{
    "title": "What's up with people protesting Tesla instead of at capitols?",
    "author": "SLiverofJade",
    "subreddit": "OutOfTheLoop",
    "rank": 6,
    "score": 799,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 243,
    "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1jd5qkq/whats_up_with_people_protesting_tesla_instead_of/",
    "id": "1jd5qkq",
    "selftext": "[Why are people protesting at Tesla dealerships](https://www.msn.com/en-us/news/politics/hundreds-protest-tesla-showrooms-over-musk-s-doge-work/ar-AA1B2s9i) instead of at capitols, town halls, or the offices of their elected representatives?\n\nWouldn't it be more effective to put pressure on the people who could make changes?  Is it because they're in smaller towns more distant from state capitols?  Do they feel safer protesting at a car dealership than anywhere else?\n\nI don't live in the US so I'm seeing this on social media and US-based news, which admittedly may be ignoring those types of protests instead of ones at Tesla.\n\nHey mods, why do I have to use something like \"what's up with\" or \"what's the deal\" in the title instead of a plain question such as \"Why are people...?\"  *neurospicy confusion*",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nFriendly reminder that all **top level** comments must:  \n\n1.  start with \"answer: \", including the space after the colon (or \"question: \" if you have an on-topic follow up question to ask),\n\n2.  attempt to answer the question, and   \n\n3.  be unbiased\n\nPlease review Rule 4 and this post before making a top level comment:\n\nhttp://redd.it/b1hct4/\n\nJoin the OOTL Discord for further discussion: https://discord.gg/ejDF4mdjnh\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "myownfan19",
            "body": "Answer:  They are trying to show their displeasure with Musk and if they can hurt his business then they can have a real impact on him as an individual.  That is a different impact from protesting at government facilities and events.  Many of the republicans have dismissed those protestors as being paid by Soros so they have deliberately said they will ignore them.  While elections have consequences, none of the federal positions are up for election until late next year.  \n\nTesla stock however is business.  It skyrocketed around the election and doubled.  It has taken a beating and has lost all those gains.  I don't know much about how he does his finances, but his much touted net worth is largely tied to Tesla stock, some of which is collateral for loans when he bought twitter.  I don't know where this is headed, but things can get painful for him eventually.",
            "score": 1213,
            "replies": [
                {
                    "author": "zangler",
                    "body": "He collateralized the loan with over $62 billion in stock and sold billions more. If sustained, this could hurt.",
                    "score": 362,
                    "replies": [
                        {
                            "author": "myownfan19",
                            "body": "I remember him saying years ago that Tesla stock was overvalued and he didn't recommend buying it, but nobody was listening to him. \n\nIts PE ratio has been out of control.   \n\nThe bigger they are the harder they fall.",
                            "score": 149,
                            "replies": [
                                {
                                    "author": "zangler",
                                    "body": "I just hope the fall is fast and complete.",
                                    "score": 151,
                                    "replies": [
                                        {
                                            "author": "Bethw2112",
                                            "body": "I'd love to see a Russian fall for Ellon, windows are very dangerous for billionaires.",
                                            "score": 54,
                                            "replies": [
                                                {
                                                    "author": "nlpnt",
                                                    "body": "I'd just be happy with the full Lindell.",
                                                    "score": 19,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sublimatedBrain",
                                            "body": "I would settle for him just getting the fuck off our earth.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "TheCowzgomooz",
                                                    "body": "I'm very okay with the government funding his Mars missions if we stipulate that he and DOGE have to go there on the first flight and never come back.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Harbulary-Bandit",
                                                    "body": "Problem with that is he’ll take all of our money with him in the form of wasting it on rocket shit, and then will promptly explode in low earth orbit. \n\nThat takes care of one problem, but then we’re all broke as a country. If we spent the amount of money he wants to spend to get to mars (not his money of course) here on earth to fix shit, we’d have fucking change left over and a clean planet.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "sublimatedBrain",
                                                            "body": "Okay he can get in the earth 6 feet down in a nice cushy box",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Happy-Dress1179",
                                            "body": "Or slow and methodical.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Drigr",
                                            "body": "Unfortunately, he's buddy buddy with the president, so he can expect a bailout if things really go tits up.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "nlpnt",
                                    "body": "It's historically been valued as a tech startup rather than an automaker. GM averages around $50/share, Ford around $10, Toyota (which is traded on NYSE not Nikkei) a little under $200.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "dreadcain",
                                            "body": "You either need to normalize the share prices to the number of shares or just compare market caps. Share prices alone mean nothing. Not that it really tells a meaningfully different story here, tesla is still wildly overvalued, but the value of the other automakers is pretty mixed up going purely off share price.",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "gneiman",
                                            "body": "Share price means literally nothing",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "author": "229-northstar",
                                                    "body": "If that were true, Trump wouldn’t be hawking teslas out if the White House",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "gneiman",
                                                            "body": "The share price of one stock relative to itself over time is relevant. Saying a share of Ford is $X and a share of Tesla is $Y means literally nothing. Tesla has an extremely overvalued market cap, but market cap is a function of share price and number of shares",
                                                            "score": 21,
                                                            "replies": [
                                                                {
                                                                    "author": "229-northstar",
                                                                    "body": "Share price matters outside of the narrow box of relativity.  If your investment cost $400 and is now worth $200, the share price matters a LOT",
                                                                    "score": -8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "elcapitaine",
                                                                            "body": "Yes, because like that person said the share price of an individual stock over time is certainly relevant.\n\nComparing two different stocks' percentage gain/loss is also relevant \n\nComparing the stock price itself between two stocks, saying GM is 40, Ford is 10, Tesla is 200... Completely meaningless. GM could do a 5:1 reverse stock split and be worth $200/share. Does that mean the overall worth of the company has changed? Absolutely not",
                                                                            "score": 17,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "229-northstar",
                                                                                    "body": "I agree, comparing stock price of two companies strictly on stock price is silly.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "dreadcain",
                                                                            "body": "Yes but comparing share prices across different companies with 0 context of the number of shares that each company has issued is literally meaningless.",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "229-northstar",
                                                                                    "body": "I already commented that I agree (below)with that.  That is what is meant by the word “relativity”.\n\nMy response was directly at the statement that share price is meaningless.  It absolutely is, outside of the narrow box of relativity.",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "dreadcain",
                                                                                            "body": "It's meaningless in the context it was used in in this thread.",
                                                                                            "score": 4,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "229-northstar",
                                                                                                    "body": "In terms of the parent comment, yes\n\nIn terms of my opinion that Trump is hauling Teslas out of the White House to prop up the Tesla stock price because the Tesla stock price actually does matter to some people…",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Short_Cream5236",
                                                    "body": "LOLWAT?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "gneiman",
                                                            "body": "Are you confused?",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Short_Cream5236",
                                                                    "body": "Yes, hence the question mark. Are you confused by question marks?",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "barath_s",
                                            "body": ">  $50/share\n\nThis is meaningless. Because simply by issuing more shares, it will get reduced.. Issue double the shares, value will be $25/share instead of $50\n\nThere are two relevant measures  \n\na) Overall market valuation = number of shares of company * price per share.\n\nSo if totally GM had 1000 shares and each share was $50 then the market is saying GM is worth 50,000\n\nThis is where Tesla was valued at peak of $1.5 Trillion - more than GM and other automotive companies\n\nhttps://www.reuters.com/business/autos-transportation/teslas-stock-defied-gravity-years-is-elon-musks-ev-party-over-2025-03-10/\n\nThe other measure is Price/Earnings or P/E -> Price of Share and Earnings per Share.   Tech companies shares are often high in demand even when the earnings (P/E) are low, because people expect them to grow and the share to become much more valuable in future. \n\nhttps://www.reuters.com/business/autos-transportation/teslas-stock-defied-gravity-years-is-elon-musks-ev-party-over-2025-03-10/",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "wren56",
                                            "body": "Huh, thanks for the Toyota fact.",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "OldJames47",
                                            "body": "Here’s ChatGPT for December 31, 2024 market capitalization per vehicle sold in that year.\n\n> Here’s a comparison of the market capitalization per vehicle sold in 2024 for Tesla, Toyota, Ford, General Motors (GM), and Volkswagen (VW):\n\n1. Tesla\n\t•\tMarket Capitalization (as of December 31, 2024): Approximately $1.54 trillion\n\t•\tVehicles Sold in 2024: Approximately 1.79 million\n\t•\tMarket Cap per Vehicle Sold: Approximately $860,000\n\n2. Toyota\n\t•\tMarket Capitalization (as of December 31, 2024): Approximately $237 billion\n\t•\tVehicles Sold in 2024: Approximately 10.8 million\n\t•\tMarket Cap per Vehicle Sold: Approximately $21,944\n\n3. Ford\n\t•\tMarket Capitalization (as of December 31, 2024): Approximately $37 billion\n\t•\tVehicles Sold in 2024: Approximately 2 million\n\t•\tMarket Cap per Vehicle Sold: Approximately $18,500\n\n4. General Motors (GM)\n\t•\tMarket Capitalization (as of December 31, 2024): Approximately $47.6 billion\n\t•\tVehicles Sold in 2024: Approximately 2.7 million\n\t•\tMarket Cap per Vehicle Sold: Approximately $17,630\n\n5. Volkswagen (VW)\n\t•\tMarket Capitalization (as of December 31, 2024): Approximately $98 billion\n\t•\tVehicles Sold in 2024: Approximately 8.3 million\n\t•\tMarket Cap per Vehicle Sold: Approximately $11,807\n\nNote: Market capitalizations are based on data from December 31, 2024. Vehicle sales figures are sourced from available 2024 data.\n\nThe significant difference in market capitalization per vehicle sold, especially for Tesla, reflects investor expectations of future growth, technological advancements, and market positioning.\n\nu/dreadcain",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "indefiniteretrieval",
                                    "body": "Lol even if he ends up with 1 billion in cash he wins🤷🏻‍♂️",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "TheOneFreeEngineer",
                                            "body": "Not according to himself or Trump. They actively don't see things like normal human beings. They take theses sustained campiagns as direct assualts on themselves and are hurt because they are losing. When they feel like they are losing the entire movement loses momentum and they are less effectual at forcing their illegal acts thru the populace",
                                            "score": 19,
                                            "replies": []
                                        },
                                        {
                                            "author": "No_Measurement_3041",
                                            "body": "Elon with only one billion left would be an outrageous loss of money. I don’t think he would agree with you.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "indefiniteretrieval",
                                                    "body": "I bet he'd be fine! Lmao. Its mostly stock anyway.\n\n It's not money till he sells it",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "rocket42236",
                            "body": "If the Tesla stock gets low enough, the lenders will have to call the loans, and spacex and twitter go on the chopping block.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Jessnesquik",
                                    "body": "Meaning no more nazi twitter propaganda. No more fElon having money and leverage for the dump, they fall out and create a shit storm of snitching.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "Hoopy_Dunkalot",
                                            "body": "That would make me so happy. - Kyle Braflovski",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "baldieforprez",
                            "body": "Do you know when is margin calls kick in?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Odh_utexas",
                                    "body": "There’s a long way to go for that. Maybe if the share price goes under $100.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "baldieforprez",
                                            "body": "114 is what Google told me.  I was hoping for a redit answer 😆",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "zangler",
                                    "body": "Depends on a few things...the best I could work out is in the 130ish range. Keep in mind this is Musk though. The banks may very well have a different standard or make exceptions for him. \n\nFor those that followed this early, banks like JP Morgan got questioned HARD about these loans in the first place. Failure here could look extremely bad on them too so this could all fall into the 'too big to fail' category for everyone involved.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "baldieforprez",
                                            "body": "Valid point.   Butaybe we will see some b accountability in our life time",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "zangler",
                                                    "body": "I doubt it. We haven't seen it before and he has Trump in his pocket. I'm sure a bailout could be arranged.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Drigr",
                                                            "body": "\"In order to bring more jobs to America, and to help reduce our governments impact on the environment, the federal government has partnered with Tesla to replace all official vehicles with Teslas. They will also be designing and creating some new vehicles specifically to aid this movement. \"",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "zangler",
                                                                    "body": "😲 /s",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jcoddinc",
                    "body": "Also to add,  protesting at the state level isn't as effective as people think because the elected officials are not in the state and are in Washington DC. So protesting at the state house is not really doing much when the person who you want to protest isn't even there",
                    "score": 34,
                    "replies": [
                        {
                            "author": "boxofducks",
                            "body": "Not just that, but for a lot of people there's nothing to protest at the state level. I live in Washington with a Dem governor elected with an overwhelming mandate, a Dem almost-supermajority in both houses, and a Dem AG that's joined a bunch of the lawsuits against the Trump administration. I could go protest at the federal building in Seattle in a district that went Harris +80 or at the capitol in Olympia in a district that went Harris +50, but why? \n\nThe government has been captured by billionaires, there is nowhere that makes more sense to protest than places that can affect billionaires' pocketbooks.",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "jcoddinc",
                                    "body": "Exactly.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MisterrTickle",
                    "body": ">On Monday, March 10, he lost roughly $4.7 billion for every $10 the stock price declined, amounting to a total loss of $18.8 billion.\n\nUS Billionaires don't tend to take a salary, instead they usually have shareholdings in their company and then borrow money against their shares.   As they don't pay federal income tax on loans but can use the money in the same way as income.  \n\nAlthough Musk tried and failed to get about a $60 billion one year salary from Tesla.  Which caused the other investors to take him to a Delaware court to block it.  Which they did, as a result Musk has moved Tesla's legal HQ from Delaware to Texas and has started the process to try and do the same thing again.  \n\nIf the Tesla share price falls enough.  Then the people he borrowed the money from, can force the sale of his shares to pay them back.   A so called Margin Call.  That sell off could then cause a positive feedback loop.  Where the more he sells the more the share price drops, so that other loans that he has then call in their margin calls, prompting more sell offs, causing the stock to fall further......\n\nSome of the money that he used to buy Twitter, was based on loans secured against Tesla shares.  Initially it all was going to be but then he switched to getting other people to join in and using cash.  But people hope that if the Tesla share price crashes enough, then he'll be forced to sell his share of Twitter.  \n\nAnonymous, the Internet hacktivist group, claims based on anonymous sources.  That Donald \"bought\" a Tesla and did that advert for Tesla at the White House the other day because Elon had been crying in the Oval Office about how much money he was losing.  Due to his involvement in DOGE, best also blaming Ukraine for everybody hating him and falsely claimed that a recent DDOS attack on Twitter mainly originated with Ukrainian IP addresses.  When security researchers from companies like Cisco.  Claim that it was a run of the mill DDOS using botnets primarily made up of compromised IoT devices such as Webcams, doorbells and so on.  With Ukranian IP addresses not even making the top 20.",
                    "score": 86,
                    "replies": [
                        {
                            "author": "formosk",
                            "body": ">If the Tesla share price falls enough.  Then the people he borrowed the money from, can force the sale of his shares to pay them back.   A so called Margin Call.  That sell off could then cause a positive feedback loop.  Where the more he sells the more the share price drops, so that other loans that he has then call in their margin calls, prompting more sell offs, causing the stock to fall further......\n\nCould we be in a \"too big to fail\" situation with Tesla stock? One that would require a government bailout?",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "avalonfogdweller",
                    "body": "If anyone knows where I can get a Soros paid protesting job let me know could use some extra cash and seems like easy money",
                    "score": 49,
                    "replies": [
                        {
                            "author": "nlpnt",
                            "body": "I'm still waiting for his check from voting for Hillary in 2016.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "esoteric_plumbus",
                            "body": "I'll dm you a link, make sure to have your Antifa membership card handy for your member ID #",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gimmeallthecatgifs",
                    "body": "Also, anything that lowers his net worth will make it harder for him to influence other elections.  He has poured $12 million into an upcoming state Supreme Court election in Wisconsin: https://wisconsinexaminer.com/2025/03/14/elon-musk-invades-wisconsin/",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "SLiverofJade",
                    "body": "I hope at the very least it will do something beneficial for everyone.  \n\nAh, the fact that the elections aren't until next year probably explains why most of the Democrats seem to be bending the knee for now, which is interesting because the maple MAGA here in Canada was doing well up until the inauguration, then most of us went oh hell no and they tanked, leading the new PM to basically start off on a good foot with a fuck you to the US administration.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "myownfan19",
                            "body": "It depends on what you mean by bending the knee.  They have a few cards, but not many.  Enough of the democratic senators decided that shutting down the government would give more power to the White House to dismantle government and shut off public services.  It's brinkmanship politics for sure. \n\nThe White House is steamrolling changes very fast and straight up ignoring a lot of laws in the process, and ignoring court orders upholding those laws.  It's scary and a lot of people are just cheering it on.  The democrats don't control either house so they can't alone generate legislation on the matter.  \n\nThe democrats also are not united and don't have a strong leader.",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "trefoil589",
                                    "body": "> The democrats also are not united and don't have a strong leader.\n\nThe DNC is controlled opposition and has been for decades. \n\nAnd they do have a strong leader by the way. it's the oligarchs who bribe them.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "doreda",
                                            "body": "I guess we just lay down and die then.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Logical-Ad-57",
                                                    "body": "You should ignore people who \"both sides\" the Democrats.  They are the controlled opposition.  Focus on local elections you can effect.  Take the school board and the mayors' office.  Shift the party the 1/45 millionth that your party membership allows you by voting in the primary.\n\nIf sewer inspector was a good enough job for Plato its a good enough job for us.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "altodor",
                                                    "body": "The State has a monopoly on effective weaponry and a million 47-worshipping conservative boys pulling the triggers.\n\nOur elected leaders are useless. MAGA is disconnected from reality, they're trying to make disliking trump a mental health disorder, and have expressed what can be read as intent to disappear dissenters. The executive is ignoring the checks and balances.\n\nWe're absolutely fucked and no one is coming to save us. We're exhausting all the legal methods of fighting back and woefully illequipped for anything else.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sweetrobna",
                    "body": ">  none of the federal positions are up for election until late next year. \n\nThere are two congressional seats in FL up for special election in two weeks. From Gaetz resigning and Waltz appointed to national security advisor",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Railboy",
                    "body": "This plus Tesla showrooms are everywhere so it's possible to protest at them even if you're tied down by a full time job. There's only one capital.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "thelawfist",
                    "body": "It’s my assumption that he had Trump doing a Tesla commercial to buoy the stock price. I imagine that if the price drops below a certain level the loans will go into foreclosure. Plus, Musk seems to have a lot of awful people involved as investors for the purchase of Twitter to who would probably be upset if Musk’s stock lost too much value.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Defiant_Start_1802",
                    "body": "Expanding on this, Musk bought twitter using the value of his Tesla stock as collateral. If we can short Tesla stock below $150 a share, then he will have to forfeit Twitter and Tesla tanking his wealth and influence. \n\nLet’s face it, x amounts to state media at this point, and is the talking piece of the White House directly to their base. If they didn’t own twitter they would have to go back to truth social, or social medias with more moderation. Or possible even watching the news to understand what’s going on. It would dismantle big parts of their propaganda machine.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "zagmario",
                    "body": "Should we short Tesla too ?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HeadSavings1410",
                    "body": "Just to note...space x is his bigger money. It's a private company and will sustain him longer than tesla...will be interesting to see what shareholders demand from tesla tho.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rocket42236",
                    "body": "He is also in a court fight with Tesla right now to get paid 56 billion dollars or so this year…..so he knows what is coming if he gets a margin call.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "smashitandbangit",
                    "body": "As long as people don’t trash my car. I don’t support musk and will never buy another Tesla but I can’t just buy a new car. I’m already worried enough about losing my fed job.  ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Luke_starkiller34",
                    "body": "I still don't understand why you would protest the dealership (also they're not really dealerships, they're showrooms and service centers). For the most part you buy their cars online. Certainly you can go to a showroom and the staff can help you walk you through the purchasing process online. Other than browsing cars/scheduled test drives and picking up fulfilled orders...people generally aren't going to showrooms with the purpose of buying a car.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "MoogaBug",
                            "body": "I have a friend who had a cyber truck on order. After all the protests started she cancelled because she says she’d be embarrassed to drive one now. I’m sure she’s not the only one. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "XemptOne",
                    "body": "Musk and Twitter was backed by Mohammed Bin Salman, money is never going to be an issue. \n\nIn fact, the same people protesting Tesla, are the same people, who pre-election, fully backed electric cars as part of their democrat liberal agenda. Fact is, these people dont know what they want, they just know they will blindly back anything their political party tells them to... very weak minded individuals...",
                    "score": -13,
                    "replies": [
                        {
                            "author": "goodandwickeddeity",
                            "body": "Electric cars are good, billionaires stealing money and food from the poor is bad.\n\nMaybe use your brain next time you try to sound smart, huh?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "XemptOne",
                                    "body": "Electrics are worse for the enviroment than gas cars. All the mining, the toxic shit to make the batteries, the underaged labor used to mine, etc...  Elon isnt stealing from anyone, he is cleaning up years of govt mis-spending and fraud and laundering. he is finding the corrupt shit going on. Govt is too big and out of control, it needs to be paired down massively...",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "goodandwickeddeity",
                                            "body": "Dude, even with all of the cutting he has already done, the government has spent more this year than all previous years to date. They are lying to you. Either that or you are doing the lying as a Russian bot. In which case, you are doing a good job defending that petrostate.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "XemptOne",
                                                    "body": "sit back and watch the show, one day you will see the big picture...",
                                                    "score": -6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "upmoatuk",
                                            "body": "Pared down, not paired",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheBathrobeWizard",
            "body": "Answer: We protest at capitals, and politicians do nothing. We protest at Tesla dealerships, and Trump turns the White House lawn into a used car lot.\n\nIt's not much, but it's a reaction. Which proves that all this time we've been protesting the wrong people. Politicians aren't in charge of the US. Musk, Bezos, Zuckerberg, and their ilk are the ones really in charge. If we want change, we need to continue to destroy Tesla, we need to target Twitter and Space X, as well as Amazon, Facebook, Instagram, and other Meta businesses to make our voices heard.",
            "score": 213,
            "replies": [
                {
                    "author": "Naturallobotomy",
                    "body": "Yep.  You have to hit them where it hurts= money.  Not to mention musk is still actively using his wealth as a threat to primary any conservative opposition to their “plan” and to buy a Supreme Court seat in Wisconsin currently.",
                    "score": 35,
                    "replies": []
                }
            ]
        },
        {
            "author": "Andilee",
            "body": "Answer: Most people are doing both. There are set dates for Capitols I see them often for PA, OR, and WA. They also go to town hall meetings, and other events that have their governor or people of importance. Remember reddit is an echo chamber in each subreddit. Both areas are being protested. You're just seeing news right now about the Tesla ones in your feed more.",
            "score": 203,
            "replies": [
                {
                    "author": "Baejax_the_Great",
                    "body": "Yep. My sister works at a state capitol and she sends me pictures of protests every week.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "killercurvesahead",
                            "body": "She could send video clips to local news stations.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "criticalfrow",
                    "body": "ID has a protest at the capitol pretty much every week. There’s also a rally outside of a meta-sponsored Q&A luncheon for one of our representatives today. I’m excited to see how that one goes.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "SLiverofJade",
                    "body": "Thank you!  The news there also may be focused on those ones because \"Oh noes, property damage!\" is worth a pearl clutching.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "a8bmiles",
                            "body": "Also, Elon is arguably having a much higher impact at damaging the economy and people at an individual level, through DOGE, than Trump is.\n\n\nSo directly damaging Elon through Tesla is isn't nothing. The stock value is just over 50% of what it was in December.",
                            "score": 60,
                            "replies": [
                                {
                                    "author": "Different-Pop2780",
                                    "body": "And it's working. P47 is promoting Tesla from the White House, and calling for protestors to get the strictest of punishment, it's working, a difference is being made.",
                                    "score": 19,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "michaelavolio",
                            "body": "Yeah, if you look for videos of town halls on YouTube or TikTok, or look at all the protests at r/50501 and r/ProtestFinderUSA, there have been tons of protests all over, including this past weekend. They just aren't always being covered by the media. I don't think a week has gone by without protests in the past two months, even not including the Tesla protests.\n\nSometimes the media will do a sort of \"round up\" of video clips - PBS showed some weeks ago in one segment multiple clips from a bunch of different town halls where constituents were angrily asking about Musk, Trump, \"DOGE,\" etc. They made it clear it was happening all over the country - or at least in red districts.\n\nOne town hall ended recently with constituents chanting \"VOTE YOU OUT! VOTE YOU OUT!\" as their Republican rep retreated. These Republicans are getting booed and jeered and laughed at when they lie during these town halls. Some Republicans are publicly claiming that protesters and upset constituents at town halls are just paid actors or Democrats, but I don't think any of them is stupid enough to actually believe that. The Republican establishment has recommended they stop having in-person town halls at all, because their own voters are so disgusted with them. Some Democrats are starting to host town halls in those Republicans' districts, since the Republicans are hiding.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HandyMan131",
                    "body": "Also, protesting at a STATE capitol doesnt make much sense when you actually support your state government but not your federal government… other than just being a convenient place to gather. Whereas protest at a Tesla dealership makes it perfectly clear who you are protesting and has the added benefit of hitting that nazi fuck face where it hurts; his wallet.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "uni-monkey",
                    "body": "You guys are getting town halls?  My rep has turtled up and stopped doing them entirely.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Andilee",
                            "body": "Most have unfortunately they're a bunch of children and can't handle their job I guess. Vote out the weak when we can! Keep tabs on everyone who's failing for the next election.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ace_11235",
                    "body": "I also saw protestors outside the IRS building over the weekend.  \n\nI think one of the big things people from outside the US often forget is how big the US is.  I live about 4 hours away from my state capitol and about 20ish hours away from DC.  However I have and IRS building and a Tesla dealership about 20 minutes away.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "LadyTanizaki",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SanityAsymptote",
            "body": "Answer: ***They are*** protesting at [capitols](https://apnews.com/article/50501-protests-project-2025-trump-state-capitols-ddd341171a54ba9b498cbfe7530e18ab), [town halls](https://newrepublic.com/post/192285/republicans-respond-protests-town-halls), and the offices of their elected representatives.\n\nPeople are aware that Elon Musk is Trump's hatchet man, and they're protesting his most visible business in some attempt at showing him how large the opposition is.\n\n>Wouldn't it be more effective to put pressure on the people who could make changes?\n\nNo. [Republicans have largely refused to do anything.](https://www.politico.com/news/2025/02/24/house-republicans-protests-00205892)\n\nDemocratic politicians, who are (mostly) sympathetic, have a minority in both the house and senate and can't currently do anything to stop what's happening.\n\n>Is it because they're in smaller towns more distant from state capitols?\n\n[Only 17/50 states have their largest/most populous city as their capital.](https://ballotpedia.org/List_of_capitals_in_the_United_States#State_and_capital_populations) Most US state capitals are relatively smaller towns away from population centers, which makes it more difficult for large groups to form and protest in many instances because travel distances may make things difficult.\n\n>Do they feel safer protesting at a car dealership than anywhere else?\n\nLOL. They are protesting specifically at Tesla dealerships to block or shame people supporting Tesla and therefore Musk.\n\n>I don't live in the US so I'm seeing this on social media and US-based news, which admittedly may be ignoring those types of protests instead of ones at Tesla.\n\nThe protests are mostly being covered on local news, with infrequent mentions on larger scale news sites. National level news sites are often owned by large companies/wealthy individuals and are either intentionally suppressing or just unable to adequately relay the sheer amount of protests happening nationwide right now.",
            "score": 66,
            "replies": [
                {
                    "author": "SLiverofJade",
                    "body": "Thanks for the detailed answer.  There are the instances of dissenters being removed from town hall meetings or being deported, which made me wonder if those contributed to any choices.\n\nThe disconnect between local vs national makes a lot more sense, thank you.  The bias is rather shocking from the outside because everything about Canada being written on that side of the border says that we're mad about the tariffs and not the multiple threats to our sovereignty, which is the goal of the tariffs in the first place!  So I wasn't sure if I could believe, well, pretty much anything.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "cronemorrigan",
                            "body": "Just to add: Trump’s government has completely ignored the protests at government buildings, but just a few Tesla protests and he’s calling boycotts a crime & doing an advertisement on the White House lawn. Protesting Elon’s businesses gets a reaction.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "delayedconfusion",
                                    "body": "How many government buildings were firebombed or attacked with gunfire?",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "biomortality",
                    "body": "The nearest Tesla dealership is *way* closer to me than the state capitol. I definitely think it’s partly logistics.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Mr_Quackums",
                    "body": "> Democratic politicians, who are (mostly) sympathetic, have a minority in both the house and senate and can't currently do anything to stop what's happening.\n\nwell, they had a chance to do something, but they chose to sign the 2025 Enabling Act instead.  Most Dem representatives voted against it, but at the last moment the Dem leader in the senate changed to support the bill and enough of them turned into collaborators along with Schumer and voted with Republicans to pass it.\n\nThe issue is there was a clause in the bill that basically says \"congress automatically authorizes all spending decisions 'recommended' by the Whitehouse\", meaning DOGE's actions can no longer be challenged for being unconstitutional.  \n\nit *did* prevent a government shutdown, however if the government is shutdown then that would slow down the Nazi-ification of the government AND would give Dems the talking point of \"Trump had both a recession and a government shutdown in his first 100 days\".",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wykydtr0m",
            "body": "Answer: the thin veil between our democracy and the corporate oligarchy has been slowly eroding since Citizens United but is now essentially gone.   People have finally figured out that the only language the oppressors speak is money, and that with the oligarchs pulling the strings, there's little reason to engage with the middlemen, ie the politicians.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Darryl_Lict",
            "body": "Answer: Tesla is very easy to target and protesting there has a very real life effect on sales. People have to really love Tesla cars in order to to deflect the obvious hostility to Musk. I live in California and Sacramento is about 400 miles away. I can ride my bike to the Tesla dealership to protest against the Nazi.",
            "score": 44,
            "replies": [
                {
                    "author": "Icy_Arugula7111",
                    "body": "Protest against the Nazis 😂\n\nWhy don't you protest against actual Nazis at Nazi bars?",
                    "score": -28,
                    "replies": [
                        {
                            "author": "No_Measurement_3041",
                            "body": "Because those Nazis aren’t in the government ",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BurntAzFaq",
                    "body": "Yes. Easy for losers to target and feel like they're making a difference.",
                    "score": -14,
                    "replies": []
                }
            ]
        },
        {
            "author": "zangler",
            "body": "Answer: Musk out up over $62 billion in Tesla stock to finance the purchase or Twitter. Those loans have triggers that will activate a margin call if the threshold is exceeded (often 25%). That would end up costing Musk billions of dollars.\n\nFor example, if Tesla stock was around $330 at the time of the loan, then it falling 60% to the $130 range could trigger those calls. \n\nThis is a solid tactic if you want Musk to be harmed by what he is doing with DOGE.",
            "score": 24,
            "replies": [
                {
                    "author": "grandramble",
                    "body": "It also has a big impact on his force-projection when using his wealth as power, It's kind of like how a patrician can control one of his kids with a committed inheritance, but he can control all of his kids indefinitely by dangling it in front of all of them. Wealth at this level is exponentially more effective as soft power than by actually spending it.\n\nIf anything happens to threaten the actual principle value itself - Tesla becoming worthless, needing to pay off the loans, losing control of the actual assets - then all the soft power that comes from being *able* to spend it disappears with it too.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "SLiverofJade",
                    "body": "Ooooh.  One can hope!\n\nOne part of me is like but he'd still be a billionaire, but then I remember that the ultrarich can never have enough money.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "zangler",
                            "body": "He would, but you are in a different position if 10s of billions of dollars or whole chunks of ownership gets taken by JP Morgan. Billionaires care WAY more about losing 1/10th of their income than you do, even though their lives don't effectively change. They are money addicted hoarders.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "PatchyWhiskers",
                                    "body": "That’s why they freak out over taxes, even though taxes affect everyone at their income level and so don’t affect their wealth relative to their peers.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TVGuidez",
                    "body": "I keep seeing this but it is wrong\n\nElon paid for 1/4 of the X purchase with Tesla loans, but that share has been paid off. The only debt remaining is held by X investors, not Elon personally",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "p0tty_recepticle",
            "body": "Answer: Elon Musk is rich because he takes loans out on his stock, Tesla stock for example. Elon Musk has also basically been put in charge of the Federal US Government (but was not elected in any way shape or form). Protesting at tesla has significantly lowered its stock value and the thought is that the less Elon is worth the less pull he will have with the president.\n\nTLDR: protesting at Tesla and lowering its stock value hurts Elon where it matters most to Trump.",
            "score": 24,
            "replies": [
                {
                    "author": "Hoopy_Dunkalot",
                    "body": "DJT likes shiny popular things. If he sees a consistent message that Musk is a pariah, hopefully he will eject him.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Xandallia",
            "body": "Answer: Rich people have the real power in this country. There have been plenty of protests at capitals, but this is the one that upset cheeto in chief and is all over the news.",
            "score": 5,
            "replies": []
        },
        {
            "author": "gofishx",
            "body": "Answer: Why do you assume this is an ineffective method of protest? Tesla stock is plummeting. Elon is getting hurt in the only place he cares about. Also, yeah, its a lot more accessible for someone to go protest at a tesla dealership or to damage teslas that it is to fly all the way to the capital for a protest that will either be ignored completely, violently shut down, or traced back to you at home where you'll get arrested anyway. This is an *amazing* form of protest. Go vandalize a Tesla today.",
            "score": 4,
            "replies": [
                {
                    "author": "SLiverofJade",
                    "body": "Has it actually resulted in any changes or does it simply feel that way?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "gofishx",
                            "body": "Bro, we are like, 2 months into this thing. We aint seen nothing yet. Also, yes, Tesla stock is plummeting. That is a measurable change. No, I dont expect this to be the one thing that makes a difference, nor do I expect any positive change to come quickly.\n\nYou seem like one of those people who are always going to look for reasons to dismiss any kind of protest. This is very common, unfortunately, among Americans. We have been trained to think this way. If you think we should give up on a boycott after only a few weeks because it didn't have the desired outcome fast enough, then you frankly haven't spent enough time learning about how the world works. It was never going to be that easy. Buckle up, because we have a very rough road ahead of us.\n\nFor one, dont expect any one form of protest to be the end-all be-all. Its going to take organized effort on the part of many many Americans trying many different things. Dont let perfect be the enemy of good. As long as it impedes the neo-monarchist revolution, it is useful to do. That could mean showing up to a peaceful demonstration, it could also mean doing things like clogging up ICE tiplines with false reports, starting community food banks to subvert the need of government assistance, and even enforcing the boycott of a potential dictators main source of income through coercive property damage.\n\nMusk is not going to fold easily, nor is Trump or anyone in that circle. They are way to deep at this point. We must apply constant pressure in every possible way and at every possible moment to keep this group weak. That includes attacking Elon's wallet. It includes a lot of things, killing Tesla is only one single piece, and it's only the start. Now is not the time to roll over and concede on anything.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SLiverofJade",
                                    "body": "It wasn't my intention to be a doomer, I just haven't lived in the US since Obama was in office and am doing what I can from Canada such as calling the reps from my home blue state on a weekly basis and trying to keep on top of the firehose of bullshit.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "gofishx",
                                            "body": "No worries, I'm not trying to come at you personally or anything either. It all plays a role, and every bit of effort helps. I have no idea what the actual solution will be, which is why I encourage anyone to try literally anything. Thank you for doing that, btw.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "slipperslide",
            "body": "Answer:  the biggest issue facing us right now is that a billionaire can buy his way into government.  All we have is the power of the purse.  Politicians, including Democrats, don’t listen.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Foxclaws42",
            "body": "Answer: We aren’t protesting at Tesla dealerships instead of capitols. We are protesting at BOTH.",
            "score": 5,
            "replies": []
        },
        {
            "author": "TysonTesla",
            "body": "Answer: Elongated muskrat spent a quarter billion dollars to get trump elected. His investment has given him a position of power that won't be fully understood for some time. Calls to representatives go unheeded, so some people have felt the need to escalate their grievances to company who's figurehead is seen as more influential than their local elected officials, to the get their message across.",
            "score": 24,
            "replies": [
                {
                    "author": "SLiverofJade",
                    "body": "I can understand the frustration there, but since he's so far removed from doing any actual work or interaction with them I don't think they'll be as effective as they're hoping.  Anyone who doubles down on being a nazi isn't likely to change their ways.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "Saragon4005",
                            "body": "He is not nearly as far removed as he should be. The way they see it ruining Tesla ruins Musk which will likely get him out of the government too",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "exedore6",
                                    "body": "It also pressures Tesla - the company, with shareholders to hold him accountable for their losses.\n\nTell me Tim Cook would get to keep his job if he went full Nazi.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TysonTesla",
                            "body": "He is far removed from the daily operations, but much like his other investment projects, still presents himself as 'the lead genius' and creator of them, despite what the facts may be.\n\nHe also has a substantial amount of his fortune tied up in stocks derived from those companies.\n\nThe nomies who don't pay attention to his political antics may not be up date on his recent shenanigans, but protests that effect bring this to light may change that.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "SLiverofJade",
                                    "body": "Oh, I thought it was common knowledge that he doesn't create anything, just buys good things and turns them to shit.  I mean, I know there are those who drank all the kool-aid...\n\nI suppose I should stop assuming that some things are common knowledge, at least when it comes to the US, which is sad af.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RudeAd9698",
            "body": "Answer: if you hit people’s wallets you get a lot more for your effort than with the average street protest.",
            "score": 3,
            "replies": []
        },
        {
            "author": "229-northstar",
            "body": "Answer:  Act locally \n\nDo what you can, where you can.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SvenTropics",
            "body": "Answer: People didn't vote for Elon Musk. While nearly half the population didn't vote for Trump, and a fair number of Trump supporters are changing their mind about him, literally nobody voted for Elon Musk. So, to have him taking power from the people, firing hundreds of thousands of federal workers, demanding cuts to social security and medicaid, and just overall interfering with government irresponsibly is a bigger affront than an elected leader making decisions they disagree with.",
            "score": 6,
            "replies": [
                {
                    "author": "rose-buds",
                    "body": "> While nearly half the population didn't vote for Trump\n\nnearly half? it's more than that lmao",
                    "score": 0,
                    "replies": [
                        {
                            "author": "SvenTropics",
                            "body": "I meant of voters. The majority of voters did indeed vote for him in 2024. However, the majority did vote for Clinton in 2016.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "noeticmech",
                                    "body": "Not even that. Trump won a plurality (49.8%), not a majority of votes (Harris got 48.3%, for reference).",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MikeHonchoZ",
            "body": "Answer: The reason is they can’t throw maltov cocktails at federal buildings without going to federal prison.",
            "score": 2,
            "replies": [
                {
                    "author": "SLiverofJade",
                    "body": "I thought only the French have firebombed Tesla so far?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MikeHonchoZ",
                            "body": " A man threw gasoline on a Tesla in Seattle then set it on fire. Pretty much firebomb.[King5 News Seattle](https://images.app.goo.gl/tFh9HxTGXkTh6MHFA",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SLiverofJade",
                                    "body": "Too bad that there was a firefighter on reddit recently that tried to explain how bad setting a Tesla on fire is due to the chemicals and battery and needing special approaches to putting it out for fear of the fire spreading, which will be a concern as the weather warms up.\n\nNow allegedly someone's been using drones to drop water balloons full of acid on them, but I haven't managed to confirm that rumour.  It's improbable, but an interesting concept.  For fiction writers, of course.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Scherzophrenia",
            "body": "Answer: Musk is in a position to effect change; Tesla is the recipient of new government contracts more wasteful than anything “DOGE” has cut; and the owner of a company doing Nazi salutes would be enough reason to protest against him even if he weren’t connected to a regime.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Short_Cream5236",
            "body": "Answer: Much of Elon's wealth, and therefore, power, is tied up in Tesla stock. Damaging Tesla as a brand directly damages Elon's power. \n\nAs such--at the moment--protesting Tesla and weakening its brand further is the most-direct way to affect consequences on the current administration. \n\nProtests are also happening at the Capitol and other state capitols. But we're talking a battle with wealth more than anything. So attacking that directly is going to produce more immediate consequences on him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MercenaryBard",
            "body": "Answer: We protest constantly and things get worse because a few thousand idiots in swing states don’t know how tariffs work. \n\nWe properly label like three cybertrucks though and suddenly Trump is out trying to sell Teslas in front of the White House. We react to results.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DorisFink",
            "body": "Answer:  They are protesting both places but the news stations only cover the protests that riles up the viewers.  In other words money, money, money, money, money...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Upbeat-Sandwich3891",
            "body": "Answer: Protesting politicians is useless because they’re the symptom, not the disease. They’re just puppets. BlackRock, Vanguard, Fidelity, State Street Global Advisors, J.P. Morgan, etc. own America and are the US government by proxy because they pull the strings.\n\nThose are the faceless corporations you would have to take down but they own your employer, your mortgage (if not your actual house/apt), your food supply, your pharmaceuticals, your utilities, and your banks and retirement savings. This didn’t start on Inauguration Day 2025. It started in the 1960’s. They and/or their predecessors are way ahead in the fight and were already dug in by the end of the Reagan administration.\n\nAnd regarding Musk, Charles Koch is 1,000 x more dangerous than Elon Musk. He’s just not dumb enough to seek the spotlight. You would have to take that old fart and his myriad of think-tanks, lobbyists, and hand selected judges and congressmen down if you wanted to make even a dent in the oligarchy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ummmgummy",
            "body": "Answer: for the most part Trump supporters will support him 100% no matter what he does. Elon has been making people lose their jobs and if you take away someone's job it's pretty easy to get them to turn on said person. Protesting Trump's \"policies\" does very little to change peoples minds who support him. But we have seen many Republicans and Democrats come together to protest Elon. Elon and Trump are basically linked together in people's minds now. So you start with the common ground of Elon being terrible and corrupt for the government and hopefully along the way it gets people to also realize how completely corrupt the entire administration is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BZP625",
            "body": "Answer:  It's blind rage at an easy target, bc they think that hurting Tesla and their owners will make a difference against Trump's agenda.  It won't, except to make them feel better for doing something, which is something, I guess.",
            "score": -4,
            "replies": [
                {
                    "author": "SLiverofJade",
                    "body": "It seems like that from the outside, which was why I ask.\n\nI'm an emigrant from a blue state and I'm still calling my reps at least once a week because that's about all I can do from abroad (besides boycotting US products).  I can't ask most of my friends back home in mostly blue states about details because they're likely actively involved and/or are openly LGBTQIA so can't trust their online communications are safe.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "cigarroycafe",
            "body": "Answer: People lack the critical thinking abilities to protest outside the areas, slogans and causes promoted by their ideology affirming media/social media.",
            "score": -2,
            "replies": [
                {
                    "author": "Ohnoeman",
                    "body": "Lmao true",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lost_cause4222",
            "body": "Answer: As of current, Elon's 12% stake in TSLA makes him 87 billion dollars in generated wealth. People are trying to destroy the brand as a way to ruin his generated wealth and show displeasure. This is going to mean absolutely nothing really--the only way a company like Tesla could go down is when investors begin to see that TSLA is built out of Elon's hype makes up 91% of TSLAs stock--$873 Billion out of o $955 Billion valuation. ((TLDR: With Elon's promises for AI Robotaxis and Full Self Driving Software built using cameras only (instead of using LIDAR like BYD's EVs), ).\nhttps://fortune.com/2025/03/08/tesla-real-worth-market-cap-stock-outlook/\n\n\nElon's real bottom line is SpaceX, which he has a 42% stake in (147 Billion from SpaceX). This means that even if Tesla is destroyed, he would still be the richest man on earth--and would *still be using his political influence to spread StarLink and SpaceX around the globe* https://variety.com/2025/digital/global/elon-musk-outrage-italy-starlink-deal-1236333151/\n\n\nWe are fucked, not because we aren't being saved, but because one person planned this for years and is going to die on Mars because he felt \"cool\" and that \"Earth was too boring\"",
            "score": 0,
            "replies": []
        },
        {
            "author": "DoctorSwaggercat",
            "body": "Answer: Simple minds.",
            "score": -5,
            "replies": []
        },
        {
            "author": "New_Camp4174",
            "body": "Answer: The radical left has now moved on to protesting immigrant owned businesses \n\n\n\n\n/alright gang, have fun with that one ",
            "score": -5,
            "replies": []
        },
        {
            "author": "BurntAzFaq",
            "body": "Answer: Tesla hate gained steam online. And terminally online losers think bothering and harassing working Americans who have nothing to do with Musk deserve to catch shit.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Spaceseeds",
            "body": "Answer: Bunch of angry communists. Gonna do what they do best, poorly make messages by drawing swastikas on Jewish people's electric vehicles to \"hurt capitalism\"\n\nYou're welcome and thank you for the down votes in advance, proving my point . Also I'm leaving this joke of a sub so no one gets to pretend they got me angry enough to leave, because I'm stating my departure in advance.",
            "score": -2,
            "replies": [
                {
                    "author": "SLiverofJade",
                    "body": "lmao at the idea that the US even has mass numbers of communists.  The Democrats are centre right and get labeled all Socialist/Communist/Marxist/Far Left/whatever the buzzword soup of the day is.\n\nThank you for the utter lack of contribution.  Don't let the door hit you on your way out.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}