{
    "title": "What's going on with the author Jon Krakauer and the youtuber Michael Tracy arguing about an ill-fated Everest-expedition in 1996?",
    "author": "deltaisaforce",
    "subreddit": "OutOfTheLoop",
    "rank": 8,
    "score": 80,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1jdf7cg/whats_going_on_with_the_author_jon_krakauer_and/",
    "id": "1jdf7cg",
    "selftext": "I read Krakauer's book Into Thin Air ages ago, and it was a good read. But last year I clicked on a Michael Tracy YT video criticizing the narrative, so lately my feed has been bombarded with a back and forth between the two, and it's too much to dig into for a casual viewer with spotty attention span. \n\nHere's the latest Tracy video, from today:\n\nhttps://www.youtube.com/watch?v=cGMlsuP3e78\n\nHere's the latest Krakauer video, posted about a month ago:\n\nhttps://www.youtube.com/watch?v=KfUg1PZO2PI\n\nHere's a reddit thread posted 4 months ago:\n\nhttps://www.reddit.com/r/Mountaineering/comments/1ge93on/response_to_jon_krakauer_michael_tracy/",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nFriendly reminder that all **top level** comments must:  \n\n1.  start with \"answer: \", including the space after the colon (or \"question: \" if you have an on-topic follow up question to ask),\n\n2.  attempt to answer the question, and   \n\n3.  be unbiased\n\nPlease review Rule 4 and this post before making a top level comment:\n\nhttp://redd.it/b1hct4/\n\nJoin the OOTL Discord for further discussion: https://discord.gg/ejDF4mdjnh\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "MhojoRisin",
            "body": "Answer: Krakauer's account of the 1996 Everest tragedy, initially published as an \"Outside\" magazine article and later developed into the book, \"Into Thin Air,\" leaves room for criticism.  And there have been differing accounts which have criticized Krakauer's version. He has admitted mistakes. But Tracy seems to be making a meal of things - stretching legitimate critiques beyond what is reasonable. \n\nSome of Tracy's criticisms center on a purported defense of Sandy Pittman, \"a hateably rich white woman who wrote dispatches of the climb for an NBC website and was friends with Martha Stewart\\[.\\]\"\n\nThis Slate article offers a good summary & does not seem to think much of Tracy's efforts: [https://slate.com/culture/2025/02/into-thin-air-book-story-youtube-debate.html](https://slate.com/culture/2025/02/into-thin-air-book-story-youtube-debate.html)\n\n\"Tracy initially claims to be defending Pittman from misogynistic attacks in the first of 17 videos he has posted to YouTube about Everest 1996 over the past year. However, it soon became obvious that Krakauer is his real target. Replete with impressive-looking info dumps, sketchy arguments, shameless speculation, crude taunting, and juvenile A.I.–generated images, Tracy’s videos come across as quintessential YouTube crankery. Either despite or because of this, they’ve earned him 134,000 subscribers.\n\n...\n\nTracy objects to what he asserts is Krakauer’s preferred “narrative”: that “inexperienced climbers,” particularly Pittman, were “the root of all evil on the mountain.” This is a gross misrepresentation of *Into Thin Air*. Pittman was certainly widely reviled in the aftermath of Everest 1996 (and in the years since), but this was largely the result of a [dishy Vanity Fair profile](https://archive.vanityfair.com/article/1996/8/snow-blind-ambition), not Krakauer’s book.\"",
            "score": 86,
            "replies": [
                {
                    "author": "BareNakedSole",
                    "body": "If Krakauer’s account is even somewhat correct - that guides and sherpas had to short-rope clients to get up and down the mountain - I’m surprised that more people don’t die every year. \n\nThinking that the average person can pay $65K to climb into the death zone with only 30% of the normal oxygen level available is a recipe for chaos.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "MhojoRisin",
                            "body": "There is nothing I've seen about climbing Everest that makes it look remotely entertaining. And if the only way you get up and down (if you survive) is by a guide dragging you, I'd think it would diminish any sense of accomplishment significantly.",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "Cultivate_a_Rose",
                                    "body": "It may be worth mentioning that at that altitude, with so little oxygen, *no one* is likely to have a 100% \"true\" account. It is like asking a bunch of extremely hungover college kids what they did last night. They'd likely get the gist of everything down vaguely correct, but details and specifics become extremely fuzzy and different people might remember different parts of an event and at best you can sketch a decent idea of the sequence of events but ultimately you throw up your hands and have to say, \"good enough\".",
                                    "score": 40,
                                    "replies": []
                                },
                                {
                                    "author": "themrnacho",
                                    "body": "For some it's not about the accomplishment, it's more about the exclusivity.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "SuperFaulty",
                                            "body": "... and bragging about it, \"*I conquered the Everest!!*\"",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "shewy92",
                                            "body": "> it's more about the exclusivity\n\nThe exclusivity of [waiting in line like it's a Disney ride?](https://www.reddit.com/r/AlternateAngles/comments/10k97y2/climbing_mount_everest_the_queue_at_khumbu_icefall/)",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JaStrCoGa",
                    "body": "Is Tracy the conservative guy that lacks self awareness that would post uninformed and idiotic takes on Twitter?",
                    "score": 27,
                    "replies": [
                        {
                            "author": "IrrelephantAU",
                            "body": "More or less.\n\nHe's one of the mob that started out as pro-Bernie commentators, got pissed when they didn't win/got pushback from other liberals and leftists, and then started hanging around with people who were more willing to blow smoke up their arse. And now they're more or less indistinguishable from standard conservative commentators.\n\nTurns out a lot of people elevated in that period had neither principles nor resilience.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "deltaisaforce",
                            "body": "It's probably not the same Michael. This one is more like a sofa mountaineer I think. And he can't turn to rw grift cause the name is already taken.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "vigouge",
                            "body": "Nope, he's the liberal guy that lacks self awareness that would post uninformed and idiotic takes on Twitter.",
                            "score": -14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "deltaisaforce",
                    "body": "Thanks for the glimpse behind the veil. I watched a couple of the vids, theyre very detailed, lol.  They didn't bothside too much at Slate, nice.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "jimababwe",
                    "body": "What the heck? None of this is about American politics...\n\n/s",
                    "score": -19,
                    "replies": []
                }
            ]
        },
        {
            "author": "solidgoldrocketpants",
            "body": "Answer: [Here's a good write-up from last month.](https://slate.com/culture/2025/02/into-thin-air-book-story-youtube-debate.html)\n\n>Much of the argument here gets deep in the weeds of the events of 1996, with each of the disputants addressing questions regarding the fullness of oxygen bottles cached high on the trail, whether fixed ropes were used, and how close one person was standing to another at a particular moment....\n\n>Tracy argues that the cause of the disaster was, essentially, “arrogant guides” who did not provide enough oxygen bottles.... Tracy objects to what he asserts is Krakauer’s preferred “narrative”: that “inexperienced climbers,” particularly Pittman, were “the root of all evil on the mountain.”",
            "score": 34,
            "replies": [
                {
                    "author": "deltaisaforce",
                    "body": "Thanks, good article.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}