{
    "title": "What’s going on with The Kennedy Center?",
    "author": "Vegetable-Return-",
    "subreddit": "OutOfTheLoop",
    "rank": 2,
    "score": 723,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 125,
    "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1jdr5gj/whats_going_on_with_the_kennedy_center/",
    "id": "1jdr5gj",
    "selftext": "\nPeople keep cancelling their shows, conservatives are replacing members of the board, now Trump is the chair???\n\nI don’t get it. What does this mean? Why? What even is the Kennedy Center? \n\n[https://baynews9.com/fl/tampa/news/2025/03/17/trump-kennedy-center-after-removing-members-of-board--making-himself-chair](https://baynews9.com/fl/tampa/news/2025/03/17/trump-kennedy-center-after-removing-members-of-board--making-himself-chair)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nFriendly reminder that all **top level** comments must:  \n\n1.  start with \"answer: \", including the space after the colon (or \"question: \" if you have an on-topic follow up question to ask),\n\n2.  attempt to answer the question, and   \n\n3.  be unbiased\n\nPlease review Rule 4 and this post before making a top level comment:\n\nhttp://redd.it/b1hct4/\n\nJoin the OOTL Discord for further discussion: https://discord.gg/ejDF4mdjnh\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xanthu",
            "body": "Answer: \n\nThe Kennedy Center for the Performing Arts is a federal presidential memorial. It’s board of trustees have been presidential appointees who serve 6 years. It’s former chairman, David Rubenstein, and the former trustees, have poured Hundreds of Millions into the building to bring in National shows, international arts, and local DC scene arts.\n\nIt’s established by congressional order, which includes the mechanism for Presidents appointing trustees. There is no language about removal, but nor is there any hard responsibility for a trustee to contribute. Congress funds roughly 20% of the building budget, ticket sales and donations are the rest.\n\nTrump pulled this because last go around, the first set of Kennedy Center Honorees expressed their distaste and refusal to sit with the President. 45 dodged the embarrassment by not attending any of his four years.\n\nThis time, he’s made clear he wants to pick the honorees. Best I can tell, that’s the whole move to exact his revenge against a now deceased Norman Lear.\n\nArtists have reacted, as they’re within their rights to do, and many have revoked their positions or associations, canceled shows, and refuse to participate in a Partisan Power Grab.\n\nPart of me would rather he be distracted with piddly bullshit like Arts Shows and stops poisoning international relations. Who knows",
            "score": 1053,
            "replies": [
                {
                    "author": "rainbowcarpincho",
                    "body": "I fully expect Kid Rock to have the Kennedy Center booked for weeks.",
                    "score": 436,
                    "replies": [
                        {
                            "author": "Affectionate-Duck-18",
                            "body": "Playing to an empty house.",
                            "score": 175,
                            "replies": [
                                {
                                    "author": "iconocrastinaor",
                                    "body": "Or better yet, playing to the same white trash hillbilly crowd that trashed the White House during Andrew Jackson's term.",
                                    "score": 95,
                                    "replies": []
                                },
                                {
                                    "author": "TerryTheEnlightend",
                                    "body": "This. Let it be known far and wide \n\neverything that Trump touches, dies and turns to rot.\n\nLike a IRL ‘Arnold Judas Rimmer’ (Red dwarf character) he can never accept that fact that his problems and faults comes from within",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Staudly",
                            "body": "I've heard Kevin Sorbo has a one man show about how hard it is to be a white man in America",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "TerryTheEnlightend",
                                    "body": "Yeah, it’s hard out there for a pimp",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Radeondrrrf",
                            "body": "Don’t forget Jim Breuer 🫠",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "apikoros18",
                                    "body": "and Rob Schneider",
                                    "score": 59,
                                    "replies": [
                                        {
                                            "author": "rdewalt",
                                            "body": "And Roseanne Barr.\n\nIt'll be the new theater for the live \"Kill Tony\" shit show.",
                                            "score": 54,
                                            "replies": []
                                        },
                                        {
                                            "author": "Liquor_N_Whorez",
                                            "body": "4 real Rob Schnieder went trump bro? Thats sad to hear for me, I lve always appreciated his subtle lovable nerd that comes up bizarrely just a lil on top vibe. Even after South Park historically cast him as the stapler. I kind of thought with him playing roles like in grown ups he would be against drumpy. \n\n\n\n\nSmh, not a big loss but disappointing ",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "PistolGrace",
                                                    "body": "When he came to Houston, I should have walked out.  But I paid for my drinks and I was not wasting money.  I didn't laugh once.  Made sure he saw, since the venue was so small, it wasn't a problem.  \n\nHe's a stain on society now.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "breezy013276s",
                                    "body": "Awww, stoner man is like that? That’s sad",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Aliensinmypants",
                            "body": "It's worse than that somehow, they had the January 6th choir performing. \n\nI hate that I now know that that exists",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "lixxandra",
                                    "body": "They didn't: https://www.latimes.com/entertainment-arts/story/2025-02-21/steve-bannon-j6-prison-choir-cpac-kennedy-center ",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Gumb1i",
                            "body": "Gonna be really funny when someone releases a video of his set and all he's doing is playing the same shitty 25 year old songs drunkenly to an empty house every damn day.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Worst-Lobster",
                            "body": "Connor Mac Gregor will do stand up and Andrew taint will do a ted talk ..",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AlamutJones",
                    "body": "That “piddly bullshit” is kind of huge though. American cultural exports are **your biggest** export.\n\nIf he starts fucking with cultural stuff, he’s trashing a huge part of how the United States interacts with (and is understood by) the rest of the world.",
                    "score": 197,
                    "replies": [
                        {
                            "author": "mcmayhem6",
                            "body": "Also, Art is how people express some of their most important thoughts and feelings. It’s how we ponder big questions, engage in philosophy and morality, and protest.\n\nI get the “this isn’t as important as genocides, class war, and climate change” thought, except Art can help engage people to fight against all these things.",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "LoveLaika237",
                                    "body": "I distinctly remember reading how he destroyed some valuable art pieces during the building of Trump Tower (I think) despite promising he'd save them. Then he tried to brush it under the rug. ",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Shayducta",
                            "body": "***WHO FUCKING CARES.*** \n\nLet the whole country collapse. \n\nThis shit has been coming for decades. For the past decade flat fascism has been riding faster and faster and like half of the eligible voting population *even turned up.* But the ones who did vote? All they did was just complain in online echo chambers, like these armchair reddit losers who rail about him on here when they will never change someone's mind or even meet someone who thought otherwise. All while whining about the echo chambers of the right. Abject fucking failures. No one does anything of merit. \n\nWhy the utter hell should us around the world care about their cultural exports when their culture seems to revolve around worshipping corporations, standing by while children are slaughtered and a festering and never-ending apathy/laziness. \n\nI am so fucking tired of pretending like Americans do anything other than whine, project opinions and then sit on their ass. They expect everyone else to fix their problems and then when they have to do it themselves they just whine and do it with the least amount of effort and efficiency humanly possible. Both sides are not the same in politics but they are the same in their failures and complaints. They both use the same tactics and same bitching and moaning, saying they're better than the other while not doing a single THING to prove it. \n\nJust talk. Talk. Talk. All coasting on the effort that your grandparents died for decades ago. \n\nGod I fucking hate them all so much. \n\nFuck 'em.\n\nEdit: To the whiny Americans downvoting me, good. I hope I piss you off. I hope you're sitting there going \"Not all Americans!\" You're wrong. It is all Americans. Your entire culture and national persona revolves around taking credit for other people's work, lie through your teeth and disrespect people the second they don't do what you want so this president is EXACTLY what you deserve and is wholly representative of the core beliefs most Americans have. Racism and shit, maybe not, but the laziness? The wanting to get it all while having it given to you? While saying you did work by putting your name on it? Absofuckinglutely. You know that kid who didn't pitch in on the group project and still got credit for what everyone else did? Well about 5-15% of your country are the kids doing the work. The rest of you? Messing about on your phone while Whoeverthefuck finishes the assignment. And if you're wondering what side of that percentage you're on? If you're angry at me then you're in the 85%\n\nI hope you are all miserable as hell so you can finally have a taste of what it's like living on this planet while not being one of you people. Fuck your **entire** country. Get your fucking shit together.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "APartyInMyPants",
                                    "body": "I’m American. I won’t downvote you. But I think your argument is built on a bit of bad faith. \n\n>half of the eligible voting population even turned up\n\nYeah, I agree. This is a problem we’ve been dealing with for a long time. The reality of the situation is we vote based on an antiquated system that predates the Internet, radio/television, a modern postal system or even reliable interstate travel. Yeah, it sucks. We all know it sucks. I hate that states like Wyoming are given disproportionate representation in an election over states like California. Or states like Vermont are given unfair representation over states like Texas. It goes both ways. The electoral college system is one I would definitely like to see collapse. Because that’s part and parcel why our elections are poorly represented. Because voters in predominately red or blue states just don’t feel the need to vote, because either their vote isn’t needed (as the state always votes in their favor), or their vote won’t matter (as the state always votes against their beliefs). \n\nBut far right ideologies and facism are on the rise everywhere. Not just the US. This should be troubling to everyone. Not just people who want to blame the US for everything. \n\nJust know that there are a lot of Americans who simply want to go to work, raise their families, be good, normal people, and then have a couple of beers on the weekend. \n\nBut that frustration and ire you’re feeling? Yeah, a lot of us are feeling that too.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Shayducta",
                                            "body": "No. It is not built on bad faith and you just openly proved me correct. \n\nMy whole complaint is your people do nothing. You just complain and don't engage. What does your comment say? \n\nThat people are frustrated and don't want to engage. \n\nSo the one thing you need to do to fix the broken thing Americans won't do because it's broken and hard.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Shayducta",
                                                            "body": "Oh god this garbage again.\n\n> I think you grossly overestimate the power a single individual can have without an absurd amount of money (see Elon).\n\nThis is why the world doesn't take you seriously. You throw your hands up INSTANTLY and give up without offering any resistance or any effort at all. Go \"Well there's nothing I can do myself to change everything so therefore it isn't worth it at all.\" \n\n> What can I, as a single voter, do to disrupt the electoral college system?\n\nSo fucking much. Mainly you could stop whining, engage with other people, form collectives and DO SHIT instead of complaining? So like, oh I dunno, forming protests? Actually engaging with the political process instead of just saying \"It broken\" and not bother? Try actually talking to other people outside of your echo chamber? Try and convince other people with the same mindset to do stuff? \n\nYou all just go \"THE RICH ARE THE PROBLEM\" and basically give up because ***none of you care about anything other than yourself.*** Wanna know how I know that? Because your entire comment was you talking about yourself when I spent my entire comment talking about a **collective.** \n\nMy issue is that people as a whole don't do anything and then you give me a bunch of excuses but the thing is I don't remember seeing anyone ***even fucking try.*** You give up before you start. You go \"Well, it aint gonna work\" and don't bother. Apathy and laziness runs so rampant within the country. You just go \"Well, I cannot do anything as one person. The only people who can are those who have money. Ergo, there is no point.\" When it should be more like \"We as single individuals have no voice in comparison but we are much louder when talking together.\"\n\nYou all seperate and run off into your own little rooms and echo chambers. You DON'T. TRY. TO. DO. ANYTHING. You don't try to convince people one way or another, you just get snarky towards people or angry at them for what they think and then entrench yourselves further and make a wider divide. \n\n> I didn’t prove your point, I just don’t think you totally understand the nuance of our system. \n\nNo. I completely understand it. **You don't.** You're too blinded by apathy. \n\n> If you’re implying that i should go stockpile guns, shoot everyone who opposes my views or go build bombs in my basement, that will do nothing.\n\nJesus christ. Only an American would hear a call to action and then immediately assume that I'm implying physical violence.\n\nThere is ***no hope for you*** until you bother to help yourselves. Wanna know how? We've been saying it for years and I've been saying it in this comment thread. If you can't see it then yeah. There really is no hope for you and you all do completely deserve what you've gotten.",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "Every_Single_Bee",
                                                                    "body": "What would you do?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "AlamutJones",
                                    "body": "Canadian?\n\nI’m absolutely on your side. Australian here, and they’re fucking us over too. It’s infuriating to me how few Americans seem to give a shit about that.\n\nI’m more pointing out that “Trump fucking over arts and culture in the United States” is not an entirely distinct problem from “Trump fucks international relations for the United States” - the cultural stuff is part of how they manage the international stuff, and honestly might be the only tool they’ve got to pretend to be anything other than broken.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "Shayducta",
                                            "body": "Yeah, Canadian who has had to deal with that fucking pathetic countries garbage for far too long. I am so over this horseshit of \"America is our friend\". They never have been within my lifetime. \n\nMy point is more that even though their cultural stuff is part of how they manage international stuff, their cultural stuff  *still shows them as horrible fucking people.* An infinite amount of reality TV garbage, an endless amount of shows that utterly glorify the police (even when they're violating peoples rights), lunatics and murderers in every piece of media one way or another to the point of *apathy*, movies like Top Gun that are blatantly propaganda for military or law enforcement services, or shows that openly make fun/light of minorities of one kind or another. \n\nThey don't have a single reedeming quality that is unique to them.\n\nEdit: It is hysterical watching you Americans flail. \n\n> They don't have a single redeeming quality that is *unique* to them.\n\nSo what do you do? Point out all the things that other countries have in common with you by saying \"Yeah you have some too!\" \n\nA single brain cell between your country.",
                                            "score": -11,
                                            "replies": [
                                                {
                                                    "author": "InfernalInsanity",
                                                    "body": "At least half of us Americans are sick of the same shit. I'm one of those. Unfortunately, not enough of us were willing to do something about it in recent years, and when we do actively try to do something about it, we're routinely stifled and propaganda'd against by the powers-that-be.\n\nThis country is running headlong into authoritarian disaster and I'm being dragged into it by those same powers-at-be that are now gutting our federal services and want to strip away our civil protections in the name of greed and hate.\n\nThe corporations are complicit. The media is complicit. The minority party I'm forced to vote for is complicit in their cowardness to do anything about it. I've loathed living here but it's not like I can afford to move.",
                                                    "score": 22,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SCViper",
                                                    "body": "The commonwealth countries have a shit load of reality TV shows and propaganda as well. Top Gun RAF is a start.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Snoo-77111",
                                            "body": "I'm so sorry for all of it. That orange idiot does not speak for all of us.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Shayducta",
                                                    "body": "He really does though.",
                                                    "score": -3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "FattyLivermore",
                                    "body": "What have you done of merit?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "WheresMyDinner",
                                            "body": "Why does it matter? It sounds like they don’t live in the US, why would they do something about US problems?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "FattyLivermore",
                                                    "body": "In their little tantrum they referred to Americans as:\n\n> Abject fucking failures. No one does anything of merit.\n\nIt sounded like projection.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "No_Independence9767",
                                            "body": "Feeling attacked lil buddy?\n\n\nYou don't need to have 'merits' to dole out criticism and asking someone to qualify themselves before you accept their criticism is just ignorant. \n\n\nHypocrite.\n\n\nDo you ask for qualifications from every internet expert telling you vaccines cause autism, inject ivermectin or how masks restrict oxygen? \n\n\nNo, they say what you like to hear so the whole MAGA crowd eats that shit up and asks for seconds.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Shayducta",
                                                    "body": "Bro, chill. They are literally not worth the effort. They're American. They will always resort to an attack because they don't have a spine. This isn't a country of shining gold and good people. They're horrible people who allow horrible things to exist all around them because they blame everyone else for it. \n\nOf course this dude is lashing out with questioning my merit. The people who steal everything always deflect when their theft is pointed out. \n\nThis is what I keep meaning by the Republicans are perfect for them. Even the Democrats do the same stuff.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "No_Independence9767",
                                                            "body": "You're so right but it's getting harder and harder to bite my tongue in the face of their blatant ignorance and hypocrisy.\n\n\nFunny how he won't even dispute that they're without merit. \n\n\nEven kids in pre-k when insulted will say \"nuh uh, you are\" in response. These geniuses can't even muster that. Instead their playbook is to try and drag everyone else down to their meritless level rather than even attempting to disprove the claim. \n\n\nIt's fucking embarrassing to watch, but they have no shame as long as they feel like they're 'winning' by pissing off the libs and rest of the world to their own detriment. How do I share so much DNA with these people? ",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Shayducta",
                                                                    "body": "It is literally the only play they have anymore. That's why it just makes me laugh. *They are incapable of anything else.*",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "FattyLivermore",
                                                    "body": "\"lil buddy\" lol\n\nNo, none of that applies.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Shayducta",
                                            "body": "Typical American. All your issues pointed out to you and what's your response? \"OH YEAH WELL YOU'RE NOT BETTER THAN ME.\"\n\nYes. I am. Everyone else on the planet is because what we've done of merit is take care of ourselves and others without being so pathetically lazy that we let fascism win. \n\nSorry, but you don't ever get to claim the high horse ever again. Literally everyone on earth has done more of merit than you have by simply virtue of existence.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "FattyLivermore",
                                                    "body": "OK lol\n\nYou wrote:\n\n> Abject fucking failures. No one does anything of merit.\n\nAnswer the question",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Shayducta",
                                                            "body": "Sorry, but an *American* doesn't have the moral high ground. Arguably never has. \n\nKeep screaming into the wind like every other thing you do in life. You lost because of your own laziness. \n\nCry harder. You can do it alone.",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "FattyLivermore",
                                                                    "body": "It sounds like you're the one crying lol I'm laughing\n\nYou can't answer the question, can you?",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "soupkitchen89",
                                                                            "body": "the dude literally dumpster dives for food. it's in his post history. \n\nthis guy is super angry and he's taking it out on the big bad. he sees no nuance, only stupid rage.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FattyLivermore",
                                                                                    "body": "lmao!  Yes the second part of your comment was nakedly apparent.",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "jcacedit",
                                    "body": "He's right. If you want to get things done you have to whine on facebook, not Reddit.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "8-Rope-A-dope-8",
                                    "body": "This is an epic rant! Thank you...lol",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "jmastaock",
                                    "body": "There's something deeply, painfully ironic about this comment",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Shayducta",
                                            "body": "# ***Your entire comment history is politics or political memes.***\n\nYou are exactly the American I'm complaining about. So if you want to say it's ironic, go for it, because not a single thing you say has any impact at all. You've definitely proven that.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "chainlinkchipmunk",
                                    "body": "I'm sorry and also thank you for saying everything so perfectly. You're right 100%. I wish I could toss more than an upvote your way.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "drunkorkid56",
                                    "body": "\"Americans are entitled assholes!\" \n\nSuper hot take. How could you say something so brave!?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Shayducta",
                                            "body": "Found the American.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "drunkorkid56",
                                                    "body": "There are dozens of us! Dozens!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Chrispy_Bites",
                                    "body": ">Your entire culture and national persona revolves around taking credit for other people's work, lie through your teeth and disrespect people the second they don't do what you want\n\nLol goddamn dude. \n\nThe irony of course is that you can replace the word \"Americans\" in your barely coherent, fundamentally ignorant little rant with literally any other nationality and you sound exactly like the Trump supporters here. Good job.\n\nMy man out here trying to excoriate Americans for uselessly yelling into echo chambers while... *checks notes* uselessly yelling into echo chambers?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Hopeful_Chair_7129",
                                            "body": "I mean it’s pretty coherent. Hard to hear, but definitely coherent.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Empanatacion",
                                    "body": "You whined about lazy Americans from a computing device invented by Americans, on a website started by Americans, on an internet invented by Americans.",
                                    "score": -22,
                                    "replies": [
                                        {
                                            "author": "JohnPaulDavyJones",
                                            "body": "To be fair, saying that we invented the internet is a dubious claim. The core technology stack underpinning the backbone of the internet has always been the WWW, which was invented by a British man.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "Shayducta",
                                                    "body": "You mean to say the American misrepresented the truth, took claim of something that isn't actually theirs and then boasted about it? \n\nShocker. \n\nAlmost like their president. \n\nThey got what they deserved.",
                                                    "score": 20,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "postumenelolcat",
                                                    "body": "Also, the computer itself was probably invented more by Alan Turing than any other single person (although that's open to interpretation).",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "JohnPaulDavyJones",
                                                            "body": "Oh boy, the “who invented the computer” debate has been raging for a looong time. I’m a CS PhD dropout, so I love this topic.\n\nIf you reduce a computer to its core calculative and logical function as a digital device, the premier argument actually goes to a device called the Atanasoff-Berry Computer (colloquially ABC) that was invented at Iowa State University. It’s essentially the first copy of the unit that now forms the functional core of every modern CPU.\n\nThat said, Turing pioneered a relatively dense concept at the intersection of mathematical logic and information theory called “Turing Completeness”, which is a set of three macro-criteria that define a conceptual device called a Turing Machine. We call a computing device Turing-complete if it’s asymptotically equivalent to a Turing machine in replicability. No computer is *actually* Turing-complete, since they all have limited memory, but that’s why we use asymptotic equivalence; it’s the “It *would* be like this if it had infinite memory” approach.\n\nAnyway, the ABC wasn’t programmable, so it couldn’t necessarily replicate the functions of any other asymptotically Turing-complete device, so some folks discount it as the first computer. The device you’re thinking of was Turing’s Bombe device from the late 30s, which was essentially just a special-purpose machine; it was even further from Turing-complete than the ABC. \n\nThe device that you’re probably thinking of, which Turing seems to often get erroneous credit for inventing, was the UK’s Colossus machine that they developed in WW2 and that Turing used. It was actually designed by a British man named Max Newman and then implemented by a *really* interesting Brit named Tommy Flowers.\n\nThe first device to be completed as a Turing-complete implementation was Konrad Zuse’s Z3 that he built in his parents’ spare bedroom a few years before the Colossus was functional, but that the German government decided wasn’t going to be useful to the war effort. Terribly ironic.\n\nSo you could definitely say that the Brits developed the first industrial-scale computer, but saying that Turing did more toward the invention/development of the computer than anyone else is a pretty serious stretch. He was a brilliant, pioneering computer scientist, but he’s certainly behind at least a couple of other Brits, Americans, and a German in contributions toward the invention/development of the computer.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sosodank",
                                            "body": "maybe he was using a blackberry!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "drewyz",
                                    "body": "I’m an American & I agree with you. I was an environmental activist for many years, but got out of it because I was tired of screaming into the void.  Our whole civilization is doomed because of the apathy around tackling climate change. The reality is that people are too lazy to change.\n\nI had a dream once, where I was sitting at a table with a couple immensely obese people who were my parents in the dream. They were gorging themselves on meat, grease dripping down their chins. I was a small boy, and I started trembling when I realized they were eating my brother. When I woke up in terror, I realized that this is what we are doing as a culture. We are gorging ourselves on our descendants, we are eating our future.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "poopchutejackson",
                                    "body": "You seem fun",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Arrow156",
                            "body": "As per his master's instructions.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JColemanG",
                    "body": "You forgot the fact that it’s traditionally bipartisan led, and Trump ousted every last Democrat involved.",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "heterodoxia",
                    "body": "Will future honorees just be a carousel of \"Friday night Coors Light football patriot God Bless America we will invade your third-world country and kill you\" country artists that I've never heard of? None of the actually talented, introspective artists would dare to show up. Art REALLY thrives under fascism. Artists love having to censor their work.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "SquarePeg37",
                            "body": "Well, Lee Greenwood is on the board now, so seems pretty likely.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "heterodoxia",
                                    "body": "I can proudly say I have no idea who that is, and I look forward to remaining completely ignorant of any artist MAGA deems worthy of recognition. It will be sad to see Kennedy Center Honors die (or at least be majorly defiled) along with so many other American institutions. They have produced a lot of [unforgettable performances](https://www.youtube.com/watch?v=qz2efshhuq4&ab_channel=MNOW%3A%E2%80%9CMNOW%3AAMOROCCANMAGAZINE%E2%80%9DAMOROCCANMAGAZINE) over the years.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "barath_s",
                    "body": "> exact his revenge against a now deceased Norman Lear.\n\n\nhttps://deadline.com/2025/03/trump-kennedy-center-board-meeting-1236328282/\n\n> During his first term, Trump skipped the Kennedy Center Honors ceremony, bucking a tradition that dated to its inception in 1978. Trump made the announcement after the 2017 slate of honorees was announced. One of them, Norman Lear, said that while he would attend, he would skip the pre-ceremony reception at the White House in protest of the president’s proposed cuts in arts funding. Other honorees followed in their pledges to boycott the event\n\nNorman Lear was a screenwriter and producer ; responsible for sitcoms like jeffersons, sanford and son etc, who got Kennedy Center Honors in 2017\n\nhttps://en.wikipedia.org/wiki/Norman_Lear\n\nSo this time around, Trump is looking to pack the board of trustees presumably so that the Norman Lears of tomorrow don't get honored and cause Trump such an embarassment",
                    "score": 26,
                    "replies": [
                        {
                            "author": "konohasaiyajin",
                            "body": ">  sitcoms like jeffersons, sanford and son etc\n\nJust realized I'd rather have a Zombie Sherman Hemsley or Zombie Red Foxx as president right now 😬",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tltltltltltltl",
                    "body": "I predict a wrestling match. Just so all of idiocracy is being done.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Xanthu",
                            "body": "Paul Levesque needs to call Washington National Opera *yesterday*",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "tcat1961",
                            "body": "lol / WWW shows - that will fit the current administration",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SchmartestMonkey",
                    "body": "I think it also goes back to Trump’s long-known animus to never being accepted into east coast high society.   The Kennedy Center caters to the sort of east coast elite that have rejected tabloid Trump his entire life and that enrages him.  So, he decided to take over the institution that represents the slights he’s felt all these years.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cvaldo99",
                    "body": "Art shows are not piddly bullshit but your point is well taken",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Xanthu",
                            "body": "Compared to the fragile economy, wars and turmoil of the world, and degrading rights of average citizens, 47 running an arts organization is Pissing around with Piddly Bullshit",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Estimated-Delivery",
                    "body": "Luckily, he has the skill set to do both, at the same time.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Xanthu",
                            "body": "Does he?? He couldn’t even represent a tech quote correctly, claiming $30k to “move a piano” when it was the full tech package he was quoted",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlamutJones",
            "body": "Answer:\n\n The Kennedy Centre is a major hub for the performing arts and their role in the cultural life of the United States. Think plays, music and so on.\n\nConservatives have wanted to hop on the board for a while, mostly because (as the “culture wars” demonstrate) there are some *very specific directions* that conservative politicians believe American culture needs to be steered towards…and more importantly, steered away from.\n\nNow they’ve made it, and are trying to enforce what they believe “American culture” should look like. This is not going down well with performers or audiences.\n\nIt’s particularly egregious in this case because the guy trying to enforce it is Trump. He’s demonstrated no previous interest in the arts or related facets of culture. If anything, he’s almost intentionally uncultured...so for him to suddenly decide he gets the final say about what kind of works the Kennedy Centre can host is A Statement.",
            "score": 306,
            "replies": [
                {
                    "author": "Mekroval",
                    "body": "Trump should put RFK Jr on the board, so that RFK can finally finish his goal of shitting on his uncle's legacy and destroying his family's good name. \n\nMaybe they can get Ted Nugent and Kid Rock to sell concerts (if they actually can), since no decent artist wants to be associated with the Kennedy Center under Trump's petty and vindictive reign.",
                    "score": 148,
                    "replies": [
                        {
                            "author": "stitchface66",
                            "body": "in all fairness, that family name has been associated with abhorrent behavior since before jfk was president.",
                            "score": 68,
                            "replies": [
                                {
                                    "author": "BraddockAliasThorne",
                                    "body": "papa joe kennedy. appeaser. friend of hitler. SO many sins of that father.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "stitchface66",
                                            "body": "exactly",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Mekroval",
                                            "body": "True. RFK Jr really not that different from his grandfather, in that way.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "start260",
                                    "body": "Mary Jo kopechne enters the chat",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "hyperdream",
                                            "body": "Rosemary Kennedy enters the chat",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "start260",
                                                    "body": "Gloria Swanson is in the wings",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Arrow156",
                                    "body": "Honestly, I doubt their name would have nearly the clout it still does if so many of them weren't assassinated.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Loggerdon",
                            "body": "To avoid embarrassment the RNC would buy up all the tickets and they would play to an empty room.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "TerryTheEnlightend",
                                    "body": "Let them throw $$$ in that dumpster fire. The cat will be out of the bag when they kill the audience camera feeds that show moss growing on the seats and grass growing in the aisles",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Katy-Moon",
                            "body": "Triple bill: Kid Rock, Ted Nugent and Lee Greenwood.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "jonnyoslowe",
                                    "body": "And the girl from American Idol (forgot her name). She could play in the lobby by the bathrooms at intermission.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Evening-Post1797",
                                            "body": "Carrie Underwood... lol",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "loveisking",
                                                    "body": "Who’s that? Never heard of her before.  Must not be famous",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SquarePeg37",
                                    "body": "I think you're joking, but did you know, Lee Greenwood is actually on the board now? https://www.tennessean.com/story/entertainment/music/2025/02/13/trump-nashville-lee-greenwood-kennedy-center/78541916007/",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "finnishinsider",
                                    "body": "Every night?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Katy-Moon",
                                            "body": "Every. Freakin'. Night. \n/j",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Jaded_Pearl1996",
                                                    "body": "Yes every friggin night. No Exit.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BeholderBeheld",
                    "body": "Didn't he own a pageant? Admittedly, mostly to crash the ladies' dressing rooms.\n\nSo I guess I am saying, there is a pattern of very \"specific\" style of his interest in arts.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "SandSpecialist2523",
                            "body": "He'll have the Kennedy center host Miss America pageants. Not DEI, so basically the reverse of diversity: just tall skinny blondes with blue eyes)\n\nJust like the press Secretary. A long, long procession on CL in bikinis. On a song from Pavarotti or YMCA. I'm pretty sure that's art in the eye of our Dear Leader.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "audible_narrator",
                                    "body": "Don't knock the Pav, he was an amazing artist.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "BeholderBeheld",
                                    "body": "Tactile art....",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sourfunyuns",
                    "body": "These stupid motherfuckers thing the grown up band and drama kids are gonna be with their dumb shit?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "GasPsychological5997",
            "body": "Answer: Trump has always been more interested in social influence and cultural relevance. It’s clear he personally isn’t interested in government or knowledge, but wants to be famous and popular.",
            "score": 32,
            "replies": [
                {
                    "author": "Arrow156",
                    "body": "He'll have to settle with infamous and despised.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DerelictDevice",
            "body": "Answer:  Trump is the chair.  You answered your own question.",
            "score": -13,
            "replies": []
        }
    ]
}