{
    "title": "What's going on with Australia is reburying the remains of Mungo Man and Mungo Lady?",
    "author": "Rajjahrw",
    "subreddit": "OutOfTheLoop",
    "rank": 1,
    "score": 97,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1je77im/whats_going_on_with_australia_is_reburying_the/",
    "id": "1je77im",
    "selftext": "[Mungo Man and Mungo Lady are the oldest human remains found in Australia](https://en.m.wikipedia.org/wiki/Lake_Mungo_remains)\n\nI gathered it was something to do with Aboriginal communities but I don't understand why remains that are 40,000 years + old are being treated this way? \n\nIs there anything else that could be learned from them or are they basically tapped out in that regard? \n\nIs the government forcing this to happen?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nFriendly reminder that all **top level** comments must:  \n\n1.  start with \"answer: \", including the space after the colon (or \"question: \" if you have an on-topic follow up question to ask),\n\n2.  attempt to answer the question, and   \n\n3.  be unbiased\n\nPlease review Rule 4 and this post before making a top level comment:\n\nhttp://redd.it/b1hct4/\n\nJoin the OOTL Discord for further discussion: https://discord.gg/ejDF4mdjnh\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "LifeGivesMeMelons",
            "body": "Answer: Lots of moving parts here. \n\n* Indigenous remains have been treated as property rather than human remains in lots of places, and Australia has a pretty rough history in particular. Some of the last native Tasmanians/Torres Strait Islanders (this status is complicated, but close enough) had their bodies desecrated in pretty horrific ways for science. \"King Billy\" was dug up and dismembered for study, Truganini demanded a cremation but was instead also dug up and stuck in a museum like an animal on display, for a hundred years. So, partially, the AUS gov't is trying to make up for the really egregious sins of the past, and tribal entities want to make it VERY FUCKING CLEAR that their bodies don't belong to anyone but them. \n* AUS also has an unusual history when it comes to the legal status of its indigenous folks. The official policy was for years that Australia was *terra nullius*, \"empty country.\" The Empire just took the attitude that Aborigines did not exist and therefore had no rights. This lasted until 1992, with the Mabo decision, at which point tribal entities began being able to fight for recognition of their ancestral lands. Removal of indigenous artefacts and bodies for scientific study feels, to a lot of indigenous folks, like additional attempts to erase them and deny them rights. In this case, it's removing evidence that they've been there for 40,000 years, and removing connection to their history.\n* I don't know enough about the current science to say if we could still learn more from the bodies. Schmaybe.\n* In this particular case, the relevant elders said, \"Hey, give us back the bodies of our people,\" the AUS gov't said, \"Okay,\" then didn't do so immediately, instead putting them into storage. Then the AUS gov't never got around to deciding whether they cared enough to store the remains in a way they could still be accessed, so the tribal bodies decided enough was enough and just buried them.",
            "score": 112,
            "replies": []
        },
        {
            "author": "AlamutJones",
            "body": "Answer:\n\nIndigenous communities in Australia tend to treat death, the necessary rituals and the respect given to remains **very seriously.** Exactly what this looks like differs across groups - there are several hundred, these two bodies were found on the land of the Mutthi Mutthi people - but it’s enormously important to the vast majority of indigenous people that the “sorry business” of death and mourning be honoured.\n\nThe Mutthi Mutthi people have a continuous presence in and connection to that place that IS, in fact, 40,000 years old. It may be older.\n\nThis means that remains get returned and interred, and any more recent finds are studied as much as possible in situ - if it can be studied without being moved, it is. They’re family, and they want to do it right.   \n\n\nIf it were your grandmother’s body, you would.",
            "score": 66,
            "replies": [
                {
                    "author": "bettinafairchild",
                    "body": "To add to this: this is part of a worldwide trend in treating indigenous remains with more dignity and giving them back to the indigenous groups. Like in the US they have NAGPRA, Native American Graves Protection and Repatriation Act. In Japan they’re repatriating Ainu (indigenous inhabit of the Japanese islands) remains.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaraDePijardo",
            "body": "Answer: there are concerns that further studies over these remains would show little connection with Aboriginals, who claim continuous presence in Australia for tens of thousands of years. If these remains proved to be a different people it would show current Aboriginals conquered and displaced them. Similar incidents have happened with Maori people in New Zealand\n\nThe Aboriginal claim these remains are Aboriginal (no evidence to the contrary, nor to it's favour) and they demand the bodies are treated with respect which in their case means reburying them",
            "score": 1,
            "replies": []
        }
    ]
}