{
    "title": "The real supporters!",
    "author": "CG_17_LIFE",
    "subreddit": "MadeMeSmile",
    "rank": 121,
    "score": 1949,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 33,
    "url": "https://v.redd.it/emo88fgylgme1",
    "id": "1j2gixq",
    "selftext": "I'm unable to locate the original uploader of this video. If you require proper attribution or wish for its removal, please feel free to get in touch with me. Your prompt cooperation is appreciated.",
    "comments": [
        {
            "author": "SwiftSperm",
            "body": "What’s crazy is how animals SUPPOSEDLY can’t sense sense emotion. But they can sense changes in the atmosphere and behavior. I find it interesting how from just a shift in their day to day routine can make them realize or at least seem to realize that we’re not alright",
            "score": 170,
            "replies": [
                {
                    "author": "Certifiedpoocleaner",
                    "body": "I had a cat growing up that would RUSH into a room if she heard someone crying. She would purr, headbutt, and kiss the face of the person crying. I have know idea if she actually understood that we were sad, but as a kid who really struggled with depression, she helped me get through a lot.",
                    "score": 97,
                    "replies": [
                        {
                            "author": "SwiftSperm",
                            "body": "I had an old Rottweiler that would do this. I loved the fact that we had a big “scary” dog that was so charismatic and sweet towards people yet could still be aggressive when she needed to be. Never hurt a fly though. Maybe a couple squirrels though",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Hazee302",
                            "body": "My dog does this. My wife has anxiety and occasional panic attacks. She doesn’t leave her side when she’s going through some shit. She also stayed by me for several weeks after my dad died. She definitely knows when something is up.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "olistova",
            "body": "Animals sometimes show more care than people",
            "score": 58,
            "replies": [
                {
                    "author": "OneFaceManyVoices",
                    "body": "…only *sometimes*?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "apollo11733",
                            "body": "Always",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Visible_Presence_188",
            "body": "he must have felt so warm.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Spikas",
            "body": "I'm assuming this has nothing to do with them being opportunistic omnivores and just heading over to check if there's anything to eat. Hence why they (the goats anyway) leave once seeing that there's nothing worth hanging around for?\n\nNot like they started to nuzzle the farmer or anything?\n\nOr?\n\nInb4: Yes, I am fun at parties.",
            "score": 21,
            "replies": [
                {
                    "author": "Soulegion",
                    "body": "Occam's Razor: What's more likely, that these farm animals are so in tune with human body language and facial expression that they knew the farmer was in distress, and had a strong enough emotional response to walk over to comfort him?\n\nOr, \"animal see farmer do something different than normal, walk over to see new thing.\"",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "lfreckledfrontbum",
                    "body": "Hello…Hello Food Person? Are you ok? Not Holding Foods? I will be over here.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Hadramal",
                    "body": "\"Can we eat it yet?\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Personal_Coast7576",
            "body": "That's why people choose to be with animals rather that people sometimes",
            "score": 3,
            "replies": []
        },
        {
            "author": "According_Weekend786",
            "body": "Me when i am lonely gay but then i see kind and joyful cow",
            "score": 4,
            "replies": [
                {
                    "author": "dan1987te",
                    "body": "Please be autocorrect for guy. Lonely gay adds a whole different vibe.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "According_Weekend786",
                            "body": "I wanted to do the opposite of loving lesbian couple and evil and intimidating horse",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComplexWrangler1346",
            "body": "Wow",
            "score": 1,
            "replies": []
        },
        {
            "author": "Siprsaso4",
            "body": "So wholesome!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snowedin-69",
            "body": "Made me smile, however I wonder whether the animals were just curious. Looks like they were having a boring day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArtsyRabb1t",
            "body": "My rabbit will stomp if anyone is crying, which is a danger response. Also, I think it just confuses animals when we are on the ground. They also run over when we lay down to see what’s up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PumpkinPresent2794",
            "body": "Things like this make me miss living on the farm...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tinu505",
            "body": "Had a cat as a teenager, she never gave hugs, my dad and I were the only ones who could even touch her. Had an abortion, came home feeling so bad (I was too young, he was too dangerous, hope he never has kids), so down and then she came, spent the next few days with me, slept with me, gave me hugs and when I felt better she just stopped. It might be stupid, but I have never felt so supported.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nickoninja833K",
            "body": "You are what you eat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Past-Watercress-2024",
            "body": "We don’t deserve animals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "feelingmyage",
            "body": "I was literally laying on the floor bawling once, and my big tomcat, who was not affectionate, looked at me and came up and curled right into my stomach.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eNaRDe",
            "body": "That first goat was all over that person the second they started walking and when they sat down you can see it's head jesture was meant as a... Oh no, boys we got a job to do. That goat been here before 😞",
            "score": 1,
            "replies": []
        },
        {
            "author": "DirteMcGirte",
            "body": "Does anyone know what that giant blue thing is? It seems like it's for animals to scratch themselves on, I wanna get one for my goats but I don't know what it's called",
            "score": 1,
            "replies": [
                {
                    "author": "This_Price_1783",
                    "body": "Livestock scratch brush",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dawnieangel76",
            "body": "I've had more animals comfort me in my life than humans. Even random animals on the street, not just my own.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Physical_Weakness_28",
            "body": "All this subreddit does is make me cry",
            "score": 0,
            "replies": []
        },
        {
            "author": "Lunardestroyed",
            "body": "Now eat them",
            "score": 0,
            "replies": []
        }
    ]
}