{
    "title": "Cannibal Corpse lead singer George Corpsegrinder Fisher loves to play theme park and claw machine games. He then donates the stuffed plush toys he wins to children's hospitals.",
    "author": "Maybeiliketheabuse",
    "subreddit": "MadeMeSmile",
    "rank": 58,
    "score": 4839,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 39,
    "url": "https://i.redd.it/ondv51rs2pme1.png",
    "id": "1j3dv44",
    "selftext": "",
    "comments": [
        {
            "author": "Mordeckai23",
            "body": "\"*This song is about shooting blood from your cock!*\"\n\n\\-Corpsegrinder.",
            "score": 283,
            "replies": [
                {
                    "author": "indicabigbeard",
                    "body": "Nice dude",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "Abattoir_Noir",
                    "body": "Fucking poet",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheNeck94",
            "body": "met him a few times at CC shows, SUPER friendly and wholesome, dude just fucking loves metal and WoW",
            "score": 189,
            "replies": []
        },
        {
            "author": "TrulyCleverUserName",
            "body": "What a good human Mr. Corpsegrinder is! :D",
            "score": 319,
            "replies": [
                {
                    "author": "JoySubtraction",
                    "body": "\"I'm George.  Mr Corpsegrinder is my dad.\"",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "amilliamilliamilliam",
            "body": "I peeked at his Insta the other day and it's mostly just a sweet longhair dad showing off his very normal-looking family. Super wild contrast to the lyrics, but he seems like a real legit dude.",
            "score": 119,
            "replies": []
        },
        {
            "author": "Crispy385",
            "body": "Love Corpsegrinder. Death metal legend who's also so obsessed with WoW they named an NPC after him lol",
            "score": 73,
            "replies": []
        },
        {
            "author": "t0p_n0tch",
            "body": "More evidence that hardcore and metal fans are nice people cosplaying as mean people",
            "score": 60,
            "replies": [
                {
                    "author": "TylerTheSnakeKeeper",
                    "body": "As a hardcore and metal fan, I would say this statement doesn't cover hardcore 🤣",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "tacwombat",
            "body": "Wholesome dude with a most metal name.\n\n(I want that owl plushie.)",
            "score": 40,
            "replies": []
        },
        {
            "author": "Kilroy314",
            "body": "My dad couldn't pass a claw machine without getting a plushie. Every year he donated all his plushies to charity. The world is a little dimmer without him.",
            "score": 39,
            "replies": []
        },
        {
            "author": "Atillion",
            "body": "Mom, can I go play the claw machines now? \n\nNot until you've ground all your corpses.",
            "score": 57,
            "replies": []
        },
        {
            "author": "Emotional_Cherry226",
            "body": "You guys gotta watch him in target. There's a video somewhere and he's just playing with the toys",
            "score": 14,
            "replies": []
        },
        {
            "author": "GeminiIsMissing",
            "body": "Corpsegrinder sounds like a very nice man.",
            "score": 11,
            "replies": []
        },
        {
            "author": "mrwioo",
            "body": "Couldn't be more metal than that",
            "score": 10,
            "replies": []
        },
        {
            "author": "highly_uncertain",
            "body": "If there's one thing I learned through my younger years of dating metal musicians, metal heads are almost always just big squishy teddy bears.",
            "score": 10,
            "replies": []
        },
        {
            "author": "SilverLilyBloomy",
            "body": "I don’t understand how people don’t like you. You’re incredible",
            "score": 7,
            "replies": []
        },
        {
            "author": "peculiarparasitez",
            "body": "George is down to earth as fuck. A solid dude all around.",
            "score": 9,
            "replies": []
        },
        {
            "author": "FixergirlAK",
            "body": "I want to see the machine the big squishmallows came from.",
            "score": 8,
            "replies": []
        },
        {
            "author": "StraitJakit",
            "body": "Didn't he get arrested cause of that song about having skulls in his basement or something? And it turned out he legit did but they were all legally obtained?",
            "score": 7,
            "replies": [
                {
                    "author": "SegmentedMoss",
                    "body": "That was one of the bands guitarists",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "AsunderMango_Pt_Two",
            "body": "We don't deserve Corpsegrinder......but we need him! <3",
            "score": 7,
            "replies": []
        },
        {
            "author": "MrMeowPantz",
            "body": "For a guy who sings about cumming blood and decapitating people, he’s very wholesome.",
            "score": 7,
            "replies": []
        },
        {
            "author": "CocoonNapper",
            "body": "\"MOMMY, MOMMY! Look what the nice man CANNIBAL CORPSE gave to me....\"",
            "score": 5,
            "replies": []
        },
        {
            "author": "Abattoir_Noir",
            "body": "Corpsegrinder has always been a special man",
            "score": 5,
            "replies": []
        },
        {
            "author": "kjoloro",
            "body": "Wonderful Dad and husband.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Whatiatefordinner",
            "body": "He was in my WoW guild. Awesome guy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HandToeKneeUK",
            "body": "Winning twice!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Grand_Measurement_91",
            "body": "Nice of him but Children’s homes (as in group homes) would be a better place to donate as kids in hospitals face the risk of infection and these things can’t be disinfected and also have limited space, whereas kids in group homes have few possessions and no-one to cuddle.",
            "score": 11,
            "replies": [
                {
                    "author": "Tittoilet",
                    "body": "I definitely agree with group homes needing donations. I want to add that the children’s hospital gives the stuffies they get away to kids who are spending time there or scared. My daughter’s prized possession is a dog named cutie from when she had pneumonia. It was years ago and she still talks about how amazing it was, not the fact that she missed a birthday and Christmas stuck in the hospital. That lone little dog made her remember the worst time ever as something she loved.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "fuxxwitclowns",
                    "body": "That is a great suggestion. Everything you said was something that I haven’t considered and will pass on. Thank you!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Mugwumps_has_spoken",
                    "body": "Actually children's hospitals are constantly giving away stuffed animals.  They are a critical part of the child life programs. \n\n\nI don't disagree that kids in a group home probably need them, but I don't know that the model of a group home exists anymore. Foster homes, yes.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Grand_Measurement_91",
                            "body": "It definitely does",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 2,
            "replies": []
        },
        {
            "author": "theRealLydmeister",
            "body": "My favorite, “I forgot I googled that when I was drunk/stoned until I reopened the browser” moment, is “Corpsegrinder kids”. One of his daughters was a clone of him when she was young and I guess I wanted to show someone.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kelly_Killbot",
            "body": "Corpsegrinder is such a good dude! 🖤",
            "score": 1,
            "replies": []
        },
        {
            "author": "Madame_Steph",
            "body": "Long live Mr. Corpsegrinder 👏🏻",
            "score": 1,
            "replies": []
        }
    ]
}