{
    "title": "These bills confiscated by teen cashiers and deemed “counterfeit”",
    "author": "PhillipEngMBTA",
    "subreddit": "mildlyinfuriating",
    "rank": 6,
    "score": 2855,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 348,
    "url": "https://i.redd.it/ouxbg7jlh27e1.jpeg",
    "id": "1hf0r08",
    "selftext": "I shed a tear because of the sharpie they scrawled onto the bills",
    "comments": [
        {
            "author": "Ghstfce",
            "body": "I remember years back using a $2 bill for something and the cashier called over the manager because they thought it was a fake.  The manager sighed and had to explain that $2 bills are real.  Just not very common.\n\nEdit: That red seal would be worth quite a bit of money to a collector and that dumb fuck defaced it...",
            "score": 2268,
            "replies": [
                {
                    "author": "LurkerKing13",
                    "body": "The red seal bills sell for like 15 bucks",
                    "score": 165,
                    "replies": [
                        {
                            "author": "Artistic_Regard",
                            "body": "Wait. You can sell money for more money? WHAT",
                            "score": 109,
                            "replies": [
                                {
                                    "author": "audible_narrator",
                                    "body": "Yep, you see the paper silver backed dollars a lot on ebay. Those are the ones with blue ink.",
                                    "score": 51,
                                    "replies": []
                                },
                                {
                                    "author": "wingedcoyote",
                                    "body": "Interestingly enough, brand new rolls of 2024 nickels are currently selling for about $100 per roll (face value $2). They did a very short run of nickels this year so collectors expect them to become a valuable rarity.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "Raskalnekov",
                                            "body": "Wow, the currency market is even more speculative than I'd imagined",
                                            "score": 18,
                                            "replies": []
                                        },
                                        {
                                            "author": "Verryfastdoggo",
                                            "body": "Isn’t Pennie’s and nickels from past a certain year worth way more because the metal is actually copper and nickel. Remember reading something about a guy who was sending truck loads to Canada to smelt them down into bars to sell. Because it’s not illegal to deface US currency in Canada lol \n\nNo idea if that’s true, just some phantom memory",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "-NGC-6302-",
                                    "body": "You've never tried looking for money on Amazon or Ebay?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Buff_dude_",
                            "body": "In good condition uncirculated 1800$. But still a rare thing to see in the wild.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "DudesworthMannington",
                                    "body": "I mean, if you see it in the wild it's not uncirculated.\n\nI actually have one from my time as a cashier.  Only one I saw over several years so I snatched it up.  It's neat even if it's not worth a ton.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Buff_dude_",
                                            "body": "Let me tell you. I almost shot my pants when I found a buffalo nickel. Then one day for shits and giggles I took a magnet through my change jar....and I found a steel penny.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Fun-Position7750",
                                                    "body": "I found a buffalo nickel at work in the cash drawer. And a dollar silver note",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "The_Phroug",
                            "body": "theres a plenty of coins out there thatll sell for $500,000+",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Broccobillo",
                                    "body": "I even hear that bits of coins can sell for that much sometimes",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ACoinGuy",
                            "body": "They are not that valuable.  I sell random red seal fives on my site for $7.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fish_Fellatio",
                    "body": "My kids got $2 bills from the tooth fairy. Easy to acquire via the bank. Sometimes I had to put an order in to get some the next day if they were out.",
                    "score": 449,
                    "replies": [
                        {
                            "author": "bankruptbusybee",
                            "body": "I love $2 bills and dollar coins, especially as gifts to kids",
                            "score": 189,
                            "replies": [
                                {
                                    "author": "bestem",
                                    "body": "Whenever I got interesting money in my till at work ($2 bill, 50 cent piece, $1 coins, etc), I'd use it as change for a family with kids, hoping that they'd give it to the kid.",
                                    "score": 85,
                                    "replies": [
                                        {
                                            "author": "justanotherbutthead",
                                            "body": "Were they silver?",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "bestem",
                                                    "body": "It was mostly $2 bills.  One of my stores was a quarter mile from a university.  At the end of the semester, when a company came to buy back books from the students, all the books were valued at an even dollar amount.  The company just brought a ton of $2 and $20 bills with them, and would give the college kids a bunch of 20s and 2s.  Easy math for everyone.  For a couple weeks at the end of each semester all the stores near us (including us) would be awash in $2 bills.",
                                                    "score": 19,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "theslob",
                                            "body": "Managed a liquor store and got to know the regulars pretty well. We had an older woman who we’d save the $2 bills for. She gave them to her grandchildren.   \n  \nI would also take the weird money out. I have a lot of foreign coins, and probably 20 or so uncirculated collectible silver quarters that some lady was using to buy $4 vodka. ",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Phobos_Asaph",
                                            "body": "I got called dumb for rejecting 50 cent coins once but my reasoning was while that is a real coin, the ones that guy had made the wrong noise",
                                            "score": -46,
                                            "replies": [
                                                {
                                                    "author": "Mojoscream",
                                                    "body": "So some were silver and some were clad. Which means you were either used to hearing coins made before 1965 or after. If you declined coins made before 1965, that’s too bad for you.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Phobos_Asaph",
                                                            "body": "I know what silver sounds like and it wasn’t that",
                                                            "score": -18,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "No_Brush_6762",
                                    "body": "When I was a kid my dad used to go to NFL and NBA games with one of his friends \n\nAnd every time his buddy would hide a BUNCH of dollar coins around our family sedan while they were either on their way there or on the way back \n\nStill a core memory of mine waiting for him to get home so I could tear the car apart looking for dollar coins\n\nHe’d always ask me how much money I found and tell me if there was still a couple in there",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "KalaronV",
                                            "body": "That guy sounds like the coolest",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "RiLoDoSo",
                                    "body": "I used to go to my bank once in a while and specifically request $2 bills and the $1 Sacajawea coins. It's funny how many people think that they're fake money. I love giving them as gifts as well.",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "Hi-Point_of_my_life",
                                    "body": "The other side though is they seem too special to spend. Or at least that’s how I felt and the reason I have an envelope stuffed with $2 bills from about 25 years ago.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "dk745",
                                            "body": "Same. I’m pretty sure they are still being printed to this day though!",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Quadpen",
                                            "body": "i put earlier in the thread but it’s more relevant here,\n\nrang someone up years ago who was just idly collecting them in case they were worth something and found out they were only worth $2 so she just spent them on everyday things",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "library_gremlin_0998",
                                    "body": "My Grandpa used to give me a silver dollar every year as a Christmas present.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Jelly_Belly321",
                                            "body": "Got them from the tooth fairy. When the tooth fairy gifts them to my kid though, she doesn't care. 😞",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "KTKittentoes",
                                    "body": "My mom always did that for me. ❤️‍🩹",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "kilobitch",
                                    "body": "$2 bills are great for tipping bartenders and valets.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Touchit88",
                                    "body": "As a mellinial I thought $2 bills were dope and saved every one I got.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ClassicT4",
                                    "body": "Vending machine on my college campus dispensed dollar coins for change. I used it to collect Presidential dollar coins. I’ve gotten about twenty different Presidents and quite a few Susan B Anthony’s. \n\nI also swapped out my $1s for $2 bills when I worked as a cashier and managed to get about two dozen overall.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "C-romero80",
                                    "body": "The tooth fairy has given my kids a special coin, a $2 bill, and mainly gives dollar coins. They won't spend the $2, and my one kid lost the special coin taking it to school which sucked.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ok_Spell_4165",
                            "body": "My grandmother used to give them out on holidays and birthdays. \n\nWhen I hit a rough spot and had to spend them (I hated doing it but had to) it was a royal pain in the ass because almost anywhere I tried there was a whole ordeal about whether it were a real bill or not.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "BA5ED",
                                    "body": "I’ve got old savings bonds from my late grandparents and I can’t bring myself to cash em.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Ok_Spell_4165",
                                            "body": "I didn't want to but desperate times and all that. \n\nStill have a few of the cards that they came in at least.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Throwaway8789473",
                            "body": "A former friend of mine went to withdraw $22,000 cash from the bank once to buy a house cash at a county auction and got the $2,000 in $2 bills. Paid like $18k for the house in cash, used the other $2k to get it livable, and then kept a big roll of $2 bills for forever and would tip with them places and whatnot.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "xXHomerSXx",
                                    "body": "Make the teller hate you forever any% speedrun",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Puzzleheaded_You2985",
                            "body": "You’re the only other person I know who does this! I gave out my dad’s $2 bills (older, maybe valuable) to my first daughter and then ran out. Had to score some modern ones from the bank. My youngest daughter has just started losing teeth, oldest is just about finished. They have them safely squirreled away because they think they’re special. ",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "LiveTillYouDie",
                            "body": "Yeah I’m a bank teller and I usually keep a strap of crisp 2s I didn’t realize how common that is people love to give them to their kids",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "adisgirl",
                            "body": "I work for a state agency and our director hands out $2 bills (we assume he orders them from a bank and pays for them out of pocket.) He's an awesome guy who works his rear off for us. I always try to write down when and where I get them.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "eatingpopcornwatchin",
                            "body": "Most post offices give $2. Think ive got maybe 10 from them.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TomeThugNHarmony4664",
                            "body": "My kids got the “golden dollars” from the TF, which was great until an accidental tooth loss. OMG— we ended up going to convenience stores, and then went to the metro station 15 miles away when we remembered they gave change in dollar coins. After that, a stash was kept in hand at ALL times ha ha ha",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "classicnikk",
                            "body": "I love that. I acquired a $2 bill like 10 years ago from a friend. Still have it do this day in my dresser! Definitely will never spend it",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Quadpen",
                            "body": "i once rang up someone who paid with them and said “wow don’t see them every day” she said she had loads and was saving them for years until they were worth something, she looked it up and they’re worth $2 so shes just paying for stuff with them",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "YdocT",
                            "body": "Sharpie is an easy fix for a pro, Costly But If its a rare one worth it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "My_Fridge",
                    "body": "When I worked as a cashier I remember this older dude coming up to me with a smug shit eating grin cause after I finished ringing up all his items he hands me some $2 bills to pay. I know they're real bills so I just took them and gave his change back. Man kinda got frustrated that I didn't question him about it cause he is so used to it and I was like, \"Bro my mom used to give me these all the time as a kid so I know what they are.\" \n\nThat said follow up later that night when we're closing and my manager flips the fuck out on me for taking fake bills. I'm confused and ask what fake bills and she pulls them out saying that they aren't real cause she's never seen a $2 bill before. I had to argue for like 10 minutes to have her just google them so she would believe they were real.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "ApprehensiveTask2171",
                            "body": "\"Well at least I know you ain't gay.\"",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "NegotiationJumpy4837",
                            "body": "I'm surprised this problem still happens now that Google exists.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MrMacGrath",
                    "body": "I remember at some point I explained that $2 bills do exist (Along with dollar coins) and you can just ask a bank for them if you want to convert some of your money to them. I just warned them that since they're so uncommon places might not take them.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "midri",
                            "body": "Not just that, you can buy them directly from the US mint uncut... There are people that perforate them themselves and carry folders where they whip out a whole page of $2 and tear off as many as they need.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "teh_maxh",
                                    "body": "Uncut sheets cost significantly more than their face value, though.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "themaskedcrusader",
                    "body": "With the right solvents, you should be able to wash the vandalism off.... \n\nLegal money laundering....",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "zamufunbetsu",
                    "body": "When I lived in Oregon many moons ago, two dollar bills were all over the place. I came home to the East Coast and tried paying for a sandwich that was less than three dollars. The clerk told me they were fake and when they finally confirmed that they were real, she gave me change with a Susan B Anthony.  I worked at an USAF Exchange on a small island off of Japan. For some reason they shipped me $200 in Susan B Anthony’s. I gave them out as  change as rapidly as I could. Nobody wanted them. I bought them all and brought them home to a bank.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "EditEd2x",
                            "body": "There was a strip club in El Paso, Tx that gave out 2 dollar bills as change.  It’s been like 15 years since I was there so I don’t know if they still do that. I figured it was so that you couldn’t just tip 1 dollar.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "zamufunbetsu",
                                    "body": "Exactamente!!",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Shaggy_Shiggles",
                                    "body": "No, it was because the strippers already have a coin slot built in.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TechnetiumAE",
                            "body": "OK I gotta ask: as a Canadian so I don't know American money, why call it a \"Susan b Anthony\" rather than just \"$2 bill\"? \n\nEven Google wanted to just refer to it by Susan. \n\nIs there a particular reason? The only other bill I've heard of like this is the hundred with Benjamin on it. It is more common in some places to refer to the bills as the person on them? \n\nThis is genuinely curiosity over something that seems like more work to me",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "atomicsnarl",
                                    "body": "Thomas Jefferson is on the $2 bill.  Susan B Anthony is on the $1 coin.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "TechnetiumAE",
                                            "body": "I didn't even get the info right from Google, jfc. \n\nAgain why I wonder why they get referred to as the person rather than $1 coin, $1 bill, $2 bill...",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "riptor3000",
                                                    "body": "There have been numerous attempts at popularizing a dollar coin in the US. Susan B. Anthony, Sacajawea, the presidential series.\n\nSo it's just sort of common to refer to at least the first two of those by who's on the coin, I guess. They were heavily promoted that way",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "TechnetiumAE",
                                                            "body": "Only explanation that's actually made sense. Half the replies have been \"YOU HAVE IT WRONG\" but no information. \n\nThank you.",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Pretend_Evening984",
                                                            "body": "Remember the Eisenhower dollars? Those coins were absolute units",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "sobegreen",
                                                    "body": "Because we have a few different $1 coins. The two most common being the Susan B Anthony and the Sacagawea. The Susan B Anthony was retired in 1999 and the Sacagawea took it's place. It is less about the person and more a way to distinguish the series.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "TechnetiumAE",
                                                            "body": "Thank you as well for actual information about this.\n\nI knew $1 coins were uncommon but I didn't think so to the point of calling each kind by its series. \n\nThank fuck canada doesn't do that, nearly every year we have a special loonie or Twoonie come out.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "-Invalid_Selection-",
                                                    "body": "Did you get your info from their ai results, or a link it brought up?\n\nIf you got it from the ai, then you got the most accurate ai result ever given (because ai results are comically bad all the time)",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "TechnetiumAE",
                                                            "body": "No, I'm not an idiot. I've been told to STFU on mildlyinfuriating because of the idiots posting about Google AI there. Only thing worse than AI is people who don't realize how stupid AIs are. \n\nI looked at several links brought up and none were lineing up entirely, that's why I asked.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "-Invalid_Selection-",
                                                                    "body": "Oh good. There's way too many people who wrongly think ai will solve all their problems. \n\nI'm curious what links you did see though, cause someone out there is publishing really bad info",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TechnetiumAE",
                                                                            "body": "Yah unfortunately reinforced my preference of asking people directly over trying to research some things",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "xXHomerSXx",
                                                                    "body": "Okay, one of you had to have changed your comment.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "SideEqual",
                                                                    "body": "You’re right, AI models like Large Language models, LLMs, still have to be trained. They are not self learning…yet.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "zamufunbetsu",
                                                                    "body": "What? AI’s are frigging awesome. They are definitely the future.  And I am definitely not a bot shilling for them",
                                                                    "score": -3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "sherzeg",
                                                    "body": ">Again why I wonder why they get referred to as the person rather than $1 coin, $1 bill, $2 bill...\n\n[Rhetorical question] Why do Canadians call their one dollar coins \"loonies\"?\n\nMoney has all kinds of names; wheat pennies, buffalo nickels, sawbucks, ten-spots, dixies (now that I think of it, there are a lot of names for a ten dollar bill,) and liberty dollars. The list goes on.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Longjumping-Run-7027",
                                                            "body": "Don’t forget the toonie!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "sherzeg",
                                                                    "body": "Loonie, toonie, By the shores of Gitchee Gumee... whatever. \n\nMomentarily forgot about the coin that they developed and then said to themselves, \"We want a catchy name, but we don't want anybody calling it, 'twice the loony.'\"\n\nCheers to my northern neighbors, in our ongoing contest with each other to find chief executives most resembling Zaphod Beeblebrox.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Global-Efficiency-22",
                                                    "body": "Pretty much everything is referred to by its dollar amount, because there's only one version in circulation. With dollar coins there are several different versions floating around like the old oversized Eisenhower, smaller Susan b Anthony or gold Sacagawea version so it tends to be specified more.\n\nEdit: after scrolling down I saw several people post the same thing, I should have checked before replying",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "NeedsToShutUp",
                                                    "body": "Different designs. There was a period of time with 1 dollar coins having Susan B. Anthony. Then they made them with Sacagawea. Those coins are extremely different in size, shape, and color.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "StarsBear75063",
                                                    "body": ">Again why I wonder why they get referred to as the person rather than $1 coin, $1 bill, $2 bill...\n\nWhy are Canadian $1 coins called \"Loonies\"?  Is it because of the loon depicted on it?\n\nSame thing, basically.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "mahjimoh",
                                                    "body": "I feel like if you asked the same question you asked here, Google would have just been confused. Ideally something like a Wikipedia link explaining US denominations and coins might have popped up, but asking why they call a $2 bill “Susan B. Anthony” is a little like asking why they call a Hyundai a Hummer, or why they call a pancake a sandwich. :-) It just wouldn’t have really added up so the results wouldn’t have, either.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Practical-Dish-4522",
                                            "body": "A one dollar coin. Sacajawea (sp?) is on the gold colored one.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "gamacrit",
                                    "body": "The Susan B. Anthony is a one dollar coin that used to be made.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "hoppertn",
                                            "body": "First minted 1978 released in 1979. One reason I heard  it wasn’t accepted was because it was so close in size to a quarter it could get mixed up.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "shuzgibs123",
                                    "body": "A Susan B Anthony is a $1.00 coin that’s about the size of a quarter.  You don’t see them too often.  $2.00 bills are kind of rare, but they still get printed most years.  I have $6,000 worth of them in a safe at work.  We take them to Vegas and give them to customers to use as “tips”.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Remarkable_Inchworm",
                                    "body": "Susan B. Anthony was a specific line of $1 coins.\n\nThey never caught on and many people hated them because they were too close in size to the quarter.\n\nYou rarely see them these days, other than as change from certain vending machines. \n\nThere was another line of $1 coins that featured Sacagawea; those never really caught on either.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ResponsibleBank1387",
                                    "body": "Susan b was a silver colored $1 coin. Confusing with a quarter. \nSacajawea $1 coin was a gold color. Neither were used widespread. Then the Presidents each have a gold colored $1 coin. ",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "According_Gazelle472",
                                    "body": "Susan is on the coin and not on the dollar .I seldom see either one in my town.Some people hate both of them and will refuse to take them .",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "zamufunbetsu",
                                    "body": "The Susan B Anthony is the US version of the Looney. There was a plan at one time to eliminate the one dollar paper money",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Practical-Dish-4522",
                                    "body": "For context Susan B Anthony is said to be the first person to stitch together the American flag 🇺🇸. A folk hero of our country. Having a coin worth $1 is pretty rare. Susan B Anthony feels better to say than “1 dollar coin” and means the same thing. None of this is common in normal life, the dollar coins are rare and more of a novelty except to people who are specifically interested.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "styrolee",
                                            "body": "That’s Betsy Ross. Susan B. Anthony was a progressive activist from the 19th and 20th centuries who helped found and support numerous activist campaigns for abolition of slavery, woman’s suffrage, and prohibition.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "charrobeanss",
                                            "body": "That’s betsy Ross lmao. Susan b Anthony fought for civil rights. ",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "theberg512",
                                            "body": "No she's fucking not. She fought for women's rights, especially the right to vote.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "killbot12192002",
                    "body": "Well the seal is still perfectly fine the number on the other hand",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "AndIThrow_SoFarAway",
                    "body": "It's even worse when the manager also thinks it's fake.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "MechaNickzilla",
                    "body": "I had someone at a chil-fil-a years ago (before they had strips in them) claim that my $20 was fake. I told them I literally just got it from an ATM. We argued about it until they said they would call the cops and I said go ahead and they gave in.\n\nProbably trying to get me to just give it up to them or something but hell no. Fucking fake Christians.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DRKMSTR",
                    "body": "That's nothing.\n\n\nPeople have been detained and then the police had to explain to the store that it was not counterfeit. ",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Effective-Bit-3642",
                    "body": "What is quite a bit of money? I have a red $5 from the 60's that isn't defaced lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ghstfce",
                            "body": "Some 1953s are up for $1500",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Effective-Bit-3642",
                                    "body": "Oh damn!",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Effective-Bit-3642",
                                    "body": "I just checked mine is from 1963",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bibberly",
                    "body": "My local drive- in movie theater only gives $2 bills as change. I took my mom there for her first time in September, and she was so excited about it!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Simoxs7",
                    "body": "I imagine that collectors might have some ways to clean up those bills right?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ghstfce",
                            "body": "Oh I'm sure. Alcohol or something",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Yodaddysbelt",
                    "body": "It might have a red seal but the bill is torn, has obvious creases, and has clearly been circulated plenty. It’s not worth more than face value",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "DGOVegeta",
                    "body": "Same happen to me but they called the cops on me. Cops had to explain to them it was real.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lady-of-Shivershale",
                    "body": "I rejected a $2 bill in Cambodia because I'm not American and didn't know they were a thing. My American husband assured me they were. But people in Cambodia are extremely picky over which bills they accept (the money has to be pristine) and giving counterfeit bills to tourists is extremely common.\n\nSo I rejected it and insisted on two ones.\n\nWe never had any problems with our money, though, so that was nice.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "IrradiatedToast",
                    "body": "Happened to me at a Jimmy John's. They refused to take cash as I was handing over a $2 bill with the other cash.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Available-Bonus-552",
                    "body": "I had this happen at McDonald’s once",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lepke2011",
                    "body": "I had that maybe 30 years ago when trying to use a $50 to pay at a Baker's Square.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cescasjay",
                    "body": "When I was a kid, our local movie theater always gave out $2 bills. Matinee price was $3, so we paid with $5 just so we'd get $2 as change.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "meesterstanks",
                    "body": "LPT: if you ever go to Mexico, tip with a $2 bill for special treatment, they are good luck charms to them and will make you remembered out of the sea of faces",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "issacoin",
                    "body": "when i was in high school i sold weed and this kid bought an eighth from me with 20 $2 bills. he was a bit of an odd duck all around but i thought that was cool",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EnderJax2020",
                    "body": "I had a guy pay at the register whose wallet was filled to the RIM with $2 bills. It was crazy lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MessageOk4432",
                    "body": "Well that 2$ bills worth around 300$ in my country, with certain number they worth more. People buy it as some sorts of lucky charms lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tubular1845",
                    "body": "Not in that condition it wouldn't",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DaShMa_",
                    "body": "I have a similar $5 bill, but not sure if red. Gonna have to go check it out, but I sure would like to find more.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Clever_mudblood",
                    "body": "Not in that condition (with the tears and such). MAYBE double face value. But more like $8. If eBay sold listings say anything.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "notislant",
                    "body": "Rubbing alcohol is pretty good at removing sharpie ink.  Would probably be worth trying little bits at a time.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "synfulacktors",
                    "body": "My great grandma whipped out a 1k bill one time. Yes, they are real. I have a couple $2 bills in a safe just for giggles to hand over to my daughter in like 20 years.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "younoknw",
                    "body": "damn, they're not common? I have one. looks like I gotta keep it now.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "saltyourhash",
                    "body": "I had a customer that paid in only $2 bills, he had some kinda stash or something",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Foxy_locksy1704",
                    "body": "I also had to explain this to a young cashier. I had 2 $2 in my own wallet so I opened it and showed her that it was indeed valid currency. Once she got over her embarrassment she thought it was actually really interesting.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Careflwhatyouwish4",
                    "body": "Maybe the owner could sue for that value.  THAT would be a lesson learned I'd like to see.  LOL",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "connorwhit",
                    "body": "Imagine calling someone dumb because they don't know what's value to niche currency collectors",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Ghstfce",
                            "body": "Nice try, my comment was not knowing that $2 was legal currency. But try again another time. The marking of any bill is just stupid",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "connorwhit",
                                    "body": "You literally call them a dumb fuck for counterfeit testing the note you dumb fuck",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ghstfce",
                                            "body": "Did I say they were dumb for testing it? No, I said they were dumb for DEFACING IT. Huge difference buddy. Reading comprehension is important... No need for name calling",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheFox1331",
            "body": "I’m so confused as to how they think they’re fake? I personally have not worked long as a cashier ever but isn’t the ink supposed to change if they are fake",
            "score": 579,
            "replies": [
                {
                    "author": "notomatostoday",
                    "body": "Yep. I was a fast food manager for a few years and checked many a bill myself. Granted, it’s been a long time and I may have this backwards, but I believe those orange marks on the bills would be black if the notes were counterfeit. I’m not sure how it works on older bills, but we rarely if ever checked those where I worked anyway.",
                    "score": 246,
                    "replies": [
                        {
                            "author": "TheMoneyCounter",
                            "body": "Sometimes great counterfeiters will use highlighter on their fake bills to make it seem like the counterfeit pen passed - so that no one else uses one to check it.",
                            "score": 104,
                            "replies": [
                                {
                                    "author": "kwiknkleen",
                                    "body": "Also they wash out lesser bills and use the paper for counterfeiting so the pen would show it was real.",
                                    "score": 58,
                                    "replies": [
                                        {
                                            "author": "TheMoneyCounter",
                                            "body": "That’s right, they bleach a low denomination bill and reprint a higher denomination on top. It’s very common, that’s why we don’t use the markers anymore.",
                                            "score": 39,
                                            "replies": [
                                                {
                                                    "author": "zamufunbetsu",
                                                    "body": "I always thought the markers responded to the ink",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "TheMoneyCounter",
                                                            "body": "Me too but then I learned the pens respond to the cotton/linen blend in real bills (which later I found out is also in resume paper)",
                                                            "score": 18,
                                                            "replies": [
                                                                {
                                                                    "author": "zamufunbetsu",
                                                                    "body": "Good to know! So I can start my hobby counterfeiting by using resume paper I guess?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Argylius",
                                                    "body": "How can I make sure they’re not counterfeit?",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "TheMoneyCounter",
                                                            "body": "I use an automatic counterfeit detector. But if you don’t want to spend the money, checking for the watermark is easy. Scratching the collar with your nail is good to check for textured ink (if it’s smooth it’s fake). I always suggest to at least invest in equipment with a UV light so you can check the security thread. It’s a no brainer, you catch 1 counterfeit and you’ve already paid for the machine.",
                                                            "score": 10,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "thomasjmarlowe",
                                                            "body": "For newer bulls, uv light underneath illuminates the security strip inside. Different colors and positions for different bills. $5 and up have them (newer ones at least)",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Argylius",
                                                                    "body": "Can confirm. I used to have a money marker pen with a UV light attachment. It was super fascinating",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "notomatostoday",
                                    "body": "Huh. That’s pretty smart. In practice, you should check them every time, but the human element certainly presents a lot of backdoors.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "satbaja",
                            "body": "You are correct for newer bills. Yellow pen stays yellow for good bills and tilers dark for fake - usually. Old bills are not compatible with this test. Look at the age 1950s. They will fail the pen test every time.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "AchondroplasticAir",
                            "body": "It does depend on when the bill was made, if they're too old like that 5 dollar bill it'll cause a false positive, any bill before 1960 can very likely do that. \n\nThat 10 on the other hand I am not too sure if that's also the case because I can't see the year.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PhillipEngMBTA",
                    "body": "Yes! And even then they didn’t care",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "DMercenary",
                    "body": ">I’m so confused as to how they think they’re fake?\n\nProbably no one actually trained them on the pen and the design of the bills are too different from modern bills so = FAKE\n\nThat being said absolutely dumb to deface it even more with sharpie or confiscate it.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "bankruptbusybee",
                    "body": "And we were told to never bother checking anything below a 20….",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "kluvspups",
                    "body": "Older bills don’t have whatever is in newer ones that reacts with the pen. So even if they are real, they can appear “counterfeit”.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Randy_Character",
                    "body": "1). Because people are stupid\n\n2). They started printing “big head” bills in 1996.  I still use cash for a decent amount of transactions, and I rarely ever see those pre-96 bills anymore. There’s a good chance younger cashiers have never seen one.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "TheFox1331",
                            "body": "The second half I can tripping up some people sort of, but still questionable to me. I’m only 25, so not much older than most that would be working retail.  Although I could be the odd one out, since I’ve always been very money conscious because we never had any. \n\nFirst half, sadly probably the answer",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LC_HoTS",
                    "body": "Speaking as someone who worked in fast food as a teen/young adult, cultural perception makes you think counterfeit money is a lot more common than it actually is (much like quicksand or getting stranded on a deserted island lol).\n\nPicture this: you grow up not handling a lot of money, now you and your shift leader who's only 2 years older than you are alone on a slow day and someone hands you a funny looking $100 bill. Knowing about money more from the same stock picture in civics textbooks than actual cash, you become convinced it's counterfeit with the same certainty that the stork brings babies because of the book you read when you were 4. The two of you spend the next 15 minutes hyping each other up over uncovering a criminal conspiracy in your small town until he calls your beleaguered manager who tells you to take the stupid money and we'll deal with it tomorrow. I don't even know how long that poor schmuck was waiting for his food. The next day it's confirmed that the money is not fake, and there is now a felt tipped pen with special color changing ink that can mark fake bills in case an idiot is working the register on the boss's day off.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "TricellCEO",
                    "body": "Yeah, this seems odd. I once checked an older bill with the ink, and it didn't turn dark, so it was legit. However, the bill was lacking other security features due to its age (I don't even think it had the ghost when holding it up to the light). Also, I have been told that bills that have been washed and reprinted with higher value will pass that ink test.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "dogengu",
                            "body": "Yes. I have seen and touched a fake $50 once. It passed the marker test, because it was a washed $10. When I held the bill up to the light, I could see the ghost of the $10 man. \n\nThe color, however, looked really odd. Especially when you compare it with a real $50. And the ink washed away easily once water touched it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Beginning-Tea-17",
                    "body": "It darkens from a highlighter yellow to a muddy orange.  If it’s not fake it stays a lighter shade of yellow\n\nI have to pen about 20 bills every night and have seen bills fail, I do other tests as well however not just the pen.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "GringerKringer",
                    "body": "Because they don’t know these were the designs before the modern bills",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "imSillayy",
                    "body": "I thought they were fake cause it said not real tender.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lucketts",
                    "body": "I don’t know if these bills are new or what but the first time I saw them I thought they were fake. \n\nI’ve been handling cash for a decent amount of time and these bills\n1) Feel different\n2) Have a different design \n3) $2 bills used to be rare?\n\nI got my first cash handling job in 2015 and between 15’ through like 20-21’ I saw a $2 like once. \n\nThe last couple years I get them everyday. \n\nI see some people saying that these bills are from the 90s. That may very well be true, I’m not sure. I used to work in San Diego and never saw $2 bills. I’m not in that area anymore and now I see them all the time so maybe it’s a weird regional thing as well.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "AccuBANKER",
            "body": "Retailers need to stop using the pen altogether. As others have pointed out, you can fool a pen but automatic detectors check up to 8 security features on US bills. That $5 red seal was nice until the cashier took a sharpie to it.",
            "score": 225,
            "replies": [
                {
                    "author": "thegrayvapour",
                    "body": "A little rubbing alcohol and a dabbed paper towel will take that write/right out.",
                    "score": 30,
                    "replies": []
                }
            ]
        },
        {
            "author": "lacinated",
            "body": "always amazes me on the currency subs when people question the bills that we all USED to use… god im old",
            "score": 554,
            "replies": [
                {
                    "author": "TheLostRepublic",
                    "body": "That’s a 1953 DC $5 Red Seal. It was worth between $50-$1000\n\nNot anymore. I feel older.",
                    "score": 294,
                    "replies": [
                        {
                            "author": "u-bot9000",
                            "body": "If you are buying any of them for $50 and it isn’t in amazing condition you are getting scammed\n\nThey roughly go for around $10 in okay condition (VF / XF for collectors) \n\nIn good quality (AU to low MS for collectors) they go for around $40\n\nIf you somehow sell one for $1000 then that must have the most insane error ever recorded or something haha\n\nJust don’t want you to be misinformed",
                            "score": 104,
                            "replies": [
                                {
                                    "author": "TheLostRepublic",
                                    "body": "I am quoting my last memory. So 10 years ago maybe. Love to hear it’s more affordable now. I got out years ago at the height when a Red Seal pre-Kennedy was still an easy grand",
                                    "score": 29,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PcLvHpns",
                            "body": "This makes me feel sick and like slapping some idiot teenagers",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "De-railled",
                    "body": "ROFL, I have some old dollar bills my dad gave me if I ever travelled to America.\n\nAlso said stuff about American money being accepted in many countries back when he was travelling, so it was good to have American dollars when travelling abroad for emergencies.\n\n  \n\n\n...I guess I bettter go find that stash and check if they have any hidden value in those notes...\n\nand don't give them to a dumb cashier...",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Darth19Vader77",
                    "body": "Like 3/4ths of the US population was born [after 1965](https://www.statista.com/statistics/296974/us-population-share-by-generation/)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "basiltoe345",
            "body": "So you’re saying these idiots stole legal tender from customers? \n\nAnd didn’t check with their managers? 🙄\n\nHopefully the customer(s) complain(s) to the store manager \n\nand gets their money back!!",
            "score": 349,
            "replies": [
                {
                    "author": "Mr_Tiddly_Winks",
                    "body": "Actually the real value of these bills which would be over face value….",
                    "score": 118,
                    "replies": [
                        {
                            "author": "theberg512",
                            "body": "Not by much, and if they're trying to spend them at face value it's a moot point. ",
                            "score": 49,
                            "replies": [
                                {
                                    "author": "Mr_Tiddly_Winks",
                                    "body": "True",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TH_Rocks",
                    "body": "Technically the store needs to notify their bank or the police who then contact the FBI.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "linux_ape",
                            "body": "Secret service are the ones in charge of counterfeit money actually",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "mkosmo",
                                    "body": "Yeah, but you don't call them directly.  Local law enforcement or the bank will do that.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "linux_ape",
                                            "body": "Yeah it was a correction on his chain, you call local cops and then they call the SS, not the FBI",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Osos_Perezosos",
                                                    "body": "USSS*",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "linux_ape",
                                                            "body": "I could see where shortening it to SS might cause some confusion",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Wise_Rutabaga_5809",
                                    "body": "Can confirm. Had secret service pop up to a place I worked at a while back about counterfeit money accepted by a coworker. They were on to a woman who was spending fake cash all around my city",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Cetun",
                    "body": "In smaller establishments your manager might be 20 and your workers might be 17.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Potatowhocrochets",
            "body": "oh man, seeing the sharpie on the bottom one hurts",
            "score": 31,
            "replies": [
                {
                    "author": "DrZurn",
                    "body": "Would you be able to wash that out with rubbing alcohol? I know that works on other surfaces but not sure if it works on bills.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Potatowhocrochets",
                            "body": "I'm not sure, I mostly collect coins and you aren't supposed to clean them as they lose value when you do. I have a few bills I got as a gift in sleeves but never tried to clean them, I worry any kind of liquid on the bill will worsen its condition.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "FatchRacall",
                            "body": "Acetone yeah.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "colbymg",
            "body": "I once sold an iMac on Craigslist, buyer paid with $100 bill. I went to spend it and it failed the pen test. Took a closer look, it was from 1950, very crisp and good condition; not fake. From what I could tell, it'd be worth $200 if not for that cashier scribbling all over it. Ended up changing it at a bank for 20s",
            "score": 24,
            "replies": []
        },
        {
            "author": "A1_Killer",
            "body": "As a non American what made them think these were fake?",
            "score": 38,
            "replies": [
                {
                    "author": "georgecm12",
                    "body": "They're old currency designs.\n\nThe $5 is a special bill known as a \"United States note\" or a \"Red Seal\" note, which means instead of being issued by the Federal Reserve, it's backed by the US Government itself. Somewhat uncommon, would be worth some considerable amount of money more than face value to a collector in good condition (which this is no longer, now that the stupid cashiers scribbled on it).\n\nThe $10 isn't really all that special; it's just an old design from before 1991.",
                    "score": 100,
                    "replies": []
                },
                {
                    "author": "0le_Hickory",
                    "body": "These are a couple generations old currency. Only the $1 still looks like this. All larger bills were redesigned a few times since these were last issued. It’s just old bills.  Older than the kids most likely that said they were fake.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "bankruptbusybee",
                            "body": "God, I’m so old, I was trying to figure out what was wrong with them since they look normal",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "live-the-future",
                                    "body": "Yeah sadly, those young cashiers thought their limited life experience was the definitive word.  I'm over the half-century mark myself and have seen both these bills before, though the red seal was kinda rare even in the old days.  My grandma used to send red seal bills as birthday money.  Still have some of them, including a $2 red seal somewhere.  I won't be spending that, but I'd like to see the expression on one of those young cashier's faces if I did.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CrispyJalepeno",
                            "body": "These are from the early 50s specifically, so definitely older than most kids these days. I'd personally be so excited to get these, and I don't even collect currency",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "A1_Killer",
                            "body": "Okay, thanks a lot",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Beginning-Tea-17",
                    "body": "The people are telling you “old currency” but it’s because it failed the pen test. I’m the US special pens are used to help identify counterfeit bills. That dark marker-like line left of the portraits is from that.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "mitolit",
                            "body": "The marker turns black when it is counterfeit not yellow… these are genuine bills.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Beginning-Tea-17",
                                    "body": "https://preview.redd.it/i97pg47rd47e1.jpeg?width=875&format=pjpg&auto=webp&s=975b259e694137490f25acaaf201abdec3cf8a3c",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mitolit",
                                            "body": "From your image:\n\n>When marking a genuine banknote the mark will become clear or yellowish. If the banknote is NOT genuine, the mark will turn dark brown or black.\n\nAre you unable to read your own image? Read that second sentence.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Takara38",
                            "body": "The pen is notorious for being wrong.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Beginning-Tea-17",
                                    "body": "Wrong or not people are painting the picture that teenagers never seen an old $5 bill before when it’s obviously failed the pen test.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "New_Competition_316",
                                            "body": "The overall point of “teenagers dumb” still applies if they believe the pen without a second thought",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Beginning-Tea-17",
                                                    "body": "The pen plus the letters “fake” written on the 10$ bill coupled with the fact it’s old? Yeah I wouldn’t take it either. Wouldn’t doodle on it would just ask for a different bill.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "misshopeful0L",
                                                            "body": "I think they wrote the “fake” on there- it wasn’t there before confiscation. At least that’s my read of it.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Beginning-Tea-17",
                                                                    "body": "I mean there’s a “fake” in pen, and a “fake” in marker",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Late_Mixture8703",
                                            "body": "No bill made before 1960 will pass the pen test, The chemical properties of US banknotes printed before 1960 make marking pens useless, resulting in false positives. One example of this complication taking place happened in 2016, in which a 13-year-old student was arrested by police after she attempted to pay for lunch with a red seal Series 1953 $2 bill after the school's counterfeit pen was unable to prove its authenticity.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mooosejoose",
            "body": "I tried to buy food at checkers years ago, with a really old 10 dollar bill I had in a collection. It was nothing special, just old, and I figured I'd go get some lunch with it.\n\nNope. They called the cops on me trying to pay with fake money. After the cops showed up, and I explained, they laughed and told the manager it's not fake money.\n\nShe still wouldn't accept the bill. Absolutely refused to take it because she had \"never seen a bill that looks like that\".",
            "score": 27,
            "replies": [
                {
                    "author": "live-the-future",
                    "body": "Tell her to whip out her phone and get to a site called Google on the electric internets.  The stupidity of people does not make me optimistic for the future.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mister_Normal42",
            "body": "Who's giving red seal bills to cashiers?!?",
            "score": 10,
            "replies": [
                {
                    "author": "davidg4781",
                    "body": "People that find their grandma’s money and take it to buy some MD 40/40s.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "adought89",
                            "body": "You mean MD 20/20?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "davidg4781",
                                    "body": "Oh yeah, that!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "adought89",
                                            "body": "Fun fact it used to be actual wine",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "New_Competition_316",
                    "body": "I’ve heard some collectors will recirculate money from their collection to generate interest in the hobby",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SmolishPPman",
            "body": "Oh god. I’m old",
            "score": 7,
            "replies": [
                {
                    "author": "cbih",
                    "body": "You must be real old then. These bills are from the Kennedy administration.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "theberg512",
                            "body": "~~Can't make out the date on the top one, but the bottom is from Eisenhower's presidency.~~\n\n\nTIL the dates don't mean what one would think. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cbih",
                                    "body": "Check the treasurer. Kathryn Granahan was treasurer from 1963-1966",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "theberg512",
                                            "body": "I stand corrected. \n\n\nSo apparently these are from somewhere between January 1963 and April 1965.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sporkbeastie",
            "body": "Aren't you supposed to call the FBI or Secret Service when you have counterfeit money?",
            "score": 21,
            "replies": [
                {
                    "author": "Jussins",
                    "body": "Yeah, secret service typically handles counterfeit cases.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "khamul7779",
                    "body": "They're supposed to confiscate it as well, yes",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ecwagner01",
            "body": "I'd give them a 'real' dollar for both of them.  \n\n![gif](giphy|xT8qB9vEWaZRBQ7wdO)",
            "score": 7,
            "replies": []
        },
        {
            "author": "Strange_Bar1353",
            "body": "Obviously, you can’t force them to take them, but screw them confiscating them. I’d grab them back tell them to go kick rocks. Lol",
            "score": 7,
            "replies": []
        },
        {
            "author": "PurrpleShirt",
            "body": "I worked fast food as a teen. Another girl who worked with me refused to accept a 50c piece because she said it was not US currency. She then tried to fight the customer and manager who explained that it was.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Spammyhaggar",
            "body": "I will gladly take that fake 5$ bill.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Snackdoc189",
            "body": "Were they teaching the teen cashiers how to identify counterfeit bills, or just assuming they would know how to do something without training them and then getting mad that they failed?",
            "score": 4,
            "replies": []
        },
        {
            "author": "lynivvinyl",
            "body": "Some people are so stupid that they make the world worse because of it.",
            "score": 9,
            "replies": [
                {
                    "author": "VirtualMatter2",
                    "body": "77.269.255 Americans come to mind immediately. ",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "live-the-future",
                    "body": "Yeah...*\\*sighs\\**\n\nThese young cashiers thought their limited life experience was the definitive word.  One of the bad things about ignorance, of course, is being unaware of just what you're ignorant of.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "AlarmedRush2113",
                    "body": "They're teenagers, chill.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "UltraXFo",
            "body": "As a collector, them writing on a red seal $5 pisses me off",
            "score": 12,
            "replies": [
                {
                    "author": "PrimarisShitpostium",
                    "body": "Yeah why would you attempt to spend that bill in the firstplace?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GrungyGrandPapi",
                            "body": "Broke people stuff",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hewhofartslast",
                    "body": "Nothing a cold acetone wash wouldn't fix.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hot-Win2571",
            "body": "Hey, you. You're no longer allowed a Sharpie at the register.",
            "score": 4,
            "replies": []
        },
        {
            "author": "quinangua",
            "body": "“What do you mean money used to look different, not since I’ve been alive” that dumb ass cashier……",
            "score": 5,
            "replies": []
        },
        {
            "author": "Sudden_Duck_4176",
            "body": "When you say confiscated, what do you mean? To the cashier just take their money and tell them to fuck off.?",
            "score": 3,
            "replies": []
        },
        {
            "author": "lucinasardothien",
            "body": "Something similar happened to me with a $100 USD bill, the cashier was super confused because he didn't recognize certain details of the bill so he called over a manager who was also super confused at first, thankfully they googled it and realized it was an older design so they didn't want to take it since they weren't sure it was real or not but they also didn't keep it, simply told me to bring it to a bank to see if it was fake or just an older bill and I just gave them a \"normal\" looking bill, I'm not american so I hadn't even noticed they were different.  \nSure enough it a real bill, just an older one.",
            "score": 5,
            "replies": []
        },
        {
            "author": "iamthecavalrycaptain",
            "body": "That reminds me of a time I was in Canada.  When I return from another country I usually don’t bother changing currency back to USD.  So, I had some Canadian currency from my last trip there years ago.\n\nI walked into a coffee shop, ordered, and pulled out a few Canadian dollar bills.  The cashier thought I was trying to pull a fast one, and called over her manager — who was a bit older and remember that Canada used to have dollar bills instead of Loonies.\n\nApparently I had been holding those bills for longer than I realized.",
            "score": 4,
            "replies": []
        },
        {
            "author": "thatburghfan",
            "body": "It would take 10 minutes to train a cashier to detect fakes with no need for a pen. But managers just tell people to use the pen so no one has to think. Which is why bleached and re-printed bills work - the pen just checks for the right paper.",
            "score": 12,
            "replies": [
                {
                    "author": "Underwater_Karma",
                    "body": "The pens are just iodine.  It turns black in presence of starch.\n\nThe assumption is counterfeit bills will be starched to make them feel more real, but there's really no reason to assume that.  \n\nThe pens are basically just a scam",
                    "score": 7,
                    "replies": [
                        {
                            "author": "mitolit",
                            "body": "What? No. Bleach does nothing to starch, except sterilize it from bacteria. Unless a counterfeiter goes out of their way to source 100% starch free paper, then that paper will have starch in it. The paper with starch is what feels fake.\n\nStop talking out of your ass.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "theberg512",
                    "body": "Honestly, if you handle enough cash you can immediately feel the difference. \n\n\nSource: I used to deal blackjack and have touched a fuck ton of money.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "bexxyrex",
            "body": "I've had 50¢ pieces taken from me over them thinking they were fake. Ppl are stupid.",
            "score": 8,
            "replies": []
        },
        {
            "author": "ResponsibleBank1387",
            "body": "Our local small town sawmill paid all its employees with $2 bills. Just to prove to the town how much the mill contributed to the town. \nNow the presidents dollar coins go to grandkids for their treasure chests. They look gold and shiny. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "sailsaucy",
            "body": "For lulz I tried paying for things with more obscure money and frequently younger people wouldn’t take it. $2 bill, 50 cent piece, silver dollar and a Susan b Anthony dollar. Only one kid was willing to take the $2 bill because his grandmother had given him one for a birthday years ago so he knew what it was lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "Weird-Group-5313",
            "body": "Oh nooo… the fiver😫…",
            "score": 3,
            "replies": []
        },
        {
            "author": "Thing437",
            "body": "Idiocracy in action",
            "score": 1,
            "replies": []
        },
        {
            "author": "HarriBallsak420",
            "body": "They were not confiscated. The cashier stole them and should be prosecuted. Ignorance is not an excuse.",
            "score": 5,
            "replies": []
        },
        {
            "author": "CalligrapherGold5429",
            "body": "When I was a checker, there use to be an old couple that would come in once a month and pay with bills printed before 1950. I think they didn't trust banks and probably had a bunch of $$$ hidden at home. The bills were cool with a darker tone on the front and a weird shade of green ink on the back.",
            "score": 2,
            "replies": [
                {
                    "author": "CrispyJalepeno",
                    "body": "If you lived around the great depression, it makes a lot of sense to not trust banks",
                    "score": 2,
                    "replies": [
                        {
                            "author": "FatchRacall",
                            "body": "Or around 2008.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MYOB3",
            "body": "Take them to a bank. They will probably get a kick out of it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TMQ73",
            "body": "Have an old $100 bill that ATM refused to accept for deposit.",
            "score": 2,
            "replies": [
                {
                    "author": "pixel809",
                    "body": "Go to a Bank with real people. They pretty much have to accept it",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "veganerd150",
            "body": "Those counterfeit pens are a waste of time and money, stop using them and this wont happen again",
            "score": 2,
            "replies": []
        },
        {
            "author": "Curious-Bit3296",
            "body": "They would have to pay me my money back that wasn't damaged by them after the police arrived. Although it's old money. What a shame",
            "score": 2,
            "replies": []
        },
        {
            "author": "bluesky747",
            "body": "Oooo that five is neat. I would have kept that. I’ve never seen one with orange ink like that. It looks different. If I find old money, I keep it, but I’m never lucky enough to find interesting money. I don’t deal enough in cash.",
            "score": 2,
            "replies": [
                {
                    "author": "FatchRacall",
                    "body": "Yup the red seal ones, in good condition, are worth something.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BitchesGetStitches",
            "body": "American currency used to slap",
            "score": 1,
            "replies": []
        },
        {
            "author": "thefrenchguysaidwii",
            "body": "Lmao they just old",
            "score": 1,
            "replies": []
        },
        {
            "author": "BJGuy_Chicago",
            "body": "Try paying with a $2 bill and watch what happens...",
            "score": 4,
            "replies": [
                {
                    "author": "CrashDisaster",
                    "body": "Omg I worked at a video store late 90's to early 00s and too many times I had cashiers both younger and older than me tell people the $2 were fake. I would wave the customer over to me and I'd take the $2 haha",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Underwater_Karma",
                    "body": "Or the golden dollar coins.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Odur29",
            "body": "wait so they defaced legal tender?",
            "score": 4,
            "replies": [
                {
                    "author": "Nuclearmullets420",
                    "body": "It is not illegal to deface legal tender.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "nn123654",
                            "body": "It's almost never enforced, but it's on the books:\n\n>Whoever mutilates, cuts, defaces, disfigures, or perforates, or unites or cements together, or does any other thing to any bank bill, draft, note, or other evidence of debt issued by any national banking association, or Federal Reserve bank, or the Federal Reserve System, with intent to render such bank bill, draft, note, or other evidence of debt unfit to be reissued, shall be fined under this title \\[up to $5,000\\] or imprisoned not more than six months, or both.\n\n>[18 U.S.C. § 333](https://www.law.cornell.edu/uscode/text/18/333)\n\nYou would need either a very egregious case (think defacing tens of thousands of notes as a political statement), an extremely bored prosecutor, them trying to pin anything they can on you in retaliation for another crime they can't prove, or possibly all of the above to get prosecuted for this.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Boonclick",
            "body": "Probably unpopular opinion but going to write in defence of the teens here. These kids are on likely their first real world job, received some basic training and probably got put behind the counter with the warning that “if you accept fake money it’s coming out of your pay check”. Sucks that it happened but holy fuck some people need to learn some empathy.",
            "score": 4,
            "replies": [
                {
                    "author": "PrimeScreamer",
                    "body": "They should have contacted a manager first before defacing legal tender. That's what they're there for.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "DocDocMoose",
            "body": "Wait a cashier took from a customer, kept and then scrawled nonsense on legit bills? And the customer just shrugged it off and went about their day?",
            "score": 2,
            "replies": [
                {
                    "author": "khamul7779",
                    "body": "You're supposed to confiscate counterfeit money. That's not the issue here lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FatchRacall",
                            "body": "It's not counterfeit tho.  Cashier straight up stole from the customer.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "khamul7779",
                                    "body": "They believed it was, in which case it's literally the law for them to keep it. Claiming this is theft is nonsensical.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DocDocMoose",
                                            "body": "They can believe what they like but if I were that customer nothing would have been “confiscated”.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "khamul7779",
                                                    "body": "What a silly response. You can play tough all you like, they did exactly what they thought they were supposed to do. Grow up.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AMCGrandWagoneer",
            "body": "Those bills are worth a lot more than you think especially the old five dollar red seal note",
            "score": 1,
            "replies": []
        },
        {
            "author": "PcLvHpns",
            "body": "So those cashiers robbed your customers! STOLE from them and then defaced the money! 🤦🏼‍♀️\nOh what a bright future we have in store",
            "score": 2,
            "replies": [
                {
                    "author": "khamul7779",
                    "body": "A mistake on the job isn't theft. Relax.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "adlittle",
            "body": "This reminds me of when I had a bunch of 50 cent coins (a friend bought 1,000 of them to pull out the ones with high silver content) and used some to pay for a slice of pizza. The kid at the cash register had to go and ask some older coworkers if that's a real coin. To be fair, I haven't seen one just randomly in circulation since the 80s.",
            "score": 1,
            "replies": [
                {
                    "author": "MLDaffy",
                    "body": "When Ij was working at a gas station in 2000s used to get 50 cents and 1 coins all the time along with $2. We would all save them and buy them from the register to keep",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ReasonDismal6795",
            "body": "Maybe lemon juice might work to fade the ink like with highlighter? I’m so sorry this happened 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "DegenRayRay",
            "body": "Can anyone see any problems with these bills?? They're probably just old bills",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdventureCuriously",
            "body": "Pffft kids these days. Obviously none of them have been to a strip club. $2 bills up in everything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "typehyDro",
            "body": "MBTA ticket machines in Boston only gave dollar coins back…. Much to my dismay",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeitherSparky",
            "body": "I was working at Knott’s Berry Farm as a cashier in one of the smaller gift shops the first time I saw one of the new $20s and I had to call a manager from the big store. I felt pretty dumb.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ButterflyShort",
            "body": "I tried to pay for my drink at a gas station with Susan B Anthony dollars and had to explain that the coins were legal tender.",
            "score": 1,
            "replies": []
        },
        {
            "author": "szczurman83",
            "body": "I've actually heard of a bank teller calling the police because someone tried to exchange a $2 bill. It's insane how stupid people have become.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Competitive-Fox3556",
            "body": "Lmfaoooooo",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoxJellyray243",
            "body": "It’s the fact you can see they used a counterfeit marker on it and it said it was real",
            "score": 1,
            "replies": []
        },
        {
            "author": "Great-Pineapple-8588",
            "body": "I had some silver certificates, thieves chose them over some of my new money. Even criminals knew what they were looking at.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hungry-Holiday2541",
            "body": "The US note is a cool find.  Meh.  Nothing worth shedding tears…",
            "score": 1,
            "replies": []
        },
        {
            "author": "budwin52",
            "body": "Well you could have until some stupid kid wrote on them !!🤦‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "camelbuck",
            "body": "Sharpie can be removed. The substrate is super resilient.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remarkable_Peach_374",
            "body": "I bet they could sue for that if it ends up being valuable with that red seal",
            "score": 1,
            "replies": []
        },
        {
            "author": "frozenthorn",
            "body": "Maybe let them know nobody counterfeits less than $20 bills, it's an expensive process to do well and it's only worthwhile when you can do at least $20 bills.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IwasMilkedByGod",
            "body": "I purposely get a stack of $2 bills from the bank every few weeks to fuck with people. The number of times someone has told me “these aren’t real” or even tried to call the cops is astonishing. Even got a cop saying they’re fake one time and had to go to the bank down the road “to prove it or go to jail”.  (his words)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Golden_Hour1",
            "body": "Lol isn't defacing currency a crime? Maybe someone should teach them a lesson in destroying property",
            "score": 1,
            "replies": []
        },
        {
            "author": "sail4sea",
            "body": "My father is a numismatist and was collecting certain mint marks of Susan B Anthony,  Sacagawea, Presidental dollars.  As well, he was collecting 50 cent pieces.  He used to tip waitresses with Dollar and 50 cent coins.",
            "score": 1,
            "replies": [
                {
                    "author": "theberg512",
                    "body": ">Sacujwe\n\n\nNow that's a new way to spell Sacagawea. I even begrudgingly accept Sacajawea, though that pronunciation grates on my North Dakota ears. It's Sakakawea up here.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "sail4sea",
                            "body": "Corrected.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "carrieminaj",
            "body": "They’re real they’re just old and actually probably shouldn’t be in circulation anymore. But that happens, I have some bills like that",
            "score": 1,
            "replies": [
                {
                    "author": "MyFavoriteInsomnia",
                    "body": "You can probably trade them in at a bank for the new ones.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kahnahoo",
            "body": "Destruction of US currency is a federal crime, call the cops if this happens, the Feds do not fuck around when it comes to the money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dinky_Nuts",
            "body": "Most cashiers are trained to use the pen on $50 bills or higher. Them doing it on 5s and 10s is a training oversight from their supervisors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bwanabass",
            "body": "Don’t waste time. Hire a teenager while they still know everything!",
            "score": 1,
            "replies": []
        },
        {
            "author": "PoopsmasherJr",
            "body": "I wouldn’t have used them to buy anything anyways.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Think-notlikedasheep",
            "body": "It passed the pen test and these brain cell donors call it fake.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Asurakuma_7",
            "body": "As a Brit, can someone explain? \n\nI know y'all have 5,10,20,50,100 dollar bills so why would they not be accepted?",
            "score": 0,
            "replies": [
                {
                    "author": "Chemical-Coconut-879",
                    "body": "They are not the newer style",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Asurakuma_7",
                            "body": "Jeez really? Do they believe legal tender becomes illegal when a new style comes out?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "MyFavoriteInsomnia",
                                    "body": "They're just not familiar with the old style.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "nn123654",
                                            "body": "To be fair if I were a business I would do the same thing as policy. Taking currency you're not familiar with is a risk, and if I'm wrong the business is the one who takes the loss.\n\nI would simply tell the customer that I'm unable to take the currency as it's too old to be identified and to encourage them to go to the bank. I would not keep the currency though for this kind of thing unless it's clearly counterfeit.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Asurakuma_7",
                                                    "body": "But it's legal tender, you have to accept it. \n\nHere in the UK, we have a similar issue with Scottish notes not being accepted, but a little known law exists that if you attempt to pay with legal tender and the cashier refuses to accept the payment, you can legally walk out with the goods you were trying to purchase.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "FatchRacall",
                                                            "body": "Nope.  In the US they have to accept it for debts, not necessarily for purchases.\n\nIf you eat the food at a restaurant and pay after, they have to take it.  If you order at a counter and get your food after, it's not a debt and they can choose not to accept it.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Reversi8",
                                                            "body": "But aren't Scottish notes technically not legal tender outside of Scotland, as they are issued by Scottish banks?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Asurakuma_7",
                                                                    "body": "Nope, they are legal tender because Scotland and England are part of the UK",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "nn123654",
                                                            "body": "You do not in fact have to accept it. From the Federal Reserve:\n\n>Is it legal for a business in the United States to refuse cash as a form of payment?\n\n>There is no federal statute mandating that a private business, a person, or an organization must accept currency or coins as payment for goods or services. Private businesses are free to develop their own policies on whether to accept cash unless there is a state law that says otherwise.\n\n>Section 31 U.S.C. 5103, entitled \"Legal tender,\" states: \"United States coins and currency \\[including Federal Reserve notes and circulating notes of Federal Reserve Banks and national banks\\] are legal tender for all debts, public charges, taxes, and dues.\" This statute means that all U.S. money as identified above is a valid and legal offer of payment for debts when tendered to a creditor.\n\n[https://www.federalreserve.gov/faqs/currency\\_12772.htm](https://www.federalreserve.gov/faqs/currency_12772.htm)\n\nThere is nothing illegal about placing reasonable restrictions on which notes you accept. You have to accept US dollars, but which form they take is up to you.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Asurakuma_7",
                                                                    "body": "I mean, the fact it literally states \"all U.S. money as identified as above\" meaning that you literally have to accept legal tender as payment",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "odaxsaku",
                    "body": "it’s an uncommon type of bill.\ni work as a cashier to pay for school and i can count on both hands the number of times i’ve received old bills.\ncombine that with lot of places not teaching *how* to check for counterfeits except using a special type of pen and looking for watermarks found on modern bills, this type of stuff occurs.\n\nsimilar stuff happens with $2 bills",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Coeddil",
            "body": "The absence of \"...and gay\" tells me this is modern",
            "score": -1,
            "replies": []
        },
        {
            "author": "minniebarky",
            "body": "I would be suing the business",
            "score": -5,
            "replies": [
                {
                    "author": "LIVESTRONGG",
                    "body": "And you’d be the dumbest person on earth to do so. So go ahead",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Atomicnes",
            "body": "I think it's kind of your fault for showing up with bills from the 50's.\n\nI totally would have thought these were fake if someone tried to pay with bills this old that are still in this good of a condition. Counterfeiters love older designs of bills because they're simpler and also don't have the security features of newer bill designs.",
            "score": -4,
            "replies": [
                {
                    "author": "FatchRacall",
                    "body": "They passed the pen test.\n\nThese style of bills were made up through the mid to late 90s.  It's been 30 years not 75 since this style was minted.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Buff_dude_",
            "body": "A red number 5$ what an idiot",
            "score": 0,
            "replies": []
        },
        {
            "author": "OperaBunny",
            "body": "They're not in circulation anymore, but wow all the stuff the younger folks still haven't seen yet.   Currency has its own history.   Years ago I read about a politician who used an older bill and was detained, when the younger cashier call the cops on him.   Young cashier was not aware the older bills were still legal tender, and acceptable.   I have a collection of the older bills, without the watermark, as a keepsake,  but will never use them for purchase, even if it's totally legal to do so.",
            "score": 0,
            "replies": []
        },
        {
            "author": "sabo81",
            "body": "And those teens probably can't read or write in cursive. Kids are dumber than ever these days",
            "score": -6,
            "replies": []
        },
        {
            "author": "juanito_f90",
            "body": "Why aren’t old bills demonetised like every other developed nation on earth?",
            "score": -22,
            "replies": [
                {
                    "author": "0le_Hickory",
                    "body": "Old bills are taken out of circulation but if you have a bill that’s out of circulation it still retains its face value until destroyed by the treasury.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "juanito_f90",
                            "body": "Elsewhere, old notes/bills are demonetised and you can exchange them at a bank for contemporary notes.\n\nThis reduces the amount of misidentifications as “fake” by people who are younger than the bills in question.",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "0le_Hickory",
                                    "body": "Doing that with our currency would grind the world economy to a halt.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "juanito_f90",
                                            "body": "It really wouldn’t.",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "LIVESTRONGG",
                                                    "body": "Starting an argument you know nothing about yet so confidently think you do. It’s hilarious to me.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "0le_Hickory",
                                                    "body": "The dollar is the reserve currency of the world. If suddenly a dollar could be demonetized for any reason people lose confidence in it. What is to stop us from demonetizing greenbacks held by drug dealers or citizens in regimes we disagree with politically. The there is really nothing that could take its place. The Yuan and the Euro don’t have a chance to take its place and neither has instilled confidence in the world to even challenge. The pound is probably the closest but the UK really is not in position now to instill confidence in the world and the a large part of the world is not going to welcome back British power. Without stability of the dollar everything falls apart. Every dollar has to retain its value. Old dollars are demonitized and destroyed but that happens between the banks and treasury, Not by zeroing out legitimate privately held bills.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "live-the-future",
                                                            "body": "\\^ This person economics.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "WildMartin429",
            "body": "Who on Earth is paying with bills from the 1950s? Like have they had this cash in a mattress for 70 years? I expected them to be like 90s or close to when they stopped making them like that.",
            "score": -5,
            "replies": []
        },
        {
            "author": "Beginning-Tea-17",
            "body": "That dark mark next to the portraits is the result of what’s known as a pen test and it failed.\n\nCombine that with the penned in “fake” it appears that more than one cashier determined this as counterfeit. And the fact it failed the initial test and has the word “fake” already on it I’d also be extremely suspicious of it.",
            "score": -6,
            "replies": [
                {
                    "author": "FatchRacall",
                    "body": "The pen test passed you twat.  Failure looks almost as dark as the sharpie on the right.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LaurAdorable",
            "body": "Sharpie is alcohol based, so perhaps a little rubbing alcohol / hand sanitizer will rub that writing off….? Maybe test a small area first?",
            "score": -2,
            "replies": []
        },
        {
            "author": "AccountHuman7391",
            "body": "At the same time, fuck that guy for trying to spend a bill that old.",
            "score": -26,
            "replies": [
                {
                    "author": "LIVESTRONGG",
                    "body": "…what",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AccountHuman7391",
                            "body": "Collectable, bro!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LIVESTRONGG",
                                    "body": "I mean yes, but no reason to get upset spending their own money.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xKVirus70x",
            "body": "That's not a sharpie, older bills when hit with a counterfeit pen show that black doe to the old paper used.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Xenastra",
            "body": "These are FAKES. If you look at real bills from the bank, they look totally different. It's a crime to pay people with bills like this. The Secret Service would like a word.",
            "score": -11,
            "replies": [
                {
                    "author": "plasticman1997",
                    "body": "Found the teenager",
                    "score": 8,
                    "replies": []
                }
            ]
        }
    ]
}