{
    "title": "Do you think Elon Musk has a conflict of interests if USAID was investigating Starlink in Ukraine?",
    "author": "pimmen89",
    "subreddit": "AskTrumpSupporters",
    "rank": 133,
    "score": 112,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 251,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1iklpmg/do_you_think_elon_musk_has_a_conflict_of/",
    "id": "1iklpmg",
    "selftext": "https://gizmodo.com/elon-musks-enemy-usaid-was-investigating-starlink-over-its-contracts-in-ukraine-2000559365\n\nA lot of Trump Supporters have expressed concerns about Joe Biden having a conflict of interest when he was tasked to pressure the government of Ukraine to fire the prosecutor that investigated his son’s company. If it’s true that USAID was investigating Starlink, is it evidence of corruption that Elon Musk is tasked to use the Treasury to defund it and close it down?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Professional_Size_62",
            "body": "That's the thing though, they weren't investigating Starlink at all. USAID isn't an investigatory agency, why would a foreign aid agency investigate a domestic company?\n\nIn reality, they USAID Investigator General was investigating whether the Starlink terminals supplied to Ukraine were used and secondly id USAID was adequately monitoring the use of the terminals\n\nThe exact wording was: \"The USAID Office of Inspector General, Inspections and Evaluations Division, is initiating an inspection of USAID’s oversight of Starlink satellite terminals provided to the Government of Ukraine.\"  \n  \n\"Our objectives are to determine how (1) the Government of Ukraine used the USAID-provided Starlink terminals, and (2) USAID monitored the Government of Ukraine’s use of USAID-provided Starlink terminals.\"\n\nIt's actually jarring to me to see so many news orgs report this as if Starlink was being investigated - everyone has believed it without stopping to wonder why an organisation like USAID would be investigating a domestic company? They have no fining or sanctioning powers, no subpoena power... It's just so weird to think/believe that. \n\nLink to the USAID announcement below:\n\n[https://oig.usaid.gov/node/6814](https://oig.usaid.gov/node/6814)",
            "score": 5,
            "replies": []
        },
        {
            "author": "Gaxxz",
            "body": "What exactly are they investigating?",
            "score": 1,
            "replies": []
        },
        {
            "author": "CanadianBaconne",
            "body": "Yes yes and yes ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jaded_Jerry",
            "body": "Do you think the Democrats had a conflict of interests weaponizing government against their primary political adversary?\n\nI hate these questions because the more I see them the more I realize the left expects Trump supporters to be considerably more aware than the left themselves are.\n\nI'm not faulting you for your question, I'm faulting the concept that the people asking the questions never feel they need to be similarly conscious about when people they like do something similar.",
            "score": 1,
            "replies": []
        },
        {
            "author": "random_guy00214",
            "body": "With all the people USAID funds, it would be too difficult to find someone without conflict",
            "score": 1,
            "replies": []
        },
        {
            "author": "sielingfan",
            "body": ">*This story has been updated to clarify the nature of USAID’s probe.*\n\nI'm guessing you got to the article before the update, since the nature of the probe had nothing to do with Musk or SpaceX. There is no conflict, as reported here now.\n\nQuestion for you.... what authority do you think USAID has to investigate anyone? If they HAD been investigating Starlink's behavior in Ukraine,  what would that mean, what would that look like, what would they be allowed to do? Who would be in charge? What are that person's interests?",
            "score": -13,
            "replies": [
                {
                    "author": "Phedericus",
                    "body": ">since the nature of the probe had nothing to do with Musk or SpaceX.\n\nwhat do you mean? \n\nfrom the article: \n\n>“The USAID Office of Inspector General, Inspections and Evaluations Division, is initiating an inspection of USAID’s oversight of Starlink satellite terminals provided to the Government of Ukraine. Our objectives are to determine how (1) the Government of Ukraine used the USAID-provided Starlink terminals, and (2) USAID monitored the Government of Ukraine’s use of USAID-provided Starlink terminals.”",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Rebel_bass",
                            "body": "Doesn't your quote clearly state that the investigation is focused on the Ukrainian government? How do you extrapolate from that, that Musk and Starlink are being investigated?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sielingfan",
                            "body": "Perhaps if you read it more slowly. It does say the word \"Starlink,\" in the sense that a blog about OJ Simpson would say the word \"Bronco,\" but Ford was never investigated for murdering OJ's wife.",
                            "score": -32,
                            "replies": [
                                {
                                    "author": "ridukosennin",
                                    "body": "Starlink terminals refer to the product produced and provided by Elon Musk’s company, Starlink, which,he owns and profits from government dollars. Does that help clarify?",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "sielingfan",
                                            "body": "\"Bronco\" refers to the product produced and provided by the Ford company, which profits from OJ Simpson's dollars.",
                                            "score": -16,
                                            "replies": [
                                                {
                                                    "author": "ridukosennin",
                                                    "body": "What does that have to do with Musk overseeing government contracts of his own products?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "sielingfan",
                                                            "body": "Musk does not oversee USAID. If you're alleging that he's manipulating USAID in order to profit, 'feeding them into the woodchipper' is an odd way of going about that.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "LateBloomerBaloo",
                                                                    "body": "Are you really not understanding what the potential conflict of interest is here? Hint: it is NOT related to Musk making money of USAID",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sielingfan",
                                                                            "body": "/u/LateBloomerBaloo, how would you personally explain the 'conflict of interest,' in your own words?\n\n(Direct question posted in accordance with ATS rules, you are allowed to answer without question marks)",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LateBloomerBaloo",
                                                                                    "body": "It seems I still have to ask you because my answer seems to have been removed. But would you agree that the following applies?\n\nThe conflict of interest here would be that a USG agency was apparently investigating something related to Musk's interests, i.e. Starlink. Therefore this would fall under the definition of potential conflict of interest since Musk could benefit from shutting down that investigation.\n\nI hope this was sufficiently asked?",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "sielingfan",
                                                                                            "body": "Automod shouldn't be removing your answer. Bad automod. \n\nI've answered this elsewhere. USAID was not paying for the Starlink terminals,  SpaceX was not profiting from their use, and the investigation by USAID IG was specifically targeting USAID oversight (SpaceX was not under investigation). The starlink terminals are tangential to the investigation.  It has nothing to do with Musk,  alleges no wrongdoing or improper profiting (indeed it has no interest in funding of any kind), and the investigation could not reasonably have any impact on SpaceX or Musk monetarily, legally, politically,  or reputationally. They're not party to, nor targets of, the investigation.  It's not about them in the least. No conflict exists.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Ok_Ice_1669",
                                                    "body": "Do you think OJ was the CEO of Ford?",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "sielingfan",
                                                            "body": "Do you think Musk is the CEO of Ukraine?",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Ok_Ice_1669",
                                                                    "body": "> Do you think Musk is the CEO of Ukraine?\n\nNo. Musk is the CRO of America. As a shareholder, I’d like the board to audit our corporate interests as part of a larger governance strategy. ",
                                                                    "score": 14,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sielingfan",
                                                                            "body": "Let's audit **all of it.** All taxpayers dollars, all recipients thereof. Full transparency,  or as near to that as we can manage without putting operatives at risk or what have you. Who says no?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Ok_Ice_1669",
                                                                                    "body": "> Who says no?\n\nAnyone who knows what an audit is. The first thing an actual audit would flag is the unrestricted access by DOGE to restricted information. ",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "sielingfan",
                                                                                            "body": "Let me make sure I understand.  You *don't* want transparency from the government,  because that would require looking at information?",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Hardcorish",
                                                                                    "body": "I'm on board with that.  What I'm not on board with is Elon rapidly taking a sledgehammer to cripple these agencies while bypassing all laws and rules without any oversight.\n\nDo you believe Musk and co should slow down to uncover the wasteful spending before dismantling said agencies, or do you see this 'wrecking ball' tactic as a good thing and if so, why is this the preferred option to carefully uncovering waste within said agencies?",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "sielingfan",
                                                                                            "body": "Sen Kennedy spoke about this at length, and his thoughts basically line up with my own, so I'll link the speech [here](https://youtu.be/Mot_MXlGd4w). The itemized spending talk starts around 8:50 or so. I see no reason why this sort of stuff should be stopped slowly. A wrecking ball is the appropriate tool.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "swantonist",
                                                                                    "body": "That’s not what Musk is doing though. He is completely deleting entire agencies and institutions. Why is he calling USAID evil? Why is an unelected billionaire doing this? Congress is the voted in branch of the government who should be responsible for anything like this. Are you really ok with Musk just paying Trump into being able to delete any regulatory agencies? Why is he attacking judges now who say he must delete any personal data of citizens he took? This is madness.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "sielingfan",
                                                                                            "body": ">Why is he calling USAID evil?\n\nHe alleges several reasons,  including fraud, waste, abuse of funds, political spending, international interference, corruption, and manufacturing entire news agencies both at home and abroad. Elon Musk believes these allegations to be true, and that's why he calls USAID 'evil.'\n\n>Why is an unelected billionaire doing this?\n\nThe elected president of the US appointed him and ordered him to do so.\n\n>Congress is the voted in branch of the government who should be responsible for anything like this. \n\nUSAID is an executive agency, under the executive branch, which is headed solely by Donald Trump. \n\n>Are you really ok with Musk just paying Trump into being able to delete any regulatory agencies?\n\n1. USAID is not a regulatory agency. 2. Musk (or more accurately, his team) reviews data and makes recommendations. All actions are made by the President and/or his cabinet.\n\n>Why is he attacking judges now who say he must delete any personal data of citizens he took?\n\nThat's not what the judge said.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "swantonist",
                                                                                                    "body": "> The elected president of the US appointed him and ordered him to do so.\n\nIs that supposed to frame it in a good way? The reason I point this out is because this is the definition of an oligarchy as opposed to a democracy. Musk bought his way into the government. This is an insane thing to be accepting of. It is one thing to be a lobbyist it is an entirely different thing to be the sole arbiter over every single agency and deciding to flat out delet them or framing them as wasteful or as Musk put it \"Evil.\" \n\n>Let's audit all of it. \n\nThese agencies were *already* being audited. When Musk unilaterally oversees and suggests elimination of these agencies you don't see a conflict of interest with his companies or how one of the most powerful people on earth can take advantage of something like that? \n\n>USAID is an executive agency, under the executive branch, which is headed solely by Donald Trump.\nUSAID is not a regulatory agency. 2. Musk (or more accurately, his team) reviews data and makes recommendations. All actions are made by the President and/or his cabinet.\n\nUSAID is not the only agency he is claiming to have gotten rid of or wants to get rid of. He wants to delete or stick his fingers into **ALL** of these.\n\nConsumer Financial Protection Bureau (CFPB)\nFederal Deposit Insurance Corporation (FDIC)\nDepartment of Education\nEPA\nCDC\nDepartment of Health and Human Services \nFAA\nNOAA\nSocial Security Administration\nand even the fucking Treasury Department\n\nYou're ok with Musk, a private citizen, having access to all these departments and agencies with no oversight? Why do you think it's legal to. Musk's agents have access to the public's personal and sensitive information, including individual's financial information. Why do you think it is ok that Trump gave him the power to do something like this? Even with oversight how could you possible be ok with something like this? Not all of these are executive order agencies.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "sielingfan",
                                                                                                            "body": ">Is that supposed to frame it in a good way? The reason I point this out is because this is the definition of an oligarchy as opposed to a democracy.\n\n? Every president appoints hundreds of positions, including their cabinet and many many many others. Nobody in USAID is elected -- so aren't they an oligarchy? Aren't  ALL of the organizations you cite later, oligarchy?\n\n>It is one thing to be a lobbyist it is an entirely different thing to be the sole arbiter over every single agency and deciding to flat out delet them\n\nHe doesn't make those decisions. He conducts the audit and makes recommendations to the state department (so far; later, other departments,  one assumes). He very explicitly is not an arbiter, let alone SOLE arbiter.  He's an agent of the executive branch, functioning correctly. \n\n>These agencies were *already* being audited.\n\nThen they're awful at it.\n\n>When Musk unilaterally oversees and suggests elimination of these agencies you don't see a conflict of interest with his companies or how one of the most powerful people on earth can take advantage of something like that?\n\nNo.\n\n>You're ok with Musk, a private citizen, having access to all these departments and agencies with no oversight?\n\n1. Again, he has oversight. 2. Yes, I'm okay with it, hell i wish we ALL had access to how these departments and agencies were spending our money. 3. Again, Musk is operating in his capacity as an agent of the executive branch, duly charged and appointed. \n\n>Why do you think it's legal to.\n\nAll of those agencies fall under the executive branch, which power is vested in the office of the President. It's the law.\n\n>Musk's agents have access to the public's personal and sensitive information, including individual's financial information. Why do you think it is ok that Trump gave him the power to do something like this?\n\nAll those agencies already had access to my information,  and I didn't vote for anyone at any of them. Six (seven?) new people from DOGE have access to a system that has ~60,000 employees,  so we're talking about a 0.0001% risk increase? I'm not losing sleep. \n\n>Even with oversight how could you possible be ok with something like this?\n\nI think federal spending has around $3 trillion in fraud, waste, and abuse annually.  The GAO only estimates around $6-700 billion, but i think it's far higher than that. We haven't had a balanced budget since AOL was leaving internet CDs on windshields. Our government functions by voting to spend money it doesn't have, then voting whether or not to pay, then holding one another hostage over the debt limit to extort pork spending in hopelessly arcane omnibus spending bills, and finally by printing new cash and trying to tax the excess out of circulation. We've had a quarter century to solve this gently and it feels like half of Congress has been here for that entire span. They're not going to solve it. A wrecking ball is the appropriate tool for the job.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "swantonist",
                                                                                                                    "body": "> Every president appoints hundreds of positions, including their cabinet and many many many others. Nobody in USAID is elected -- so aren't they an oligarchy? Aren't ALL of the organizations you cite later, oligarchy?\n\nNo. What do you think an oligarchy is? Musk has total power over government institutions here and he bought it. This is worrying because power like this should not be bought but held by the people. There is a pretense that he is there to cut wasteful spending but so far he is just unilaterally \"recommending\" to delete these entire institutions. That suddenly apparently do get deleted immediately. The government workers have clearances and answer to independent oversight. You're also completely leaving out the fact that these agencies literally *give* you your SSN number and that this sensitive data is literally part of the functional apparatus between you and the government. It is a necessity in order for these programs to even function. Introducing outside parties with no independent oversight is a breach of safety that any agency has strict guidelines for.\n\nThere are strict regulations in the access and use of this data. Why are you ok with a private citizen having the same access without these safeguards? Want to post your SSN number right here?\n\n>He doesn't make those decisions. He conducts the audit and makes recommendations to the state department (so far; later, other departments, one assumes). He very explicitly is not an arbiter, let alone SOLE arbiter. He's an agent of the executive branch, functioning correctly.\n\nIf Musk does not make the decisions then why are these agencies suddenly vanishing into thin air when he deems it so? Your argument boils down to \"Well Trump says its ok.\"\n\n\n>All of those agencies fall under the executive branch, which power is vested in the office of the President. It's the law.\n\nNo. This is false. Social Security. The treasury department, The department of Education. The FDIC and the CPFB among others\nwere not created by the president. He has no authority over them under the constitution. He is breaking the law.\n\n>Again, he has oversight. 2. Yes, I'm okay with it, hell i wish we ALL had access to how these departments and agencies were spending our money.\n\nOnce again. No. And this is really important to get right. He does not have oversight. Trump is not oversight. Oversight requires independent analysis. Also the simple fact that he literally *bought* his way into this position. Musk is a private citizen with no knowledge or expertise in government systems. He should not wield this power. Government officials answer to congress and the law when handling sensitive information along with bureaucratic checks and balances. There is no check here and no balance. Musk has total power and decides which agencies get to stay and which get tossed. There is no official appointment, no legal framework for what he is doing. DOGE is not an official government entity. There is no way to even apply rules and regulations to it. It is the same as a private group that bought their way into doing whatever they want with government agencies. It is insane.\n\n>I think federal spending has around $3 trillion in fraud, waste, and abuse annually. \n\nThis is a completely different issue entirely from the legal standpoint. Also, proof? \n\nMost importantly Musk is not an elected or even a hired state official. He is a private entity doing this with no governmental oversight or legal framework to do this.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "sielingfan",
                                                                                                                            "body": ">Once again. No. And this is really important to get right. He does not have oversight. Trump is not oversight. Oversight requires independent analysis.\n\nArticle II of the Constitution says otherwise. The executive Power shall be vested in a President of the United States of America (that's Donald Trump). \n\nI'm not gonna carry this on. I think you're flat out wrong. Power does not, should not, CAN NOT, rest with the bureaucracy.  You put more legitimacy on a G-6 than on the POTUS or his direct representative.  I think that's no way to run a government,  let alone an ostensibly democratic republic. I believe i have sufficiently clarified my position.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Phedericus",
                                    "body": "I don't understand the analogy. Can you please explain it?",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "Professional_Size_62",
                                            "body": "They were investigating how the starlink terminals were being used to ensure it was for their intended purpose. Starlink was not being investigate, not were the starlink terminals provided.\n\nEvery reference to Starlink is actually referencing the product (starlink terminals), not the company.\n\nHis analogy is a bad one but bronco is a product of Ford Motors, same as starlink terminals are a product of starlink.\n\nThat's what he's trying to say",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Phedericus",
                                                    "body": "now I understand! thank you?",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "snowbirdnerd",
                    "body": "Did you read the clarification? They were looking into USAIDs connection and support for Starlink in Ukraine. \n\n\nDo you think USAID has the authority to look into the groups they are funding? ",
                    "score": 16,
                    "replies": [
                        {
                            "author": "sielingfan",
                            "body": "USAID is investigating itself, via its own IG, for its own oversight of a resource provided by USAID to the government of Ukraine. SpaceX and Elon Musk are in no way involved. Y'all are quoting the paragraph that spells this out explicitly and somehow still not getting it.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "snowbirdnerd",
                                    "body": "\"USAID’s inspector general was in the process of investigating its own public-private partnership between Musk’s Starlink and the Ukrainian government. \"\n\n\nThis is what the article says after the correction. Do you think they should be able to investigate their own connections? ",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "sielingfan",
                                            "body": ">This is what the article says after the correction.\n\nFirst of all, Gizmodo is not news, and this is not an article. Your quoted line is a bloggers summary of a paywalled blog post. Second, this was in the original version of the article. The update is quoted elsewhere in this thread, cited from US AID, and it makes the nature of the IG investigation wholly unambiguous. \n\n>Do you think they should be able to investigate their own connections? \n\nOn the contrary, if they would investigate how $87 million of my money went through their agency into Chelsea Clinton's pockets, maybe we wouldn't be having this conversation.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "snowbirdnerd",
                                                    "body": "Don't you think it's pretty telling that an organization that has never been mentioned by Republicans as a problem only comes under fire after it starts auditing it's payments to Starlink a company owned by Musk? That we only hear about how it's bad once Musk gets into power? \n\n\nTo me this seems like he's trying to retaliate against a group that's investigating his company overcharging the US government. ",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "sielingfan",
                                                            "body": "1. We've been talking about foreign aid overspending and fraud since 2016, not sure where you've been. The recent uptick in attention, I think, has more to do with such discoveries as $15 million in condoms to LGBT Hamas fighters, sex changes for Bolivian spider monkeys, and hundreds of millions of disappearing aid to Haiti. \n\n2. There's some disagreement about who's been paying for Ukrainian starlink access, but [USAID certainly doesn't appear to be one of the possible options](https://www.newsweek.com/starlink-systems-ukraine-funded-poland-claims-minister-1967727). Again, the statement regarding the nature of the probe cited in this blog makes it abundantly clear, the investigation has nothing to do with SpaceX, Starlink, or funding. It's.... I mean they literally told you I'm plain english what they're looking at. I can't make it more clear than that.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Ok_Ice_1669",
                                                                    "body": "Do you care that Trump’s inner circle was part of the “Torturers Lobby” which funneled USAID to African Warlords that cut off kids’ arms?\n\nThese were the criminals that Trump pardoned in his first term. \n\nIf you cared about this in 2016, why are you still supporting a president who surrounds himself with the worst offenders?",
                                                                    "score": 5,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "snowbirdnerd",
                                                                    "body": "Yes but don't you think it's very telling that no one was talking specifically about USAID until the person they were looking into for defrauding the US government got into power? \n\n\nUSAID was trying to see if Musk was overcharging and war profiteering at the US tax pays expensive and now he's shutting down the whole organization. ",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "StockFaucet",
                                            "body": "USAID needs to stop taking our tax dollar and provide money to other countries. NOT OUR PROBLEM. We need to fix things HERE!\n\nOff topic. Govt employees can opt out of paying social security. People that don't work for the govt. cannot. We have no choice. If I were to be able to invest that money I would feel safer and have more money.",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "snowbirdnerd",
                                                    "body": "Do you like mass immigration to the US? \n\n\nUSAID provides funds to countries that have experienced natural disasters or who have developing economics. This improves the conditions in those countries making people more likely to stay and less likely to want to come here. \n\n\nThis is basically the goal of the program and I really don't understand why people like yourself are so against it. Programs like USAID are exactly what we need to address the root cause of mass immigration. ",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Ice_1669",
                    "body": "Would it have been better in USAID had used their work in Ukraine as leverage to get Zalenski to investigate Musk?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "DidiGreglorius",
            "body": "Joe Biden announced that someone should “look into” Elon’s companies, and then dozens of executive branch agencies did. \n\nLeftist weaponization should not prevent anyone in the Trump admin from doing their work.",
            "score": -26,
            "replies": [
                {
                    "author": "Ciph3rzer0",
                    "body": "https://www.cbsnews.com/news/joe-biden-elon-musk-saudi-foreign-investors-in-twitter-worth-being-looked-at/\n\n\nThis??  He was asked if Elon receiving 44 billion in foreign money to buy Twitter was a national security threat, and he said \"it's worth looking into it\".  That's the most milquetoast, boring, and expected answer in all of political history.\n\n\n\n\nAlso Elon was under investigation for random things for over a decade.  I used to be a musk fanboy and watched YouTube channels covering all of the trouble he was getting into.  In 2018 he was fined for manipulating stock by making false public statements about taking Tesla private: https://www.sec.gov/newsroom/press-releases/2018-219",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 21,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "long_arrow",
            "body": "he doesn’t. Just because he is doing business does not mean he can m’t provide spending cuts advice to Trump",
            "score": -13,
            "replies": [
                {
                    "author": "OGstupiddude",
                    "body": "Do you think there's a possibility that Elon's advice might be motivated by self interest rather than the good of the country?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "JohnLockeNJ",
                            "body": "Do you think there’s a possibility that the man who is already the richest in the world might be motivated by things other than money?",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "OGstupiddude",
                                    "body": "Are you implying that elites are the least greedy people becuase they already have wealth and power? How could someone become the richest man in the world in the first place without being deeply motivated by these things? And why would that motivation just disappear?",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "JohnLockeNJ",
                                            "body": "Because this particular man got rich through companies that have a higher purpose. SpaceX is trying to spread humanity to other planets. Tesla is trying to move auto transport away from fossil fuels. Boring company is trying to change urban transport. Neurolink is trying to help the disabled.  I wouldn’t put PayPal in the same category but he was young and it’s more insightful to see what he did with his riches once he had some.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "TwoButtons30",
                                                    "body": "What was the higher purpose behind the Roman salute?",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "JohnLockeNJ",
                                                            "body": "It was a “my heart goes out to you” gesture.",
                                                            "score": -7,
                                                            "replies": [
                                                                {
                                                                    "author": "TwoButtons30",
                                                                    "body": "No, it isn't. https://youtu.be/N-_ZBfKXfr0?si=JFFv7bIyKfkMT26m is from 2023 and if you watch 12 seconds, musk makes a my heart goes out to you gesture. What was the purpose of making a Roman salute twice?",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JohnLockeNJ",
                                                                            "body": "Even the ADL says it wasn’t a Nazi salute. https://thehill.com/homenews/administration/5097676-elon-musk-defended-salute-criticism/\n\nMusk said what it meant at the moment he did it, my heart goes out to you. Notice he didn’t say sig heil.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TwoButtons30",
                                                                                    "body": "Why did musk do a Nazi salute when he knows another hand gesture?",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "JohnLockeNJ",
                                                                                            "body": "There’s more than one gesture to convey feelings. \n\nYou’re also ignoring common sense. It’s in context that it means exactly what he says in the moment. Instead you’re pretending that Musk would randomly praise Nazism at a presidential inauguration on live TV. Even a Nazi wouldn’t do that.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "TwoButtons30",
                                                                                                    "body": "How do you explain the other gesture, that clearly shows his heart going out? It is clear what message or purpose is supposed to be conveyed in the 2023 video and totally incongruous to the one at the inauguration. I don't think it was a random moment of praise for Nazism. The obvious connection between white supremacist messaging increasing on X and the Nazi flag being used in rallies like Charlottesville with the MAGA movement are impossible to deny. \n\n\n>Even a Nazi wouldn’t do that.\n\nSo who would do a Nazi salute other than a Nazi?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "JohnLockeNJ",
                                                                                                            "body": "Sometimes people gives a thumbs up and other times an A-OK sign. It doesn’t mean the latter is a white supremacist symbol, as many in the media claimed a few years ago.\n\nCharlottesville was not a MAGA rally.\n\n>\tSo who would do a Nazi salute other than a Nazi?\n\nMy point is that even someone who secretly was actually a Nazi wouldn’t do a Nazi salute at a presidential inauguration on live television.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "TwoButtons30",
                                                                                                                    "body": ">Sometimes people gives a thumbs up and other times an A-OK sign. It\n\nCould you show me where someone else has used a Nazi salute to mean my heart goes out to you? It's obviously not the same as an OK, a common and widely understood hand gesture.\n\n\n>Charlottesville was not a MAGA rally\n\nThe connection between Richard Spencer and Trump is very real. Even if Trump denounces neo Nazis, they love and support him. Never mind the link between the proud boys and Roger stone. Even if it's not an official maga rally, if there are Trump flags next to swastikas it's not exactly unclear that there is a connection is it?\n\n\n>My point is that even someone who secretly was actually a Nazi wouldn’t do a Nazi salute at a presidential inauguration on live television.\n\nIt's not a secret when you do it on stage is what I think you're saying?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "JohnLockeNJ",
                                                                                                                            "body": ">\tIt’s not a secret when you do it on stage is what I think you’re saying?\n\nI’m saying it’s obvious praising Nazis is not what he meant using common sense. It would be a stupid thing to do a sig heil in that situation even if you were a Nazi and Musk is not stupid.\n\nThese aren’t Nazi gestures either:\n\nhttps://imgur.com/a/p0Ge8bx\n\nThis doesn’t mean Biden supported Hitler:\n\nhttps://imgur.com/a/yJpaq3J",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "TwoButtons30",
                                                                                                                                    "body": "By definition, doing a Nazi salute at all is stupid. That would by your own definition, make musk stupid. Wouldn't it?\n\n\nThose are screenshots, the clip of each shows them not doing Nazi salutes at all doesn't it? And to that point, would you post a video of yourself giving your heart out if it's so innocent?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "JohnLockeNJ",
                                                                                                                                            "body": "Doing a Nazi salute if you’re a Nazi is not stupid. Doing it in that situation would be.",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "TwoButtons30",
                                                                                                                                                    "body": "Being a Nazi is inherently stupid isn't it?",
                                                                                                                                                    "score": 2,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "JohnLockeNJ",
                                                                                                                                                            "body": "It’s inherently evil, but not about intelligence",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "TwoButtons30",
                                                                                                                                                                    "body": "What is intelligent about Nazism?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "JohnLockeNJ",
                                                                                                                                                                            "body": "Nothing, but there are evil people at all levels of intelligence.",
                                                                                                                                                                            "score": 2,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "TwoButtons30",
                                                                                                                                                                                    "body": "I understand what you're saying, but the people that believe there are inherently pure bloodlines are about on par with flat earthers. Would you continue with a surgery if your doctor didn't believe in a round earth?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "JohnLockeNJ",
                                                                                                                                                                                            "body": "In scientific terms, plenty of Nazi leaders had high IQs.\n\nhttps://history.info/on-this-day/1945-what-iq-did-the-nazi-leaders-have/?utm_source=perplexity\n\nIn general, across all ideologies, it’s common to find extremists with high IQs because intelligence makes people better at inventing rationalizations for what they want to do or believe anyway. See the Nazi intellectuals:\n\nhttp://online.wsj.com/article/SB10001424127887324577904578557352244619768.html?st=CoHe4u&reflink=article_copyURL_share\n\nBut the larger point is that being a sociopath is not correlated with IQ. It’s evil to be a Nazi, but historically there have been smart ones and dumb ones.",
                                                                                                                                                                                            "score": 2,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "TwoButtons30",
                                                                                                                                                                                                    "body": "I would think the delusion would outweigh the scientific method. Using phrenology to determine racial differences for example. You can have talent and skill that doesn't make you intelligent. \n\n\nEither way, I noticed you haven't answered the question as to what the purpose of musk's Nazi salute was?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "JohnLockeNJ",
                                                                                                                                                                                                            "body": "Exactly what he said it was in the moment.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "TwoButtons30",
                                                                                                                                                                                                                    "body": "Which is absolutely a lie as I've shown, he knows what he was doing. Why hasn't he denied it was a Nazi salute?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "JohnLockeNJ",
                                                                                                                                                                                                                            "body": "You showed one time he conveyed a similar sentiment a different way. Listen to the audio of his whole speech, both before and after the key moment. Which interpretation of body language fits the context, the straightforward interpretation that fits with what he actually said, or a Nazi salute?",
                                                                                                                                                                                                                            "score": 2,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "TwoButtons30",
                                                                                                                                                                                                                                    "body": "It's a completely different and far more appropriate hand gesture. The straightforward interpretation was that he made 2 back to back Nazi salutes and said what he said to provide threadbare cover and plausible deniability. He made a Nazi salute for whatever reason, but it was an undeniable message. The proud boys and Fuentes thought it was a clear salute, why can't you?\n\n\nAnd again, if it's not a Nazi salute, why don't you do it and post the video if you actually believe what you're saying?",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "JohnLockeNJ",
                                                                                                                                                                                                                                            "body": "It’s like he said “I did not see that coming” and said 2 of the words quickly together and you claim he actually said “I did Nazi that coming.” It’s obvious from the context. Likewise, it’s obvious that the context here is a gesture from his heart and it requires imagination to claim that it makes sense that he’d just do a random Nazi salute on national television.\n\nI don’t think it was a Nazi salute and neither does the ADL. Proud Boys and Fuentes are desperate for credibility and it’s in their interest to claim that powerful figures are secretly on their side. In contrast, the ADL gains nothing by debunking this hoax. In fact, in recent years the ADL has been accused of being too quick to classify incidents as right-wing hate. After all, such incidents help justify its mission. Yet they thought this was clearly not such an incident.",
                                                                                                                                                                                                                                            "score": 2,
                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                    "author": "TwoButtons30",
                                                                                                                                                                                                                                                    "body": "So you would do the same gesture and video it to prove your point?",
                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                            "author": "JohnLockeNJ",
                                                                                                                                                                                                                                                            "body": "You just demonstrated that partisans will use motivated reasoning to ignore context and willfully assign disparaging interpretations to innocent gestures, so why feed trolls?",
                                                                                                                                                                                                                                                            "score": 2,
                                                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DulceFrutaBomba",
                                    "body": "If he's not motivated by money, then why was he so pressed about a $56 billion dollar pay package?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "JohnLockeNJ",
                                            "body": "Probably because he thought he deserved it. Just rewards are very different from money through corruption.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "long_arrow",
                            "body": "Yes it’s more than 0. However we operate by the principle of not guilty until proven. You don’t stop driving car just because there is a non zero chance of having a crash.  Do I think he is doing it for self interest? No. Do I have evidence? No. Do I need evidence to think what I think? No. Why? Because I trust my instinct. Am I brainwashed? No. Why? Because I have followed him since 2005 and I know  many little details of him. I have no problems in trusting him. It’s my choice.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "Delam2",
                                    "body": "His net-worth has almost doubled since he endorsed Trump and you don’t think he’s self motivated?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "long_arrow",
                                            "body": "His  networth more than doubled during Biden’s term. And my networth is doubled too. My mom’s car is wrecked. Correlation does not mean causation.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "Delam2",
                                                    "body": "That’s a very silly comparison, I hope you know that. It is entirely causal because investors have speculated musk will be nominated government contracts. Have you heard of corporatism? We’re in the early stages of it?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "long_arrow",
                                                            "body": "Like I said his networth more than doubled during Biden’s term.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Delam2",
                                                                    "body": "That was a 4 year period?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "long_arrow",
                                                                            "body": "So you mean he got too many government contracts from Biden during 4 years?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ciph3rzer0",
                                    "body": "Why is your bar not higher for an unelected oligarch cleaning house in the govt?  If you're going to crap on the constitution and democracy, I would hope you'd have someone beyond reproach that you make king so he can fix it.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "long_arrow",
                                            "body": "How high do you want it to be? His achievement means nothing to you? If you are talking about morality, it’s up to Trump. Forget about whether he is trustworthy or not, What can you do?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mrhymer",
            "body": "No - I think the idea of negating Trump and Musk on technicalities is petty and contrary to the mandate of the people. This is happening. Grab a whisky and pet your cat. It will be over soon.",
            "score": -28,
            "replies": [
                {
                    "author": "Aschebescher",
                    "body": "When I became interested in US politics around 15 years ago and began reading about it the cornerstone of conservative politics was to always be scepticle of people in power. People explained to me it's also the reason for the 2nd amendment because power corrupts everyone. I have to admit it made complete sense to me because the history books are full of goverments turning corrupt, clinging to power and so on. Now, just a few years later, people of this exact same ideologie are putting more trust in their leaders than anyone else I have ever seen.Some are even saying they trust Elon and Trump \"100%\", so without even being the slightest bit sceptical. How do you explain this change of heart regarding this core principle? Have humans changed so dramatically that power doesn't corrupt them anymore?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "Your \"no true Scotsman\" fallacy will not fly - sorry. A coalition of Republicans, independents, and former and current democrats elected Trump and Trump brought Musk along. We are going to give them at least a year before we are skeptical and threaten them with the 2nd amendment.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Pope4u",
                                    "body": "That wasn't the question asked.\n\n\nEvery president is elected with a body of supporters, but even supporters believe in oversight, preventing conflicts of it interest, the possibility of self-dealing. There are lots of examples of Trump using his position to enrich himself and his family (e.g. the $2B that Jared got from the Saudis or the Trump meme coin). So how can you be so confident that he's uncorruptible?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": ">That wasn't the question asked.\n\nYou tried a shaming fallacy and it did not work.\n\n>but even supporters believe in oversight,\n\nWhere was the oversight for Biden. He was clearly mentally not there. Who was being \"Biden\" and making decisions?  You cannot have it both ways. \n\n>There are lots of examples of Trump using his position to enrich himself and his family (e.g. the $2B that Jared got from the Saudis or the Trump meme coin).\n\nI swear to God the hypocrisy of this statement astounds me. Biden, Pelosi, Obama, Clinton all left office with millions. You cannot have it both ways.\n\n>So how can you be so confident that he's uncorruptible?\n\nC'mon man.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Pope4u",
                                                    "body": "> You tried a shaming fallacy and it did not work.\n\nI don't understand. Who did I attempt to shame? My question had nothing to do with shame, only with trust.\n\n> Where was the oversight for Biden. \n\nThe purpose of oversight is to prevent illegal and/or immoral actions. I understand that you have issues with Biden's decisions, as do I, but that should *increase* your desire for presidential oversight, since there are obviously so many ways that power can be used.\n\n> He was clearly mentally not there. Who was being \"Biden\" and making decisions? You cannot have it both ways. \n\nI don't see how that's relevant. *All* presidents make some decisions themselves and delegate others. We're talking about trust for the *office of the president*, which includes the president and those who work for him, e.g. Musk.\n\n> I swear to God the hypocrisy of this statement astounds me. Biden, Pelosi, Obama, Clinton all left office with millions. You cannot have it both ways.\n\nYou're engaging is needless tribalism. I don't support presidents making money, including those you named. I'm not having it both ways. I *am* saying, if you want to keep money out of politics, a good place to start is the obvious opportunities for self-dealing and corruption happening now, which (a) goes well beyond in size the mere millions made by those you listed, and (b) has the potential to negatively impact many Americans, for example by allowing Musk to disadvantage his competitors. If you oppose presidents profiting, why do you support it now?\n\nIn other words, it's not just making money, but how they make money. If a president gets a few million to speak at a fancy dinner, I don't really care. If a president gets a few billion to put a donor's competitor out of business, that's a big problem.\n\n>> So how can you be so confident that he's uncorruptible?\n\n> C'mon man.\n\nIt's a serious question, and I don't know how to interpret your response. Are you saying that you *know* Trump is corrupt but you're okay with it, because everyone is corrupt? Or are you saying that Trump *cannot* be corrupt?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": ">I don't understand. Who did I attempt to shame? My question had nothing to do with shame, only with trust.\n\nYou defended the shaming question by saying it was not answered.\n\n>The purpose of oversight is to prevent illegal and/or immoral actions.\n\nNo - that is the purpose of laws. The purpose of checks and balances is to prevent a monarchy. Oversight is not in the constitution.\n\n>I understand that you have issues with Biden's decisions, as do I, but that should increase your desire for presidential oversight, since there are obviously so many ways that power can be used.\n\nNo - it does not work that way. Biden set the new standard for presidential oversight which is none. You do not get to have no standards when your guy is in and then try to control with standards when their guy is in. \n\n> don't see how that's relevant. All presidents make some decisions themselves and delegate others. We're talking about trust for the office of the president, which includes the president and those who work for him, e.g. Musk.\n\nYour side trusted Biden and the nameless shadows being Biden but we should not trust Trump because he freaks you out. That is a you problem.\n\n>You're engaging is needless tribalism.\n\nWhat I am doing is not tribalism - it's accountability. It does not surprise me that you could not identify accountability.\n\n>I am saying, if you want to keep money out of politics, a good place to start is the obvious opportunities for self-dealing and corruption happening now\n\nCutting government is corruption? You are not making sense.\n\n>a good place to start is the obvious opportunities for self-dealing and corruption happening now\n\nWe have covered this. Please stop repeating yourself.\n\n>goes well beyond in size the mere millions made by those you listed\n\nLet me assure you that Trump is not in this for the money.\n\n>has the potential to negatively impact many Americans, for example by allowing Musk to disadvantage his competitors.\n\nThat is malarkey. That's right I said it. Musk has always released his patents to his Tesla competitors. He wants his competition to succeed right along with him.\n\n>If you oppose presidents profiting, why do you support it now?\n\nI do not share the lefts collective paranoia about Trump and Musk.\n\n>Are you saying that you know Trump is corrupt but you're okay with it, because everyone is corrupt? Or are you saying that Trump cannot be corrupt?\n\nI am saying that the idea of holding corruption accountable left the building when democrats elected Biden. You do not get to impose a double standard now.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Pope4u",
                                                                    "body": "> You defended the shaming question by saying it was not answered.\n\nWhat is \"the shaming question\"?\n\n>> The purpose of oversight is to prevent illegal and/or immoral actions.\n\n> No - that is the purpose of laws.\n\nThe laws need someone to enforce them, or else they are just paper. We have cops to enforce laws on civilians, and we have oversight to enforce laws on presidents. Unless of course the president fires the Inspectors General.\n\n>  The purpose of checks and balances is to prevent a monarchy. Oversight is not in the constitution.\n\nOversight is a consequence of checks-and-balances. Congress has a right to know that its money is being spent in accordance with law. That's why Congress can hold hearings on appointees, that's why they approve nominees, that's why they have Inspectors General. Without those tools, they would have no power to verify that the president is doing what he says he's doing.\n\n>  Biden set the new standard for presidential oversight which is none.\n\nI am not sure what you are referring to. Biden allowed the Inspectors General to do their job. Biden officials were regularly interrogated by Congressional bodies. Can you please explain what law Biden violated?\n\n> What I am doing is not tribalism - \n\nThe tribalism I was referring to was in response to your comment that \"I can't have it both ways,\" since you seemed to assume that I support official corruption, because I do not. \n\n> it's accountability. It does not surprise me that you could not identify accountability.\n\nAccountability is great. That's exactly what I want: the president should be accountable for his actions to the American people. The best way to ensure that happens is to prevent conflicts of interest in his administration. So I'm confused that you claim to support accountability but when given an opportunity to apply it, you reject it.\n\n> Cutting government is corruption? You are not making sense.\n\nPotentially, yes. For example, farmers, food manufacturers, and drug companies would love to have less regulation from the FDA. Wall street and big banks would love to have less oversight from the SEC. Factories would love to [get rid of OSHA](https://www.workerscompensation.com/daily-headlines/legislation-to-eliminate-osha-introduced-in-congress/). So, yes, getting rid of organizations that historically have protected Americans from big business would be a big boon to business, which is one reason why those businesses support political candidates who promise to cut regulation. Taking [millions of dollars](https://apnews.com/article/abc-trump-lawsuit-defamation-stephanopoulos-04aea8663310af39ae2a85f4c1a56d68) from a company in exchange for telling the SEC to allow their upcoming merger to go through is one clear example.\n\n> Let me assure you that Trump is not in this for the money.\n\nI understand that you believe it. If so, then, why did he create the Trumpcoin? Why did he release a brand of sneakers? What is the purpose of the Trump Media & Technology Group Corp (DJT)? What is your basis for this assumption?\n\n> That is malarkey. That's right I said it. Musk has always released his patents to his Tesla competitors. He wants his competition to succeed right along with him.\n\nIt's true that Musk's patents are available for use, with some caveats. However, this is not as [useful as you might think](https://www.vennershipley.com/insights-events/does-teslas-open-source-patent-philosophy-mean-they-are-free-to-use/), and it seems to be mostly a PR move. He has certainly acted aggressively against competitors in the past.\n\n>>   If you oppose presidents profiting, why do you support it now?\n\n> I do not share the lefts collective paranoia about Trump and Musk.\n\nYes, I see that. My question is *why*. You seem like a person very skeptical of unchecked power and big business, and Trump and Musk represent both. So why do they get a free pass?\n\n> I am saying that the idea of holding corruption accountable left the building when democrats elected Biden.\n\nStop me if I'm wrong, but this sounds like you support Trump's corruption, or at least are unwilling to prevent it.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": "> What is \"the shaming question\"?\n\nIt's the no true Republican would support Trump one.\n\n>The laws need someone to enforce them, or else they are just paper. We have cops to enforce laws on civilians, and we have oversight to enforce laws on presidents. Unless of course the president fires the Inspectors General.\n\nNice try. IGs have no authority over the president. The law that is over the president is the people with their vote and the military if the president does not respect the vote and there is impeachment and removal which the state governments no longer have a say in.\n\n>The tribalism I was referring to was in response to your comment that \"I can't have it both ways,\" since you seemed to assume that I support official corruption, because I do not. \n\nYou did not vote in Biden and then vote for Kamala when she became nominee sans vote. Did you call for Biden to be removed or to reveal who was running the government? I cannot find that in your comment history.\n\nI repeat. You cannot have a double standard about corruption or competence.\n\n>That's exactly what I want: the president should be accountable for his actions to the American people.\n\nImpeachment and removal. The vote and a new constitution are the only reprieve from a bad president. \n\n>Accountability is great. That's exactly what I want: the president should be accountable for his actions to the American people. The best way to ensure that happens is to prevent conflicts of interest in his administration. So I'm confused that you claim to support accountability but when given an opportunity to apply it, you reject it.\n\nAre you talking cocaine in the White House accountability or something more official.\n\n>Potentially, yes. For example, farmers, food manufacturers, and drug companies would love to have less regulation from the FDA.\n\nAnd they should. When they directly and intentionally harm a specific human the decision makers of the company should all be arrested, convicted and go to max security prison. That would stop all the nonsense - regulation is not at all accountability. \n\n>Biden allowed the Inspectors General to do their job. Biden officials were regularly interrogated by Congressional bodies. Can you please explain what law Biden violated?\n\nBiden was not there in any kind of capacity to allow. Fraud is a crime and a lot of people in that Biden White House  should go to prison for fraud and endangerment.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Pope4u",
                                                                                    "body": ">> What is \"the shaming question\"?\n\n> It's the no true Republican would support Trump one.\n\nIf you're referring to [this question](https://old.reddit.com/r/AskTrumpSupporters/comments/1iklpmg/do_you_think_elon_musk_has_a_conflict_of/mbpbtba/), I think you're misinterpreting the question. That comment doesn't use the word \"shame\" or the word \"Republican.\" They just pointed out that the same people who a few years ago seemed very afraid of massive centralized governmental power are now no longer afraid of it. They asked what could explain such a change in position. I think it's a resonable question. What's your objection?\n\n> Nice try. IGs have no authority over the president.\n\nOf couse they don't have authority over the president. What IGs do is to investigate and report to Congress. The intent is that if there is fraud, abuse, or inefficiency, Congress can find out and potentially restrict funds for departments or programs that are not performing well. As you know, the Constitution grants the power of funding exclusively to Congress. So what is the purpose of firing IGs, except to hide fraud, abuse, and inefficiency?\n\n> Did you call for Biden to be removed or to reveal who was running the government?\n\nLike I said before, all presidents delegate authority. For example, Trump has delegated the takeover of the Treasury computer to Musk. Do you think Trump knows what Musk is doing on a day-to-day basis? At his recent press conference he seemed to not have a clue. So how is it different when Trump delegates to his subordinates versus when Biden does the same?\n\n>  You cannot have a double standard about corruption or competence.\n\nWhat double standard are you accusing me of? I oppose corruption in all its forms. You haven't told me a single example of Biden's alleged corruption.\n\n> Impeachment and removal. The vote and a new constitution are the only reprieve from a bad president. \n\nYes and no. Removal is one form of accountability. As I side, though, Congress provides accountability because they are responsible for the money. If Congress disapproves of the execute branch's use of money, they can take it back. Obstructing or circumventing that power of Congress is unconsitutional and violates the principle of checks and balances.\n\n> Are you talking cocaine in the White House accountability or something more official.\n\nI don't know what you're talking about.\n\n> And they should. When they directly and intentionally harm a specific human the decision makers of the company should all be arrested, convicted and go to max security prison. That would stop all the nonsense - regulation is not at all accountability. \n\nWhat do you mean by \"direct\"? If a food manufacturer includes an ingredient that increases the risk of cancer of 10% in those who consume it, who is going to stop them? Who is even going to find out? Government regulations protect the consumer by investigating and regulating these things. So an obvious way to be corrupt is to reduce regulations, stop investigations, and take a nice kickback from the manufacturer. Can you see, then, how reducing the size of the government can lead directly to corruption?\n\n> Biden was not there in any kind of capacity to allow.\n\nBiden was president for four years during which time the IGs continued to operate as normally. Whether Biden directly allowed them or whether he delegated that authority to a subordinate is not relevant. That follows the normal rule of Congressional oversight. Why should Trump be exempt from IG oversight when Biden was not?\n\n>  Fraud is a crime and a lot of people in that Biden White House should go to prison for fraud and endangerment.\n\nI will again ask you for a specific instance of fraud from the Biden White House.\n\n\n>> If so, then, why did he create the Trumpcoin? Why did he release a brand of sneakers? What is the purpose of the Trump Media & Technology Group Corp (DJT)? \n\n> None of that is corruption or incosistent with Trump before politics. \n\nYou said that Trump is not in it for the money. But yet he continues to enter several scammy, manipulative money-making ventures. So he certainly seems like a guy who is motivated by making money. So I'll ask again; why are you so sure that Trump is not in it for the money? Do you think he created Trumpcoin just to improve people's lives?\n\n> The left did not hate Trump beyond the standard wealth envy bullshit until he won the presidency. \n\nThe left, I think it's fair to say, hated Trump since he falsely claimed that Obama was born in Kenya, which was well before he became president. New Yorkers have hated him even longer than that, because of his abusive real estate scams. Of course, they hated him after he became president because the power that goes along with that allows him to damage many more people's lives. Same goes for Musk: he was fine as an eccentric inventor, but when he revealed himself to be a conspiracy-believing racist nutjob, people's opinion changed. None of that, however, explains why **you** trust Trump so much, despite all that he's done.\n\n> What makes you think either of them is getting a free pass? \n\nI've asked you several times why you think Trump evading Congressional checks and balances is okay, and each time your answer has basically been \"because I trust him.\" I call that giving him a free pass. If Biden was doing the stuff that Trump is now doing, I (and every Republican in the world) would say that the president is claiming unconsitutional power and that there needs to be limits in line with the checks-and-balances.\n\n> There is no corruption to support.\n\nThat's a bold assertion. Trump's attempt to illegally shut down Department of Education and USAID have been halted by courts. Musk, at Trump's behest, has been given access to sensitive records of nearly every citizen. There's no provable corruption, but there is definitely reason to be suspicious.\n\n> What would you have me do \n\nObviously **you** can't do anything. Neither can I. But it's a question of what you think should be done. I think Congress needs to assert itself and reclaim the power given to them in the Constitution. Trump is not a king, but he's acting like one. That bothers me, and it bothers anyone with an understanding of the Constitution. I'm curious why it doesn't bother you.\n\n> you will no longer govern in the shadows.\n\nWho is governing in the shadows? Courts? Congress? That's hardly the shadows. They are supposed to govern as two-third of the government, not as toadies to a king.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": ">I understand that you believe it. If so, then, why did he create the Trumpcoin? Why did he release a brand of sneakers? What is the purpose of the Trump Media & Technology Group Corp (DJT)? What is your basis for this assumption?\n\nNone of that is corruption or incosistent with Trump before politics. I reject the idea that politicians must forever reject business and subscribe to the mystery wealth that elected officials accumulate.\n\n>Yes, I see that. My question is why.\n\nBecause your distrust is unfounded. The left did not hate Trump beyond the standard wealth envy bullshit until he won the presidency. The left did not hate Musk besides the standard wealth envy bullshit until he bought twitter. It's all ridiculous.\n\n>You seem like a person very skeptical of unchecked power and big business, and Trump and Musk represent both. So why do they get a free pass?\n\nWhat makes you think either of them is getting a free pass? Those two are doing exactly what we elected Trump to do. I am not fake mad about their wealth. I cannot undo the election. What are you expecting to see?\n\n>but this sounds like you support Trump's corruption\n\nThere is no corruption to support.\n\n>or at least are unwilling to prevent it.\n\nWhat would you have me do because I promise you whatever it is will not prevent what is happening or what is going to happen. Trump is going to do a thousand things that will stupidly result in a thousand knee-jerk lawsuits and in ten to twenty years how many Roe v. Wade decisions will you be facing? You may save some of government but after your predictable lawsuits government will not be the same and you will no longer govern in the shadows.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Pope4u",
                                                                                    "body": ">> What is \"the shaming question\"?\n\n> It's the no true Republican would support Trump one.\n\nIf you're referring to [this question](https://old.reddit.com/r/AskTrumpSupporters/comments/1iklpmg/do_you_think_elon_musk_has_a_conflict_of/mbpbtba/), I think you're misinterpreting the question. That comment doesn't use the word \"shame\" or the word \"Republican.\" They just pointed out that the same people who a few years ago seemed very afraid of massive centralized governmental power are now no longer afraid of it. They asked what could explain such a change in position. I think it's a resonable question. What's your objection?\n\n> Nice try. IGs have no authority over the president.\n\nOf couse they don't have authority over the president. What IGs do is to investigate and report to Congress. The intent is that if there is fraud, abuse, or inefficiency, Congress can find out and potentially restrict funds for departments or programs that are not performing well. As you know, the Constitution grants the power of funding exclusively to Congress. So what is the purpose of firing IGs, except to hide fraud, abuse, and inefficiency?\n\n> Did you call for Biden to be removed or to reveal who was running the government?\n\nLike I said before, all presidents delegate authority. For example, Trump has delegated the takeover of the Treasury computer to Musk. Do you think Trump knows what Musk is doing on a day-to-day basis? At his recent press conference he seemed to not have a clue. So how is it different when Trump delegates to his subordinates versus when Biden does the same?\n\n>  You cannot have a double standard about corruption or competence.\n\nWhat double standard are you accusing me of? I oppose corruption in all its forms. You haven't told me a single example of Biden's alleged corruption.\n\n> Impeachment and removal. The vote and a new constitution are the only reprieve from a bad president. \n\nYes and no. Removal is one form of accountability. As I side, though, Congress provides accountability because they are responsible for the money. If Congress disapproves of the execute branch's use of money, they can take it back. Obstructing or circumventing that power of Congress is unconsitutional and violates the principle of checks and balances.\n\n> Are you talking cocaine in the White House accountability or something more official.\n\nI don't know what you're talking about.\n\n> And they should. When they directly and intentionally harm a specific human the decision makers of the company should all be arrested, convicted and go to max security prison. That would stop all the nonsense - regulation is not at all accountability. \n\nWhat do you mean by \"direct\"? If a food manufacturer includes an ingredient that increases the risk of cancer of 10% in those who consume it, who is going to stop them? Who is even going to find out? Government regulations protect the consumer by investigating and regulating these things. So an obvious way to be corrupt is to reduce regulations, stop investigations, and take a nice kickback from the manufacturer. Can you see, then, how reducing the size of the government can lead directly to corruption?\n\n> Biden was not there in any kind of capacity to allow.\n\nBiden was president for four years during which time the IGs continued to operate as normally. Whether Biden directly allowed them or whether he delegated that authority to a subordinate is not relevant. That follows the normal rule of Congressional oversight. Why should Trump be exempt from IG oversight when Biden was not?\n\n>  Fraud is a crime and a lot of people in that Biden White House should go to prison for fraud and endangerment.\n\nI will again ask you for a specific instance of fraud from the Biden White House.\n\n\n>> If so, then, why did he create the Trumpcoin? Why did he release a brand of sneakers? What is the purpose of the Trump Media & Technology Group Corp (DJT)? \n\n> None of that is corruption or incosistent with Trump before politics. \n\nYou said that Trump is not in it for the money. But yet he continues to enter several scammy, manipulative money-making ventures. So he certainly seems like a guy who is motivated by making money. So I'll ask again; why are you so sure that Trump is not in it for the money? Do you think he created Trumpcoin just to improve people's lives?\n\n> The left did not hate Trump beyond the standard wealth envy bullshit until he won the presidency. \n\nThe left, I think it's fair to say, hated Trump since he falsely claimed that Obama was born in Kenya, which was well before he became president. New Yorkers have hated him even longer than that, because of his abusive real estate scams. Of course, they hated him after he became president because the power that goes along with that allows him to damage many more people's lives. Same goes for Musk: he was fine as an eccentric inventor, but when he revealed himself to be a conspiracy-believing racist nutjob, people's opinion changed. None of that, however, explains why **you** trust Trump so much, despite all that he's done.\n\n> What makes you think either of them is getting a free pass? \n\nI've asked you several times why you think Trump evading Congressional checks and balances is okay, and each time your answer has basically been \"because I trust him.\" I call that giving him a free pass. If Biden was doing the stuff that Trump is now doing, I (and every Republican in the world) would say that the president is claiming unconsitutional power and that there needs to be limits in line with the checks-and-balances.\n\n> There is no corruption to support.\n\nThat's a bold assertion. Trump's attempt to illegally shut down Department of Education and USAID have been halted by courts. Musk, at Trump's behest, has been given access to sensitive records of nearly every citizen. There's no provable corruption, but there is definitely reason to be suspicious.\n\n> What would you have me do \n\nObviously **you** can't do anything. Neither can I. But it's a question of what you think should be done. I think Congress needs to assert itself and reclaim the power given to them in the Constitution. Trump is not a king, but he's acting like one. That bothers me, and it bothers anyone with an understanding of the Constitution. I'm curious why it doesn't bother you.\n\n> you will no longer govern in the shadows.\n\nWho is governing in the shadows? Courts? Congress? That's hardly the shadows. They are supposed to govern as two-third of the government, not as toadies to a king.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mrhymer",
                                                                                            "body": "> I think you're misinterpreting the question.\n\nI am certain I am not. A no true Scotsman fallacy is used to shame people into behaving like a true Scotsman as defined by the fallacy perpetrator. Please do try to keep up.\n\n>So what is the purpose of firing IGs, except to hide fraud, abuse, and inefficiency?\n\nOne reason to fire the IGs is that they were partisan shills pushing now banned agendas. \n\n>Like I said before, all presidents delegate authority.\n\nNo - delegation requires stable decision making. Touting of Biden's  competence was a fraud. Are you sure you want to keep doing it.\n\n>I will again ask you for a specific instance of fraud from the Biden White House.\n\nhttps://www.youtube.com/watch?v=4aQj70AtxBg\n\n>I've asked you several times why you think Trump evading Congressional checks and balances is okay\n\nBecause congress is useless and the your precious IGs were not checking for or balancing good government.\n\n>You said that Trump is not in it for the money. But yet he continues to enter several scammy, manipulative money-making ventures.\n\nWhat is the point you are trying to make with this. Are you Michael Mooreing this? Here is a thing and here is another thing - look causation. Trump is fine and I am not mad about Trump being like Trump has always been.\n\n>That's a bold assertion. Trump's attempt to illegally shut down Department of Education and USAID have been halted by courts. \n\nYes - just like the challenges to Roe v. Wade. You really do not see the long term potential ramifications of these lawsuits - do you?\n\n>Musk, at Trump's behest, has been given access to sensitive records of nearly every citizen.\n\nYou mean like Lois Lerner and 2 million nameless faceless little corruptlings. I trust Musk. I no longer trust the permanent employees of government.\n\n>The left, I think it's fair to say, hated Trump since he falsely claimed that Obama was born in Kenya, which was well before he became president.\n\nHe was disdained but not rabidly hated. \n\n>Congress provides accountability because they are responsible for the money.\n\nGive one example of that in the Biden government.\n\n>New Yorkers have hated him even longer than that, because of his abusive real estate scams.\n\nNew Yorkers gave him the Ellis Island award and many others.\n\n>Obviously you can't do anything. Neither can I.\n\nThen why do you keep calling for it?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Pope4u",
                                                                                                    "body": ">> I think you're misinterpreting the question.\n\n> I am certain I am not. A no true Scotsman fallacy is used to shame people into behaving like a true Scotsman as defined by the fallacy perpetrator. \n\nThe fact that you're taking a reasonable question of the type \"Why did these people seemingly change their minds in such a diametrically opposite way\" as an attempt to shame you says more about you than about the question. In particular, you have repeatedly demanded \"you can't have it both ways\" and \"no double standards,\" but this question is precisely about the application of a double standard: that you judge the rules for a Democratic president differently than those of a Republican. Can you see why the commenter raised this question? Don't you think that you yourself are applying a double standard and \"having it both ways\"?\n\nIn reality, the [No True Scotsman Fallacy](https://en.wikipedia.org/wiki/No_true_Scotsman) involves defending a generalization by dismissing counter-examples as irrelevant. It has nothing to do with shame.\n\n> Please do try to keep up.\n\nI think you should stop using these snide comments to denigrate my questions. It makes you look petty.\n\n> One reason to fire the IGs is that they were partisan shills pushing now banned agendas. \n\nIGs don't have the capacity to push agendas, they can only report to Congress. Do you have any evidence to support your conclusion that the IGs were partisan? As far as I know, Trump did not even attempt to justify their firing.\n\n>> I will again ask you for a specific instance of fraud from the Biden White House.\n\n> https://www.youtube.com/watch?v=4aQj70AtxBg\n\nIf those claims are true, that's certainly deceptive, but that does not rise to the legal standard of fraud: \"In law, fraud is intentional deception to deprive a victim of a legal right or to gain from a victim unlawfully or unfairly.\" A president being old is not fraud, no matter how much you disagree with it.\n\nTrump also has shown signs of mental decline. [He forgot how to pronounce \"Yosemite\"](https://www.youtube.com/watch?v=kwcploTZbKA), he repeats himself, [he shows up to a town hall and just dances](https://as.cornell.edu/news/trumps-abrupt-decision-play-dj-sign-accelerating-cognitive-decline-says-cornell-expert). What is the difference between Biden's alleged decline and Trump's?\n\n> Because congress is useless and the your precious IGs were not checking for or balancing good government.\n\nThe Republican majority in Congress refuses to take action against Trump for obvious reasons. I would certainly prefer to have a more aggressive Congress, and if there was a Democrat majority I think they would do that. What evidence do you have that the IGs were not doing their job?\n\n> What is the point you are trying to make with this. .... Trump is fine and I am not mad about Trump being like Trump has always been.\n\nI think my line of questioning has been pretty clear all along: there is lots of evidence that Trump is motivated by greed and power, and at every turn you are willing to ignore that evidence based on an unshakeable *personal* trust in him. Would you agree that's a fair characterisation?\n\n> just like the challenges to Roe v. Wade. You really do not see the long term potential ramifications of these lawsuits - do you?\n\nThe ramifactions is that the partisan Republican SCOTUS may use them to further erode the rule of law by overturning long-held rulings. Is that what you mean?\n\n> You mean like Lois Lerner and 2 million nameless faceless little corruptlings. I trust Musk. I no longer trust the permanent employees of government.\n\nNo one else is history has ever had the level of direct access that Musk has now. Why do you trust Musk? Did you trust him before he bought Twitter and became a Republican mouthpiece? Do you agree with his comments that Jews [hate white people](https://www.theguardian.com/technology/2023/nov/16/elon-musk-antisemitic-tweet-adl)?\n\n>> Congress provides accountability because they are responsible for the money.\n\n> Give one example of that in the Biden government.\n\nThere were no accusations of fraud or abuse during the Biden presidency because Biden obeys the law. There were numerous attempts of Congress exercising their authority to reject a bill supported by the president, for example the [bipartisan immigration reform bill](https://www.brookings.edu/articles/the-collapse-of-bipartisan-immigration-reform-a-guide-for-the-perplexed/).\n\n> New Yorkers gave him the Ellis Island award and many others.\n\nThe \"Ellis Island Honors Society\" gave it to him, for his work on real estate development projects. That is not a governmental organization or reflective of New Yorkers as a whole. As you can imagine, this award does not reflect a widely-held opinion among New Yorkers.\n\n>> Obviously you can't do anything. Neither can I.\n\n> Then why do you keep calling for it?\n\nWhy do I keep calling for what? I haven't asked you to do anything. This is /r/AskTrumpSupporters and I am asking your opinions.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "Pope4u",
                                                                                                    "body": "Hey, did you get scared and run away? I was enjoying our conversation.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bloodhound83",
                                    "body": "So it's a free pass no matter what they do for the first year?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "No - it's not a free pass but you must understand that they are doing exactly what we elected them to do. We want them to go farther than they have gone in finding the corruption and ending the waste.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bloodhound83",
                                                    "body": "Would you approve of illegal/unconstitutional actions to reach that goal?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "Let's hope it does not come to that.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "bloodhound83",
                                                                    "body": "Does that mean you wouldn't approve of such actions? \n\nHave all actions and executive orders so far been legal and conditional?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": ">Does that mean you wouldn't approve of such actions?\n\nI do not feel comfortable speaking of this.",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BloodhoundGang",
                                                                                    "body": "Why not?",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mrhymer",
                                                                                            "body": "Because USaid has now been proven to be a corrupt partisan secret Democrat activist organization. Any \"investigation\" is because the censoring of Twitter was taken away from the left.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Pope4u",
                                                    "body": "But what if they are *contributing* to the corruption?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "We will take our chances.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Pope4u",
                                                                    "body": "Do you think it's best to leave the safe execution of the powerful job in the world to *chance*?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": "Were you in a coma during the Biden administration?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Pope4u",
                                                                                    "body": "No, I wasn't. I recall that under Biden, the three branches operated as they were supposed to. Congress provided oversight. The Inspector Generals were not fired. Uncleared individuals were not given unlimited access to sensitive treasury data. The government functioned imperfectly, but more or less as the Founders intended.\n\nThe Founders created the checks-and-balances system to ensure that no single branch accumulated too much power and put the country in the precarious position of having to trust its future to *chance*, rather than the cooperation of many.\n\nDo you agree with the Founders' intent?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mrhymer",
                                                                                            "body": ">Do you agree with the Founders' intent?\n\nThe founders intent was the united state governments  of America. We steered away from the founders intent in 1913 with the passing of the 17th amendment and immediately. Federal spending in 1913 was $715 million dollars. It was 2.5% of GDP. When the states were removed from the process we had two world wars and a hundred billion dollar budget in 52 years.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Pope4u",
                                                                                                    "body": "Changing the way Congress is elected, per the 17th amendment, does nothing to weaken the idea of three coequal branches of government. Nor does is it opposed to the checks-and-balances system. How is the 17th amendment relevant to this conversation?\n\nTwo world wars were started in Europe. Are you proposing that the 17th amendment led to both world wars?\n\nYou also failed to answer my actual question. Do you **you** agree with the founder's intent of three branches of government that check each others' power, or do you **you** believe that the office of the presidency should have unchecked power?",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nononotes",
                    "body": "How can you trust what musk says? There's no oversight. You know 49% isn't a mandate right?",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "j_la",
                    "body": "Does having a mandate authorize them to break the law or violate the constitution?",
                    "score": 22,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "Nobody has done that.",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "j_la",
                                    "body": "Wasn’t the law broken when IGs were fired without notifying Congress? Or isn’t it unconstitutional to unilaterally shutter a department that has been created and funded by Congress?",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": ">Wasn’t the law broken when IGs were fired without notifying Congress?\n\nNo\n\n>Or isn’t it unconstitutional to unilaterally shutter a department that has been created and funded by Congress?\n\nNo",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "j_la",
                                                    "body": "What leads you to say “no”? The law governing IGs requires 30-days notice to Congress. Where do you see otherwise? And if Congress instructs the executive to create and fund a department or program, isn’t that law? What leads you to say otherwise?",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "> What leads you to say “no”? The law governing IGs requires 30-days notice to Congress.\n\nYes - but the precedent is set that some laws are enforced and some are not. Also congress does not have the authority to usurp the presidents judgement on matters of national security.\n\n>And if Congress instructs the executive to create and fund a department or program, isn’t that law?\n\nNot unless that department is created as an enumerated power in the constitution. Anything beyond defense, state, and the post office is not a power of the executive in the constitution.",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "j_la",
                                                                    "body": "What do IGs have to do with national security?\n\nIf Congress passes laws to check and balance the power of the executive, and the executive can just ignore and/or refuse to enforce laws that checks its power, isn’t that fundamentally contrary to our system and therefore a constitutional crisis?",
                                                                    "score": 14,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": ">What do IGs have to do with national security?\n\nHow can you not know what IGs have to do with national security?>If Congress passes laws to check and balance the power of the executive, and the executive can just ignore and/or refuse to enforce laws that checks its power\n\nYou just described the  twentieth and twenty-first centuries to this point. We could not  control and restrain the government by laws. Now we are trying to control and restrain government by money. Pray that it works because the only thing left to try will be pretty gruesome.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "j_la",
                                                                                    "body": "IGs oversee departments to guard against fraud and abuse…which I suppose is a kind of national security, but maybe only in the loosest possible definition. Is an IG overseeing, say, the department of veterans affairs in a national security position?\n\nSo are you saying the executive shouldn’t have restraints on its power? I’m not sure I understand your point. While all three branches have their powers, I think it is fair to say that the founders wanted Congress to be the strongest. Why wouldn’t we want Congress to be able to instruct the executive through law? Without that it kind of seems like the president is just a king and we did away with kings a long time ago.",
                                                                                    "score": 10,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mrhymer",
                                                                                            "body": "> IGs oversee departments to guard against fraud and abuse…which I suppose is a kind of national security\n\nYou bet it is. Should IGs be partisan activists - no they should not. \n\n>Is an IG overseeing, say, the department of veterans affairs in a national security position?\n\nIn the most crucial way. If veterans are treated badly it will hurt recruitment - National Security.\n\n>So are you saying the executive shouldn’t have restraints on its power?\n\nThe executive is in place to have the power to act quickly day to day. Congress is place to act more deliberately and slowly and create the permanent law of the land. The president sends troops to a situation and the congress responds with a declaration of war or not when all the facts are in. Congress is not doing any of that anymore but that is beside the point. \n\n>While all three branches have their powers\n\nWe have talked about the other two so the checks and balance role of the supreme court is to determine if congress passes a law that is contrary to the constitution. The court should not interfere with the president issueing EOs that internally direct the executive. Finding out where the money is being spent is something all presidents should have been doing. Cutting government is unprecedented but now is the time to set that precedent.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "j_la",
                                                                                                    "body": "By your definition, anything could be national security. Doesn’t that ultimately give the presidency ultimate and unilateral power?\n\nIf Congress acts slowly and passes laws, but the executive ignores and overrules them (outside of the veto power), does it have any power at all? How can any law be “permanent” if the president just decides it is a national security issue and ignores the law?",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "mrhymer",
                                                                                                            "body": "> By your definition, anything could be national security.\n\nDing ding ding - give that man a prize.\n\n>Doesn’t that ultimately give the presidency ultimate and unilateral power?\n\nFor the limited powers that the constitution and congress have granted him. Cleaning house in the executive is defenitely a presidential superpower.\n\n>If Congress acts slowly and passes laws, but the executive ignores and overrules them (outside of the veto power), does it have any power at all?\n\nThe executive executes the congressional laws of the land as long as those laws do not impede the executives ability to affect national security and of course as long as there is not a double standard of accountability. \n\n>How can any law be “permanent” if the president just decides it is a national security issue and ignores the law?\n\nThis president would not ignore a law that closed the border and built a wall at the border. I could give you a long list of laws that will not be ignored if congress decides to risk their political future and do something. Laws that end laws, regulation, and departments will be wholeheartedly enforced.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "j_la",
                                                                                                                    "body": "So Congress only has power if the president likes what they’re doing? That doesn’t seem like a particularly balanced government. It sounds more like an autocracy with the artificial window dressing of democracy. Do you think this is what the founders intended when they wrote the constitution?\n\nWhat’s the point in having a congress if they just exist to affirm the will of the president?\n\nHypothetically, could a president ignore impeachment because he deems it to be a threat to “national security”?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "mrhymer",
                                                                                                                            "body": ">So Congress only has power if the president likes what they’re doing?\n\nNo - congress and the president only have just powers that are granted by a consensus of the people. Those powers granted by the people are written in a constitution alongside many restrictions of government. \n\n>That doesn’t seem like a particularly balanced government. It sounds more like an autocracy with the artificial window dressing of democracy.\n\nThe unbalancing came in 1913.\n\n>Do you think this is what the founders intended when they wrote the constitution?\n\nNo - the founders intended for the states to play a big role in the federal government in the UNITED STATES. The 17th amendment passed in 1913 destroyed that important check on power. \n\n>What’s the point in having a congress if they just exist to affirm the will of the president?\n\nThe point of the congress was to have the people's representatives and the state government's representative work together to create the laws of the land.\n\n>Hypothetically, could a president ignore impeachment because he deems it to be a threat to “national security”?\n\nWe will see.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ilosesoothersmaywin",
                    "body": "Why do you believe that Trump and Musk have a mandate from the people?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "They have the mandate from the election whether you are a mandate denier or not.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Ilosesoothersmaywin",
                                    "body": "So in your eyes a simple victory in an election is what gives the president a mandate from the people?\n\nLet's consider for a moment that we don't really have a solid set of criteria as to when a mandate is given.  So saying someone is a 'mandate denier' doesn't mean all that much since we might vary well disagree on what the definition of it is.\n\nIf you're able and willing, I'd be curious to hear what you define the setting of a mandate is.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ilosesoothersmaywin",
                                                    "body": "How do I stop being an \"ugly mandate denier\" when I don't when a mandate is given or not?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "The same way we had to stop being an election denier without national voter ID.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Ilosesoothersmaywin",
                                                                    "body": "See my brain is broken.  It just doesn't work with out a good mug of coffee and a definition.\n\nSo what is the set of circumstances needed for a mandate from the people to be acquired by a president?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": "\n\nIf lawfare is used against the candidate, his mugshot becomes a rallying symbol, he is convicted of a crime, he is shot and keeps running, and wins the election. \n\nI promise you if all of that happens again to another candidate - mandate.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Ilosesoothersmaywin",
                                                                                    "body": "This can't be the definition of what is needed to acquire a mandate though right?\n\nIf so then we've had no other president in history whose ever had a mandate.  Maybe no other leader of any country ever.\n\nIs there a more universal way to acquire a mandate from the people?",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mrhymer",
                                                                                            "body": ">This can't be the definition of what is needed to acquire a mandate though right?\n\nIt can be.\n\n>If so then we've had no other president in history whose ever had a mandate. Maybe no other leader of any country ever.\n\nWhat makes you think that mandates are one size fits all.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Ilosesoothersmaywin",
                                                                                                    "body": ">What makes you think that mandates are one size fits all.\n\nSo there are multiple ways to acquire a mandate from the people?",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "blahblahthrowawa",
                                    "body": "What do you mean?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "There was an election in the US. Trump won overwhelmingly. There is a mandate on that win. It's a mandate that you lot will spend forever denying.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 14,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": 8,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Windowpain43",
                                                                    "body": "Why do you consider a 1.5% popular vote margin a mandate?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": "Why do you deny that is a mandate?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Windowpain43",
                                                                                    "body": "It's not a large margin. Why do you think it is a mandate?\n\nFrankly, the idea of a mandate is silly to me. Regardless of the margin, the winner of the presidency is the president and they each have the same powers. Winning more votes doesn't mean someone has more of a right to do something. Just be president and try to get things done. If a president needs to bring up their \"mandate\" that feels weak and insecure. Get things done and convince people of them based on their merit.",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TheScumAlsoRises",
                                    "body": "Did you see Joe Biden as having a mandate from the election and the people after he won in 2020?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Windowpain43",
                    "body": "What mandate?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OGstupiddude",
                    "body": "Do you think that conservative outrage during the last admin over Biden firing the Ukraine prosecutor was also petty and contrary to the mandate of the people?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": ">Do you think that conservative outrage during the last admin over Biden firing the Ukraine prosecutor was also petty and contrary to the mandate of the people?\n\nYes - I do. And the fact that the outrage and calls for oversight did nothing in the Obama administration and the Biden administration has set the precedent.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "heroicslug",
            "body": "Nope, because the USAID has zero investigative authority, outside of investigating themselves. From the article:\n\n\n“USAID’s inspector general was in the process of investigating its own public-private partnership between Musk’s Starlink and the Ukrainian government at the time that the billionaire’s DOGE crippled the agency.”\n\n\nMaybe USAID was doing something wrong, maybe it wasn't. It doesn't matter, because it's gone now. \n\n\nEven if they were somehow investigating starlink, which they weren't, and Musk shut them down...\n\n\nIt would be like eating a bag of Jelly Bellies which had exactly one grass flavored Bernie Bott's Every Flavor Bean. It's 99% delicious, and yeah there's one in there that wasn't great. \n\n\nAgain, however. That's not the case. The agency was investigating itself. Which is pretty stupid honestly, but I wouldn't expect anything else from the government.",
            "score": 0,
            "replies": []
        },
        {
            "author": "StockFaucet",
            "body": "Great question!!! He gave those devices to them!! How is that a conflict exactly?",
            "score": -2,
            "replies": [
                {
                    "author": "Hi_MyName-Is",
                    "body": "Is potentially giving Russia, Ukrainian intelligence that he collects from Star link not a conflict?\n\nhttps://apnews.com/article/musk-putin-x-trump-tesla-election-russia-9cecb7cb0f23ccce49336771280ae179\n\nhttps://www.theguardian.com/technology/2024/oct/25/elon-musk-has-been-in-regular-contact-with-putin-for-two-years-say-reports\n\nhttps://apnews.com/article/musk-putin-x-trump-tesla-election-russia-9cecb7cb0f23ccce49336771280ae179",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "nope. USAID is not an investigative agency so they had no reason to investigate anything ever.",
            "score": -12,
            "replies": [
                {
                    "author": "Phedericus",
                    "body": "isn't this the independent watchdogs investigating?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "sielingfan",
                            "body": "It's USAID IG, investigating USAID and not SpaceX. It's literally *nothing.*",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Phedericus",
                                    "body": "but that wasn't your argument, your argument was that it couldn't possibly be an investigation because USAID has no investigation power.\n\naren't they investigating the relationship between USAID and Starlink in Ukraine?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "sielingfan",
                                            "body": "1. That was the other guy, not me.\n\n2. No, they aren't.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "I have no idea. That wouldn't be USAID then if it was.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pimmen89",
                    "body": "But they were doing internal investigations of aid that was used to buy Starlink terminals, aid that Elon Musk profited from. I’m sorry if it sounded like they were investigating Starlink itself, I can edit the main post to make it clearer.\n\nDoes that make it clearer about if Elon Musk defunding them is a conflict of interests?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "sielingfan",
                            "body": ">But they were doing internal investigations of aid that was used to buy Starlink terminals, aid that Elon Musk profited from.\n\nFalse. They were auditing internal oversight procedures of USAID’s interactions with a foreign government,  regarding Starlink terminals [bought by Poland and operated at a huge loss by Starlink.](https://www.newsweek.com/starlink-systems-ukraine-funded-poland-claims-minister-1967727). USAID did not purchase the terminals,  didn't fund the terminals, and the investigation could not have produced any impact on SpaceX profits.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Specific-Wolverine75",
                    "body": "What about him saying all waste but excluding that they pay millions for teslas?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ocean_Soapian",
            "body": "No.",
            "score": -3,
            "replies": []
        },
        {
            "author": "dethswatch",
            "body": "He said he'd recuse himself in the event of conflicts.\n\nSo you either accept that or continue to more unhappy than you need to be.\n\nAlso- if you think he's going to change the data in the system and grant himself more money... well, you might be irretrievable.",
            "score": -8,
            "replies": [
                {
                    "author": "dash_trash",
                    "body": ">He said he'd recuse himself in the event of conflicts.\n\nAre you comfortable just taking him at his word? How is this statement worth anything in the absence of any shred of accountability?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "dethswatch",
                            "body": ">Are you comfortable just taking him at his word? \n\nwhat else do we have?\n\nWhat actually do you suspect he can do without breaking the law?",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "dash_trash",
                                    "body": ">what else do we have?\n\nNothing, that's the whole point. My question is whether or not that is enough for you?\n>\n>What actually do you suspect he can do without breaking the law?\n\nI am not convinced he feels bound by the law. Why do you think \"breaking the law\" would still be a barrier in light of the fact that the people/department heads/IG's who would be immediately responsible for holding him to account have been fired, forced to resign, or placed on leave?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "dethswatch",
                                            "body": "\"I'm the richest person in the world- I'll just write myself a load of checks.\"\n\nIf you feel he's capable of that, then there's really nothing I can do to persuade you otherwise.\n\nI urge you to get very depressed about it all.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "dash_trash",
                                                    "body": ">\"I'm the richest person in the world- I'll just write myself a load of checks.\"\n\nI didn't suggest that his sole motivation is further enriching himself (although I can't see why that wouldn't be part of it) - I have no doubt that his motivations, whatever they are, are self-serving in one way or another but I'm much more interested in whether you think he is acting in YOUR best interest? And how you would know, given his utter lack of accountability to the public?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "dethswatch",
                                                            "body": ">he is acting in YOUR best interest?\n\nSounds like the only peoples' interests he's not acting in is those in sri lanka who are unhappy about binary-gender coded language, and similar. \n\nIt'd be pretty smart for the left to admit 'transgender recognition' in Guatemala probably don't need me to work part of the year to fund. Or that maybe Egypt can fund its own tourist advertisements.\n\nYou keep saying 'unaccountable' as if there's no one to stop him from breaking the law, as if the administration isn't reviewing what he's doing, as if the media isn't telling us what's happening, as if this would be any different if it wasn't elon.\n\nIf this was some random lawyer, instead of elon, there'd be very little story here.\n\nThe left keeps pumping elon as the antichrist. Ok- but it's not really very effective because it's not persuasive, the left doesn't like him (any more- they used to LOVE his electric cars), and the not left think he's fine.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheGlenrothes",
                    "body": "Do you really think he would actually recuse himself if there is a conflict of interest? All evidence points to him being only interested in personal gain no matter how much it hurts other people. How can you possibly consider him to be trustworthy?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "dethswatch",
                            "body": "well, you're mind-reading and inferring intent.\n\nMaybe we should wait until he does something illegal and use the courts to take care of it.\n\nUnless you're of the opinion that he'd be pardoned. Well, this is a deep rat hole of negative thought, isn't it?",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}