{
    "title": "What do you think of Trump’s February 18th executive order?",
    "author": "SpatuelaCat",
    "subreddit": "AskTrumpSupporters",
    "rank": 82,
    "score": 204,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 311,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1itbib6/what_do_you_think_of_trumps_february_18th/",
    "id": "1itbib6",
    "selftext": "Trump signed an executive order of February 18th which says “The President and the Attorney General (subject to the President’s supervision and control) will interpret the law for the executive branch” so there can be “a single President who is alone vested with ‘the executive Power” and responsibility to “take Care that the Laws be faithfully executed’”?\n\nHow do you feel about this?\n\nDo you agree that the President alone should have the power to decide what the President can or cannot do and what powers the presidency does or does not grant?\n\nhttps://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-reins-in-independent-agencies-to-restore-a-government-that-answers-to-the-american-people/",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DidiGreglorius",
            "body": "Your last question is a major, major misread of the EO. The EO asserts Trump’s control of the *Executive Branch*. There are three branches of government. The order in no way asserts that Trump alone decides what he can or can’t do, or what powers he has — it asserts his Constitutional authority to direct one of those three branches. \n\nOn what the order *actually says*, the Constitution is clear. The Executive Authority of the United States is vested in the President — nobody else. All corners of the Executive Branch must report up through politically accountable leadership, and ultimately the President, as prescribed by the Constitution. Federal Officials with discretionary authority are responsible for faithfully implementing the President’s policies for the Executive Branch, as communicated and directed through politically accountable leadership.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Ok_Motor_3069",
            "body": "Federal agencies being made more accountable to the electorate so they can’t work at cross purposes to the American people without consequences (to the President) at the ballot box - sounds awesome!!!!\n\nA modern version of “the buck stops here”. Great!!!!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "whateverisgoodmoney",
            "body": "This is exactly correct.\n\nThere is no 4th branch of government although we have become so used to the Legislature not doing their jobs that many people think there is. \n\nThe EO explicitly carves out an exception for the Federal Reserve, which, I think, is wise.\n\nThe Executive is not beholden to the Judiciary. It is beholden to the Legislative, whose remedy is impeachment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "p3ric0",
            "body": "I think it's ridiculous that an EO like this is even needed to reiterate preexisting notions. Similar to having to sign an EO stating the obvious: that there are only two genders. \n\nSad but necessary, I guess.",
            "score": 1,
            "replies": []
        },
        {
            "author": "whateverisgoodmoney",
            "body": "I do not understand why this is so hard to understand.\n\nThere is no 4th branch of government, so \"independent agencies\" do not exist. The Legislative does not have the power to Execute.\n\nThe Judicial has no enforcement powers against the Executive. The Legislative absolutely does, the remedy is impeachment.\n\nIt really is that simple.\n\nThere is no Constitutional crisis at all. It is simply that the Legislative decided to no longer use their powers and hand it all over to the Executive with 2000 various Executive agencies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "itsmediodio",
            "body": "Just to make it clear for everyone, in no way does this executive order state that \"the President alone should have the power to decide what the President can or cannot do and what powers the presidency does or does not grant\" nor does it say that \"the current president gets to decide the powers of the president instead of the constitution\" nor is it saying that \"he can choose what the limits of presidential power are\".\n\nAny party stating otherwise has misread the order or is deliberately inerpreting it in a dishonest way, we have no way of knowing. It's telling that no media outlet or constitutional authority has interpreted this order that way.\n\nHere is the full text.\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1. Policy and Purpose. The Constitution vests all executive power in the President and charges him with faithfully executing the laws. Since it would be impossible for the President to single-handedly perform all the executive business of the Federal Government, the Constitution also provides for subordinate officers to assist the President in his executive duties. In the exercise of their often-considerable authority, these executive branch officials remain subject to the President's ongoing supervision and control. The President in turn is regularly elected by and accountable to the American people. This is one of the structural safeguards, along with the separation of powers between the executive and legislative branches, regular elections for the Congress, and an independent judiciary whose judges are appointed by the President by and with the advice and consent of the Senate, by which the Framers created a Government accountable to the American people.\n\nHowever, previous administrations have allowed so-called \"independent regulatory agencies\" to operate with minimal Presidential supervision. These regulatory agencies currently exercise substantial executive authority without sufficient accountability to the President, and through him, to the American people. Moreover, these regulatory agencies have been permitted to promulgate significant regulations without review by the President.\n\nThese practices undermine such regulatory agencies' accountability to the American people and prevent a unified and coherent execution of Federal law. For the Federal Government to be truly accountable to the American people, officials who wield vast executive power must be supervised and controlled by the people's elected President.\n\nTherefore, in order to improve the administration of the executive branch and to increase regulatory officials' accountability to the American people, it shall be the policy of the executive branch to ensure Presidential supervision and control of the entire executive branch. Moreover, all executive departments and agencies, including so-called independent agencies, shall submit for review all proposed and final significant regulatory actions to the Office of Information and Regulatory Affairs (OIRA) within the Executive Office of the President before publication in the Federal Register.\n\nSec. 2. Definitions. For the purposes of this order:\n\n(a) The term \"employees\" shall have the meaning given that term in section 2105 of title 5, United States Code.\n\n(b) The term \"independent regulatory agency\" shall have the meaning given that term in section 3502(5) of title 44, United States Code. This order shall not apply to the Board of Governors of the Federal Reserve System or to the Federal Open Market Committee in its conduct of monetary policy. This order shall apply to the Board of Governors of the Federal Reserve System only in connection with its conduct and authorities directly related to its supervision and regulation of financial institutions.\n\n(c) The term \"independent regulatory agency chairman\" shall mean, with regard to a multi-member independent regulatory agency, the chairman of such agency, and shall mean, with regard to a single-headed independent regulatory agency, such agency's chairman, director, or other presiding officer.\n\n(d) The term \"head\" of an independent regulatory agency shall mean those appointed to supervise independent regulatory agencies and in whom the agencies' authorities are generally vested, encompassing the chairman, director, or other presiding officer, and, as applicable, other members, commissioners, or similar such officials with responsibility for supervising such agencies.\n\nSec. 3. OIRA Review of Agency Regulations. (a) Section 3(b) of Executive Order 12866 of September 30, 1993 (\"Regulatory Planning and Review\"), as amended, is hereby amended to read as follows:\n\n\"(b) \"Agency,\" unless otherwise indicated, means any authority of the United States that is an \"agency\" under 44 U.S.C. 3502(1), and shall also include the Federal Election Commission. This order shall not apply to the Board of Governors of the Federal Reserve System or to the Federal Open Market Committee in its conduct of monetary policy. This order shall apply to the Board of Governors of the Federal Reserve System only in connection with its conduct and authorities directly related to its supervision and regulation of financial institutions.\".\n\n(b) The Director of the Office of Management and Budget (OMB) shall provide guidance on implementation of this order to the heads of executive departments and agencies newly submitting regulatory actions under section 3(b) of Executive Order 12866. Agency submissions by independent regulatory agencies under such section shall commence within the earlier of 60 days from the date of this order, or completion of such implementation guidance.\n\nSec. 4. Performance Standards and Management Objectives. The Director of OMB shall establish performance standards and management objectives for independent agency heads, as appropriate and consistent with applicable law, and report periodically to the President on their performance and efficiency in attaining such standards and objectives.\n\nSec. 5. Apportionments for Independent Regulatory Agencies. The Director of OMB shall, on an ongoing basis:\n\n(a) review independent regulatory agencies' obligations for consistency with the President's policies and priorities; and\n\n(b) consult with independent regulatory agency chairmen and adjust such agencies' apportionments by activity, function, project, or object, as necessary and appropriate, to advance the President's policies and priorities. Such adjustments to apportionments may prohibit independent regulatory agencies from expending appropriations on particular activities, functions, projects, or objects, so long as such restrictions are consistent with law.\n\nSec. 6. Additional Consultation with the Executive Office of the President. (a) Subject to subsection (b), independent regulatory agency chairmen shall regularly consult with and coordinate policies and priorities with the directors of OMB, the White House Domestic Policy Council, and the White House National Economic Council.\n\n(b) The heads of independent regulatory agencies shall establish a position of White House Liaison in their respective agencies. Such position shall be in grade 15 of the General Schedule and shall be placed in Schedule C of the excepted service.\n\n(c) Independent regulatory agency chairmen shall submit agency strategic plans developed pursuant to the Government Performance and Results Act of 1993 to the Director of OMB for clearance prior to finalization.\n\nSec. 7. Rules of Conduct Guiding Federal Employees' Interpretation of the Law. The President and the Attorney General, subject to the President's supervision and control, shall provide authoritative interpretations of law for the executive branch. The President and the Attorney General's opinions on questions of law are controlling on all employees in the conduct of their official duties. No employee of the executive branch acting in their official capacity may advance an interpretation of the law as the position of the United States that contravenes the President or the Attorney General's opinion on a matter of law, including but not limited to the issuance of regulations, guidance, and positions advanced in litigation, unless authorized to do so by the President or in writing by the Attorney General.\n\nSec. 8. General Provisions. (a) If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.\n\n(b) Nothing in this order shall be construed to impair or otherwise affect:\n\n(i) the authority granted by law to an executive department, agency, or the head thereof; or\n\n(ii) the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(c) This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(d) This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person",
            "score": -28,
            "replies": [
                {
                    "author": "SELECTaerial",
                    "body": "So how do you feel about it?",
                    "score": 57,
                    "replies": [
                        {
                            "author": "itsmediodio",
                            "body": "I like it. All executive departments and bureaucracies must be directly accountable to the people through an elected representative. The alternative is a perpetual shadow government that is answerable to no one yet has the power to take the peoples money and influence their lives.",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "shiloh_jdb",
                                    "body": "What happens if they are meant to serve the public and the executive’s directives are not in the public’s best interest by any objective measure? Also are they really answerable to no one? Wouldn’t a malicious actor be subject to oversight of the administration if they did something contrary to their sworn responsibility to serve the public interest?\n\nIf a presidential candidate thinks that they won an election and they are the executive, should the FEC staff collect voting machines or invalidate specific state results because they are directed to do so, or should they identify a potential conflict of interest and not comply?",
                                    "score": 47,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": "The courts still have judicial review in that case, and if that doesn't work the people can vote the person whose in charge of the bureaucrat out.\n\n>Wouldn’t a malicious actor be subject to oversight of the administration if they did something contrary to their sworn responsibility to serve the public interest?\n\nThat would work unless the actor proclaimed that he was just acting in the public interest and was not malicious, and therefor doesn't have to obey the orders of the elected representative, which is the attitude that we're trying to push back on.\n\n>If a presidential candidate thinks that they won an election and they are the executive, should the FEC staff collect voting machines or invalidate specific state results because they are directed to do so, or should they identify a potential conflict of interest and not comply?\n\nNothing in this order prevents lawsuits and judicial review, as well as impeachments by congress which would almost assuredly happen in that scenario.\n\nAll these hypotheticals and what ifs aren't more terrifying to me than the idea of an unaccountable bureaucrat having power over the peoples money and lives and answering to nobody. You could easily flip around all your hypotheticals and they're far worse with agencies that don't answer to elected representatives.\n\nA bureaucrat could simply say \"No\" and refuse to implement a policy 99% of the public agrees on and is constitutionally mandated, or they could sabotage the implementation of duly elected laws they disagree with. \n\nThey could disagree that the candidate they opposed won an election and refuse to implement any of their orders, or refuse to recognize an election in a state they didn't have confidence in.\n\nWe can play what if all day, but objectively having MORE means of holding government accountable through elected representatives is BETTER for a functioning transparent democracy.\n\nThe democrats will understand that when it's their turn in power again. Right now their hatred of trump is clouding their judgement. They can be entirely reasonable as long as the Agent Orange factor isn't present.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "shiloh_jdb",
                                                    "body": "Are they truly equivalent tho? Your hypothetical is the risk related to an unknown, in-named individual actor with limited power, ultimately answerable to the administration having significant impact. Even if there were multiple such people, working in concert, they don’t have as sizeable impact as a President who, policy positions aside, has demonstrated on multiple occasions, a tendency to be dishonest and self-serving and to assert his position as truth. A President who is now claiming the authority to make any of his “truths” legal based on his own determination.\n\nI agree that the courts are there but he controls the Justice department that would enforce violations of the courts’ edicts.\n\nCongress has been neutered because he has the power and backing to primary any opposing Republican representative into political oblivion.\n\nSo basically the checks and balances that you’re referencing can be overcome by a President clever enough to be successful at working the system. Is this still something that you like? And do you have the same faith in a future president to not abuse it as you in Trump?",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Glad-Ad-4390",
                                                    "body": "You feel alright about having everyone involved simply be rubber stamps for the president? Yes-ppl all them way down? How would your view change if a democratic president eliminated everyone that didn’t agree with him/her, and Dems violated the constitution, broke laws and regulations, and refused to obey judges?",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "itsmediodio",
                                                            "body": "Rule 3. You're only allowed to ask clarifying questions with inquisitive intent designed to understand, not challenge or debate the views of Trump Supporters. Don't present your own opinions (or those of AI in this case) and disguise them as inquisitive questions. \n\nThis is soapboxing and it would result in a ban if it was reported.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "seanlking",
                                    "body": "Which elected representatives would you suggest be in charge of interpreting what kinds of safety factors, maintenance schedules, and required documentation be used for pressure vessels? Who do you think would be best suited to comment on the required statistical sample size for documenting process controls in medical devices? The analysis and testing required to determine a safe operating envelope of an airplane?\n\nThese all fall under “interpretations of the law” in the United States. They are all currently regulated by what you call a *shadow government*. Frankly, if you work in these regulated environments, I’m surprised you would want someone without any background interpreting laws and regulations.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": "I never stated that elected representatives would be directly responsible for the actual work, only that those doing the work would answer directly to an elected representative. Didn't think that needed to be said.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "seanlking",
                                                    "body": "Who would be able to have the final say on how that’s interpreted? That’s my point. \n\nIf those specific examples are what you would deem “actual work” how is that different than determining the types and amounts of medications that can be prescribed? That’s a very divisive topic that the administration has a different interpretation of than the medical community. \n\nYou may want to live in a world where scientists, engineers, software developers, doctors, mathematicians and other experts aren’t able to determine rules based on their expertise, but that’s not a world that makes sense to me.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "itsmediodio",
                                                            "body": ">Who would be able to have the final say on how that’s interpreted? That’s my point. \n\n\nIf the elected representative thinks there's an issue they can bring in outside experts to check the bureaucracts work, make a judgement call on their performance, and then keep or replace the worker. It's not rocket science.\n\nI want to live in a world where government is accountable to its citizens through their elected representatives because the alternative is undemocratic, prone to corruption, and also just plainly idiotic and counter to everything we know about transparent government.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "seanlking",
                                                                    "body": "So how is that different than the independent review process by other experts outside the agency, the extended public comment process, and final review of regulations? Did you know that has to be done for any regulation added?\n\nThe only thing you’re putting in there is an elected representative who could stop that cause they feel like it. Being elected doesn’t mean they know anything about the process or even the Constitution, frankly. Sure you can vote them out but regulations take a long time to implement because of the aforementioned process. \n\nIf you’ll forgive the allusion, in some cases these regulations *are* rocket science. I don’t trust anyone but an engineer or actual scientist to be able to tell other engineers how to design. And, again, that is literally at issue in Section 7 \n> Sec. 7.  Rules of Conduct Guiding Federal Employees’ Interpretation of the Law. The President and the Attorney General, subject to the President’s supervision and control, shall provide authoritative interpretations of law for the executive branch.  The President and the Attorney General’s opinions on questions of law are controlling on all employees in the conduct of their official duties.  No employee of the executive branch acting in their official capacity may advance an interpretation of the law as the position of the United States that contravenes the President or the Attorney General’s opinion on a matter of law, including but not limited to the issuance of regulations, guidance, and positions advanced in litigation, unless authorized to do so by the President or in writing by the Attorney General\n\nSo no regulations can be passed without approval by the President or Attorney General. The interpretation of those regulations is ultimately in their hands as well… that’s completely insane.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "itsmediodio",
                                                                            "body": ">So how is that different than the independent review process by other experts outside the agency, the extended public comment process, and final review of regulations? Did you know that has to be done for any regulation added?\n\n\nBecause without an elected representative as the final point of contact a bureaucrat could simply ignore all attempts at correction and accountability towards the public, which is a far more dangerous hypothetical. We've already discovered cases where federal agencies have paid money to groups that the state department opposed, actively undermining standing US policy. That's ridiculous, dangerous, and unacceptable.\n\nI don't agree that having these agencies answer directly to the people via elected representatives will undermine efficiency or productivity.\n\nIf you had another question I'm going to ask that you make it purely inquisitive with the intent to discover, not challenge the opinions of TS. As a NTS your role here is to ask questions from a neutral POV, not give your own opinion or soapbox. I've been ignoring it so far but it's getting excessive and if your comments were reported to me they would likely result in a ban. Thank you.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SpotNL",
                                                                                    "body": "> I don't agree that having these agencies answer directly to the people via elected representatives will undermine efficiency or productivity.\n\nWhy not? Doing the job correctly (even it is unpopular) will take a backseat once a politician's electibility is involved, no? A president would be able to stop them doing their job, according to the EO, if it means it turns out negative for the president.\n\nHow would this make things more efficient?",
                                                                                    "score": 5,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "OffBrandToothpaste",
                                                                    "body": "Does having independent government agencies actually preclude transparency? This notion seems to get tossed out a lot without substantiation.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "RooneyNeedsVats",
                                    "body": "So if a dem got elected into the oval office you would be fine with them having the same power? \n\nWhat if Trump (and before you say he won't I'm speaking 100% hypothetically) doesn't allow anymore elections?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": ">So if a dem got elected into the oval office you would be fine with them having the same power?\n\nIf a dem made the effort to make government more accountable to the voters like this I would be extremely grateful.\n\n>What if Trump (and before you say he won't I'm speaking 100% hypothetically) doesn't allow anymore elections?\n\nI wouldn't support that and this executive order does not give him that power in any way shape or form, nor is he seeking that power.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "RooneyNeedsVats",
                                                    "body": "Agreed the Dems do need to be more accountable to the people that put them in power. Every political party should do this. \n\nI am glad to hear that you wouldn't support something as dictatorial as the president having ultimate power over everything. Do you feel the other Trump supporters you know would feel the same way? Ya know, believing in the constitution and rule of law?",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Glad-Ad-4390",
                                                    "body": "He told voters they’d never have to vote again once he got elected this time. I got the impression he meant it. What is the general thought process on the right concerning that comment?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Born-Sun-2502",
                    "body": "Congress passed laws setting up independent agencies because lawmakers wanted the government to be able to perform some functions – like overseeing elections or regulating financial markets – without direct presidential involvement. This is his attempt to circumvent that. He does NOT want any presidential oversight, meaning anyone overseeing HIS activities, in the Executive Office. Even if you trusted Trump, ask yourself if that's a power you want every president to have regardless of who holds the role?",
                    "score": 84,
                    "replies": [
                        {
                            "author": "Karma_Whoring_Slut",
                            "body": "That’s an example of legislative overreach. The executive branch is responsible for enforcement of the law.\n\nAs head of the executive, it is completely logical that he should be in charge of the executive branch. This is how the presidency was always designed. \n\nIf the legislative branch feels the president isn’t fulfilling his duty, he can be impeached. If the judicial branch feels the president is enforcing something illegally, the judicial system can prevent him from doing that. \n\nThis executive order simply clarifies that he has absolute authority over the executive branch, as was always intended.",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "yumyumgivemesome",
                                    "body": "Do we want the legislature to be able to pass some laws which can be executed without being undermined by a subsequent president?  I know that’s a different question than whether this EO is constitutional, but policy rationales do play a role.\n\nAlso, the fact that this EO carves out Fed Reserve’s monetary policy feels like an admission that legislation for independent agencies IS constitutional, and that Trump is trying to weaken a constitutional power that Congress is admitted as holding.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Karma_Whoring_Slut",
                                            "body": "The legislature’s job is to pass laws. The executive’s job is to execute on those laws. The judicial’s is to make sure that both the executive and the legislative branches are behaving legally. \n\nIf the legislature believes that the president is not following the law, they can impeach the president.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Born-Sun-2502",
                                                    "body": "But Trump is violating those laws currently, correct? Or choosing his own interpretations of the laws that differ from that of the judicial branch, who, according to you, are just doing their job to make sure the executive is behaving legally. Then Trump claims it's overreach on their part?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Karma_Whoring_Slut",
                                                            "body": "No.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Born-Sun-2502",
                                                                    "body": "Then why is the Judicial blocking some of his executive orders saying they are not legal? They are just flat out lying?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Karma_Whoring_Slut",
                                                                            "body": "Ah, I thought you were referring to something else. Issuing illegal executive orders isn’t “breaking the law” the judicial branch is merely blocking the executive orders that they believe are illegal. We will see when they inevitably get to the Supreme Court.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Born-Sun-2502",
                                                                                    "body": "Breaking the law versus issuing executive orders that are in violation of the law. I get that you are construing breaking the law a specific way, but seems like semantics? Anyhow, sounds like you understand what I meant.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Glad-Ad-4390",
                                                                    "body": "You’re saying trump’s not ignoring the judges/laws/constitution?",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Glad-Ad-4390",
                                                    "body": "Impeachment doesn’t mean anything anymore.\nHow then can we address any overreach?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fligglymcgee",
                    "body": "It doesn't surprise me or likely anyone else here that this EO \\*\\*doesn't\\*\\* explicitly state \"the current president gets to decide the powers of the president instead of the constitution\". That's not the line in the sand, since that would obviously be crossed far past the point of no return.\n\nFor me, the line in the sand is right around the EO's declaration taht the “*so-called ‘independent regulatory agencies’ operate with minimal Presidential supervision*” and that this *“undermines such regulatory agencies' accountability to the American people”*\n\nI fully support that many of these \"so-called\" independent regulatory agencies can and SHOULD operate with minimal Presidential supervision. Let's review what is actually changing with the governance of the following organizations named in 44 U.S. Code § 3502:\n\n* Board of Governors of the Federal Reserve System (Excluded)\n* Federal Election Commission\\* (Nice of him to casually slip this one in as an addition)\n* Commodity Futures Trading Commission\n* Consumer Product Safety Commission\n* Federal Communications Commission\n* Federal Deposit Insurance Corporation\n* Federal Energy Regulatory Commission\n* Federal Housing Finance Agency\n* Federal Maritime Commission\n* Federal Trade Commission\n* Interstate Commerce Commission\n* Mine Enforcement Safety and Health Review Commission\n* National Labor Relations Board\n* Nuclear Regulatory Commission\n* Occupational Safety and Health Review Commission\n* Postal Regulatory Commission\n* Securities and Exchange Commission\n* Bureau of Consumer Financial Protection\n* Office of Financial Research\n* Office of the Comptroller of the Currency\n* and any other similar agency designated by statute as a Federal independent regulatory agency or commission. (A pretty gaping loophole)\n\nThe EO \\*\\*significantly\\*\\* changes the precedent of ovrsight to a few key commissions (Elections, SEC, FTC to name a few) that many of us would feel more comfortable under more independent or at least bipartisan control, \\*\\*as they were designed to operate\\*\\*. Aren’t you happy the President has never been given free license to have complete authority over the entire Executive branch? The checks and balances of our government surely shouldn’t be literally divided between three separate branches like sports teams?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "fligglymcgee",
                            "body": "For example. The SEC and FCC, while agencies within the Executive branch, have tradtionally operated under \"multi-member commissions\" of \\~5 presidential \\*\\*nominees\\*\\* that to be approved by the Senate. They also submitted proposed changes to budget or regulatory measures to be approved by Congress by way of OMB. While the language of the EO doesn't say these commissions are somehow newly nested under OMB, it greatly epxands and redefines OMB's authority in several key ways that shift a great deal of power from either their independent operation or the checks and balances of the other branches. Just a few excerpts that really stand out:\n\n1. \"\\[commissions\\]...*shall submit for review all proposed and final significant regulatory actions to the Office of Information and Regulatory Affairs (OIRA) within the Executive Office of the President before publication in the Federal Register.\"* \\- OMB and the President will now require they review and approve any regulatory changes proposed by the SEC and FCC, before Congressional review and before they can be enacted. This is a pretty significant change in practice, if not legally much different. The President is gaining far more authority over two domains he has serious conflicts in: Media and Communications, and... well, the SEC.\n2. *“The Director of OMB shall... consult with independent regulatory agency chairmen and adjust such agencies' apportionments by activity, function, project, or object, as necessary and appropriate, to advance the President's policies and priorities.”* *-* The President/OMB is not just pressuring how the SEC and FCC can decide what to regulate, they are now more directly dictating what funding they receive (or don't). This is, again, a large swing in precedent that previously included more checks and balances from the other branches.\n\nSo what does this all mean? I personally think it's a bad thing that commissions like these will now be pressured to align proposed changes and upkeep re: regulatory oversight and budget allocation with the desires of a President who has a ton to gain from \\*\\*not\\*\\* being regulated by the SEC and FCC. These \"'so-called' independent regulatory agencies\" have literally been more independent, bipartisan, and counter-balanced by other branches right up until this EO.\n\nRight wing, left wing, whatever: \\*\\*None of us should want the executive branch to have swelling authority over the governance of regulatory oversight\\*\\*. That is, unless you want to see DJT enjoy an unprecedented, less-and-less controllable position of authority?",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Heffe3737",
                    "body": "With the way the order is worded, it gives trump the ability to be the sole authority (technically the attorney general as well) when it comes to interpretation of the law, specifically as it pertains to the executive branch. Is that the way you’re reading it as well? And trump himself is in the executive, and he is the executive, is he not? \n\nWouldn’t that provision therefore provide him the ability to interpret any law he wants, in any way he wants? Meaning he can pick and choose which laws to enforce and which to ignore, not only as it pertains to the public, but also those that may attempt to place a limit on his own presidential power, no? \n\nIn other words, say Congress writes a law prohibiting a specific type of election interference. Would trump then be able to interpret that law any way he wishes, and then enforce, or not enforce that law any way he wants so long as his enforcement or lack thereof is in alignment with his own personal interpretation? \n\nI’d love to be wrong on this, because it feels like, as written, to be a gross overreach of executive power. But I’m not a lawyer - can you point to where I’ve made a mistake here?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "IdahoDuncan",
                    "body": "Then why would they feel to issue a new order?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Ok_Motor_3069",
                            "body": "Because if you want to preserve the Constitution you have to use it or lose it. Letting people flout it creates normalization of deviance which makes it harder to correct if it gets into the culture of an organization.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Glad-Ad-4390",
                                    "body": "Yes I feel the same. But how do we reconcile preserving the constitution while at the same time, judge’s rulings (on different matters) are ignored and disregarded? Does one cancel out the other?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ok_Motor_3069",
                                            "body": "That will be litigated in court where we can all watch it in real time. The Constitution is the basis for all laws in the US, or is supposed to be. People who want to change the Constitution have several strategies to push laws in different directions. \n\nNormalization of deviance - in any organization, standards slip if people get away with ignoring more and more laws and standards.\n\nTainting the jury pool with PR strategies.\n\nActivist judges put in to rule in strategic cases in certain planned jurisdictions. \n\nGradually working on the culture over time, with whatever types of influence can be brought to bear - media, PR, terrorism, threats, coercion, etc.\n\nWe have seen people who take oaths to protect the Constitution behave in ways that indicate they did not mean that oath in any way shape or form. Once more people get into the system who actually WANT to uphold it things will get better.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ok_Motor_3069",
                                                    "body": "In my opinion there is no need to panic. There has been normalization of deviance for so long, that a whole generation (maybe more than one) has grown up not knowing how it’s supposed to work. Once they learn they will see it makes sense. It will seem weird for a while. These issues can take years to litigate so I recommend to everyone you get informed on the Constitution so you can better understand what is happening and why. That way it won’t seem so scary and people’s mental health will improve. And they will be more in a learning frame of mind rather than just wildly reacting based on fear. It’s hard to learn while you are in a state of panic. Social engineers have learned how to exploit this.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Ok_Motor_3069",
                                                            "body": "This is the most significant time in American history since the Civil War in terms of whether we are going to survive as a country or not. I’m rooting for it to survive. We are currently in a counter-revolution and a restoration. That we got here after a cold Civil War without 100s of thousands of dead and generations of material suffering is near miraculous. I think it proves our Constitution did its job and is worth preserving. We almost lost it but we came through. I rejoice!!!!!\n\nWe could have easily had a similar fate to Ukraine in the 30s, Europe in WWII, China, Russia, Cambodia and more. Mass death and destruction and several more lost generations. We were spared!!!!!!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AU_WAR",
            "body": "I agree with it. The President has all the power in the Executive Branch. Unelected bureaucrats at the agencies mentioned, who do not answer to voters, have been given too much power/authority over the American people. \n\nHe is simply putting that power/authority in its proper place: with the President.",
            "score": 2,
            "replies": [
                {
                    "author": "Ok_Motor_3069",
                    "body": "They think they are a ruling class and are above all of us. No, the US is not supposed to have a ruling class with special rights and privileges.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "OpinionSuppository",
            "body": "The constitution is pretty clear on the powers of the President.",
            "score": -20,
            "replies": [
                {
                    "author": "SpatuelaCat",
                    "body": "I agree, so what do you think of this executive order that changes that and instead says that the current president gets to decide the powers of the president instead of the constitution?",
                    "score": 104,
                    "replies": [
                        {
                            "author": "itsmediodio",
                            "body": "It does not say that.",
                            "score": -43,
                            "replies": [
                                {
                                    "author": "lunar_adjacent",
                                    "body": "What doesn’t say what?",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": "The February 18th executive order, the subject of this entire thread.",
                                            "score": -25,
                                            "replies": [
                                                {
                                                    "author": "Oatz3",
                                                    "body": "What's your interpretation of it then?",
                                                    "score": 21,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "beyron",
                            "body": "You are incorrect. This executive order does not \"change\" that at all. The only way to change the constitution is through the amendment process.",
                            "score": -26,
                            "replies": [
                                {
                                    "author": "Kevin_McCallister_69",
                                    "body": "What does this executive order change?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "beyron",
                                            "body": "Definitely not the constitution",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "Kevin_McCallister_69",
                                                    "body": "So what did change?",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "beyron",
                                                            "body": "I don't know, I didn't read the whole thing  but I do know it doesn't change the constitution",
                                                            "score": -26,
                                                            "replies": [
                                                                {
                                                                    "author": "Kevin_McCallister_69",
                                                                    "body": "Would you be open to reading the whole thing and telling us what you think it changes?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "beyron",
                                                                            "body": "I've now read the fact sheet that is linked in the OP. From what I see it doesn't change anything and simply reasserts the powers of the president as they are already laid out in the constitution.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Kevin_McCallister_69",
                                                                                    "body": "Why was this necessary?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "beyron",
                                                                                            "body": "I'm not sure on the necessity but I will say it's likely a response to federal workers who seem to work against the president's agenda. He likely signed this EO to reassert his executive status to make sure federal workers understand who the boss is.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tim310rd",
                            "body": "He is talking about interpreting the law in the context of federal agencies. Agencies constantly interpret and change interpretations of laws for the purpose of enforcement actions. A good example is the EPA and whether or not CO2 is a pollutant under the Clean Air Act. Originally it was not classified as such, even though people knew it was a thing, but under Biden and Obama the EPA changed its interpretation to count it as a pollutant under that law. This EO basically says the AG or the President is the only power that has that authority in the executive branch. For the trump admin, the purpose is mainly to prevent the executive agencies changing the laws without the knowledge or consent of the top offices in the executive. This is consistent with the constitution and our history.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "in8logic",
                                    "body": "I think I’m mostly with you on this and I find this whole situation really fascinating. It seems to me like the separation of powers has become quite fuzzy  and maybe this EO could be a step toward making it more clear as long as all three branches are acting in good faith. \n\nYour EPA example is especially interesting to me. I could have misunderstood the ruling but didn’t SCOTUS recently rule that it is the judiciary that should be deciding that kind of thing?  Wouldn’t that be somewhat at odds with this EO? \n\nIt also seems like the way Congress has been writing laws for decades is essentially delegating a good chunk of their power to the executive. They leave so much room for interpretation making it necessary for the various agencies to fill in the gaps for them. \nIt makes sense, though. Congress simply can’t move fast enough to define all the minutiae and keep it up to date especially with such a hotly divided two-party system.  \n\nI’ve always thought that was why Congress had to approve so many leadership positions and also why there are so many legal restrictions on how the president has historically been able to act with regard to certain agencies. \nI’m not sure if I’m explaining my thoughts very well but I’m interested to see how it all plays out. \n\nDo you think there could be a better way for Congress to manage the definitions of the law so that the executive isn’t creating so many pseudo laws through regulation? What should the role of the judicial be in this?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "tim310rd",
                                            "body": "Yes and no. The judiciary ruling changed how courts show deference to the executive branch interpretations of law, basically saying that the courts are no longer going to assume that just because an agency says something is the law, that's correct. Still, executive branch agencies need to interpret the law, and this EO says that only the president and AG can speak for the Executive interpretation of the law. This does not affect the courts.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "YeahWhatOk",
                                    "body": "> He is talking about interpreting the law in the context of federal agencies.\n\nThrough his birthright EO, we know that the president's interpretation of that particular law is that it does not apply to illegal immigrants that give birth in the US. Right now, should government agencies not be recognizing citizenship of those people? \n\nWe also have a lot of case law now that out lie the Presidents legal interpretation of many of the crimes that he has been accused of - should those be treated as the official interpretation of those laws?\n\nFurthermore, he made a lot of speeches around the Jan 6 detainees, establishing his views on the laws they were accused of breaking. Same thing?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "tim310rd",
                                            "body": "The supreme Court also agreed with Trump about the J6 charges being overcharged, specifically using a law meant to prevent businesses from destroying records before an investigation being applied to rioters at the capital. Biden certainly had his fair share of absurd legal interpretations. \n\nYes, the espionage act was bad law when it was passed by the worst president in US history, Woodrow Wilson. It was abused then against political dissidents, it was abused for the past 20 years to go after whistleblowers, it was abused under Biden to go after Trump in unprecedented and completely novel ways. The espionage act should be interpreted in a very limited way, and probably should be removed from the US code all together. Anyone who defends the Espionage act as a piece of law is in my view an antidemocratic imperialist. \n\nThere is no law that gives birthright citizenship to illegal immigrants. There is an interpretation made by the supreme Court of the US constitution's fourteenth amendment in the late 1800's to apply the provision meant to give freed slaves US citizenship to apply to immigrants. People have assumed based on the wording of the decision that it applied to anyone in the US, despite the case in question dealing with the child of 2 legal immigrants, and it has not been tested since. This Supreme Court was also responsible for Dred Scott, so they did not make the best decisions, and we've overturned this court's reasoning in the past. Trump is allowed to interpret the law differently than past administrations since this is a fairly open question, and eventually the supreme court will have to weigh in to clarify the issue.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "YeahWhatOk",
                                                    "body": "Not sure I follow your logic, but I'm a bit of a dullard. \n\nShould Trumps off the cuff remarks on a variety of law related activity be considered the official interpretation of the law until were told otherwise? \n\nExample: flag burners should get a year in prison. Trumps interpretation of whatever law would govern such a thing (I believe its probably just protected speech under 1a). Should the DOJ begin prosecuting people that burn flags with a mandatory 1 year sentence?",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "tim310rd",
                                                            "body": "Well, yeah. That has always been the president's power. Bush, Obama, and Biden all advanced particular legal interpretations and their agencies followed suit. The mandatory sentence they wouldn't be able to do unless there is a provision in the law that Trump is interpreting that is a mandatory minimum, but they would start prosecuting that as a crime. The courts would step in and probably rule that the executive interpretation is wrong and that X is the correct interpretation, at which point the EAs would have to follow that because it's no longer an open question.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "YeahWhatOk",
                                                                    "body": "Is Trumps twitter musings and such considered \"binding\" then in this case? Will the DOJ be instructing law enforcement to arrest flag burners and prosecuting them until a judge steps in and says otherwise?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "tim310rd",
                                                                            "body": "I think Trump would have to be specific in \"this law, section yadda, subsection boring, I interpret to include things as well\". In practice, the executive agencies will mostly come up with interpretations internally, the change is that before they start arguing it in court the AG/Trump has to sign off on it. Trump can't just say \"X\" is illegal now, he has to find a statute that is open to interpretation and include X in a reasonable interpretation.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "OpinionSuppository",
                            "body": "The EO simply re-iterates the plenary powers of the President and his authority over the Executive Branch, as described in the Constitution.   \nYou cannot work against your own boss, it's common sense.  \n\nThe House is not impeaching Trump and the Senate confirmed his appointees to interpret the laws and implement them as they interpret it.  \n\nAnd I believe Trump and his appointees (both judicial and executive) are interpreting the Constitution closer to how the framers wanted it (e.g., 14th Amendment) vs. the Democrats (e.g. Roe v. Wade).\n\nIt's all really thanks to Biden for setting the precedent. For example, Trump is able to fire anybody in the Federal Government without wasting time in lawsuits due to [Spicer v. Biden/Severino v. Biden](https://aflegal.org/litigation/spicer-v-biden/).\n\nSome people did warn the Democrats back in 2021 about the trap they walked into:\n\nhttps://slate.com/news-and-politics/2021/05/biden-trump-severino-trap.html  \n\nThey just didn't expect Trump to win in 2024 and use the same precedent.  \n\nThe Severino v. Biden judgement states that the President has the authority to fire Presidential appointees at will.    \nSuch Presidential appointees have the authority to fire people under them so Severino really set the case for Trump to fire any employee at will by virtue of his executive powers.  \nThe EO only uses the same precedent to say that anyone in the Executive branch not in line with the President can and will be fired.  \n\nSame with DOGE - the way Obama's USDS was utilized and rebranded was a bit of legal checkmate too. He really has the most brilliant minds behind his actions this time.",
                            "score": -39,
                            "replies": [
                                {
                                    "author": "DoozerGlob",
                                    "body": "A president does not have the authority to direct a presidential appointee to fire non-presidential appointees. Correct?",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "OpinionSuppository",
                                            "body": "The presidential appointees, especially the Senate-confirmed ones, are responsible for the upkeep and maintenance of the agency, which includes the firing of insubordinate employees.\n\nSince you all can't be bothered to read up about the executive branch, let's compare to private companies:  \n\nThe CEO of a company has the authority to fire any employee. The President is the CEO.  \n\nThe CEO takes the advice and consent of the Board members of the company when hiring important people like the COO/CFO. The board is the senate, which currently is in favor of the CEO.\n\nAnd the house - well they kind of represent voting power of the shareholders. They can sue the company. The House has impeachment powers and the people have voting powers every 2 years.  \n\nSaying that the President cannot direct Presidental appointees to fire non-Presidential appointees does not pass the common sense test. The CEO cannot tell the Head of HR to fire certain employees for insubordination?  \n\nSure, those employees have certain rights depending on which state they're in, but as far as the Federal government is concerned, it follows at-will employment. And even with states that are not at-will - insubordination will get you fired almost anywhere.\n\nThe EO, I'm sure, aims to simplify the process of firing insubordinate employees by just citing this EO instead of following a wasteful bureaucratic process set up to stop Trump's agenda.\n\nI'd have cared more if there was similar noise and reporting when Biden fired Trump's appointees.",
                                            "score": -19,
                                            "replies": [
                                                {
                                                    "author": "DoozerGlob",
                                                    "body": "Insubordinate to who?",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "OpinionSuppository",
                                                            "body": "The political appointees confirmed by the Senate, who are in charge of implementing the President's agenda.  \n\nThere's documented evidence of unelected bureaucrats subverting Trump's political appointees in his first term because these people went to the media and bragged about subverting Trump. They told the appointees certain things couldn't be done when in fact they could be done, or slow walked certain things. That shouldn't be happening this time round.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "DoozerGlob",
                                                                    "body": "Where is this evidence and were they sacked?",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "OpinionSuppository",
                                                                            "body": "Firstly, the evidence for Biden sacking appointees is in the original reply. Trump's appointees in the first term were weaker due to McConnell and probably didn't sack many people they should have sacked. It's quite different this time which is why you see all the noise in the media about a faux \"constitutional crisis\".  \n\nThe slow-walking, subversion, known to you as \"the resistance\" is well documented even in mainstream media, but this article in particular summarizes such acts quite well and has citations as well:  \n\nhttps://americafirstpolicy.com/issues/20222702-federal-bureaucrats-resisted-president-trump\n\nThe fact that there were 102 \"alt\" or \"rogue\" accounts supposedly run by unelected bureaucrats resisting the head of the executive branch (Trump) while being a part of it should be enough of an evidence - I think everyone remembers those accounts. How many \"alt\" accounts did you see during Biden or Obama's terms?   \n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0740624X1830546X",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DoozerGlob",
                                                                                    "body": "I don't view \"alt\" accounts on twitter from people who claim to work for the government as sufficient evidence of anything. Of course there have always been some civil servants who will try to scupper the plans of the current administration. I've been in local government and experienced it myself. The alternative however is a complete overhauling of government institutions every few years which would be eternal chaos. It would also mean appointing yes men to every position which is even worse. When everyone says yes to you there is a much higher chance of you doing something stupid. \n\nDo you think Trump's plan is to fill every important federal position with those who will do whatever he says?",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "OpinionSuppository",
                                                                                            "body": "> Do you think Trump's plan is to fill every important federal position with those who will do whatever he says?\n\n...yes? Given how his cabinet confirmations are going so far it seems the Senate will agree to this to save their ass in the 2026 elections. That's the power of populism.    \nTrump, Musk and the MAGA movement have effectively weaponized cancel culture against the GOP Senators.  Shouldn't have forced Musk to buy Twitter, I guess?  \n\n> The alternative however is a complete overhauling of government institutions every few years which would be eternal chaos\n\nIs it really that bad? Worked out quite well for Musk and his companies despite the media screeching about how like the entire Twitter staff got laid off.  X and xAI are collectively worth a lot more than Reddit right now.  \n\nGiven how many people Biden hired, and given how partisan and political the entire Fed machinery was during the last 4 years (added pronouns everywhere, all sorts of flags/awareness days/wokeism, straight up tried to force the 28th Amendment, etc.) it wouldn't be surprising if Biden's personnel hiring policy excluded hiring people who posted a photo in their family group chat wearing a MAGA hat some 10 years ago. The only two solutions to fixing this are to hire an equal number of MAGA hat wearing people or fire the people he hired. Given the party's fiscal conservative aspirations, it only makes sense to fire them.  \n  \nIt's a digital, fast moving world now. Federal employees don't have to arrive in DC by horse drawn carriages anymore. It's also a hyper partisan world - but the partisanship wasn't started by the Republicans. I mean, Reddit itself is a pretty good example for partisanship. Conservatives get banned on Reddit. But liberals on Twitter leave voluntarily.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DoozerGlob",
                                                                                                    "body": "Let's say a President comes in who thinks lead should be reintroduced as a food additive but all the experts say that's fucking retarded so they are all fired and replaced with widely shunned but loyal yes men. \nIs that ideal?",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "OpinionSuppository",
                                                                                                            "body": "It already happened with gender and was reversed with the next election. We're replacing the experts you like with our experts now. Don't try to make \"experts\" non partisan.",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "DoozerGlob",
                                                                                                                    "body": "\n\nDid you know the \"experts\" Trump got in proclaimed that everyone is female in that EO? \n\nDo you think gender is biological?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "OpinionSuppository",
                                                                                                                            "body": "> everyone is female in that EO\n\nOnly for people who believe in newspeak. It's pretty clear to me, the definition of sex and conception.   \nYou do know that the sex chromosomes...are what define your sex at conception right? It's in your DNA, no amount of hormones will change that.   \n\n> Do you think gender is biological?\n\nWhat is a woman?  \n\n\nBy the way:  \n https://www.politifact.com/factchecks/2025/jan/29/tweets/no-were-not-all-female-under-trumps-executive-orde/  \n\nDEBUUUUNKED",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                    "body": "Firstly, I didn't claim it legally classed anyone as anything so we can ignore that part of the \"debunk\". \n\nSecondly, even if the cited study is correct ( words like \"suggest\" and \"highly likely\" are used as good science is cautious when based on a single study ) the EO is still WRONG. Sex is not determined at conception. This is made clear in your source...\n\n\"The problem with the executive order’s definition.\n\nA person’s \"sex,\" according to scientists, is not easily measured by one factor. Chromosomes, gonads, hormones and genitalia can all contribute to a person’s sex categorization.\n\nAnd those determinants are not all clear at conception. Nor do they always add up to typical male or typical female anatomy.\"\n\nFrom the citation...\n\n\"The chromosomal sex of the embryo is established at fertilization. However, 6 weeks elapse in humans before the first signs of sex differentiation are noticed. Sex differentiation involves a series of events whereby the sexually indifferent gonads and genitalia progressively acquire male or female characteristics. Believed initially to be governed entirely by the presence or absence of the SRY gene on the Y chromosome, gonadal determination has proven to rely on a complex network of genes, whose balanced expression levels either activate the testis pathway and simultaneously repress the ovarian pathway or vice versa. The presence or absence of primordial germ cells, of extragonadal origin, also has a sexually dimorphic relevance. Subsequently, internal and external genitalia will follow the male pathway in the presence of androgens and anti-Müllerian hormone (AMH), or the female pathway in their absence.\nAs already mentioned, the gonadal ridges are bipotential until the 6th week after conception in humans, i.e. they have the capacity to follow the testicular and the ovarian pathways.\"\n\nDo you think gender is biological?",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                            "body": "According to scientists, a trait isn’t easily measured by one factor—multiple elements like chemistry, environment, and biology all contribute—so let’s apply that brilliance to our diets and reintroduce lead as a food additive to aid the complex spectrum of nutrition in our diets.\n\n> This is made clear in your source\n\nAs far as I'm concerned, the original claim in your comment is DEBUNKED.\n\nLead was an additive to many things as late as 1996 - we know how stupid it was now. You really think the \"science\" you're proposing will hold up over time? (Challenge: Don't cite examples of random extinct or uncivilized cultures in your response)\n\n> From the citation...\n\n> \"The ~~chromosomal~~ sex of the embryo is established at fertilization.\n\n\nFTFY",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                    "body": "The claim that we are all female at conception is now unclear so I will adapt accordingly as that part was unimportant. The important part is that the EO is WRONG due to either ignorance or political ideology.\n\nIs, as the EO claimed, sex determined at conception?\n(Please present your source).",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                            "body": "> Please present your source\n\nI looked up a Reddit debate on this and almost every comment in favor of my opinion was `[deleted]` and the thread locked. The subreddits supporting my opinion were banned. \n\nI don't think this site allows me to express my opinion or site sources on that topic freely.  \n\nHappy to debunk any other mis-conceptions.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                    "body": "Is, as the EO claims, sex determined at conception? \n\nThis subreddit is run by Trump supporters. Please provide your source ( via DM if necessary ).",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                            "body": "Verily, in the generation of animals, the sex of the embryo doth arise from the potency of heat within the seed of the male. For the semen, being a residue of blood perfected by vital warmth, doth act upon the cooler matter of the female, which receiveth it as clay receiveth the sculptor’s hand. If the heat be strong and masterful, it shapeth the offspring into the male form, imparting the active principle; yet if it be weak or overcome by the coldness of the female matter, the female form prevaileth. Thus, at the moment of their union, the balance of heat decreeth the nature of what shall be, as I have set forth in my contemplations.\n\nSource: Aristotle. (1942). Generation of animals (A. L. Peck, Trans.). Harvard University Press. (Original work published ca. 350 BCE)",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                    "body": "So now your entire argument has broken down your only recourse is to piss about. 🙄\n\nI was going to edit to put \"peer reviewed scientific paper in the last 50 years\" but didn't think you'd go there. \n\nWhy did you cross out \"chromosomal\" from \"chromosomal sex\"?\n\nChromosomal sex and biological sex are different things. \n\nWith that, and the other nonsense from Aristotle ( who also thought eels spontaneously generated from mud )...\n\nIs, as the EO claims, biological sex determined at conception? \n\nPlease include a peer reviewed source written within the last 50 years.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "None",
                                                                                                                                                                                            "body": "[removed]",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                    "body": "This is from your source...\n\n\"Myths of Sex Determination\n\nMyth 1: Sex is typically determined by X and Y chromosomes\".\n\nThis demonstrates the problem with using AI instead of reading things yourself. \n\nWhy do you have a russian account name? \n\nLet's cut the crap. Sex is not determined at conception. The EO was either written by idiots or was motivated by political ideology over science. Which do you think it is?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                                                            "body": "I don't think Trump's EO is covering animals other than humans.\n\nIn humans, it is determined by chromosomes as mentioned in the source. Are you a human? Am I a human?",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                    "body": "Does this mean you are dismissing the study that suggests female is not the default sex at conception as it has only been tested on mice?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                                                                            "body": "I simply don't care about that study. \n\n* Sex is determined by X and Y chromosomes in humans, 99.98% of born humans have XX or XY chromosomes (male and female respectively)  \n* Human chromosomes are a product of conception;\n* Therefore sex is determined at conception in almost every case\n* The above points are factual to civilized societies and cultures that are non-extinct and have successfully propagated their genes and culture, i.e., the society we live in. \n* The EO deals with sex and does not attempt to define gender; \"Gender\" is a whole another debate which is plagued by academic bias and retracted studies due to fear of Marxist politics.\n\nTherefore sex is determined at conception and the EO is factual and correct, and will be applied in cases of enforcement of relevant laws like Title IX or executive branch functions like printing of passports.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                                    "body": ">I simply don't care about that study. \n\nSo everyone IS female at conception then?",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                                                                                            "body": "You seem to not be grasping the concept of \"not caring\", which does not mean agreement or disagreement with the conclusion.\n\nNor do you seem to acknowledge that the chromosomes chemically encoded in DNA do not care about the growth stages of the fetus - the DNA does not change once conception happens.  \n\nLet's go many steps further. \n\n* The sex can decided by analyzing the sex chromosomes after a DNA test once the fully developed baby pops out of the birth canal (which can only exist and function properly in females with the XX chromosome) \n* The sex might be determined posthumously millennia later by analyzing the skeletal structure of the pelvic region which would point to the existence of a birth canal with high certainty\n* The above points exclude 0.02% of the people with abnormal chromosomes and an undetermined victims of childhood experiments due to factors like Muchanasen by proxy as outliers.\n\nThe growth stages of the mammalian fetus while in the womb, one of which you seem to be calling the \"default sex\", are irrelevant to what is chemically encoded in the DNA of the human cells contained within the organism known as a human. \n\nI thought you people didn't care too much about the clump of cells in there? Abortion activists do not seem to agree with you. They think that [even an abortion clinic under construction is determined to be an abortion clinic and will be treated as such by law](https://apnews.com/article/wyoming-abortion-clinic-fire-arrest-4524825ae149b37a677fbfe72ce76400)...now apply that logic to the fetus (the under construction human) perhaps.\n\nRegardless,   \nDo svidaniya",
                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                                                    "body": "Are all humans female at conception?",
                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                                                                                                            "body": "Why are you so utterly obsessed with sexing a clump of cells BEFORE it pops out of the vagina?",
                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                                                                    "body": "It's the EO we've been talking about. Try to keep up.\n\nIs everyone female at conception?",
                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                                                                                                                            "body": "Do you really think you have a left wing version of \"What is a woman?\" lmao  \n\nYou can keep asking that, it does not even slightly shatter my world view nor makes me question anything. My previous statements regarding chromosomes answer your question perfectly.",
                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                                                                                    "body": "The Trump EO proclaims everyone is female. That's incrediblely dumb and anti science. Can you now see how replacing experienced and well educated people with incompetent sycophants is a bad idea?",
                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                                                                                                                                            "body": "> The Trump EO proclaims everyone is female.\n\nThat's been debunked - you are the only one here proclaiming that everyone is female.",
                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                                                                                                    "body": "It hasn't been debunked. The article used a study that had only been done on mice and we are not mice, we are human remeber?\n\n\"I don't think Trump's EO is covering animals other than humans.\"\n\nDo you have a study in humans that disproves the long standing evidence that everyone is female at conception?",
                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        },
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                                                            "body": "> Why do you have a russian account name?\n\nThat's Russophobic. Would you ask if it was in Arabic or German instead?",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "DoozerGlob",
                                                                                                                                                                                                                    "body": "As social media isn't infested with  Arabic or German troll accounts that use AI instead of thinking...no. \n\nDon't you think it's wise to be a little suspicious these days?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                                                                            "body": "> infested with Arabic \n\nThat's factually untrue since October 7, 2023.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        },
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "OpinionSuppository",
                                                                                                                                                                                            "body": "And before you start talking about the big \"I\":\n\nhttps://pubmed.ncbi.nlm.nih.gov/12476264/",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "OpinionSuppository",
                                                                            "body": "Another instance of bureaucrats subverting Trump: \n\nhttps://x.com/lukerosiak/status/1892334717866754219\n\nFresh from DOGE.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "BloodhoundGang",
                                                    "body": "Why do we constantly want to compare the role of President to a CEO?",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "OpinionSuppository",
                                                            "body": "https://en.wikipedia.org/wiki/Officer_of_the_United_States  \n\nThe President is quite literally the chief (head) of all officers of the executive branch...in other words, the Chief Executive Officer of the (Federal) Executive branch.  \n\nHas it dawned upon you that the word \"chief executive officer\" quite literally originates in Constitutional history and the American political system?  The use of CEO to refer to heads of the executive branches predates their use in private corporate structure.  \n\nhttps://en.wikipedia.org/wiki/Chief_executive_officer#Origins  \n \nThere were no \"CEOs\" before America existed. Private company structure is based on state company law which is loosely based upon the constitution of the states which themselves are loosely based on the US Constitution which makes good use of \"executive\" and \"officer\" and \"chief\".  The rest of the world simply followed American corporate structure.    \n\nThe term \"chief executive officer\" was used in 1782 to refer to Governors of states and the President pretty much has the same powers over the federal executive branch as the governors have over the state executive branches.  You could swap out \"President\" for \"Federal Governor\" or \"US Governor\" or \"Chief Executive Officer of the United States\" and it would make just as much sense.  \n\nYou should do some research before asking such rhetorical questions. Because perhaps the question you asked might not be rhetorical at all.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lone_Wolfen",
                    "body": "So is Trump overreaching his constitutional powers here, saying effectively he and he alone decides how laws apply to him?",
                    "score": 47,
                    "replies": [
                        {
                            "author": "OpinionSuppository",
                            "body": "Congress passes laws.   \nThe executive branch interprets those laws and enforces them.  \nThe judiciary branch can rule if the interpretation went against the original intent or the constitution and handles sentencing/restitution.\n\nHis EO simply says that there will only be one interpretation in the executive branch because he is the chief executive. That is explicitly constitutional. Any un-elected bureaucrat in the executive branch should not and cannot interpret the laws or the constitution differently.  \nHis EO does not remove the powers of the Supreme Court nor the Senate checks and balances clause or House impeachment powers.\n\nIt is nothing but a stern reminder. It's really there so that his political appointees can remove unelected bureaucrats using their federal government position to subvert the agenda Trump was elected to implement like they did in his first term, by just citing the EO in a single shot instead of wasting time with even more bureaucracy to get rid of such \"resistance\".  \n\nhttps://www.washingtonpost.com/politics/resistance-from-within-federal-workers-push-back-against-trump/2017/01/31/c65b110e-e7cb-11e6-b82f-687d6e6a3e7c_story.html  \n\nThe only difference between Biden and Trump doing it is how the media is reporting it.   \n\nYou do not get hyper partisan FEMA employees ignoring houses with Trump signs after a major natural disaster unless you have politically purged the agency of opposing ideology. You think Biden's OPM hired people with MAGA hats in their profile pictures?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Quidfacis_",
                                    "body": "> The judiciary branch can rule if the interpretation went against the original intent or the constitution and handles sentencing/restitution.\n\nThe [Executive Order says](https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-accountability-for-all-agencies/):\n\n> The President and the Attorney General, subject to the President’s supervision and control, shall provide authoritative interpretations of law for the executive branch.  **The President and the Attorney General’s opinions on questions of law are controlling on all employees in the conduct of their official duties.**  No employee of the executive branch acting in their official capacity may advance an interpretation of the law as the position of the United States that contravenes the President or the Attorney General’s opinion on a matter of law, including but not limited to the issuance of regulations, guidance, and positions advanced in litigation, unless authorized to do so by the President or in writing by the Attorney General. \n\nIf the Judiciary branch rules that the President's interpretation of X incorrect, then are employees of the executive branch beholden to SCOTUS, or the President's interpretation?",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "OpinionSuppository",
                                            "body": "> If the Judiciary branch rules that the President's interpretation of X incorrect, then are employees of the executive branch beholden to SCOTUS, or the President's interpretation\n\nA significant fundamental difference in the interpretation of Article 1, 2 or 3, would be a constitutional crisis which might even lead to a civil war. Because a partisan SCOTUS could interpret the Constitution to give them more power than the status quo or original intent of the Constitution.  \n\nThe legislative branch has impeachment powers over both executive and judiciary, judiciary has powers over both legislative and executive, while the executive is the one really enforcing the powers of both of the branches. It's effectively a loop with no final authority really except for people and elections spread out over decades.  \n\nThe system relies upon people respecting the fundamental text of the Constitution. Activist judges (often overruled) are a significant vulnerability to this system because they create a feedback loop wherein crazier rulings lead to less authority and even crazier rulings.\n\nFor example, if the Republicans pack the SCOTUS with 12 more Justices all of whom who happen to be former Trump cabinet members (let's say 12 copies of Kash Patel but as a Supreme Court Justice), they could interpret Article 2 to be effectively useless and neuter a future Democrat President. But a Democrat Congress could just ignore by not impeaching the Democrat President. In this scenario the states still function as usual and keep elections going on because the Governors are not in on the craziness.  \n\nThat's why the First and Second Amendment exist as the final check over all giving the final enforcement to the People. It's one of the reasons why the President almost has the powers of an elected dictator, but the country does not turn into a dictatorship.  \n\nIn other countries especially parliamentary democracies, the chief executive usually reassigns or transfers executive officers to remote places or insignificant positions instead of firing them outright. Or often they just turn into quasi dictatorships especially in third world countries.  \n\n> executive branch beholden\n\nThe Federal executive officers are beholden to the US Constitution and Judicial Review is currently an \"implied power\" stemming from Article 3 and the only enforcement authority for that is impeachment by Congress because the enforcement of the judgement would rest with the Department of Justice which is part of the executive branch. There's various things the states could do as well depending on how close to a civil war they're willing to go.   \n\nSo far, the institution that is SCOTUS has been respected by everyone, but I could see a timeline in which the Democrats have packed the court with activist judges and the implied power is lost with increasingly partisan judges with both the President and Congress just ignoring it.\n\nI respect Kystern Sinema and Joe Manchin for preventing the Democrats from packing the courts. As far as the current status quo goes, SCOTUS is still the supreme authority over the Constitution with their implied, respected and enforced Judicial Review power.  \n\nhttps://en.wikipedia.org/wiki/Article_Three_of_the_United_States_Constitution#Judicial_review  \n\n> The interpretation of the laws is the proper and peculiar province of the courts. A constitution, is, in fact, and must be regarded by the judges, as a fundamental law. It therefore belongs to them to ascertain its meaning, as well as the meaning of any particular act proceeding from the legislative body. If there should happen to be an irreconcilable variance between two, that which has the superior obligation and validity ought, of course, to be preferred; or, in other words, the constitution ought to be preferred to the statute, the intention of the people to the intention of their agents.\n\nWhen fundamentals like the Electoral College, First Amendment, Second Amendment, States' Rights,, etc. become a highly partisan issue...the court will start to lose authority even with Congress. For a real world example outside of gov, see the various medical institutions that have become highly partisan and have lost credibility - because they decided to cover up the origins of COVID or prevent debate on the efficacy of the COVID vaccine or rules.     \n\nDemocrats could pack the courts and the Republican Congress could just refuse to impeach Trump for violating enforcement of SCOTUS orders via the Department of Justice.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Quidfacis_",
                                                    "body": "Apologies.  I do not see in your post where you answered this question:\n\n> If the Judiciary branch rules that the President's interpretation of X incorrect, then are employees of the executive branch beholden to SCOTUS, or the President's interpretation?\n\nIf SCOTUS says that the President's interpretation of the law is incorrect, are employees of the executive branch beholden to SCOTUS or the President?",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": -7,
                                                            "replies": [
                                                                {
                                                                    "author": "Popeholden",
                                                                    "body": "Why don't you want to answer that question? Does the President have a duty to abide by the rulings of the Judicial branch? Do executive branch employees have a duty to abide by the rulings of the Judicial branch?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": -4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Saysonz",
                                                                                    "body": "Do you usually have conversations where you completely ignore the basic question answered and instead go off on tangents about unrelated things and make snarky responses?",
                                                                                    "score": 7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "OpinionSuppository",
                                                                                            "body": "Did you mean to reply to the other 2 people? I gave a pretty long response to a question including an answer to the question which the guy just ignored. \n\n> SCOTUS is still the supreme authority over the Constitution with their implied, respected and enforced Judicial Review power\n\nI'm not here to answer questions like I'm in a school or some communist struggle session.",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "reddit4getit",
                                            "body": "I don't recall neither President Trump nor any of his AGs ignoring decisions coming down from the Supreme Court, so we can be confident that they would adhere to those decisions, and pass down those interpretations to his employees in the executive branch.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "shiloh_jdb",
                                    "body": "Did Biden summarily fire what both sides have understood for decades to be non-political career civil servants and appointees with 10 year terms like the FBI and SEC? Didn’t Biden keep Trump’s FBI director Christopher Wray in place and Obama did the same with Mueller? \n\nAre you genuinely saying that this is wholly consistent with past Presidential norms and that both sides do this to the same degree?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "OpinionSuppository",
                                            "body": "MAGA is effectively a completely new political doctrine compared to the old GOP.  I don't care about Wray or Mueller, it seems clear in retrospective that Trump's cabinet and agenda during his first term were neutered by Mitch McConnell and Paul Ryan respectively, along with the rest of the so called non-political career civil servants, who reside in 92% Democrat-voting DC. Non-political my ass.    \n\nBiden set the precedent by firing a Presidential appointee who sued and got a judgement against him and made it easy for Trump to do the same without lawfare, period. That appointee was also serving a term, if you actually care to look up details.    \nIt would be unfair to Trump to reinstate Biden appointees while Trump appointees were fired for 4 years - if the original judgement against Severino was overturned then maybe the original Trump appointees should also be restored instead, no?  \n\nThe \"independent\" agencies like FTC, FCC, etc. rely on the sanctity of the two party system and whatever little bipartisanship in Congress that is left to have bipartisan commissions because the Constitution does not define political parties and it is only up to the Senate's advice-and-consent decree to enforce bipartisanship in those commissions. The significant erosion of bipartisanship really started under Obama, with the Democrats appointing increasingly partisan people and Harry Reid invoking the nuclear option to override GOP concerns.    \n\nI wouldn't be surprised if the Democrats stopped bipartisan appointments to these independent agencies given how far they were willing to go to pack the courts, so much that Kystern Sinema and Joe Manchin had to leave the party itself.  \n\n> Are you genuinely saying that this is wholly consistent with past Presidential norms and that both sides do this to the same degree?\n\nThe presidential norm for this goes as far back as Lincoln or even Andrew Jackson.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "WulfTheSaxon",
                                            "body": "> Did Biden summarily fire what both sides have understood for decades to be non-political career civil servants and appointees\n\nYes.\n\nhttps://thefederalist.com/2021/09/10/biden-administration-orders-ideological-purge-of-u-s-military-academies/\n\nhttps://lawandcrime.com/lawsuit/last-minute-trump-appointee-sues-joe-biden-claiming-the-president-has-no-authority-to-fire-him/\n\nhttps://thehill.com/homenews/administration/573697-sean-spicer-sues-biden-over-naval-board-removal/\n\netc.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Sketchy_Uncle",
                                    "body": "> The executive branch interprets those laws\n\nWhat does the Judicial branch do?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "OpinionSuppository",
                                            "body": "> What does the Judicial branch do?\n\nDid you read past the quoted text?",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "gsmumbo",
                                    "body": "> Congress passes laws.\n> The executive branch interprets those laws and enforces them.\n> The judiciary branch can rule if the interpretation went against the original intent or the constitution and handles sentencing/restitution.\n\nPutting aside the executive order (since that’s what’s in question here), how did you come to this conclusion?’It’s always been accepted that:\n\nLegislative branch (Congress) passes laws\nExecutive branch (President) enforces laws\nJudiciary branch (Supreme Court) interprets laws\n\nThey each act as a check for the other branches. The fact that you were able to simply explain the first two branches but had to break down individual responsibilities for the third should say something. It’s all balanced until you move interpretation to the executive branch. That’s when their purpose becomes muddy and has to be broken down as their overarching responsibility that ties it all together no longer exists.\n\nBringing it back to my original question, where / how did you come to the conclusion that the executive branch handles interpretation?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "OpinionSuppository",
                                            "body": ">  how did you come to the conclusion that the executive branch handles interpretation\n\nWhat do you understand by the phrase \"faithfully execute\"?\n\nLet me break it down in Redditor cringe terms:  \nI think that your reply to my comment is not made in good faith. I will report your comment and call in a mod to be an arbiter of whether it's in good faith or not. \nIf I did so, I would be interpreting this sub's rules when reporting you. Mod will decide and tell me if my interpretation is correct or not by acting on my report or banning me.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "gsmumbo",
                                                    "body": "In that scenario, you aren’t interpreting and executing the rules though, right? You are free to report it all you want, but nothing happens until the mods interpret the rule. For us commenters, we are given a set of rules and are expected to follow them. We don’t get to change them if we don’t agree with them, and we don’t get to pick and choose how we want to interpret them. \n\n> Mod will decide and tell me if my interpretation is correct or not by acting on my report or banning me.\n\nAdditionally, aren’t mods able to act without users reporting comments and posts first? Aka they interpret the rules themselves, not just confirm if your interpretation that led to your report is correct or not?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "OpinionSuppository",
                                                            "body": "> you aren’t interpreting and executing the rules though\n\nNo, I am in fact interpreting the rules and trying to faithfully execute their intent every time I comment on here and when I report you.\n\n> Additionally, aren’t mods able to act without users reporting comments and posts first? Aka they interpret the rules themselves, not just confirm if your interpretation that led to your report is correct or not?\n\nIn any case, Elon Musk could buy Reddit, maintain the exact same Reddit Content Policy in text and still change the interpretation to an extent where you leave the site.    \nKinda like what RBG did to the SCOTUS for a while.  \nThat's the threat of activist judges for ya.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "hakun4matata",
                                    "body": "> You do not get hyper partisan FEMA employees ignoring houses with Trump signs after a major natural disaster unless you have politically purged the agency of opposing ideology.\n\nWhen and where did that happen?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "OpinionSuppository",
                                            "body": "https://www.reuters.com/world/us/fema-employee-fired-urging-team-not-help-homes-with-signs-backing-trump-2024-11-11/  \n\nI'm sorry that you only get censored news from Reddit. Even the propaganda press reported this!\n\n\nhttps://x.com/MarioNawfal/status/1855012196809334922",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "hakun4matata",
                                                    "body": "Why this accusing assumption? You don't know me, you don't know where I get my news from?!\n\nDo I get this right? One case about one employee out of 50'000 employees, makes FEMA \"hyper partisan\" and \"politically purged the agency of opposing ideology\"? One case? One employee?\n\nOh and that means you lied or didn't prove your claim yet, as you wrote \"employees\" but this evidence is only about a single employee.\n\nAnd don't get me wrong, this behavior is unacceptable and I'm glad that this employee was fired. And because I care so much about respecting people with other opinions, I hate to see Trump withholding federal aid multiple times for blue states.\n\nAnyway, back to your claim. How can FEMA be so so \"hyper partisan\" and \"politically purged\" when the Biden appointed director of FEMA says this after taking immediate action after this one case?\n>This is a clear violation of FEMA’s core values & principles to help people regardless of their political affiliation. This was reprehensible. I want to be clear to all of my employees and the American people, this type of behavior and action will not be tolerated at FEMA and we will hold people accountable if they violate these standards of conduct",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "myotherreddit13",
                    "body": "I have a law degree… so let’s do this. Actually, no it isn’t. It was designed as a foundational framework, with the powers of the executive branch subject to checks and balances by both congress and the judiciary. Historically, these powers were expanded and retracted over numerous administrations by congress and the judiciary. In other words, our system is set up so that Aladdin can’t unilaterally wish for more wishes.  \n\nSo, this executive order likely violates the separation of powers, improperly expands presidential authority, and undermines independent regulatory agencies. By subjecting agencies like the SEC, FTC, and CFPB to WH oversight, the order contradicts congressional intent, which established these agencies to operate autonomously and free from political influence. In statutory interpretation, courts consider the original intent of congress, and in this case, congress intentionally designed independent agencies to function outside direct presidential control. SCOTUS precedents such as Humphries Executor v U.S. (1935) and Morrison v Olson (1988) affirm that congress has the power to insulate agencies from executive overreach, making this order an unconstitutional expansion of presidential power. Additionally, the order could violate the Administrative Procedure Act (APA) by imposing new executive review requirements that are not authorized by law. Furthermore, by centralizing regulatory oversight in the executive branch, the order threatens the neutrality and enforcement of financial and consumer protections, potentially turning independent agencies into partisan enforcement tools. Given these legal weaknesses, the order is vulnerable to judicial challenges, potential injunctions, and congressional pushback. Ultimately, this executive order represents an unconstitutional power grab that disregards legislative intent and should be struck down by the courts. \n\nThat said, with Trump controlling congress, and a SCOTUS that is politically conservative, he has a strong chance of getting what he wants. \n\nThis rapid-fire executive order strategy is meant to overwhelm the system - flooding the courts and political landscape with extreme actions to see what survives legal and legislative challenges. It’s a “shock and awe” approach, straight out of Bannon’s playbook.\n\nQuestion for the Trump supporters who are constitutional originalists… do you really think that the power which Trump is currently wielding  (regardless of what it accomplishes) was intended by the founding fathers? They historically have moved to limit, rather than expand executive branch power. Even Thomas’ ruling in Trump v U.S. (2024) was widely seen a departure from this interpretation (because Thomas is an ardent originalist) and therefore more politically motivated.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "OpinionSuppository",
                            "body": "> I have a law degree…\n\nAre you associated with the ABA, the organization supporting the view that the ERA could be a part of the Constitution by Biden just tweeting about it?   \n\nI learned about the Constitution by hallucinating a hunting trip with the founding fathers and binge watched a few seasons of Suits. \n\nThey told me to prompt ~~ChatGPT~~ Grok to act as an ultra, mega based chad  constitutional lawyer for me so I can argue with you on Reddit.  \n\nBy the way, I hope Trump issues an EO banning the use of LLMs in courts soon. I'm a prompt engineer.  \n\n> That said, with Trump controlling congress, and a SCOTUS that is politically conservative, he has a strong chance of getting what he wants.\n\nThat's always what the balance of power boils down to, doesn't it? The Republican congress could give an entirely new classified agency to Trump and he could do whatever within it until it's discovered by the public. You really think I give a shit about procedure when pretty much none of the Marxist progressives give a shit about 1A/2A/10A or any laws relating to illegal aliens?  \nI'm lowkey hoping for the Supreme Court to classify Marxism as a religion and the LGBTQIAAAA21SP++ Pro Max flags as religious symbols so they can stay out of schools and government buildings forever.  \n\n>  do you really think that the power which Trump is currently wielding (regardless of what it accomplishes) was intended by the founding fathers\n\nI'm not sure if the answer to that question is relevant since they didn't intend for a lot of the things post FDR, or even post-1913. Trump's power, is only because of a massive federal government.  \n\n> It’s a “shock and awe” approach, straight out of Bannon’s playbook.\n\nThat's where you people go wrong...you really think Bannon's strategy is running the show? He is pretty good for getting elected but not much past the transition period. \n\nToo bad Susie Wiles won't leak the people behind every decision so liberals can scream at their families.\n\n>  the SEC, FTC, and CFPB \n\nYou really think FCC, with Brendan Carr or Ajit Pai acts as an independent agency? The D commissioners at least fake being nonpartisan by not posting Trump memes on X but independence and bipartisanship are largely a farce now. But nobody is independent or non partisan in an age when Judges like Paul Engelmayer can restrict the Senate confirmed Scott Bessent from doing his own job by restricting his access to the Treasury systems.  \n\nCFPB has no oversight from anyone. It's an entirely unconstitutional agency.  And the FTC just helped bankrupt Spirit Airlines.  These 3 agencies simply exist so that Nancy Pelosi can do insider trading while her wall street friends can short companies before these agencies issue their rules or fines.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "myotherreddit13",
                                    "body": "No, I’m not associated with the ABA - but not sure how that is relevant. LLM prompt engineer? Good for you. You can’t use ChatGPT to argue a case, it isn’t great at citing cases to support an argument. It just makes stuff up. But sure… I’ll approach this with a more casual tone… So anyone who opposes an overreach of power by the executive branch… no, sorry, only when Trump is president - is a Marxist? Lol. What’s the conservative equivalent of TDS? hmmmm…. Let’s call it LDS? And do you really want to bring up the separation of church and state? While the Christian right, through Trump as their new JC, is trying to make public schools post the Ten Commandments in classrooms… and he is trying to direct federal funding to religious schools. And no, I don’t think Bannon is running the show, he just had a good idea that the authors of Project 2025 are currently leveraging. And what do you know of investor protections and the SEC? I am a consultant in the investment industry and I work for investors to protect investors - but please, do educate the rest of us on your vast knowledge of the U.S. securities regime and how deregulation would make America great again… just like in 2008. Good times! And I fully agree that congress should not be allowed to trade stocks - the Stock Act (2012) attempted to address that, but no one (including the GOP) will enforce it. You think Trump and Musk will? Lol! Nancy Pelosi (and her husband) would have been arrested for insider trading if she wasn’t a U.S. rep. And Trump would be serving 5 to 10 if he wasn’t the president. So I guess the whole system is fucked. The issue here is, we fundamentally disagree on how it should be un-fucked.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "OpinionSuppository",
                                            "body": "> You can’t use ChatGPT to argue a case\n\nYou could have asked ChatGPT to split your comment into Reddit-formatted paragraphs.  \n\n> it isn’t great at citing cases to support an argument\n\nSeemed to have worked well enough for you to use it in your original reply. I didn't even need an AI checker to detect GPT but the checker confirmed it.    \n\n> So anyone who opposes an overreach of power by the executive branch… no, sorry, only when Trump is president - is a Marxist\n\nAnd anyone opposing an overreach of power by the activist judges or unelected bureaucrats is a fascist Nazi? Because that's what most people with NS would accuse Trump of being.  \n\nThere's a fundamental disagreement and we cannot agree to disagree anymore. Just work harder to convince people against Trump on Reddit as a digital soldier of the #resistance and maybe that'll help for 2028. Or maybe another lab leak and truckloads of ballots. \n\nWhite House is posting deportation ASMR and Trump King pictures. The executioner of DOGE just had his 13th kid out of wedlock and nobody gives a fuck. Blackmail and gaslighting don't work anymore. \n\nIf you do not recognize the far left Marxists taking over your formerly neoliberal, working-class aligned party then it will be only a few years until you fly a communist flag. Or if you are in support of Marxism then you're probably just gaslighting TS anyway. \n\nI'm quite young, would have called myself a socialist before Trump...but it seems pretty clear that the emotional blackmail to erode 1A, 2A, etc. is necessary because Marxism is incompatible with these \"individual rights\".  \n\n> While the Christian right, through Trump as their new JC, is trying to make public schools post the Ten Commandments in classrooms… and he is trying to direct federal funding to religious schools\n\nI'm not born Christian and I'm still not quite sure if I'm one but I respect them more than the others because I live in a Western society. When the other side unironically promotes Satan worship as their religion I'd like to side with the \"good\" guys.   \n\nI didn't care about all of the \"slippery slope\" warnings until 10 years passed and I realized that we're at the bottom of the slope with people unironically asking for pedos to have reduced sentences and what not.   \n\nUltimately the world as a whole is a lot less religious now (except for Islamists in the West - somehow more extreme than many Arabs in ME) so I don't think it is a fair comparison. Wokeism on the other hand...\n\nI consider large churches to be institutions like any other, and my respect for them is the same. Especially after USAID revealed their hand in human trafficking migrants with billions in taxpayer funding.    \n\nYou can say that the far left made me try to become religious again after my religious parents turned me atheist. So good job on that.    \n\nTrump is a New Yorker at heart and I really don't think he is religious at all. Vance has a Hindu wife. So I'm really not seeing the slope to Christian nationalism as you leftists like to put it. They respect secularism more than the Democrats who have no respect for Hindus and Christians both. And arguably they seem to be fine with the \"river to the sea\" crowd posting literal Nazi stuff on TikTok.  \n\n>  how deregulation would make America great again… just like in 2008\n\nIt's not about regulation or deregulation really. We all witnessed GME and naked shorting abuses under Biden. Now after 4 years of Biden, a majority of the trading happens in dark markets.  That change happened under the leadership of the same party as Warren, did it not?  \nGary Gensler pretending to care didn't help a single bit.  \nIt just seems clear that Wall Street has 2 factions - bulls and bears and the \"bears\" hoping on the downfall of humanity will do anything to make it happen. I'm not surprised Soros spent so much to resist Trump when Trump made him lose billions from shorting.  \nI hope Trump reforms the shitty Cede & Co system, makes DRS easier, and nukes CFTC & SEC with completely new people and forces FINRA to do their job.\nThese agencies are simply a tool for the big banks to pat themselves on their back. CFPB is a business harassment tool for Warren. Just because the CFPB and FTC do SOME good work doesn't mean they're excused. \n\nThey only exist as a facade for big institutions to say they're following the rules and occasionally pay small fines to keep up the facade - they seemed doing so necessary to keep the OWS crowd from waking up again. \n\nBut those same fines are quite large to smaller banks and businesses and only hurts them. Especially when a lot of them turn out to be based on no laws. These agencies operated like courts of equity/chancery but without the due process part.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "hakun4matata",
                                                    "body": "> If you do not recognize the far left Marxists taking over your formerly neoliberal, working-class aligned party then it will be only a few years until you fly a communist flag. Or if you are in support of Marxism then you're probably just gaslighting TS anyway.\n\nAny source for this?\n\nEvidence shows that the democrats moved much less to the left compared to how much the republican party moved to the right, since the 70ies.\n\nThe democrats would cover everything in Europa from far left to right of the middle in the political landscape. The republicans would cover right to far-right.\n\nBiden would be in the middle, just slightly to the left, in Europe.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "OpinionSuppository",
                                                            "body": "> Evidence shows that the democrats moved much less to the left compared to how much the republican party moved to the right, since the 70ies.\n\nAny source for this?  \n\nQuite ironic that you ask for a source two times (especially the FEMA one, first result on Google) and then immediately comment \"evidence shows\" without linking to evidence\n\nHere's my source: https://www.ft.com/content/73a1836d-0faa-4c84-b973-554e2ca3a227  \n\nThe left's shift on various policy positions especially immigration, [DEI/affirmative action](https://slate.com/human-interest/2014/02/affirmative-action-its-time-for-liberals-to-admit-it-isnt-working.html) and [freedom of speech](https://pacificlegal.org/aclu-gives-up-on-free-speech-we-are-still-fighting/) are documented quite well (see dates).\n\nLike 99% of the citations to your quote can be attributed to a graph from [this study](https://www.pnas.org/doi/10.1073/pnas.2102149118) which uses [the DW-NOMINATE method](https://en.wikipedia.org/wiki/NOMINATE_(scaling_method\\)). It is little known outside of academia and liberal news media, because people (especially on the right) simply don't care about being told something when it can be judged collectively by everyone on an individual basis. You will never see [criticisms of the NOMINATE](https://nationalaffairs.com/publications/detail/the-mismeasurement-of-polarization) BS on your news feed because the media itself is a major proponent of the far left ideology. \n\nMeanwhile Trump's position on things have remained [relatively unchanged since the 1980s](https://www.npr.org/2017/01/20/510680463/donald-trumps-been-saying-the-same-thing-for-30-years) - this fact a little unknown. His positions and views are more likely to align with the \"antifa\" that actually fought the Nazis than the communist terorrist group known as antifa today.\n\n> democrats would cover everything in Europa \n\nEurope's welfare and far-left aspirations are solely due to the United States policing the world and massively spending on military, while benefiting from unfair trade deals, regulations and trade deficits. Europe's [arrogance and hypocrisy](https://www.nysun.com/article/europeans-laughed-at-trump-over-russian-gas-no-longer) are the sole reason for their current situation with Russia. \n\nIt's unfortunate but the Europeans haven't realized that America has already moved past just \"left/right\" and we have an entire political compass (r/PoliticalCompassMemes). Europe would be \"AuthLeft\"...in line with Communism. What you people call \"far right\" are more in line with \"LibRight\" or Libertarianism which is in favor of free speech and not against it. [There are people being arrested for silently praying outside abortion clinics in Europe](https://reason.com/2024/10/17/british-man-convicted-of-criminal-charges-for-praying-silently-near-abortion-clinic/) - which goes against not just freedom of speech but also freedom of religion.\n\n> Any source for this?\n\nMy advice would be to join less-censored platforms (unlike Reddit) and let your own brain decide if society in general is rightward or towards the far left.  \n\nI think the Communists would have succeeded in their mission if it wasn't for their leftist suicidal empathy for Hamas terrorists - that made free Palestine synonymous with Hamas and then the Hamas supporters started posting calls for another Holocaust. The bipartisan TikTok ban in America wasn't over the communist China ties (for the Democrats)...[it was over the free palestine stuff](https://www.middleeasteye.net/news/us-tiktok-ban-linked-israel-china-insiders-reveal). \n\nAccording to your world view, I am far right...The media constantly publishes news articles about so called far right organizations like \"Patriot Front\" - except that I have never come across any of their stuff personally nor on social media. They wear masks (which only leftists do - right wing protests never have masks), all of them look fit (like they all would pass fitness checks for law enforcement) and so on. Common people [see through this BS](https://x.com/search?q=patriot%20front%20fed) trying to pass off some shadowy groups as far right. Most of what was left of the Democrats and left wing was funded by taxpayers across the West using foreign aid and grants - you will see a rapid rightward shift everywhere now those funds have been cut off because the media propagandists won't get paid to keep up the illusion anymore.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Ice_1669",
                    "body": "Isn’t the constitution also clear that the president is not accountable to the people. Why do you think Trump is justifying these changes when even he wasn’t elected through a popular vote?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OpinionSuppository",
                            "body": "The electoral college is still a form of democracy. It's just not a direct democracy. Not really getting your point here?   \n\nAre you talking about the fact that he got 49.8% of the popular vote after California finished counting their mail in ballots? Or are you saying that the electoral college is undemocratic? Because caring about pluralities, minorities and states' rights when forming a democratic election process does not nullify that America is a democracy and a republic.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ok_Ice_1669",
                                    "body": "> Not really getting your point here?\n\nTrump is saying that he’s drawing on the original intent of the constitution but the original intent was to insulate the president from the people. That is why electors were originally chosen by the state legislatures and not the people. \n\nHamilton argued for a popular vote for electors and he lost that argument in the constitutional convention. \n\nSo, this isn’t just Trump never reaching a majority. It’s about the original intent of the constitution - which Trump is invoking - being at odds with his assertion that the president is accountable to the people. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "OpinionSuppository",
                                            "body": "I don't read into the EO that way at all;   \nI just see the EO # as a citation to use when firing insubordinate people and to stop agencies like the EPA or FTC from making and enforcing rules that he disagrees with. He wants people to sue against the EO so that a single court case can ensure that his other actions are insulated from lawfare. It's political chess.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ok_Ice_1669",
                                                    "body": "This section from the fact sheet:\n\nENSURING A GOVERNMENT THAT ANSWERS TO THE PEOPLE: This order fulfills President Trump’s promise to restore constitutional governance and accountability to the entire executive branch.\nExecutive power without responsibility has no place in our Republic. The United States was founded on the principle that the government should be accountable to the people. That is why the Founders created a single President who is alone vested with “the executive Power” and responsibility to “take Care that the Laws be faithfully executed.”\nVoters and the President can now hold all Federal agencies—not just Cabinet departments—responsible for their decisions, as the Constitution demands.\n\nIf the constitution demands responsibility for decisions, why is the executive branch- who is insulated from the people - a better choice than congress who are directly elected?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "OpinionSuppository",
                                                            "body": "> why is the executive branch- who is insulated from the people \n\n\nEver heard about a thing called elections?",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "OpinionSuppository",
                                                            "body": "> directly elected?\n\nMoving the goalpost? The electoral college is as much of a part of the constitution as Article 1, 2 and 3. Do you only acknowledge parts of the constitution?  \n\nThe Presidential election is an election and part of a democracy, period.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Ok_Ice_1669",
                                                                    "body": "> Moving the goalpost?\n\nAbsolutely not. The topic of conversation has always been Trump’s populist justification for this EO. Your refusal to engage with Trump’s logic answers my question better than you will ever know. \n\nThanks!",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ClevelandSpigot",
            "body": "Oh, yeah.  Definitely good.  There seems to be some confusion among some people on what authorities the President has, over which subjects, and the lengths that the President can affect them.  They seem to think that it is a vague subject.  Basically, if it is a department that falls under the Executive Branch, the President has almost full control of it (notice I said \"almost\", for the lawful-evil lawyers out there), and takes responsibility for them.\n\nBut, everyone is burying the lead on this.  To use another euphemism, they can't see the forest for the trees.  This actually *limits* the power of the Executive Branch.\n\nUp until now (and you may have heard rumblings about it underneath the everyday cacophony) the various agencies in the Executive Branch had unmitigated power.  The FDA absolutely controls what substances are legal, and how long the process to approve them takes.  The FBI, CIA, and ATF are just allowed to run amuck.  The EPA can levy incredibly heavy fines, and/or shut down entire companies or industries, without there being a day in court over the matter.  This is abuse.  This is authoritarian.  It can be leveraged and politicized.\n\nTo use parlance that Liberals seem to understand, none of these people are elected, either.\n\nAnd that is how the Executive Branch has been acting for the past 35 years.  Completely unchecked.  No one taking responsibility for anything.  Waco?  Naw.  Ruby Ridge?  Naw.  Deploying our military to destroy far away places and die in useless conflicts for decades?  Naw.\n\nThis Executive Order changes that.  It says that it is the President's authority and responsibility (and the Attorney General's, as well as anyone they deputize for the task) to decide how the Executive Branch functions under our Constitution and laws - not anyone else, including departments within the Executive Branch itself - and the other two branches of our government are there to check that.\n\nThe key word here is \"*responsibility*\".  It is saying that the President, and those who he imparts authority to, can do this stuff, but they will also be held responsible.  It seems like what is meant by that is a bit more than just being able to vote-out that President every four years.",
            "score": -7,
            "replies": [
                {
                    "author": "myotherreddit13",
                    "body": "Are you implying that federal agencies are undemocratic simply because they are unelected? Every agency was created by Congress, whose members are elected by the people to be the voice of the people. These agencies operate under congressional oversight, meaning they are accountable to the legislative branch, which has the power to modify, defund, or dissolve them if necessary - if it is the will of the people. \n\nMoreover, agencies are given rule-making authority precisely to avoid the inefficiencies of excessive bureaucracy - the very red tape that all of us oppose. They are staffed by experts in their fields, not politicians, ensuring that regulations are based on technical knowledge rather than political maneuvering.\n\nThis is fundamentally different from a president granting an unelected official the unilateral power to mass-fire federal employees. Unlike agencies created through legislation and subject to congressional oversight, handing unchecked authority to a single official bypasses constitutional checks and consolidates executive power in a way that directly undermines democratic governance. Dismissing agencies as “undemocratic” while advocating for unchecked executive purges is not only inconsistent but also far more dangerous to the balance of power.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "ClevelandSpigot",
                            "body": "Of course it's different.  It always is when a Democrat is involved.\n\nReally.  None of your lofty treatise above has worked well at all over the past 35 years.  In pragmatic reality, what actually ends up happening is that you get one faceless agency \"answering\" to another faceless committee.  Strongly-worded letters are sent.  No one is held accountable at all. We have seen this happen repeatedly, over and over, every single time.  I cited some examples above.\n\nSince not one person oversees and is responsible for just one thing, there is Spiderman finger-pointing and [three monkeys](https://th.bing.com/th/id/R.07a24c3f647acf7b5524eb64c3977d15?rik=2EHiXeo7qEkipw&riu=http%3a%2f%2fimages4.fanpop.com%2fimage%2fphotos%2f14700000%2fSee-no-evil-hear-no-evil-speak-no-evil-monkeys-14750406-1600-1200.jpg&ehk=75Isa7O3UzCv01asN4SWSOuPTaXlBR7d3cW%2f%2fEe91%2bA%3d&risl=&pid=ImgRaw&r=0) all over the place.  Sure, there are hearings in front of Congress probably every single day about something or other, but nothing ever comes of them.  And, based on who is in charge of these Congressional hearings, these subjects automatically become political.\n\nI'll submit the January 6th hearings as a prime example.  Very political in who was selected to be on the committee, and what evidence was allowed to be heard publicly, and whether such Robert's Rules as hearsay and perjury were going to be taken seriously (Cassidy Hutchinson).  Oh, and the primetime televised \"emergency session\" that everyone needed to see.  And, yet, nothing came of any of it - either way.  Useless all around.\n\nRand Paul has repeatedly pointed out how the \"expert\" Dr. Fauci - the highest-paid government employee at the time - had perjured himself in front of Congress by lying about gain-of-function.  Dr. Fauci also lied about the [six-foot social distancing rule being based in science, and that masks are effective](https://www.politifact.com/article/2024/jun/06/did-fauci-say-he-made-up-covid-19-rules-on-social/).  The Covid shot will protect you from contracting and transmitting Covid.  He used [poll numbers to determine herd-immunity](https://thehill.com/policy/healthcare/531611-fauci-herd-immunity-could-require-90-percent-of-country-to-be-vaccinated/).  Nothing happened.  He retired as a very wealthy man.\n\nThe Twitter Files.  Nothing happened.\n\nOperation Fast and Furious - aka \"The Gunwalking Scandal\".  Nothing happened - except the whistleblower was fired.\n\nThe last time that I can remember anything of substance coming out of a Congressional hearing is when Oliver North was arrested for the Iran Contra debacle - in the 1980s.\n\nWell, I stand corrected.  The scandal around Crossfire Hurricane did see the upper echelon of the FBI get removed after those hearings.  McCabe, Brennan, Strozk, Page (Lisa), etc.  But, I don't think that Congress had anything to do with that.  I think that was more along the lines of the FBI jettisoning trash in order to save itself from sinking.\n\nReally, this should have happened back when [Clinton, Gore](https://youtu.be/RMBUuabroiY?t=59), and [Obama](https://youtu.be/LtoqHGbO7Ow?t=275) first proposed these actions to happen.  Ironically, it was Obama's US Digital Services that Trump revamped into DoGE, in order to be doing the things that he is doing now - because it wasn't happening before.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fligglymcgee",
                    "body": "Almost all of the commissions named in the EO have been overseen by presidential nominees confirmed by Senate approval, what \"unmitigated power\" are you referring to? Your stance that the FDA, FBI, CIA, ATF and EPA are \"running amuck\" and will be less politicized under this EO doesn't make sense to me. For one, the FDA, FBI, CIA and ATF aren't directly named in this EO. Also, who's running them? How would shifting their oversight directly under the President and OMB instead of sharing that with the Senate and Congress somehow limit the power of the Executive Branch? Are we supposed to just agree that they are only \"so-called\" independent because the EO asserts that claim?",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Ok_Ice_1669",
                    "body": "> Deploying our military to destroy far away places and die in useless conflicts for decades? Naw.\n\nCurrently, the president can launch nukes and end life on earth in 5 minutes and no one can stop him. Should that require a declaration of war by Congress?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrhymer",
            "body": "This is a reaction to the overturned Chevron decision. Departments within the executive were interpreting the meaning of the laws governing the areas they regulated. Trump is ensuring that in terms of the executive branch that the president is the one who interprets the laws.",
            "score": -3,
            "replies": [
                {
                    "author": "myotherreddit13",
                    "body": "Do you really want the next Democratic president deciding how laws are interpreted? And just to be clear - Loper Bright Enterprises v. Raimondo (2024) did not grant the executive branch the power to interpret the laws governing federal agencies. It shifted that authority to the judiciary, reinforcing the courts’ role in determining how statutes are applied rather than deferring to agency interpretations. I don’t love this as our federal judiciary has become a lot more politically activist - but… it’s much better than giving the power to the very partisan president.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": ">Do you really want the next Democratic president deciding how laws are interpreted?\n\nYou left out this part - for the executive branch and only for laws that empower rules and regulations imposed by the executive branch. This is opposed to the unelected employees of departments interpreting laws that empower rules and regulations imposed by the executive branch.\n\nWith that scope defined I think all future presidents should be the interpreter of these specific laws. I am not certain we will have another democrat president. I think the democrats will have to rebrand after the Biden / Harris nightmare.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Glad-Ad-4390",
                                    "body": "Do you foresee tRUMP taking more control bit by bit, and what, if anything, do you feel the effects would be for the USA?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "I do not see Trump as an evil character. The amount of control he must take is in direct proportion to the amount of lawfare and resistance the democrats impede with.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Glad-Ad-4390",
                                                    "body": "Do you believe in our constitution’s system of checks and balances?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "The constitutions checks and balances were destroyed with the passing of the 17th amendment.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Glad-Ad-4390",
                                                                    "body": "I don’t see that. What in the 17th amendment gives you the impression that checks and balances were destroyed with its passing?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": "With the 17th amendment the United States of America cut state governments out of the federal process. Foreign governments have diplomats that can petition congress and the executive. States have no formal or even informal role in the federal government.\n\nLook at the exponential growth of the federal government after 1913. That would not have happened if the stated governments appointed senators.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mrhymer",
                            "body": "> It shifted that authority to the judiciary, reinforcing the courts’ role in determining how statutes are applied rather than deferring to agency interpretations.\n\nIt did not. The judiciary can only act on a lawsuit. The agency must regulate before the judiciary is even involved. What this ruling said was that the agency interpretation of the law no longer  supercedes the court. This will also be true of Trump's interpretation of the law.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thatusenameistaken",
            "body": "At a glance, this isn't about executive vs. judicial branch, this is about bureaucratic overreach.\n\nYour questions start out merely misleading but by by #3 you fully out yourself as maliciously disingenuous.\n\nYou and people like you are why he won and why I switched from undecided.",
            "score": -3,
            "replies": []
        },
        {
            "author": "Amperage21",
            "body": ">Article II\n\n>Section 1\n\n>The executive Power shall be vested in a President of the United States of America.\n\n\nCould have saved a bunch of time and paper. This order doesn't do anything that already wasn't the case 250 years ago. Except maybe remind people of that being the case and signifying the desire to rectify a system that has ignored it.\n\nIt's good.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Trumpdrainstheswamp",
            "body": "Love it.",
            "score": -1,
            "replies": []
        },
        {
            "author": "coulsen1701",
            "body": "It’s in keeping with SCOTUS overturning Chevron and establishing a new process for how regulatory agencies create rules, rather than usurping congressional authority to invent new “laws” which they often enforce capriciously via state violence. Im largely okay with it, my hesitation being that I would rather many of those agencies be torn down, burned, allow every American to piss on its ashes, then salt and raze the earth upon which they were built.",
            "score": -8,
            "replies": [
                {
                    "author": "thatguywiththecamry",
                    "body": "Could you give a real-life example for us how a regulatory agency would invent and enforce new “laws” through state violence, to such an extent that burning it down and pissing on such an agency would be remotely justified?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Let us start with the ATF shall we?\n\nThe ATF has actively altered & reinterpreted the laws of Congress relating to firearms for over a half century, including the definition of what is a firearm, & has recently attempted to redefine firearms to expand their own influence & prosecution beyond the receiver requirements. This is the sole organization from which these definitions come from with no civil authority or Constitutional basis. It is to begin with a violation of the Second Amendment, most actions & much of its existence is a violation of the Constitution of the United States of America.\n\nThese policies are enforced as federal law, it is felony to disobey them & quite a number of people have been killed over these. Most infamously is Ruby Ridge. Further, the courts decided that violations of the law & tyrannical murdering of civilians is acceptable if it is done in the duties of an officer.\n\nWhat coulsen said is an understatement.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "thatguywiththecamry",
                                    "body": " But with the ATF, along with other regulatory agencies who have altered and reinterpreted laws, wouldn’t you agree that a review by the judiciary (which for the ATF has had multiple precedents over the past fifty years) is in line with the proper constitutional function of government, while the executive order referred to in this post is not?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "I disagree heavily. I see that as completely cutting out the civil authority, the electorate, in influence in law. Especially so if these organizations are in opposition to this order. This order does not remove judicial review but rather requires the approval & responsibility of the elected President or those he directly invests with authority to propose any challenge to interpreting the law. Without the President these agencies have absolutely no Constitutional standing in the first place & are inherently unconstitutional. They can only exist by the authority of the President & are subject to the office. ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gsmumbo",
                    "body": "> rather than usurping congressional authority to invent new “laws”\n\nIsn’t that exactly what an EO does?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "fullstep",
            "body": "I don't know how you could read the text of your own link and come away with such a twisted and distorted interpretation of its contents. It seems as if it is deliberate given the way you took quotes and presented them fully out of context, stringing them together in a way that makes it seem something sinister is at play.\n\nNot that I think OP wants to know the truth, as this thread seems to be an intentional lie, but for the benefit of the others... He is merely reasserting the power of the president over the executive branch, something that is clearly granted in the constitution and is 100% uncontroversial, unless you prefer rouge agency bureaucrats operating without the oversight of our democratically elected leaders. He's putting these \"independent\" agencies on notice that the party is over.",
            "score": -7,
            "replies": [
                {
                    "author": "moorhound",
                    "body": "So I take it that, if a Democratic president is elected in 4 years, you'll be fine with them also exercising these powers?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "fullstep",
                            "body": "Why wouldn't I?",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Orion032",
                                    "body": "What would you say to the idea that independent agencies are supposed to be non-partisan, and holding them directly accountable to the president and forced to carry out the law as the president sees fit would go against that?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "fullstep",
                                            "body": "To suggest that the agencies of the executive branch should not be accountable, or take direction from the president is among the more absurd statements I've seen on this subreddit. The president runs the executive branch, as mandated by the constitution, period.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Orion032",
                                                    "body": "But would it not be possible and even highly probably that an independent agency, such as the EPA, could be bent and directed by the whims of a specific party for the benefit of that party over the benefit of the people?",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "No-Dimension9538",
                                            "body": "Personally, I like the *idea* but “non-partisan” tends to mean “whatever party gives me the most kickbacks” in addition to “non-partisan” being actually impossible the majority of the time due to myriad factors, our 2 party system being one of them. For example, the Supreme Court justices get lifetime appointments to prevent partisanship and promote longterm legal stability. Do you believe the current Supreme Court to fulfills this intent?  I believe partisanship is preferable to not having oversight.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Orion032",
                                                    "body": "How is holding them accountable to the president different than holding them accountable to advisory boards as is the case now?",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gaxxz",
            "body": ">Do you agree that the President alone should have the power to decide what the President can or cannot do and what powers the presidency does or does not grant?\n\nThat's not what it says.\n\nYesterday's EO relates to independent regulatory agencies like the Securities and Exchange Commission and the Federal Communications Commission. The provision related to legal interpretation applies to the executive branch. In other words, if the head of the FCC claims the law says one thing and the AG claims it says another, the agency must defer to the AG.\n\nI work a lot with SEC regulations. Generally the SEC is in line with the administration since the president appoints the SEC chair. But this will definitely result in more direct White House control. Given how ridiculously aggressive the last SEC was, that's probably not bad.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Raider4485",
            "body": "It seems like Trump is reasserting his executive power within his own branch of government. Regulatory agencies have essentially taken much of the power of the branch in how they execute the law, often making it difficult for the president to actually control their own branch. This has nothing to do with the power of the courts or checks and balances. I don't really see how this can be challenged unless I'm reading the text incorrectly.",
            "score": -6,
            "replies": [
                {
                    "author": "SELECTaerial",
                    "body": "Do you see any value in having independent agencies? Are they better or worse for a democracy?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Raider4485",
                            "body": "Not really. I support the existence of executive agencies because they're obviously needed for efficiency purposes, but I don't support the belief that they need to operate independently. This creates a deeply entrenched bureaucracy that subverts the only elected official of the branch in which it operates in, and who is supposed to lead that branch.",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "WulfTheSaxon",
                            "body": "The framers said that they were worse – see Federalist 70 for example.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cchris_39",
            "body": "He has final authority over the regulators anyway so this is just declaring the obvious.  Part of his promise to reign in their power over us, so good for him.\n\nIt should go without saying, but this EO is not directed at usurping judicial branch or others.",
            "score": -24,
            "replies": [
                {
                    "author": "xZora",
                    "body": "> It should go without saying, but this EO is not directed at usurping judicial branch or others.   \n  \n\n \nBut what about their stance that judges can't overrule the President? Didn't we grow up being taught about the system of checks and balances? What evidence from the last 10 years do you use to validate that Trump is not trying to supercede the judicial branch or others?",
                    "score": 30,
                    "replies": [
                        {
                            "author": "WulfTheSaxon",
                            "body": "> But what about their stance that judges can't overrule the President?\n\nThis says no such thing. Checks and balances have nothing to di with parts of the Executive branch fighting each other. Please read Hamilton’s Federalist 70 and then Scalia’s dissent (now widely seen as correct) in *Morrison v. Olson*.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SpatuelaCat",
                    "body": "This is not stating he has final control over the regulators this is stating he can choose what the limits of presidential power are\n\nWhy should that go without saying? Trump, Elon, and Vance have been open lately about defying the courts and this executive order very clearly states that the president (not the courts) decided whenever the president has gone too far",
                    "score": 20,
                    "replies": [
                        {
                            "author": "itsmediodio",
                            "body": "That is not what it is saying. You are wrong. The TS had the correct interpretation. Even the most critical reading of this order does not in any way state that he's declaring that courts no longer have power of judicial review and no news station is reporting it as such.",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "SpatuelaCat",
                                    "body": "If the president is allowed to decide what is or is not a constitutional power based solely on the presidents interpretation (as stated in this executive order) then what can the courts do in judicial review? This executive order directly states their interpretation of the constitution does not matter if it disagrees with the president’s interpretation\n\nEspecially considering Trump, Vance, and Elon’s recent stance that the president doesn’t have to listen to judges or the courts",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "itsmediodio",
                                            "body": ">If the president is allowed to decide what is or is not a constitutional power based solely on the presidents interpretation (as stated in this executive order)\n\nThis is not stated.\n\n>This executive order directly states their interpretation of the constitution does not matter if it disagrees with the president’s interpretation\n\nIt does not. \n\n>Especially considering Trump, Vance, and Elon’s recent stance that the president doesn’t have to listen to judges or the courts\n\nThis never happened either.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "MotorizedCat",
                                                    "body": ">> the president doesn’t have to listen to judges or the courts\n\n\n>  This never happened either. \n\n\nWhat about the comments from Vance about 10 days ago? I've put a link in a comment one level up.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": "Vance's comments were that judges cannot impede the president's legitimate powers. This is correct and constitutional. The power to expand or shrink executive department agencies is vested in the executive, not the courts.\n\nWhen a judge puts an injunction on a legitimate act of the president that is within his explicit powers as executive that's not constitutional. Anymore than if the court put an injunction on Congress' ability to pass legislation.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "fistingtrees",
                                                                    "body": "So doesn’t this EO allow Trump and his AG sole discretion to decide which of Trump’s acts fall under his “legitimate powers”?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "proquo",
                                                                            "body": "No, and I'm not sure how you got that. Judicial review still applies. This EO only applies to the executive branch. This EO requires executive branch agencies to follow the president's directions instead of interpreting law on their own to decide how they execute policy. It reaffirms the president's constitutional powers. The Constitution explicitly vests all executive branch powers in the president.\n\nVance's comments were specifically in regards to the injunction placed against DOGE preventing them from accessing Treasury dept systems, despite DOGE and the Treasury being under the executive branch. This EO doesn't prevent an agency from obeying an injunction or order from a court.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "itsmediodio",
                                                            "body": "I see no comment or link.\n\nIf you wish you can post the link again, and ask me about it in the form of a question so that the automod doesn't delete your comment.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MotorizedCat",
                                                                    "body": "(Ok, I was under the impression that copy-pasting comments is frowned upon.)\n\n\nNews article: \"Vance says judges aren't allowed to control Trump's legitimate power\" https://www.nytimes.com/2025/02/09/us/politics/vance-trump-federal-courts-executive-order.html\n\n\nThis is just an example, it should be easy to find dozens of news reports from all kinds of outlets.\n\n\nHow do the administration's plans of ignoring court orders fit together with the discussion above? \n\n\nSpecifically since there were claims that judicial review of executive action will not be hampered - if I understood that point correctly?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "itsmediodio",
                                                                            "body": "Your link is behind a paywall, as are most NYT articles, I wouldn't use them as sources in the future were I you.\n\nI did my own googling and I'm guessing you're referring to this tweet.\n\nhttps://x.com/jdvance/status/1888607143030391287?s=51\n\nIf not, please correct me.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "proquo",
                                            "body": "> If the president is allowed to decide what is or is not a constitutional power based solely on the presidents interpretation\n\nThat's not what this says. This order requires the executive branch agencies to follow the president's interpretation of how the law applies to their agencies instead of determining their own interpretations. This reaffirms separation of powers, and prevents agencies from exceeding the confines of law or interpreting law in such a way that allows them to subvert the president's agenda.\n\nIt doesn't remove judicial review or the power of Congress to make law. It specifically referred to the Constitution's outline of the powers of the president.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "arensb",
                                                    "body": ">This order requires the executive branch agencies to follow the president's interpretation of how the law applies to their agencies instead of determining their own interpretations.\n\nSo if the president interprets a law one way, and one or more courts interpret that law a different, incompatible way, are agencies are to follow the president's interpretation, and not the court's? How, then, does this \"reaffirm\\[\\] separation of powers\" or \"prevent\\[\\] agencies from exceeding the confines of law\"?\n\nTo take an extreme example: if SCOTUS rules that everyone within the US's borders has the rights listed in the Bill of Rights, and the president says that \"if you see anyone near the border who looks Latino, shoot first, and ask questions later\", what should federal agencies do?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": "Judicial review still applies. The executive agencies just can't supplant the executive power of the president. The EO literally says nothing about other branches of government. It is the Executive's job to interpret and execute the law set forth by Congress. So every executive agency is supposed to fall in line with that interpretation rather than maintain their own disparate interpretations that are sometimes at odds with what the president wants.\n\nSCOTUS still has the right of judicial review over the executive branch.\n\n> \"if you see anyone near the border who looks Latino, shoot first, and ask questions later\", what should federal agencies do?\n\nYou made up a scenario that has nothing to do with this EO. SCOTUS has already ruled on the constitutional requirements for use of deadly force, has ruled on whether or not non-citizens are protected by the constitution, and the EO doesn't override law.\n\nExecutive Orders apply only to the executive branch and pertain solely to how the executive branch executes the law. The constitution clearly puts the power to execute law in the executive, and this EO reaffirms that which in turn reaffirms the separation of powers and the system of checks and balances.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "KnightsRadiant95",
                                                    "body": ">This order requires the executive branch agencies to follow the president's interpretation of how the law applies to their agencies instead of determining their own interpretations.\n\nSo if Trump interprets law Y and directs an agency to do X, but the Supreme Court says that's unconstitutional and a wrong interpretation and the agency cannot do X, then Trump says his interpretation is correct, who should the agency follow? Trump or the Supreme Court? \n\nBecause with this order  where \"only the president or AG can speak for the United States when stating an opinion as to what the law is\"? Or as you put it, the executive branch agencies will follow the president's interpretations. If the Supreme Court doesn't have the power to override and put a stop to what trump did because of this EO, the separation of powers and checks and balances are effectively dead.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "proquo",
                                                            "body": " > then Trump says his interpretation is correct, who should the agency follow? Trump or the Supreme Court?\n\nNo, again, no. You have no idea what you're talking about. This EO doesn't say Trump is the sole person in government who can interpret law. It says the president is the only one that can interpret law for the executive branch; the executive agencies cannot interpret it for themselves, especially where it contravenes the president's agenda (see ICE immediately after DACA was issued).\n\nJudicial review still applies. If the executive branch does something unconstitutional SCOTUS can still step in, and Congress can still pass legislation. The Constitution clearly establishes that the powers of the executive branch are vested in the president. This EO just makes it clear policy for all executive branch agencies that have acted semi-independent and requires them to report to the office of the president for accountability. The objections to this EO are all based on fundamental misunderstandings of the Constitution.\n\n> If the Supreme Court doesn't have the power to override and put a stop to what trump did because of this EO\n\nThe Supreme Court still has unquestioned power to determine the constitutionality of executive actions.\n\nHowever, if your question is what happens when there is an impasse, I'll note that historically the SCOTUS hasn't had any enforcement ability; see Andrew Jackson or Joe Biden. Biden famously bragged about pushing through loan forgiveness in violation of the SCOTUS and nothing happened.\n\nHowever, this EO doesn't give the president more powers than are already outlined in the Constitution and doesn't diminish the powers of the courts or the legislature.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cchris_39",
                            "body": "You mean how Biden kept defying the counts on student loan forgiveness?",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "pimmen89",
                                    "body": "So Biden did something wrong and that justifies tyranny?",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "kirils9692",
                                    "body": "He didn’t though? The SCOTUS struck down his mass forgiveness plan so he stopped that. \n\nHe decided to instead pursue more narrowly tailored forgiveness under other authorities. Congress has granted the president the power to forgive student loans in certain circumstances.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "riskyrainbow",
                                    "body": "Can you point me to which court order he defied? Biden abided by the order and went about taking a different avenue to achieve his goal. This is the way that presidents historically have responded to court orders. The idea that a president is within his rights to simply ignore federal courts is completely novel.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "cchris_39",
                                            "body": "Of course you never “ignore” a court order.\n\nLike you said, you just do what you want in a different way.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "riskyrainbow",
                                                    "body": "Are you aware that the Trump administration has quite literally been ignoring and violating court orders? He continued freezing federal funds after receiving an order to unfreeze them. That isn't working within the law to achieve the same goal, it's a direct violation. They are literally asserting that the courts have no right to check their power.\n\nThat's the difference I'm trying to demonstrate. Biden \"did what he wanted\" *within* the parameters set by judges. Trump is doing what he wants despite such parameters. Do you see the massive difference between these two things?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Significant_Map122",
                    "body": "Isn’t this the purview of the courts? It’s been a while since I’ve been in civics class but isn’t it:\n\nCongress makes the law\nExecutive enforces the law\nJudicial interprets the law\n\nWhy is this anti constitution move ok?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "WulfTheSaxon",
                            "body": "It’s not anti-Constitution. The Executive first has to interpret the laws in order to execute them, then the judiciary can review later if somebody claims the Executive got it wrong. This is only about who does that first step of interpretation within the Executive branch – the President or his inferior officers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "flowerzzz1",
                    "body": "And this section:\n\n“Sec. 7.  Rules of Conduct Guiding Federal Employees’ Interpretation of the Law. The President and the Attorney General, subject to the President’s supervision and control, shall provide authoritative interpretations of law for the executive branch.  The President and the Attorney General’s opinions on questions of law are controlling on all employees in the conduct of their official duties.  No employee of the executive branch acting in their official capacity may advance an interpretation of the law as the position of the United States that contravenes the President or the Attorney General’s opinion on a matter of law, including but not limited to the issuance of regulations, guidance, and positions advanced in litigation, unless authorized to do so by the President or in writing by the Attorney General.”\n\nAre you okay with the President interpreting the law using his “opinion” instead of leaving it to the Judicial branch? \n\nhttps://www.whitehouse.gov/presidential-actions/2025/02/ensuring-accountability-for-all-agencies/",
                    "score": 9,
                    "replies": [
                        {
                            "author": "cchris_39",
                            "body": "Yes the President determines the Executive branch’s position on laws, not the unelected regulators.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "flowerzzz1",
                                    "body": "Doesn’t the justice system over ride this? If they rule “a position” or interpretation of a law is in fact, illegal? You’re still in favor of the check and balance of the three arms correct?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Necessary_Sand_6428",
                                    "body": "So why do we need an EO?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 17,
                    "replies": [
                        {
                            "author": "cchris_39",
                            "body": "This came up in another thread.\n\nThe President is free to enforce or not enforce court decisions to the degree he sees fit, and all them do exactly that.  The risk is impeachment and removal by Congress.  There really isn’t much the judicial branch can do to the President.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "pimmen89",
                                    "body": "And if that decision would be to limit voting rights to the degree that the party in power can’t be voted out, the ruling party in both Congress and the executive can just declare tyranny forever with the courts interpretation of the Congress powerless to do anything?\n\nDo you think that’s what ”tyranny by the majority” means?",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "cchris_39",
                                            "body": "It’s a shot across the bow at the regulators.\n\nUntil proven otherwise there is no point in reading more into it.",
                                            "score": -5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "yumyumgivemesome",
                    "body": "If Congress writes legislation to form a Department of X, does Trump have the power to interpret that legislation as requiring the formation of a Department of Y?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "pliney_",
                    "body": ">Sec. 7.  Rules of Conduct Guiding Federal Employees’ Interpretation of the Law. The President and the Attorney General, subject to the President’s supervision and control, shall provide authoritative interpretations of law for the executive branch.  The President and the Attorney General’s opinions on questions of law are controlling on all employees in the conduct of their official duties.  No employee of the executive branch acting in their official capacity may advance an interpretation of the law as the position of the United States that contravenes the President or the Attorney General’s opinion on a matter of law, including but not limited to the issuance of regulations, guidance, and positions advanced in litigation, unless authorized to do so by the President or in writing by the Attorney General. \n\nWhat do you think about this section? It seems to indicate the all agencies and employees must look to the President and AG for interpretation of the law, not the courts. I interpret this to mean that government employees should continue with actions that have been deemed unlawful by the courts unless the President or AG agree with the courts interpretation. If there was a carve out in the section for court rulings then it wouldn't be as bad. But this seems pretty clearly aimed at giving the executive the authority to ignore court rulings it doesn't agree with.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "WulfTheSaxon",
                            "body": ">> No employee of the executive branch acting in their official capacity may advance an interpretation of the law as the position of the United States that contravenes the President or the Attorney General’s opinion on a matter of law\n\nThat just means that the position the Executive branch will take in court is the President’s. The court can of course say otherwise.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "cchris_39",
                            "body": "I don’t agree but fair point.  I took it more as Trump reiterating that he sets the position for the EB and the AG defends that position.\n\nI do however expect that he is not going to let rando circuit court judges stand in his way.  That kind of lawfare is over.  Until SCOTUS gives the final ruling he’s going to run right over that nonsense.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Shoddy-Cherry-490",
                    "body": "Isn’t this in principle a variation of the “Führerprinzip”, i.e. ascribing absolut and unwavering authority to the President over any member of the executive branch with regard to what actions/executive policy shall be interpreted as legal or illegal. \n\nWhat if, for example, the President unilaterally declares war based on a hypothetical argument by the Attorney General that in fact he has the legal authority to do so instead of Congress? Will the military have to follow him blindly because he is the commander in chief?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cchris_39",
                            "body": "Congress hasn’t declared war in 80 years.\n\nThe president is clearly CIC.\n\nI’m not sure I even follow the other.  Are you suggesting that somebody besides the president has authority over the executive branch?  I don’t think the constitution permits that.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Shoddy-Cherry-490",
                                    "body": "Neither has the President of the United States declared War on anyone in 80 years. But even in the absence of any official declaration of War by the US government, Congress has typically authorized military interventions or escalations of military interventions amounting to war such as in Vietnam, Kuwait, the Balkans, Afghanistan and Iraq. Of course not all military interventions were conducted with such congressional authorizations.\n\nIt seems to me there is a fine, but important distinction here between having authority over a subordinate and having absolute authority over that subordinate. So it begs the question about scenarios where a member of the Executive receives a directive from the White House or the Attorney General that certain parts of the law are (interpreted to be) no longer applicable - whatever they maybe - then the subordinate maybe forced to act against his/her better judgement and execute on orders that are patently illegal.\n\nAgain does it not seem similar to the \"Führerprinzip\", i.e. the idea that absolute obedience trumps the autonomous ability of any individual member of the government to exercise their own judgement. Isn't this contradictory to the more traditionally idea of governance that authority is delegated from above to subordinate entities and that the subordinate entity is required to report back to the entity from which power is delegated?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Glad-Ad-4390",
                    "body": "I’m thinking that it seems ok at the moment, but when ANY president flouts / ignores specific orders from a judge (not pertaining to the operations of the executive branch), where does that lead? Will regular citizens have any standing in our courts to do the same thing, using that as precedent? Is anyone here feeling just a little unsettled with the indications here? And if so how do you think it should be dealt with?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cchris_39",
                            "body": "Those are all good points.  I’m partisan so to me it looks like liberals have been accomplishing through the courts what they could never win at the ballot box going back at least to Roe.\n\nThis latest iteration of lawfare against Trump and anybody in his orbit, and the likes of George Soros pouring big money into getting extremely biased judges and prosecutors elected has taken it to obscene levels.\n\nThe fact that somebody is finally pushing back shouldn’t surprise anybody, but I don’t have any good solution for it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "Fine. It's a restatement of the first sentence of Article 2 Section 1 of the Constitution. \n>The executive Power shall be vested in a President of the United States of America. \n\nThere is absolutely nothing controversial about this.",
            "score": -8,
            "replies": [
                {
                    "author": "Ask-Me-About-You",
                    "body": "Why would Trump need an executive order when you claim the power is granted to him in the Constitution?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "WulfTheSaxon",
                            "body": "Because some people in the Executive branch are attempting to assume power they don’t have.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "WulfTheSaxon",
                                            "body": "It’s a warning again insubordination because many federal employees have gotten it into their heads that they aren’t accountable to the elected government, and it adds a new requirement to report new rules to the president before publishing them.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "maxington26",
                    "body": "What's the point of it, then?",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -27,
            "replies": [
                {
                    "author": "DungeonMasterDood",
                    "body": "What about checks and balances? I was learning as early third grade that the different branches of government exist to ensure we don't end up with a king. If the Supreme Court told Trump that he violated the law and his orders had to be reversed, would you be in favor of him ignoring their ruling?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "Charming-Rose",
                                    "body": "So, actually curious, are you in favor of true monarchy / autocracy or other forms of authoritarian governments? Because it seems that is what you are advocating for. If so, are other supporters also in favor of this type of government? And if not, how do you feel these moves fit into a balanced democracy?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Azianese",
                                                    "body": ">I believe this is balancing the system.\n\nBalance between what?",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SpatuelaCat",
                    "body": "That’s not what this executive order is, did you read it by chance?\n\nThis order states that the president alone has the power to choose whenever the president is or is not overreaching his power\n\nDo you agree that only the president should be able to decide whenever the president is doing constitutional things and what the limit to presidential power is?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "cometshoney",
                                    "body": "You believe he should ignore the courts? Do you hold this same belief for yourself? Is it okay for the rest of us to just ignore the courts? Are you backing ignoring all courts or just a few? I mean, if you're court ordered to pay child support, you believe the court should just be ignored? After all, what's good for the goose is good for the gander. Where, if anywhere, do you draw the line?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "cometshoney",
                                                    "body": "But, you are. You keep referring to judicial review, but the bottom line is the judiciary took that power for themselves in what, 1803, if I remember law school correctly, and no one ever tried to undo that in 222 years. Is law school where you learned about judicial review, too? Every decision the courts make affect someone. Otherwise, it wouldn't have been in court in the first place. I would think you'd be thrilled with how the power of judicial review has been working in the last 6 years or so as a Trump supporter, yet the minute they put the brakes on what's happening today, you're up in arms over judicial review? I'm not very clear on what mandate of the people you're speaking of, either. Is there some concern on your end that SCOTUS might not get with the program?",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "OpinionSuppository",
                                            "body": "Trump has the army, the legislature (so far) and the executive branch under him.   \n\nYou or the person you're replying to likely is not an elected official with Presidential or State powers unless one of the Governors just happens to be lurking on Reddit.   \n\n> You believe he should ignore the courts?\n>  I mean, if you're court ordered to pay child support, you believe the court should just be ignored?  \n\nA actual, comparable scenario would be a Democrat governor being ordered to pay child support by an activist judge appointed by a Republican governor for a child that is  proven to not be his child by a paternity test just to spite the Democrat governor or get him impeached.  \n\nThe Democrat Governor would have the support of the majority of both houses of the state legislature but not the 2/3rds required to impeach the judge under the state constitution because the Republicans would vote against the impeachment on party lines even if it's obvious that his ruling was partisan and had no basis in law.     \n\nThe State DoJ decides to not enforce any actions of the activist judge against the Governor because he is the Chief Executive of the State and controls the government with the explicit approval of the majority of both houses of the state legislature and the people he appointed realize the ruse of the activist judge. The Democrat also happened to have won the popular vote and has the support of the public too.  \n\nThe state supreme court in this case would be the only one with the power to out-rule the activist judge and they do have the power to do so, but the minority Republicans in the legislature threaten them and gaslight them into not doing their job or slow-walking their judgements because a majority of these judges happened to be appointed by the Governor (and other Democrat governors) 6 years ago.\n\n\nAs Andrew Jackson said, \"John Marshall has made his decision; now let him enforce it.\"",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "cometshoney",
                                                    "body": "I was responding to, \"I think he should just ignore the court.\" There was no grand scenario such as the one you just created behind that comment. It was simply \"I think the president of the United States should ignore the court.\" Do you feel the same way? If so, are the rest of us free to just ignore the courts?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "OpinionSuppository",
                                                            "body": "At the very core of the constitution is setting up a system to best implement the will of the people and in this case, the election as well as approval ratings prove that he has the will of the people.\n\nMost TS look at these rulings, the standing of the plaintiffs and the background of the judges and see the partisan nature of their rulings. \n\nIf the Supreme Court hears these cases and rules against Trump, I will not tell him to ignore the judges. It is ridiculous that district judges can issue nationwide \"emergency\" injunctions that do not give time to the defendants (Trump admin) to appeal/respond.\n\nThey overstepped their authority when they issued a TRO stopping the Senate-confirmed Bessent from doing his job at the Treasury.\n\nI do not expect Democrats to impeach Biden or Obama appointed judges even if it crystal clear that they committed an impeachable offense. I also do not think that Trump's entire agenda can wait until 2026 for a chance to get a 2/3rds majority (not happening very likely due to Democrat gerrymandering and lack of voter ID) so that these judges can be rightfully impeached.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "OpinionSuppository",
                                                            "body": "The judiciary was a once-highly respected institution, but it's not the same anymore. Take for example the ABA, another formerly respected institution supporting Biden unconstitutionally trying to force the ERA into the Constitution. It's clear that the judiciary (especially at the district level) has become highly partisan and deserves the same amount of scrutiny as the other branches of the government. The only reason these activist judges are confirmed is due to Democrats voting on party lines.\n\nI believe Trump's actions will therefore also only withhold with Republicans voting on party lines against any impeachment attempt or likewise.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "cometshoney",
                                                                    "body": "You mean by doing pretty much the same thing they did the last two times?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Scynexity",
            "body": "It's about time. This is what it means to drain the swamp! It is absurd to think that there are executive branch functions that are unresponsive to the will of the people through elections. This is what democracy looks like!",
            "score": -44,
            "replies": [
                {
                    "author": "SpatuelaCat",
                    "body": "Democracy looks like one man being allowed to choose what can or cannot happen and whenever he is or is not breaking the law?",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Scynexity",
                            "body": "For his branch, of course! That's just normal separation of powers.",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "bigtiddyhimbo",
                                    "body": "I’m pretty sure the judicial branch handles legality and law though? How is this normal separation of powers?",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Scynexity",
                                            "body": ">I’m pretty sure the judicial branch handles legality and law though?\n\nYes, that is unchanged. This order is just for the executive branch, which is the limit of the President's power.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "bigtiddyhimbo",
                                                    "body": "Shouldn’t it be up to the judicial branch then to determine the extent of what the entice branch has power over the law? If a president can just say “nope my word is law so say I”, isn’t that a dictatorship instead than a presidency?",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Scynexity",
                                                            "body": "The judicial branch still reviews constitutionality. That is unchanged. This order has no effect on the courts whatsoever.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "bigtiddyhimbo",
                                                                    "body": "It kinda does though. The courts are telling him what he’s doing is unconstitutional and illegal over and over again and he’s defying their orders. Is that not cause for concern?",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Scynexity",
                                                                            "body": ">he’s defying their orders\n\nHe has not defied any orders that I know of.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "bigtiddyhimbo",
                                                                                    "body": "He is outright defying and denying to follow the multiple judges rulings on MULTIPLE executive orders, namely USAID, the erasure of Trans people on the federal level, and the funding freezes massacring the jobs of thousands of people. Again, is that not cause for concern?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Scynexity",
                                                                                            "body": "I'm sorry but that's just not true. It would be big news if Trump defied a court order. He has not done so.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "bigtiddyhimbo",
                                                                                                    "body": "Maybe you’re not just looking at news sources reporting on it then? Kinda like how conservative news sources arent reporting on him calling himself a king. I don’t know what to tell you dude.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Scynexity",
                                                                                                            "body": "Yeah, I really doubt that. I think we can both agree it would be all over at least the front page of reddit - and yet, nothing is there. Feel free to link to what you're talking about, though, and I'd be happy to take a look.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "bigtiddyhimbo",
                                                                                                                    "body": "Here’s one, but I highly doubt you’ll appreciate the website it’s on https://www.nytimes.com/2025/02/19/us/politics/trump-foreign-aid-freeze.html\nIt might not be all over the front page for you given the algorithm, but it sure it there for me. (Question for guidelines?)",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Scynexity",
                                                                                                                            "body": "It's behind a paywall, so I can't read it, sorry.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "bigtiddyhimbo",
                                                                                                                                    "body": "You’re good man, I appreciate you giving it a chance regardless (question mark again lol?)",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "WulfTheSaxon",
                                                                            "body": "He’s not defying any orders. The government’s court filing in the ine case where they supposedly weren’t says that they simply couldn’t approve things fast enough – they’re attempting to comply in good faith.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "bigtiddyhimbo",
                                                                                    "body": "He is outright defying and denying to follow the multiple judges rulings on MULTIPLE executive orders, namely USAID, the erasure of Trans people on the federal level, and the funding freezes massacring the jobs of thousands of people. Again, is that not cause for concern?",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "WulfTheSaxon",
                                                                                            "body": "He isn’t. Some of the orders are being tossed on appeal.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "myotherreddit13",
                    "body": "How much do you actually know about our government and the system of checks and balances? The will of the people is not embodied solely by the president - it is expressed through both the legislative and executive branches, with the judiciary ensuring that constitutional rights are upheld. We are a democratic constitutional republic, meaning power is distributed, not concentrated, to prevent any one branch from ruling unchecked.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Scynexity",
                            "body": "Yeah, that's all absolutely true - and absolutely in line with this executive order.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}