{
    "title": "What makes being \"blind\" to differences superior or inferior to being \"woke\" to them?",
    "author": "PeskieBrucelle",
    "subreddit": "AskTrumpSupporters",
    "rank": 68,
    "score": 71,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 206,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1iwdgon/what_makes_being_blind_to_differences_superior_or/",
    "id": "1iwdgon",
    "selftext": "I'm trying to understand something about our current social discourse. Many Trump supporters proudly embrace being \"colorblind,\" stating they don't see or judge based on race.\n\n While the Civil Rights movement didn't eliminate racism, it demonstrated society's capacity to evolve beyond racial discrimination.\n\nMany Black and Brown American scholars have written extensively about these complexities and nuances and their perspectives are particularly valuable on this topic, \nI however want to focus here on how we use these spacific terms in our discourse.\n\nThere remains a fundamental agreement across society that discrimination is wrong.\n\nWhile there may be justified cases where society withdraws civility from demonstrably dangerous individuals like convicted violent criminals or terrorists, there remains a broad consensus across political lines that unwarranted discrimination and prejudice are fundamentally wrong.\n\nThis concept of being \"colorblind\" gained prominence during that era and is often cited by conservatives.\n\n What interests me is why this principle doesn't extend further.\n\n If someone can learn to look past race and treat everyone equally, what makes gender identity, sexual orientation, religion, or physical abilities fundamentally different? \n\nThe capacity for acceptance exists, so why are we becoming increasingly divided on these issues if being \"blind\" was fundamentally about avoiding prejudice?\n\nThis leads me to question our current debate over DEI and being \"woke.\" I've noticed we might be using these terms differently.\n\n When conservatives say \"colorblind,\" they typically mean treating everyone fairly without prejudice.\n\n When liberals say \"woke,\" they often mean being conscious of inequities to prevent discrimination.\n\nIt seems there's a disconnect: to some conservatives, being woke is perceived as abandoning blindness and embracing prejudice. \n\nTo liberals, being blind appears as willful ignorance of existing problems. \n\nAre we perhaps arguing for the same ultimate goal(ending discrimination) but years of discourse have trained us to seek disagreement rather than common ground? \n\nHave these terms lost their original meaning, instead becoming vessels for projected political alignment?\n\nIs there truly a distinct woke or colorblind culture, or are these concepts primarily products of internet discourse, amplified by polarizing algorithms?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SincereDiscussion",
            "body": "A lot of your post relies on the most charitable and completely benign interpretation of the word 'woke' imaginable, then treating opposition to wokeness as if it means opposition to your particular definition. Surely you can see the problem here! People don't hear 'woke' and think \"care about inequality\" or whatever, they hear \"woke\" and instantly translate that into \"discrimination against Whites\", racial double standards, tearing down statues, policing language, etc. \"Woke\" isn't this abstract thing; it's tied to policies, values, and narratives that people find repulsive. \n\n> When conservatives say \"colorblind,\" they typically mean treating everyone fairly without prejudice.\n\n.\n\n> When liberals say \"woke,\" they often mean being conscious of inequities to prevent discrimination.\n\n> It seems there's a disconnect: to some conservatives, being woke is perceived as abandoning blindness and embracing prejudice.\n\nThere's not actually a disconnect between conservatives and liberals. The disconnect is between you and the people on your own side, as they say the exact things you are trying to downplay or deny. Conservatives are accurately describing what \"woke\" liberals believe. People like Ibram X Kendi don't leave much room to the imagination; they explicitly call for present discrimination as the remedy for past discrimination. (Note: MLK did too, so conservatives citing him are of course completely wrong). \n\nAgain, it doesn't matter how you try to clean up the liberal view here in order to make it rhetorically palatable to non-liberals. We aren't unaware of the things that liberal race activists want...we've lived through them. We are frankly past the point where you can just win the debate by redefining terms. You have to actually reckon with the policies that you support. Your entire post, thoughtful as it is (and I mean this as a sincere compliment, it is far more interesting than other threads posted lately!), is heavily centered on an abstract discussion about \"woke\" that legitimately does not matter.\n\nWith all that said: being colorblind as a principle is dumb. People should have views informed by evidence, preferences, tradition, interests, etc. I honestly think that treating colorblindness as the ideal is a problem because it's bad rhetoric and terrible policy. If you actually take 'colorblindness' as an ideal seriously, you are literally just a globalist and you must oppose nation states. It should be anathema to anyone that's actually right-wing (other than people who say it because it serves their interests without actually believing it).",
            "score": 14,
            "replies": [
                {
                    "author": "pimmen89",
                    "body": "It seems like the conservative interpretation then is to tack a lot of things to \"woke\" that liberals would not agree are a part of it, since the original definition of the term has nothing to do with them and conservatives think it should be expanded. Sort of like saying that \"conservatism\" means fascism, because Franco was a conservative. Because I don't understand why I have to reckon with politics I don't actually support just because I agree with the original definition of the term \"woke\" which was coined for recognizing unequal treatment? Why do you decide what politics I support and are tacked onto the term \"woke\" after it was defined almost 50 years ago?",
                    "score": 35,
                    "replies": [
                        {
                            "author": "SincereDiscussion",
                            "body": "What term would you like me to use to describe liberals who support direct race-based policies as a way to achieve equity? \n\nLike do you think I'm wrong when I say that the unambiguous position of the democratic party and liberal intellectuals for my entire life has been that affirmative action is good and necessary? Yeah, I've spoken to liberals on reddit who say we need class-based AA. They are powerless and irrelevant, and they vote for the aforementioned group without hesitation anyway. \n\nHere's my view: the people you are talking about are either irrelevant or they are just lying about their views and do in believe the exact things I'm attributing to them anyway, so I don't think I need to really worry about applying the \"woke\" label too broadly. In any case, I think I generally do use somewhat more precise language than that. I only used \"woke\" because that is the literal point of the thread.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "pimmen89",
                                    "body": "I don’t know, are you asking me to come up with a catchy name? I don’t support those policies, why don’t you ask people who support it what they want to call themselves instead?\n\nBut you’re asking people who agree with the original term to reckon with completely different policies. Why do you get to decide what is included in this umbrella term and what other people support? How did you find out that the people not agreeing with what you put under the umbrella are either lying or are irrelevant, did you do a survey? Or are you only judging everyone based on the ones you’ve met personally?",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "SincereDiscussion",
                                            "body": "Not asking you to invent anything catchy, but if you just expect me to say \"liberals who support x, y, and z\" instead of liberals, then I'm going to politely decline unless you have an alternative. I just wondered if you had an alternative.\n\nEdit: To put it another way, I'm not asking you to do market research and find out the exact catchiest term to use, but if there genuinely *isn't* a label, then...well, I'm sorry, but I have to draw conclusions from that (i.e., that lumping you guys in is actually completely valid). If you said \"everyone on the right wants to drastically cut the size of government, eliminate medicare, social security, medicaid, repeal the CRA, etc.\", I would say no, that's libertarians. In your case though, I'm not even describing some small part of your coalition, I'm describing the dominant faction. That's what I was alluding to earlier when I said AA was the \"unambiguous position of the democratic party and liberal intellectuals for my entire life\". If you don't have a name for the dominant faction, I genuinely think it is insane to act like I'm unreasonable for lumping you guys all together. You lump yourselves together!\n\n> But you’re asking people who agree with the original term to reckon with completely different policies. Why do you get to decide what is included in this umbrella term and what other people support? How did you find out that the people not agreeing with what you put under the umbrella are either lying or are irrelevant, did you do a survey? Or are you only judging everyone based on the ones you’ve met personally?\n\nYeah, I'm asking them to reckon with the things they voted for.\n\nThe thread is asking my opinion so I'm giving it. Kind of the point of the sub. I am aware that many of the far-left views on race are unpopular even on the left -- but the problem is they have institutional power and in 50 years, every liberal will believe them anyway. That's just how these things go.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "pimmen89",
                                                    "body": "I don’t really have an alternative word you would accept, I can’t really do anything about you wanting to use words differently other than asking what you mean since I will most likely use the common definition rather than what you decide to tack onto it. It’s up to you how you want to communicate. Does that make sense?\n\nI agree that we should reckon with what we vote for, I don’t know if I subscribe to the idea that you have to agree with everything the party you voted for did though. I know plenty of Trump voters who lost their federal job and don’t agree with that, but still prioritized other things. I agree that they should reckon with the consequences of their vote, but I wouldn’t make the judgement that they agree with everything the party they voted for does. Do you agree?\n\nAnd does being aware of unequal treatment, i.e woke, mean that you can only vote Democrat in your opinion?",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "SincereDiscussion",
                                                            "body": "I agree that you can vote for someone without agreeing with everything that person supports, but I also don't think you can really complain that much about being lumped in with them. \n\n> And does being aware of unequal treatment, i.e woke, mean that you can only vote Democrat in your opinion?\n\nNo but I don't think that's a good definition tbh. I'm woke by that definition!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "pimmen89",
                                                                    "body": "Why does the definition have to exclude you to be good?\n\nI can’t change what other people vote for, so why is it my fault that you lump me in with them?",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SincereDiscussion",
                                                                            "body": "It doesn't, but I think it's a sign of a definition that's too broad and doesn't actually match with how other people use it. By your definition, every conservative who thinks affirmative action is wrong, and obviously considers it a matter of unequal treatment, must be \"woke\". I think that's bizarre and self-evidently absurd to define it that way, but this is about my limit for discussing semantics. \n\n> I can’t change what other people vote for, so why is it my fault that you lump me in with them?\n\nThat's just politics. You'll be lumped in with people in your coalition. I'm not a Zionist, libertarian, etc., but I get lumped in with them constantly. I correct people when this comes up, but that's about all I can do.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "pimmen89",
                                                                                    "body": "So the bizarre thing is to adhere to the definition of the term? Wouldn't the bizarre thing be to change the term just to make it not include conservatives so that they can use it for other things they don't like?\n\nAbsolutely, it's just politics, and I can also just correct them. We can't police how people want to redefine words or not, I hope I didn't imply we should do anything but correct people when we get lumped in?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "SincereDiscussion",
                                                                                            "body": "I get that it's important to you. Do you have anything non-semantic that you want to discuss?",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "pimmen89",
                                                                                                    "body": "I don’t know if I would say important, I come here to understand the perspective of Trump supporters. I don’t know if I think it’s a semantic question either, I’m just asking why you think it’s good to just tack on a bunch of stuff to a term to make people who support it seem weird, rather than just going by the definition of the term instead.\n\nWould you think it’s good if I redefine the word ”nazi” to include people that vote for a white politician and then ask you to reckon with progroms and other things that you now support?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "SincereDiscussion",
                                                                                                            "body": "\"What if libs starting calling everyone on the right Nazis\" isn't a hypothetical. Every right-winger in America has been called a Nazi!",
                                                                                                            "score": 3,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "pimmen89",
                                                                                                                    "body": "Do you think they should they have to reckon with progroms, eugenics, and bombings just because someone lumped them in with nazis or should we call out people who try to change terms for political othering?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "SincereDiscussion",
                                                                                                                            "body": "The difference is that with pogroms (not trying to correct you in a backhanded way, but I assume this is what you mean) and eugenics (leaving bombings aside because I don't know what you mean), Republicans *haven't passed or supported those things*. That is not the same. When I accuse the left of supporting various \"woke\" things, I am referencing things that are actually in place. That is an extremely important distinction that you are not acknowledging. Your analogy about Nazi Republicans is about policies that they don't support, whereas what I'm saying about \"woke democrats\" is about things they support *and have implemented*.\n\nIn order to make a real analogy here, we'd have to have a system in which Republicans passed eugenics laws, removed Jewish people from institutions, did this for decades -- and then after that, I wondered why you'd call me a Nazi when I say those things are bad and don't support them (but keep voting for them anyway). Yeah in that scenario, it would be really silly to get mad about being lumped in with them. Especially if support for these policies was so ubiquitous that I didn't even have a name for the people who support those policies to distinguish them from the people that don't.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Born-Sun-2502",
                                    "body": "\"The right isn't doing this because they're racist.\" \n\n\nWhat would you call removing more qualified women and people of color and replacing them with less qualified white men? That's *not* racist?\n\n\nWe've only ever had one nonwhite, and no female presidents because white men have more \"merit\" right? You look at this system and say \"yeah, that's fair\", no antidiscrimination laws needed?",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "pimmen89",
                                    "body": "Exactly, why not focus on the actual policies instead of tacking the policies onto a completely different word that means something else? This is what I’m not getting, if you think the implementation of affarmitive action, DEI policies, and more are flawed why tack all of this onto a term that just means ”being aware of unequal treatment” instead of focusing on the issues themselves?\n\nIt would be like if I don’t agree with the Trump supporters who push for a national abortion ban I then equate supporting Trump with supporting a national abortion ban. It makes the discussion harder to conduct rather than easier.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SincereDiscussion",
                                            "body": "> This is what I’m not getting, if you think the implementation of affarmitive action, DEI policies, and more are flawed why tack all of this onto a term that just means ”being aware of unequal treatment” instead of focusing on the issues themselves?\n\nI just want to note for the record that this is exactly what I do in literally every thread that isn't specifically premised on woke as a concept.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "the_bullish_dude",
                            "body": "Everything you’ve said here can be argued exactly the same by folks on the right if you just change agenda item.\n\n“It seems like the conservative interpretation then is to tack a lot of things to “woke” that liberals would not agree are a part of it”\n\n“It seems like the liberal interpretation then is to tack a lot of things to “racism” that conservatives would not agree are a part of it”\n\n\n\nThe loudest voices are often the ones being heard and those voices are not the ones representing the ideology of the normal every day citizen.\n\nIn my opinion, the scale tips left and right and most people are around the middle.  The scale began tipping too far left (at least from social ideology) when we went from something that almost all people believe “men and women of all races should be treated fairly and equally” and tipped the scale to “there’s more genders than men and women and you should believe this and then whether you believe it or not you should treat them equally”\n\nMost people in the middle said “men and women of all races should be treated fairly and equally”.  That’s the end of the sentence.  Everyone fits in those categories.  All other commentary is tipping the scale too far left and the middle will move right to achieve balance again.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PeskieBrucelle",
                    "body": "I appreciate your thoughtful critique of my original post. \n\n\nYou're right that focusing solely on benign interpretations of these terms oversimplifies the debate. However, I'm not trying to win an argument or clean up either side's position \n\n\nI'm genuinely trying to understand how we've reached this point where even our vocabulary has become a battlefield.\n\n\nWhen you say people hear \"woke\" and translate it to specific actions like \"discrimination against Whites\" or \"tearing down statues,\" that illustrates exactly how loaded these terms have become. \n\n\nSimilarly, when others hear \"colorblind,\" they may interpret it through their own lived experiences with systemic barriers.\n\n\nYou make a compelling point about the disconnect being within progressive voices rather than between conservatives and liberals.\n\n\n This internal contradiction deserves more examination. Your critique of colorblindness as potentially conflicting with nationalism raises important questions about practical policy versus abstract principles.\n\n\nBut here's where I slightly diverge: I'm not trying to rhetorically repackage these concepts to make them more palatable. I'm trying to bring attention to the nuanced issues to them as they are. Which is why im thankful we can atleast discuss this.  \n\n\nSome discussions shouldn't aim to win or debate, but rather to explore complex nuances and diverse perspectives. This is one of those discussions.\n\n\n As someone who has lived through the impacts of policies from both sides, I'm trying to understand how we've reached a point where meaningful dialogue seems impossible.\n\n\n You've experienced what you see as the negative impacts of progressive policies; I've experienced what I view as harmful effects of conservative approaches. \n\n\nWe're both speaking from lived reality, not just rhetoric. \n\nOur different lived experiences are equally valid, as each person's reality is uniquely their own.\n\n\n While we naturally form perceptions based on our personal experiences, this can be both beneficial and limiting due to our inherent biases. A trait all humans have. \n\n\n Civil discourse across different perspectives is essential for challenging these biases and broadening our understanding.\n\n\n Unfortunately, the current online climate of 'left versus right' has oversimplified many complex issues.\n\n\n These political labels barely scratch the surface of the deeper nuances involved.\n\nPerhaps instead of debating definitions or trying to \"win,\" we should examine how these different interpretations emerged from different American experiences.\n\n\n What specific policies or approaches do you think could address discrimination without creating new forms of it?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "SincereDiscussion",
                            "body": "> I'm genuinely trying to understand how we've reached this point where even our vocabulary has become a battlefield.\n\nWell, \"reached this point\" -- what does that mean? When was that *not* the case? I recommend reading a book like Caldwell's Age of Entitlement to get a feel for the other side. It makes much more sense why a concept that was divisive from the start remained that way as opposed to thinking that we were all in agreement and then got off track at some point. You weren't necessarily saying that, but it comes across that way. \n\n>  What specific policies or approaches do you think could address discrimination without creating new forms of it?\n\nI support freedom of association and don't consider 'discrimination' to be a problem that the government should concern itself with. Once you grant that idea, you're basically just saying \"there should be a powerful bureaucracy, inevitably controlled by leftists, that gets to impose its views on every business and institution in America\". Bad idea in principle, certainly bad in practice (see the aforementioned book).",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "iilinga",
                                    "body": "Why shouldn’t the government be concerned with discrimination?\n\nShould people of all racial backgrounds have equal access to employment?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "SincereDiscussion",
                                            "body": "> Why shouldn’t the government be concerned with discrimination?\n\nI consider it a basic freedom (people should be able to choose who they interact with) and think, even aside from that, it's bad because it gives the government enormous coercive power (see my final paragraph of the comment you replied to).\n\n> Should people of all racial backgrounds have equal access to employment?\n\nSee above. Ultimately, I don't agree that discrimination is immoral (it just means \"a non-consensual interaction didn't occur\") and beyond that, even if I did, I would still trust the market more than the government to actually sort it out. That is to say, I could understand being opposed to e.g. \"no blacks allowed\" hiring practices being widespread, but I find it crazy to sue firms just because they don't have the right demographics, or because they used IQ tests, etc. I consider the last several decades an experiment. We tried it, and it turns out, no, the government/liberals can't be trusted on this.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SincereDiscussion",
                            "body": "> Do you see how this is a great example of why political discourse has gone to shit? If not just flip the roles and see how unproductive and pointless a statement it is.\n\nNo. I see this as an example of a misunderstanding. I'm not saying what you think I'm saying.\n\nWhat you think I'm saying: \"there are people on the left with extreme racial views\". (Obvious counter-argument: there are people on the right that also have extreme racial views). I agree that by itself, this would be a dumb thing to say and completely pointless.\n\nWhat I'm actually saying: the only thing people like Ibram X Kendi are guilty of is stating out loud what the Democrat policies going back decades actually are. He's saying we need discrimination against Whites in order to overcome \"racism\". Okay, even if you don't agree, that is affirmative action (among other policies) and that has been the policy for decades.\n\nYou should read my replies to another user who made a similar argument:\n\nhttps://www.reddit.com/r/AskTrumpSupporters/comments/1iwdgon/what_makes_being_blind_to_differences_superior_or/mefnfku/\n\nLet's say that 10% of Republicans are White nationalists. If Republicans support mass immigration, civil rights, etc., then it would be dumb to insinuate that this small bloc has significant influence or to imply that the other 90% agree with them on those issues. \n\nOn the other hand, if that 10% managed to actually get Whites-only immigration laws, repeal the civil rights act, etc. -- and the other 90% kept voting for that party (for decades!) -- well okay, I think it's entirely correct to lump them in and acknowledge that they definitely don't consider it a deal-breaker.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jasonmcgovern",
                    "body": "Tearing down statues, like which ones?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SincereDiscussion",
                            "body": "Here's a non-exhaustive list:\n\nhttps://en.wikipedia.org/wiki/List_of_monuments_and_memorials_removed_during_the_George_Floyd_protests",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "jasonmcgovern",
                                    "body": "most of these look like monuments to the confederacy - what's the problem with losing them?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SincereDiscussion",
                                            "body": "I think that's beyond the scope of this thread tbh. Was just answering a simple question.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "jasonmcgovern",
                                                    "body": "You cited the statues as an example of \"Woke\" being tied to policies, values, and narratives that people find repulsive.\n\nI am jsut trying to understand why anyone would be repulsed by taking down statues of people who fought AGAINST our country?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "SincereDiscussion",
                                                            "body": "I understand. I'm just not interested in having the monument talk right now. I'm sure you could search the subreddit and find threads where you can hear the average TS's opinion if you're that curious about the reasoning.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "yewwilbyyewwilby",
                    "body": "Very well said",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jaded_Jerry",
            "body": "You know I have a question for you;\n\nHow can the left claim to oppose racism when they openly support mistreating people based on their race and making entire groups of people acceptable targets of aggression and hostility?\n\nWorse, how can they claim to oppose racism when they declare any person of color who speaks against them does not have an invalid voice? When they declare themselves the authority on rather or not your voice matters?\n\nI mean Obama literally got on stage and scolded black men like children because they weren't flocking to Kamala! Then, when she lost, Al Sharpton went on some left-leaning news network to talk about how sexist and racist black men were!\n\nThe Democrats aren't against racism.  They are racists who do everything in their power to sow racial animosity and paranoia and then scream that calling them out on their bullshit is just fragility.",
            "score": 2,
            "replies": []
        },
        {
            "author": "whateverisgoodmoney",
            "body": "If you find yourself saying a certain race or sex needs preferential treatment, you are racist and/or sexist.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheGlitteryCactus",
            "body": "\"Colorblind\" means you don't consider race or skin color, but rather capability and merit.\n\n\"Woke\" is discrimination against white men, because of their skin color and gender.",
            "score": 2,
            "replies": []
        },
        {
            "author": "random_guy00214",
            "body": "Judging people by their race is racist.",
            "score": 11,
            "replies": [
                {
                    "author": "pimmen89",
                    "body": "Are you judging people if you recognize that some people get treated differently?",
                    "score": 31,
                    "replies": [
                        {
                            "author": "random_guy00214",
                            "body": "No",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "pimmen89",
                                    "body": "So if you recognize that people are treated differently based on race, which is the definition of the term \"woke\" when it was coined, it's not judging people by their race?",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "random_guy00214",
                                            "body": ">So if you recognize that people are treated differently based on race\n\n\nI don't, so your point is moot",
                                            "score": -16,
                                            "replies": [
                                                {
                                                    "author": "pimmen89",
                                                    "body": "So why did you mention judging people by their race being racist when woke means recognizing unequal treatment, something you yourself don't think is racist?",
                                                    "score": 23,
                                                    "replies": [
                                                        {
                                                            "author": "MattCrispMan117",
                                                            "body": "Because everyone of us alive today has had to live in a society since we were born has told us we were \"racist\"/\"privileged\" because of our skin color all while allowing explicit programs to help every other group BUT us.\n\nThere are scholarships specifically for black kids, asian kids, hispanic kids and native american kids. There are none for white kids (nor should there be to be clear). \n\nBut none the less we are told we are the \"privileged\" ones and the racist ones even as jokes which make fun of ever other race but white people get people fired from their jobs but jokes which make fun of whites are celebrated as \"punching up.\"\n\nln short we are the bottom of this society but told we are at the top purely for the sake of justifying the apartied conditions we lived under until very, VERY recently.\n\nSo yeah when people say \"woke\" it tends to make people think you're judging others based on their skin color as up till Trump won and the left got neverous that's what it was about.",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "pimmen89",
                                                                    "body": "I am a white male and has never been told that my skin color makes me racist. Society has told you that you’re racist because you’re white?",
                                                                    "score": 3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MattCrispMan117",
                                                                            "body": "l mean in the sense there the only ones anyone has been allowed to legally descriminate against for the last 60 years yeah.\n\nThey're the only ones in the running honestly.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Dijitol",
                                                    "body": "Why do you believe that some people aren’t treated differently because of their race?",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "random_guy00214",
                                                            "body": "I think that's already illegal, so it is rare",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "Dijitol",
                                                                    "body": "Illegal in the workforce but what about every where else?",
                                                                    "score": 15,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "TheManSedan",
                                                                    "body": "Something being 'illegal' makes it rare? By this theory - Crime is rare....but we are something like 5th in the world for per-capita incarcerations. \n\nDo you really believe that something that is 'illegal' is rare?",
                                                                    "score": 12,
                                                                    "replies": [
                                                                        {
                                                                            "author": "random_guy00214",
                                                                            "body": "Illegal actions are rare compared to legal actions",
                                                                            "score": -5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TheManSedan",
                                                                                    "body": "Of course this is true because every micro action you make is most likely legal. There is no way something being illegal is so rare to the effective that it is inconsequential, as your earlier comment suggests..  \n  \nOne of the largest talking points of the most recent election was illegal immigration + the subsequent illegal actions from those immigrants effecting our nation, wasn't it? Rare != insignificant & ignorable. \n\nDoes that chain of events illustrating that illegal action, whether or not 'rare' on your scale, have  a meaningful impact on society?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Ligma_Spreader",
                                                                    "body": "How can you read someone's mind and determine their inherent racial prejudice prevented them from hiring the minority applicant? Do you know that studies have shown that applicants with white names get 50% more interviews than those with non-white names? Why is the law not preventing this from happening if it's illegal?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "random_guy00214",
                                                                            "body": "Id be fine with laws preventing names or any other racial identification during the hiring process. ",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Ligma_Spreader",
                                                                                    "body": "The only way to prevent someone with hidden racial prejudice is for that person to never see the person they are interviewing. Even hearing their voice can tip the person off. How would you control for this?",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "random_guy00214",
                                                                                            "body": "Hiring decision based on resume only.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "YeahWhatOk",
                                                                                                    "body": "Have you done much hiring in your career? If so, do you think its a legitimate and feasible solution to just take a resume and offer that person a job without ever actually talking to them?\n\nI've done a fair amount of hiring and interviewing over the years and as a result i've met a lot of creative writers who can doctor up a resume to make themselves sound better, only to find that the applicant couldn't live up to the hype of their resume.",
                                                                                                    "score": 4,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "random_guy00214",
                                                                                                            "body": "You can \"blindly\" test people to see if they know certain knowledge or have certain skills. There's no reason this couldn't work. ",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "YeahWhatOk",
                                                                                                                    "body": "Can you talk me through it? If I'm hiring someone for business to business sales for example, how can I blindly test them?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "random_guy00214",
                                                                                                                            "body": "Make a test and send it to an independent testing facility. \nThe applicant can go there and take the test. \n\n\nSimilar to SAT, ACT, MCAT, LSAT, etc.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "YeahWhatOk",
                                                                                                                                    "body": "For a sales role? I mean its a noble and novel idea, but I'm sure you can why it wouldn't work right? \n\nWhat kind of questions would you put on a standardized test for someone new to the widget sales industry that would allow you gauge if they would be an effective sales person?",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "random_guy00214",
                                                                                                                                            "body": ">For a sales role?\n\n\nSure why not? It works with much more complicated fields like law and medicine. \n\n\n>What kind of questions would you put on a standardized test for someone new to the widget sales industry that would allow you gauge if they would be an effective sales person? \n\n\nThe same questions you would ask them in person.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "zoidbergular",
                                                                                                                                                    "body": "Not to sound rude.... but have you ever actually worked at a company or hired anyone? Skills/knowledge is only a portion of it; that is just the baseline requirements for even being considered. A good chunk of hiring is just determining if the person is a complete weirdo or not through the interview process, and if their personality and work style meshes with the team they will be working in. You don't tease that out with a standardized test or reading accomplishments off a resume. The most qualified person on paper isn't inherently the best person for the job.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "random_guy00214",
                                                                                                                                                            "body": ">A good chunk of hiring is just determining if the person is a complete weirdo or not through the interview process, and if their personality and work style meshes with the team they will be working in. You don't tease that out with a standardized test or reading accomplishments off a resume. The most qualified person on paper isn't inherently the best person for the job. \n\n\nYour proposing discrimination. Everyone is going to subconsciously prefer people like them. Hiring decisions should be based on objective fact, not feels.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "zoidbergular",
                                                                                                                                                                    "body": "So you would hire the person with the strongest resume on paper even if they're a complete jackass and make their entire team/office miserable or drive other employees to quit? Humans are not robots; we are social/cultural creatures. The success of your group is dependent on more than just your skill set for accomplishing a specific task. Just because someone is objectively the most qualified on paper doesn't necessarily mean their hiring will provide the best objective outcomes for the business.\n\nAlso you didn't answer my question, have you ever actually worked at a company or hired for a team? Or run a business?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "random_guy00214",
                                                                                                                                                                            "body": ">So you would hire the person with the strongest resume on paper even if they're a complete jackass and make their entire team/office miserable or drive other employees to quit?\n\n\nIs \"jackass\" slang for black? How are you going to measure it? Sound like your feelings. \n\n\nI already stated my position. The person with the best resume, based on objective fact alone, should be hired. \n\n\n>have you ever actually worked at a company or hired for a team? Or run a business? \n\n\nI work at a company and help with hiring, I don't own the business. \n\n\nThe company I work at hires based solely on verifiable fact. Including a degree verified from the university, their GPA, and their background check. The \"interview\" is a lunch at a local restaurant that we can go without. Our problem is that there are insufficient people with the desired GPA.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "zoidbergular",
                                                                                                                                                                                    "body": "Why would jackass mean black? People can be gossipy, loud/annoying, rude, interrupting, disorganized, chaotic, self absorbed, smug, short fused, or whatever other undesirable trait that otherwise makes them unpleasant to work with. It's nothing to do with race -  my point is that these are things that you find out by talking to and socializing with people, not from screening the skills listed on their resume.\n\nAgain, there are some amount of feelings involved in hiring and working with other people that don't have objective metrics. We aren't robots.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "random_guy00214",
                                                                                                                                                                                            "body": "If you can't measure it objectively, then your biases will be present which will cause racisism around the country. ",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "Ligma_Spreader",
                                                                                                    "body": "Maybe in a perfect world where everyone is truthful on their resume. Why do you think Affirmative Action was eliminated with no other solution to the problems I bring up?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "random_guy00214",
                                                                                                            "body": "Because it's racists. ",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Ligma_Spreader",
                                                                                                                    "body": "But it's proven that racism is preventing hiring of minorities right now. Affirmative action was helping with that. Are white people just more important than minorities so their problems don't deserve solutions?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "random_guy00214",
                                                                                                                            "body": "Two evils doesn't make a good",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Killer_Sloth",
                                                                                    "body": "Wouldn't that be considered a DEI policy (\"equity\" is the E)?",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "random_guy00214",
                                                                                            "body": "No",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "MattCrispMan117",
                                                                            "body": "70% of the NBA is black. \n\nDoes this give evidence the NBA descriminates against white males??",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Ligma_Spreader",
                                                                                    "body": "Sure sounds like it to me doesn’t it?",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "h34dyr0kz",
                                                                    "body": "https://fox59.com/news/national-world/black-sounding-names-less-likely-to-receive-job-call-backs-than-white-sounding-ones-study/\n\n\nHow rare should it be before we decide we don't need to address the issue any more?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "notapersonaltrainer",
                            "body": ">if you recognize that some people get treated differently?\n\nNo, that is judging a behavior. \n\nWe have anti-discrimination laws to judge discriminatory behavior. The race/sex/etc of the discriminator doesn't matter (a black businessowner can't not hire black people anymore than a white one). That's colorblindness. \n\nThat's the *opposite* of branding a group of people \"inherently racist\" or \"white adjacent\" and institutionally discriminating against them merely for being their ancestors' race. That's woke—and it's repulsive and vulgar.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Amishmercenary",
            "body": "You can be aware of historical injustices without thinking you have to put your finger on the scales and treat people differently BECAUSE of their skin color. \n\n>It seems there's a disconnect: to some conservatives, being woke is perceived as abandoning blindness and embracing prejudice.\n\n>To liberals, being blind appears as willful ignorance of existing problems.\n\nThe issue here is that for liberals, being woke means ACTING on the contrary to reach their equal solution - in order to combat past racism, you must be racist in the present. Many leftists miss that it's quite possible to be aware of past injustices, be opposed to those injustices, and still act in a non-racist way to oppose that from happening in the future.",
            "score": 1,
            "replies": [
                {
                    "author": "non_victus",
                    "body": "I think one of the biggest challenges to \"acting in a non-racist way\" with full knowledge of the past injustices comes down to how our \"implicit biases\" affect our subconscious decision making.   Studies have examined that these biases tip the scale backwards, despite folks' awareness, or \"wokeness\" to the injustice.  For example, many here say that when hiring, employers should just look at all the candidates equally and pick the best one (not one where race, sex, etc. plays a part in the decision). However, studies show that \"employers are less likely to call back job applicants with Black-sounding names when presented with identical resumes.\" Thus creating an inequity before the applicant evaluation process even beings.\n\n 1) [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4490163](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4490163), \n\n2) [https://www.aeaweb.org/articles?id=10.1257/0002828042002561](https://www.aeaweb.org/articles?id=10.1257/0002828042002561) .\n\n  \nIn a world where these implicit biases are real, and observed in easy to replicate studies (take identical resumes, change the names, assess how employers handle those resumes), how can we \"act in a non-racist way to oppose that from happening in the future\"?\n\n  \nIf anyone here is brave enough to look into a chilling mirror, you can find out what your implicit biases are by taking one of many very simple Implicit Bias tests (designed to ensure you react without thinking, so your \"gut\" is answering the question): [https://implicit.harvard.edu/implicit/selectatest.html](https://implicit.harvard.edu/implicit/selectatest.html) \n\nYou can examine biases related to all kinds of things: sexuality, skin-tone, weight, religion, race, genders-career, weapons, age, disability, etc. - you might think you're not biased, but we all are. I am, everyone is.  \n\nWhich begets the question again, how do we account for those biases to ensure that everyone is given an equal chance?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Amishmercenary",
                            "body": ">However, studies show that \"employers are less likely to call back job applicants with Black-sounding names when presented with identical resumes.\" Thus creating an inequity before the applicant evaluation process even beings.\n\n>[https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4490163](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4490163),\n\n>[https://www.aeaweb.org/articles?id=10.1257/0002828042002561](https://www.aeaweb.org/articles?id=10.1257/0002828042002561) .\n\nI don't see that quote in the first paper, and the second paper is behind a paywall. Where are you grabbing that quote from exactly? \n\n>You can examine biases related to all kinds of things: sexuality, skin-tone, weight, religion, race, genders-career, weapons, age, disability, etc. - you might think you're not biased, but we all are. I am, everyone is.\n\nDoesn't this also mean that all minorities are also racist and are also hiring people based on their names? \n\n>Which begets the question again, how do we account for those biases to ensure that everyone is given an equal chance?\n\nI mean you can push DEI all you want, but it seems clear to me that Americans as a whole have rejected this leftist propaganda tbh. \n\nLife is unfair, and certain people will be treated differently based on immutable characteristics - but as long as you are constantly putting your fingers on the scale then that will never end- at the end of the day you are trying to treat people differently based on the color of their skin- it's so funny to me that leftists have literally become what MLK was against.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "non_victus",
                                    "body": "The quote came from an article summarizing the findings of the paper. I posted the papers themselves, which state the same things in less \"plain language\".  Happy to quote from there if it's more instructive.\n\nI didn't say racist, or anything else re: hiring, I was simply trying to point to our \"implicit biases\" (subconscious reasoning) that guides our \"reactions\" to things.  But, it doesn't seem like you're interested in engaging in a discussion about addressing the affect of implicit biases on people's decision making.\n\nI find the pivot from \"it's quite possible to be aware of past injustices, be opposed to those injustices, and still act in a non-racist way to oppose that from happening in the future\" to \"Life is unfair, and certain people will be treated differently based on immutable characteristics\" a bit of a 180.  The point is to create a more fair country, no?  One where everyone is given the same chance to succeed.\n\nI agree that scales should be balanced... but, after 200+ years of folks being prevented from participating in fair democracy, just because we've abolished slavery and we've had a black president, doesn't mean the scales have magically swung back to balance.  They're still very much tilted (and maybe slowly balancing) but tilted non-the less to those that have had 200+ years to amass wealth, property, and power.\n\nIf a bully is given permission to punch you in the face every day for a year, and then one day is told to stop (but he still wants to punch you) - and you still have a busted nose, and look like shit from being beat up, are you going to feel like that's \"fair\" and the the scales are balanced simply because he's no longer allowed to punch you?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Amishmercenary",
                                            "body": ">The quote came from an article summarizing the findings of the paper. \n\nReally? Because the way you phrased it made it sound like you were taking that from the paper itself.\n\n\"However, studies show that \"employers are less likely to call back job applicants with Black-sounding names when presented with identical resumes.\" \" and then you linked directly to some papers that you seem to think prove this claim...\n\n>Happy to quote from there if it's more instructive.\n\nSure go on ahead. Can you source where that quote came from as well?\n\n>I didn't say racist\n\nYa didn't need to haha.\n\n>I find the pivot from \"it's quite possible to be aware of past injustices, be opposed to those injustices, and still act in a non-racist way to oppose that from happening in the future\" to \"Life is unfair, and certain people will be treated differently based on immutable characteristics\" \n\nI don't see how that's a pivot at all - both those things can and are true.\n\n>doesn't mean the scales have magically swung back to balance. \n\nNever said we lived in this magical balanced world anyways.\n\n>If a bully is given permission to punch you in the face every day for a year, and then one day is told to stop (but he still wants to punch you) - and you still have a busted nose, and look like shit from being beat up, are you going to feel like that's \"fair\" and the the scales are balanced simply because he's no longer allowed to punch you?\n\nGreat example- and your solution is to punch the bully back until the bully has kids who punch your kids because you punched the bully, and the cycle continues.\n\nLike, I'm not gonna deny that racism exists- it occurs every day - but the solution is to point out specific acts of racism and act against those, not just bring up this ethereal systemic racism that just says there's racism out there, and we have to act against anyone who could possibly be racist. That's the basis of our modern political and justice system- that you don't attribute one act to a group.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "heyomopho",
            "body": ">When liberals say \"woke,\" they often mean being conscious of inequities to prevent discrimination.\n\nThat's the light side of it. The dark side is that it actually represents vengeance for evils of the father, whether perceived or real. It never ends. The more we reify race, the more we are slaves to the division it sews.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scynexity",
            "body": ">If someone can learn to look past race and treat everyone equally, what makes gender identity, sexual orientation, religion, or physical abilities fundamentally different?\n\nNothing. It would be great if everyone could look past these things. Unfortunately, the party preventing that is on the left. If someone on the left demands that I introduce myself with pronouns, and use pronouns for them that don't match their sex, I cannot simply ignore them. If I ignore them, I will be fired at best, and subject to criminal proceedings at worst. They are the ones making demands on me. Pretty much all conservatives I know just want to treat everyone the same - no special treatment demands.",
            "score": 1,
            "replies": [
                {
                    "author": "apeoples13",
                    "body": "How do you know if someone’s preferred pronouns match their sex? I get that with some people it’s easier to tell than others, but I’ve met transgender people who don’t look at all like their biological sex. In those cases do you feel you’re being demanded to use a different pronoun than their sex?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Scynexity",
                            "body": "Same way we've known for thousands of years.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "apeoples13",
                                    "body": "Which is what exactly? This really isn’t a gotcha question. I’m genuinely curious how people determine if they’re being told to use pronouns for someone that doesn’t match their biological sex, like you mentioned in your comment.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Scynexity",
                                            "body": ">they’re being told to use pronouns\n\nThis is the problem - it's the telling that's the issue.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "pimmen89",
                                                    "body": "”Please, don’t call me Mr. Smith, call me Hank!” would also be an example of someone telling you what pronoun they want you to use. Are you offended by that?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Scynexity",
                                                            "body": "No, I don't think that is an example of pronoun use.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "pimmen89",
                                                                    "body": "Would it be more accurate with ”hey, you don’t have to call me ”Mr. Smith”, you can just say ”hey, you” if you want my attention” as a pronoun use since you is a pronoun?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Scynexity",
                                                                            "body": "That's would be fine, since it's not a demand.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "pimmen89",
                                                                                    "body": "And if it’s framed as a demand? ”Don’t say ”hey, you” to him, only call attention with ”Mr. President” like in a code of conduct?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Scynexity",
                                                                                            "body": "I again don't think that would be an example of pronoun use. When we talk about pronouns we are exclusively referring to male and female.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "pimmen89",
                                                                                                    "body": "Who are the people in that group you referred to with ”we” that are exclusively referring to male and female when you talk about pronouns?\n\nThe authorities on English I know would call ”us”, ”you”, ”something” and ”others” as examples of pronouns and say that most pronouns used in English have nothing to do with male or female (in contrast to some languages that almost exclusively use gendered pronouns, and some that don’t have gendered pronouns at all).",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Scynexity",
                                                                                                            "body": "> Who are the people in that group you referred to with ”we”\n\nConservatives and trump supporters.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "pimmen89",
                                                                                                                    "body": "So conservatives and Trump supporters only think formalizing pronoun use is a problem when it has to do with gender, but they’re ok with other pronouns being referred to in a code of conduct? Like not using informal pronouns for the president?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Scynexity",
                                                                                                                            "body": "Yup I'd say that's accurate.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "pimmen89",
                                                                                                                                    "body": "Why is gender a problem for Trump supporters but not titles?",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Scynexity",
                                                                                                                                            "body": "Titles are official recognitions, compared to mental illnesses for those using the wrong pronouns.",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "pimmen89",
                                                                                                                                                    "body": "Based on your comments, I assume you don’t mean using the wrong pronoun in general is a mental illness, but only when it has to do with gender? I can’t say I’ve heard of it being a mental illness, what’s the name of the diagnosis?",
                                                                                                                                                    "score": 2,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Scynexity",
                                                                                                                                                            "body": "Pronouns are just about gender, like I previously said, so there is no distinction there.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "pimmen89",
                                                                                                                                                                    "body": "I understand that you think so, but what mental illness diagnosis has to do with using the wrong gendered pronoun?",
                                                                                                                                                                    "score": 2,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Scynexity",
                                                                                                                                                                            "body": "Believing yourself to be the gender you aren't.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "pimmen89",
                                                                                                                                                                                    "body": "And what’s the name of it? I think you gave a description and not a name.\n\nI have to believe I am a gender I am not to use the wrong gendered pronoun of someone else? Or do you only mean if I use the wrong gendered pronoun of myself?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Scynexity",
                                                                                                                                                                                            "body": "That is what it's called. It is a mental illness to believe that you are not of your gender. It's a furtherance of that same illness to demand others join your delusion.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "pimmen89",
                                                                                                                                                                                                    "body": "I can’t find it as a mental illness when I look in the DSM 5. If you mean feeling discomfort around the gender you identify not matching your biological sex, called gender dysphoria, it’s not recognized as a disorder and the use of pronouns is not a diagnosis criteria at all, or a sign of it. Is that the condition you mean?\n\nReferring to yourself in a third person pronoun regularly however can be a sign of a personality disorder (such as DID or NPD) which is a mental illness. [You can see an example of that here](https://youtu.be/sIV-RwYbWio?si=G5z6qXArkq5fHyHW). Is that a pronoun use you’re concerned with?",
                                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "Scynexity",
                                                                                                                                                                                                            "body": "> Is that the condition you mean?\n\nNo.\n\n> Is that a pronoun use you’re concerned with?\n\n[For the third time, no](https://old.reddit.com/r/AskTrumpSupporters/comments/1iwdgon/what_makes_being_blind_to_differences_superior_or/mekrwl3/).",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "pimmen89",
                                                                                                                                                                                                                    "body": "So it has no diagnosis? Is it only your personal opinion that it’s a mental illness, or did you learn it from mental health professionals?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "Scynexity",
                                                                                                                                                                                                                            "body": "I applied common sense - no need to outsource my critical thinking to others.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "pimmen89",
                                                                                                                                                                                                                                    "body": "Why do you think that most of the US population, and especially people that work with and study mental health, don’t agree with you when they apply their common sense?",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "Scynexity",
                                                                                                                                                                                                                                            "body": "I think the large majority of people do agree with me. That's why this is such a winning political issue. I hope the Dems keep running on this, it works out great for my side.",
                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "iilinga",
                    "body": "Pronouns are incredibly helpful to me. I work with many people with unisex names so having pronouns in an email signature gives me an idea of who to expect when I call. \n\nBut refusing to call someone by their preferred pronoun sounds incredibly disrespectful to me. If someone gave you their name would you also refuse to use that?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Scynexity",
                            "body": "No, I think that using legal names is fine.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Popeholden",
                                    "body": "If my name is Richard on my birth certificate, will you call me Rick if I ask you to, even though it's not my legal name? What if my name is Richard but I ask you to call me \"Barry\" or \"T-Bone\"? Those aren't legal names or even closely related to my legal name, would you refuse to use them? What if my legal name is Richard but I ask you to call me Susan?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Scynexity",
                                            "body": "Nicknames are fine. Changing gender is not something I want to humor.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Popeholden",
                                                    "body": "What if I'm born male and my name is Brian but I decide to transition to female and I choose a gender neutral name like Jordan or Jamie, would you use that name?\n\nSorry if these seem like stupid questions I'm just trying to see where the line is",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Scynexity",
                                                            "body": "Not voluntarily.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Popeholden",
                                                                    "body": "So it doesn't matter if the name is wildly different but it does matter if the name is at all in furtherance of any kind of transition? Like if I'm not transitioning and I want to you to call me by some other unisex name like Casey, that's fine. If I'm transitioning and I want you to call me by a unisex name, you won't. Why do you care what someone wants to be called?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Scynexity",
                                                                            "body": "I don't care what they want to be called. I do care about not participating in delusions. I would also not pretend that a schizophrenic was actually God or that a paranoid person was actually being targeted by the government.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jasonmcgovern",
                    "body": "treating someone with basic dignity is 'special treatment'?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Scynexity",
                            "body": "I wouldn't say that.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jasonmcgovern",
                                    "body": "why wouldn't you say that?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Scynexity",
                                            "body": "I don't think it's true... presumably why anyone disagrees with anything.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "jasonmcgovern",
                                                    "body": "but what part are you disagreeing with? Do you disagree with the notion that trans individuals are worth treating with basic common courtesy?\n\nI am assuming you would respectfully go along with someone asking you to use proper title, name, etc, correct? If so, what makes trans people different?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Scynexity",
                                                            "body": "> Do you disagree with the notion that trans individuals are worth treating with basic common courtesy?\n\nI don't think there is such a thing as \"trans individuals\".",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "jasonmcgovern",
                                                                    "body": "what does that mean? You don't regard them as people?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Scynexity",
                                                                            "body": "It's a choice, not an ontological category like \"man\" or \"woman\". Men can pretend to be women, but they are still men. If you want to call people that pretend that way \"trans\" that's fine, as long as its understood that their pretending doesn't entitle them to anything different from any other man .",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "jasonmcgovern",
                                                                                    "body": "why do you think it's a choice?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Scynexity",
                                                                                            "body": "It's easily changeable. Just stop pretending and poof - no one knows you'd like to pretend.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "jasonmcgovern",
                                                                                                    "body": "what's the difference between a man believing they are a woman and a man believing in a specific religion? would you be as equally dismissive of the religious person?\n\nOr, say the trans person is pretending - what is preventing you from treating them with a basic modicum of respect?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Scynexity",
                                                                                                            "body": "Yes, religion is also not an immutable characteristic or an ontological category.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "It's all mumbo jumbo. Yes, you, a company, or politician can virtue signal if they want. Famously Biden saying he was going to select a non-white woman as VP, and a black woman as his SCOTUS appointment is classic racism and sexism commonly called \"woke\". But in general the average person is going to post a job description, and then make a choice based on the people who apply which is a limited field to choose from. If you are dumb, you'd throw people out of the pool based on sex or color or other non-professional feature.",
            "score": -1,
            "replies": []
        },
        {
            "author": "mrhymer",
            "body": "Because wokeness is the Marxism of immutable characteristics. It pits people against each other and it is racist, sexist, and fascist.\n\nMeanwhile, valuing people as individuals by the content of their character is the morally  right way to proceed.",
            "score": -11,
            "replies": [
                {
                    "author": "PeskieBrucelle",
                    "body": "I've noticed 'Marxism' being used frequently in discussions lately. \n\n\nHaving studied Marx's actual writings and scholarly including other scholars critiques for my coursework, I understand there are different interpretations of this term as much as complex issues surrounding the book. \n\n\n I've examined both the core concepts and limitations of Marxist theory through a critical academic lens. So I'm not going out there calling people a comrade just because I read it. \n\n\nTankies are a real problem and I'm not blind to them and that area of extreme. \n\n\nMarx's writings, like any theoretical work, should be approached with critical analysis. \n\n\nJust as scientific theories require peer review to validate their findings and expose potential biases, relying solely on one person's perspective whether Marx's or anyone else's limits our understanding.\n\n\n A comprehensive evaluation requires examining multiple viewpoints and critiques. These nuanced topics come to my mind when I see Marx mentioned but I realize, to conservatives of differing minds and ideologies of mine they see it differently and I do value different insights on topics. \n\n\nI don't believe in absolutes, except that complex situations always have nuance. Refusing to examine these nuances leads to bias and prevents genuine understanding.\n\n\nWhich brings me to your use of the word, I notice you're using the term quite differently almost as a general descriptor rather than referring to the specific economic and social theories Marx proposed. \n\n\nCould you help me understand your interpretation? \n\n\n I'm curious about how you're connecting Marxism to discussions about identity and social characteristics, as this seems to be quite different from Marx's original economic theory about class struggle and means of production. \n\n\nCould you elaborate on how you see these concepts relating?\n\n\nSimilar to how the term 'woke' has taken on different meanings in today's discourse, I've noticed the same happening with 'Marxism.' \n\n\nThis observation actually inspired my post I'm trying to understand how we reached a point where our shared vocabulary has become so contested, with words carrying such different meanings for different people.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "> Could you help me understand your interpretation? \n\nHere is an article by Helen Pluckrose on Quillette.com that will help you.\n\nhttps://quillette.com/2024/05/07/how-french-intellectuals-ruined-the-west-foucault-lyotard-derrida/",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "iilinga",
                                    "body": "Are you equating the post modernists with people who are ‚woke’?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "Yes - please do keep up",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "iilinga",
                                                    "body": "Did you read your link before posting? Because it’s very specific on post modernists rejecting and tearing down Marxist principles. So how can post modernists be both woke and Marxist?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "Because economic Marxism failed but the new sexy post-modern Marxism based on power and oppression is better according to these French idiots.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "iilinga",
                                                                    "body": "How can something be Marxist when it rejects the basic fundamental principles of Marxism?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": "The basic fundamental principle of Marxism is that the oppressed should subjugate the oppressor. Communism knocks the oppressor in the head and takes their business. Fascism uses the state to take control of their business away from the oppressor.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ilosesoothersmaywin",
                    "body": "Woke-ism by definition has to be racist as it's looking for wrongs on the societal level that can be attributed to race and racism.\n\nIs this necessarily a bad thing?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "Yes - dividing people by race and assigning different level of value based on that is the definition of bigotry.\n\nYou cannot fix racism by being racist.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ilosesoothersmaywin",
                                    "body": "How do you even attempt to fix racism if you aren't able to identify where the racism is?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "I do not attempt to litigate or fix the past. I only focus on the present and the future. We have a robust system of reporting and marginalizing bigotry when we find it. It is exceedingly rare.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ilosesoothersmaywin",
                                                    "body": ">I only focus on the present and the future. We have a robust system of reporting and marginalizing bigotry when we find it.\n\nThat's woke though.  Understanding that there is racism in the present coupled with the desire to fix it.\n\nIs this a bad thing in your eyes?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "Yes - racism was dying and wokeness resurrected it. Anything that makes race significant and relevant is perpetuating racism. We need to stop focusing on race and stop measuring race and let racism die.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Ilosesoothersmaywin",
                                                                    "body": "So your belief is to bury your head in the sand when it comes to racism in hopes it goes away on its own?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": "It's gone. The racists have to mine our \"unconscious bias\" to find it.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "TriceratopsWrex",
                                                    "body": "How do you fix a problem without identifying the root cause, a process that requires analyzing the past?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "You fix the problem by letting people like me have our own agency and live our own lives. Your \"discovery\" of white unconscious bias means that I will never be anything but protected by you. I reject that nonsense.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "TriceratopsWrex",
                                                                    "body": "Why are you making assumptions about what I believe?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": "Shock me",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "iilinga",
                    "body": "How can Marxism be fascist?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "Fascism is Marxism through state regulation instead of state ownership.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "iilinga",
                                    "body": "Well that’s not really accurate is it? The commodification of people and relationships is a core feature of Marxism as is the idea of social change through class struggle. Neither of these feature in fascism",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "It's the same action by different means. Communism is the subjugation of wealth by changing the ownership of the means of production. Fascism is the subjugation of wealth through state regulation. Both are the subjugation of wealth and both are driven by the all consuming wealth envy that drives all of Marxism.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "iilinga",
                                                    "body": "Well it does matter because words have meaning. And it’s not the same action. You are still misrepresenting communism and now you’re conflating Marxism, fascism and communism. They are very different theories and very different social outcomes. Fascism is not driven by the subjugation of wealth at all. Are you conflating these because you are unfamiliar with them?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "I stand behind this analysis. Communism is the subjugation of wealth by changing the ownership of the means of production. Fascism is the subjugation of wealth through state regulation. Both are the subjugation of wealth and both are driven by the all consuming wealth envy that drives all of Marxism.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "non_victus",
                    "body": "\"Meanwhile, valuing people as individuals by the content of their character is the morally right way to proceed.\"\n\nThis is so much easier said than done.  Every day, all day, we pre-judge the \"content of people's character\" based on what they're wearing, weight, height, sex, race, where you saw them, etc.  \n\nMaking decisions this way may be an ideal way to operate in the world, but fundamentally impossible given our implicit biases.  Consider your reactions to the following:\n\n \\- Young person driving a Porsche.\n\n \\- Young person in a slum\n\n \\- 4 teenagers on a stoop\n\n \\- Two doctors discussing a surgery\n\nWhat did they look like in your mind? Male/Female? White/Black/Asian?\n\n  \nTry an real implicit bias test - if you're curious about your own: [https://implicit.harvard.edu/implicit/selectatest.html](https://implicit.harvard.edu/implicit/selectatest.html) \n\nIf we're affected by our implicit biases, how can we ensure that we're making morally normative decisions that are based on character, rather than some superficial judgement (MAGA Hat, Harris Hat = must be a despicable person / I have nothing in common with them / not worth my time)?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "I do not buy the argument for unconscious bias. We do the best we can and that is all we can do.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "non_victus",
                                    "body": "Does that mean you don't believe that implicit biases exist?   Or that you never make judgements about people you don't know personally?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": ">Does that mean you don't believe that implicit biases exist?\n\nWe are the point where making race significant does far more damage than anything else. We need to get on with seeing people as individuals with agency and not merely attributes of their birth.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Justthetip74",
            "body": "I would argue that the conservative position isn't being colorblind but treating everyone equally regardless of race\n\nI would argue that the progressive position is Ibram X Kendi \"anto-racism\" which is not treating equally but using present day discrimination to make up for past discrimination.\n\nMy example is that the company I work for offers 4hr/wk leadership mentoring for black, brown, aapix, LGBTQ, and women",
            "score": -1,
            "replies": [
                {
                    "author": "MobyDickPuncher",
                    "body": "Is the company under some obligation to offer leadership mentoring? Have you seen white, cis, men go to management and ask for leadership mentoring and been denied?\nOffering a benefit to a group does not sound like negative discrimination. \nIs there such a thing as negative vs. positive discrimination maybe? Would positive discrimination be okay in your eyes?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Justthetip74",
                            "body": "There is no leadership mentoring program aside from this one. I asked HR and was offered a single 3 hour group lecture after hours (which I took).\n\nPositive discrimination is what I'm disagreeing with",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "iilinga",
                    "body": "So companies have found that increased diversity in their leadership tends to correlate to improved financial success. Are these groups underrepresented in the leadership team?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "notapersonaltrainer",
            "body": "Woke exposed itself when it went after Asians and \"white-adjacent\" POC—culminating in unapologetic \"context-dependent Jewish genocide\".\n\nUp until that point, it could potentially be dismissed as mere \"anti-racism\"—since, by its logic, you can't be racist to whites...which of course is racist but upstanding white people couldn't point out the naked racism. \n\nBranding and targeting any high-achieving \"white-adjacent\" revealed woke was just a nastier instantiation of SJW focused on success grievance, even against minorities. At least the original SJW movement had the sense to keep it strictly anti-white. \n\nWhen you take intersectionalism to its logical limit you get the individual. That is colorblindness. Treating people as individuals, not abstract melanin groups for perverse intergenerational guilt games. \n\nThis woke obsession with putting people in biological guilt boxes isn’t progressive—it’s regressive and vulgar.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Big_Poppa_Steve",
            "body": "\"Woke\" is the disgusting belief that white, cisgender men deserve to suffer because they have oppressed minorities for 400 years. It's appalling.",
            "score": -7,
            "replies": [
                {
                    "author": "PeskieBrucelle",
                    "body": "I believe no one deserves to suffer, regardless of their background, gender, age, or race. This includes white men. \n\n\nLearning about history is crucial, even when it's uncomfortable, as it helps us acknowledge both our progress and areas still needing improvement. \n\n\nWhen I advocate for equality, I mean true equality for everyone, which requires recognizing where inequalities still exist.\n\n\nAnger about historical injustices is valid, and people express it in various ways.\n\n\n While I don't condone cruel expressions of that anger, I understand its roots in deep historical trauma. \n\n\nLike family secrets, unaddressed historical wounds eventually surface, often in destructive ways.\n\n\nWe can't shape a better future by ignoring our past. \n\n\nWhile we aren't responsible for our ancestors' actions, understanding their choices helps us make better ones.\n\n\n I've studied my own white ancestors' history, and rather than feeling shame about my heritage, I've learned to appreciate those who stood for positive values while learning from others' mistakes.\n\n\nWhat concerns me most are the basic human tendencies toward fear, anger, and tribalism that persist today. \n\n\nWe're all human, yet we have different cultures and biological characteristics.\n\n\n Acknowledging these differences  and the history of indifference is essential for social progress. \n\n\nOur complex human history deserves recognition, but it should never be used as a tool for discrimination.\n\n\nWoke, may not be the right description for this expecially in this political climate but, no one deserves to be discriminated against. \n\n\nNo one deserves to have their experiences and histories invalidated or be weaponized for discrimination because of it.  \n\n\nTo achieve genuine equality, we must identify and address areas where people experience unequal treatment compared to others. \n\n\nWhat specific inequalities do you see in your community that need attention?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Big_Poppa_Steve",
                            "body": "Black people are definitely at a disadvantage in my community, as are young men of all races. Young Black men are especially disadvantaged. How about you?",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Heffe3737",
                                    "body": "Do you think your statement would be considered “woke”? Because from a liberal perspective, what you just stated is what liberals consider being “woke” - the act of simply recognizing and acknowledging that inequalities exist. Whatever “wokeness” means on the right, do you think it means the same thing to the left?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Big_Poppa_Steve",
                                            "body": "No, I don't think my statement should be considered \"woke.\"\n\nI live in the center of one of the most liberal areas in the United States, only a little less liberal than San Francisco. This place has one of the largest gaps in outcomes between Black and white lives. NTS do nothing but talk and put up yard signs. \n\nInstead, NTS are focused on the rights of transsexuals and illegal aliens. More and more Black people are willing to give Trump a try because of this.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Heffe3737",
                                                    "body": "I understand that you don’t think NTS are effective, but that didn’t really address my question. \n\nWhy do you not think your acknowledging of the existence of inequalities is woke?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Big_Poppa_Steve",
                                                            "body": "No, I don’t think you understand at all. It’s not that “woke” NTS are ineffective, it’s that they are hypocrites.\n\nI have just stated the facts. That’s not “woke”. “Woke” is using those facts to shame others and thereby improve my place in the pecking order. That’s what “woke” people do.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Heffe3737",
                                                                    "body": "So according to you, the definition of woke is “using facts to shame others and improve one’s place in the social hierarchy”? Thats super interesting. Do you think that’s how liberals define woke as well?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Big_Poppa_Steve",
                                                                            "body": "I don’t know how liberals define woke",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Heffe3737",
                                                                                    "body": "Have you ever asked one?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Big_Poppa_Steve",
                                                                                            "body": "No",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "iilinga",
                    "body": "What do you define as ‚suffering’?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Big_Poppa_Steve",
                            "body": "Suffering is losing your job and not being able to provide for your family.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "iilinga",
                                    "body": "Do you know anyone who actually wishes that on people? Like I would consider myself having several values and ideals that you would like consider woke but I don’t believe that white cisgender men deserve to all lose their jobs and suffer",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MattCrispMan117",
                                            "body": "l mean personaly have  l seen it lRL??\n\nl live in a pretty rural area of west virginia so l personally know very many democrats and the ones who are democrats tend to be pretty chill and moderate.\n\nThat said there's a guy on Tiktok l've seen named TizzyEnt who has an entire channel based around getting people fired from their jobs because they said or did something. Some of the people he goes after for sure are dirtbags but some just said the wrong thing at the wrong time not knowing they were being recorded.\n\nHe's not the only one either, while its died down a bit cancel culture is still a real thing (and in all honesty sadly l've seen it rising on the right as well; especially with the gaza stuff).\n\nBut just to answer your question yeah l have seen that in some people.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "iilinga",
                                                    "body": "Really? That sounds really sad to see, I can’t imagine seeing that much hate in someone :( \n\nIf someone is getting fired for something they’ve said, it sounds like their employer doesn’t want to be associated with their views, which is valid because they should have the right to protect their brand or if you’d rather businesses didn’t have that freedom, sounds like an issue for the strength of your employment protections.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}