{
    "title": "Have you come across Haidt’s moral foundation theory, what are your thoughts on it?",
    "author": "hadawayandshite",
    "subreddit": "AskTrumpSupporters",
    "rank": 66,
    "score": 4,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1ixs9mo/have_you_come_across_haidts_moral_foundation/",
    "id": "1ixs9mo",
    "selftext": "https://en.m.wikipedia.org/wiki/Moral_foundations_theory\n\nEssentially, they suggest there are 6 moral foundations that our morals and political affiliations spring from:\n\nCare/harm\nFairness/cheating\nLoyalty/betrayal\nAuthority/subversion\nSanctity/degradation\nLiberty/oppression\n\nWe each hold all of these 6 morals but in different ways and to different extents\n\nLiberals/left are higher than those on the right on Care, Fairness and Liberty (but again the view of ‘fairness from left and right might vary) meaning they’re seen as more important…with the other 3 being less important/lower\n\nThose on the right hold all 6 in roughly equal importance (3 being less important than the left hold them, 3 being more important)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amishmercenary",
            "body": "Remember reading Haidt in college, but I would say that moral foundations in general are going to be way too complex to simplify into specific political affiliations - real life tends to be very situational.",
            "score": 3,
            "replies": []
        },
        {
            "author": "WulfTheSaxon",
            "body": "It makes a lot of sense. I also appreciated this article that talks about it in part: https://www.tabletmag.com/sections/news/articles/americas-white-saviors",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZarBandit",
            "body": "I think it fails to address the obvious foundational fact that people’s morality is almost always aligned with self interest.  Morals are neither randomly selected nor virtuously selected.\n\nFurthermore, morality is entirely subjective.  Thus, no one can legitimately claim their morals superior to mine.  Or vice versa.\n\nFor something that claims ‘foundational’ status, that’s a lot of missing foundation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "notapersonaltrainer",
            "body": ">Liberals/left are higher than those on the right on Care, Fairness and Liberty\n\nHis model applies to classic liberals, not today's leftists. \n\n* Care? As long as you're not white, asian, male, cisgender, christian, other non-muslim religious, non-aligned white female, conservative, \"deplorable,\" rural, a raped Israeli woman, or capitalist. They have contempt for more of humanity than virtually any other group. \n\n* Liberty? If you mean oppressive bureaucracy, economic control, intergenerational race guilt, lockdowns, and speech suppression, then sure.\n\n* Fairness? Equity is the opposite of fairness.\n\nIronically, Loyalty, Authority, and somehow both Sanctity/Degradation better describe the modern leftist. Party dissent leads to excommunication, they're championing the unelected bureaucracy as we speak, and moral inversion is their morality.",
            "score": 1,
            "replies": [
                {
                    "author": "hadawayandshite",
                    "body": "Do you think things have changed for the left massively from 2004 when he measured this?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "notapersonaltrainer",
                            "body": "In 2004 these were all [Democrats](https://x.com/iliketeslas/status/1858158941584208255).",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Karma_Whoring_Slut",
            "body": "I’m not sure if I took the official test for it (moralfoundations.github.io) But I took a test claiming to be Haidt’s moral foundation theory, and scored as follows: \n\nCare: 58\n\nFairness: 85\n\nLiberty: 79\n\nIn Group Loyalty: 73\n\nPurity: 46\n\nAuthority: 60\n\nMost of these tests end up having a pretty heavy bias against conservatives in the way they phrase their questions, for the most part I thought this one was well written. Although, there were a few issues that were lumped together in one question, that I would have preferred were separated into multiple questions. Or, maybe rather than having the answer being a degree of agreement/disagreement, maybe the questions could have been more vague, and the answers could have been examples of where you draw the line. \n\nI also do seem to follow the websites political prediction based on my test scores. It predicts that libertarians will hold Liberty highly and it’s not uncommon for them to score high on fairness as well. So, at least in my case, it seems to be somewhat accurate.",
            "score": 0,
            "replies": [
                {
                    "author": "ScootyJet",
                    "body": "If you liked the test then you might might his book: The Righteous Mind. I think it's a pretty even keel analysis of why good people feel very differently about religion and politics. \n\n(Obligatory question) Have you read it?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "I mean it's all subjective to individual interpretation but I'd agree the solid left and solid right are going to be different and us moderates are going to be a blend.",
            "score": 0,
            "replies": []
        }
    ]
}