{
    "title": "Will you support direct or indirect US military intervention if China invades Taiwan?",
    "author": "AlternativeRare5655",
    "subreddit": "AskTrumpSupporters",
    "rank": 54,
    "score": 21,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 35,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1iyydwd/will_you_support_direct_or_indirect_us_military/",
    "id": "1iyydwd",
    "selftext": "https://www.reuters.com/world/trump-declines-answer-question-about-china-taiwan-2025-02-26/\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JoeCensored",
            "body": "All we need to do is impose a trade blockade.   Position down by Indonesia and the Philippines.   Don't let any tankers or cargo ships pass.  \n\nTaiwan then just needs to hold the north of their island for around 6 months.   After that, China will run out of food and energy.   \n\nRussia has both, but can't ship it fast enough to supply China.   Taking it by trucks through their neighbors is not going to work either.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thirdlost",
            "body": "They U.S. policy of strategic ambiguity goes back to 1979. \n\nTrump is just another in a long line of presidents to give such an answer.  It seems s disingenuous to pin this on Trump.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheGlitteryCactus",
            "body": "I'm for the direct approach. Troops on the ground, let's kick China's butt with our manufacturing buddies in Taiwan. \n\nI always hear \"The defense budget is so expensive.\" and \"Military spending is our biggest expense.\" Well, if we're paying for it, we might as well use it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "notapersonaltrainer",
            "body": "I can only realistically see China invade *after* it is confident it can sink any aircraft carrier within the first or second island chain using mass drone swarms and hypersonics. \n\nAt that point we can't really do a conventional counter-offensive. There would be a naval blockade and focus on containment. We would also have to take out all their shipyards since they have 230x our shipbuilding [capacity](https://www.defensenews.com/naval/2024/12/08/dwarfed-by-china-in-shipbuilding-us-looks-to-build-its-defense-base/) which would quickly overwhelm us in a grinding naval war. The question is whether they go nuclear in response at that point. \n\nThe invasion scenario is a bogeyman, though. It's infinitely easier for them to just use soft power and not end up in a nuclear war.",
            "score": 3,
            "replies": [
                {
                    "author": "Heffe3737",
                    "body": "Excellent comment! How do you feel about China’s recent foray (last 10-20 years) into carrier building, and their fleets’ current tactical capabilities?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tachyonzero",
                            "body": "They want to have the best of the both worlds, have a cake and eat it too. They are already learning from Japanese, British, and Russian mistakes, and we know what they want. The gap between the time it takes to build ships and personnel training, which spans years, and the time it takes to sink a fleet of ships, which takes at least an hour, has widened significantly. As you know, United States power in the pacific lies at the might of USN which badly needs an overhaul and increase fleet capacity. We want allies not to rely on us but also we want them on par on budget parity. It’s like bringing your rich friends to a restaurant and they expect you to pay for it.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SpicyBanana42069",
            "body": "No why should this be our problem? \n\nIf anything we should foster a better relationship with China.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lordtosti",
            "body": "Again shows Trump why I support him.\n\nIf you take even more then a tiny brief look behind the Western narratives, it is very clear that China will act on Taiwan if the West tries to actively remove Taiwans ties from China.\n\nThey see it as an unfinished civil war where the Taiwan government for a long time even claimed to be the rightful government of China.\n\nChina also has the “century of humiliation “ high in their collective conscience and they won’t accept further humiliation from the west.\n\nThe status quo right now is good. So Trumps stance is also good.\n\nPeace above idealism.\nWe should have also done that in Ukraine and Russia would have never invaded.\n\nBring in the downvotes, I’ll carry them as upvotes 🥰",
            "score": -2,
            "replies": [
                {
                    "author": "Loose_Orange_6056",
                    "body": "Russia attacked 2014 as a response to the people of Ukraine overthrowing Viktor Janukovytj? What should the Us have done differently?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "lordtosti",
                            "body": "“the people of ukraine “ or the western part of ukraine?\n\nThe US and the west in general shouldn’t so actively try to be involved in trying to pull Ukraine into the western influence.\n\n\nhttps://www.bbc.com/news/world-europe-26079957.amp\nhttps://www.youtube.com/watch?v=rQnXo2HMriQ\n\nFrom a realpolitik point of view it was expected what russia was going to do. They just signed a lease for their only warmwater military harbor.\n\nNote that barely any people died (2?) in crimea and the east of ukraine completely didn’t support what was nothing but a coup of a democratic elected president in their eyes.\n\nCompare that to the result of (probably) +1.000.000 of deaths and trillions of economic damage after unnecessary further provocations of the Biden administration in 2021.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Shoddy-Cherry-490",
                                    "body": "If you look at who did the pulling in Ukraine, wouldn’t you say that Russia did far more of it? Didn’t pro-Russian operatives try to kill Viktor Yushchenko with TCDD in 2004?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "lordtosti",
                                            "body": "I don’t do “teams”.\n\n- The Russian political class is terrible \n- The western political class is terrible\n\nI just say it was preventable.\n\nRealpolitik above having +1.000.000 killed for making some kind of moral point.\n\nThe reflaming of the political conflict in 2022 was completely preventable by just taking russians point of view about NATO encroachment only the slightest serious.\n\nJust like we would with a Cuban or Switzerland military alliance with Russia or China that allows them to place nukes on said countries.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Shoddy-Cherry-490",
                                                    "body": "Why people keep going this laughable myth about NATO encroachment? Putin doesn’t give a single F about NATO…as a threat to Russia! NATO was never a threat to Putin. Not once! And Putin is smart enough to know that. Otherwise he’d be shitting the bed that those pesky Finish neighbors are now also NATO members. What NATO is to Putin is an obstacle!!\n\nPutin wants to rebuild his sphere of influence and the Eastern Europeans and most Ukrainians just don’t want any part of that! And if you have ever travelled to any part of Eastern Europe you know exactly why!\n\nI remember a conversation I had many years ago with a federal agent of the German police who was working in Eastern Europe. There was never any real cooperation with Russia. Already 20 years ago it was a mafia state!",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "lordtosti",
                                                            "body": "Well your endpoint seems to be “see they are evil!!!” so not sure why i answer this. It’s impossible to convert ideologists.\n\nBut ok last one:\n\n- Like Finland has the same history as Georgia and Ukraine. If you don’t see why there is a difference in historical important countries to russia or finland you lack empathy \n- If it’s not about NATO why give them such a clear middle finger by first making two times a provoking statement in 2021, and then give them the middle finger dec 2021 when they promised to invade if they wouldn’t stop the encroachment in sensitive territories?\n\nhttps://www.youtube.com/watch?v=Zf5xEBwBhds\n\nBonus question: why did your leaders and the media hide this information? Why is it not a public debate if we want to take russias point of view serious or not? \n\nThey bet behind closed doors that this would be beneficial for the west and they LOST. \n\nWith hundreds of thousands of people dead and trillions of economic damage.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Shoddy-Cherry-490",
                                                                    "body": "Sure! We can engage in endless mental gymnastics why we are all just victims. History is really just one “Dolchstoßlegende” after another, right.\n\nWhere are you from anyway? Have you ever been to any of these places you seem to think you are so knowledgeable about? Did you grow up in Eastern Europe? Do you know anyone from there? \n\nHonestly I am so sick of people behaving like little Putin lover boys when it’s so painfully obvious that they don’t know the first thing about the subject matter.\n\nMan Putin send entire armies into a neighboring country not because Zelensky wouldn’t have a pow wow with him but because he decided it was time to take Ukraine by force. Putin started this thing from the very beginning. He can whine all he wants about NATO, about alleged assurances by the West and all that BS. It’s always some BS pretext. For Hitler it was the stab-in-the-back-myth and Versailles, in Iraq it was “WMDs”. Yeah, you can chose to eat up that shit and decide to be blind to reality. Or you can see right through it.\n\nSeriously wake up dude! Life is not some nonsense you can rhyme yourself together on Reddit because it fits your world view.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "lordtosti",
                                                                            "body": "I understand that eastern countries don’t like Russia. That has nothing to do with preventing unnecessary wars. \n\nI also understand hutus hate tutsis and the other way around. Doesn’t mean I would unnecessarily provoke one or the other.\n\nAccording to you Russia is going to invade further even if there is a MAGA president right? (hopefully until 2032) Lets see what happens.\n\nYou are going to adjust your opinion if your “putin is hitler” predictions don’t come to fruition ?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Shoddy-Cherry-490",
                    "body": "How is this different from the Taiwan policy of every presidents since Reagan?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "lordtosti",
                            "body": "Well ask the dumb journalist trying to frame Trumps very rational answer or anyone following mainly mainstream media.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "itsmediodio",
            "body": "These questions should really just be \"would you advocate for a nuclear holocaust and the death of all of humanity.\"\n\nA war between nuclear powers is not a sane, viable option and those seriously advocating it are extremely idiotic and/or psychopathic.\n\nThat being said I support deterence and making sure that those seeking aggressive action are just as afraid of us as we are of them. I also think an air of unpredictability is better than announcing your intentions in the press.\n\nI suppose as an alternative he could do what Obama and Biden did and publicly declare a red line that must never be crossed, and then when put to the test either commit to ww3 or cave and show extreme weakness resulting in further invasions. I think history has shown though that that doesn't work.",
            "score": -6,
            "replies": [
                {
                    "author": "GuiltySpot",
                    "body": "What do you think Trump will do in such a scenario?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "WhitePantherXP",
                    "body": "There is no chance we will wage a direct war against China, it would be yet another proxy war with aid to various degree, maybe direct involvement depending on the administration in power. It will simply be defensive, not an offensive deep into China territory. Given that clarification, would you support it?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "perfect_zeong",
            "body": "The US should not intervene in Taiwan, with direct or indirect military means",
            "score": -1,
            "replies": [
                {
                    "author": "thirdlost",
                    "body": "Nah. Fuck China.  China is our most pressing adversary In the world, and they need to be opposed on all fronts",
                    "score": 1,
                    "replies": [
                        {
                            "author": "perfect_zeong",
                            "body": "I think the US should not involve itself in random wars, including this hypothetical china scenario. Which surely would be quite costly",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "thirdlost",
                                    "body": "Yeah, my last comment was a bit flippant. \n\nI definitely believe it is our national interest on many levels to protect an independent Taiwan. I also agree a full military encounter with red China is a bad idea. Which is why we need to focus on deterrence and military strength to prevent a conflict.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Tachyonzero",
                                    "body": "It’s unavoidable, Thucydides Trap- no matter how you contain it or make a buffer, it ends up on a collision. US cannot let it guard down and they must prepare. Beijing also wants what Washington DC is having.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Trumpdrainstheswamp",
            "body": "No",
            "score": -1,
            "replies": []
        },
        {
            "author": "MakeGardens",
            "body": "Hell no. ",
            "score": -1,
            "replies": []
        },
        {
            "author": "Flussiges",
            "body": "No.",
            "score": -7,
            "replies": []
        }
    ]
}