{
    "title": "Are there any democratic nominees in 2028 that you'd tolerate if they ended up winning?",
    "author": "Cold_Student",
    "subreddit": "AskTrumpSupporters",
    "rank": 31,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1j1es80/are_there_any_democratic_nominees_in_2028_that/",
    "id": "1j1es80",
    "selftext": "With no clear leader in sight and the party effectively running around aimlessly like a chicken with its head cut off, the 2028 democratic primary is looking to be very competitive and unpredictable with plenty of potential candidates seeking the nomination. That being said, is there any democrat you'd be fine with seeing in the oval office if republicans lose in 2028? This can be any politician that can run as well as outsiders that lack any experience in elected office and fit outside the establishment.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "If they convinced Tulsi to come back and right the ship I'd tolerate her.",
            "score": 3,
            "replies": [
                {
                    "author": "agentspanda",
                    "body": "Tulsi was wildly left wing progressive for WAY too long. I don’t buy it that she’s had some grand revelation.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "I think she has, but yes I disagree with her plenty. The one thing she has going for her is she isn't insane like everyone else witha D next to thier name",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "agentspanda",
                                    "body": "That much is fair. I call it the “John Fetterman Problem”. Fetterman and I profoundly disagree on nearly every issue but because he doesn’t foam at the mouth and isn’t actively stating half the country are irredeemably stupid racist misogynists he’s what passes for normal even though his actual policies are very far left. \n\nSometimes I forget that he only looks sane and reasonable because everyone else in his tent is so actively nuts.\n\nI’ve been debating recently how much I want to encourage this phenomenon though. Sane reasonable but far left dems are still dangerous and antithetical to my beliefs after all, and more likely to achieve their goals than folks too busy screaming “illegal president Elon Nazi orange man felon” to have a serious policy discussion.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Lucky-Hunter-Dude",
                                            "body": "The alternative is the insane ones might actually win If the GOP incorrectly takes their insanity as permission to go insane as well. I'd rather the opponent make a rational argument I disagree with than a irrational argument that is fucking bonkers.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "agentspanda",
                                                    "body": "Fair point. Again.\n\nAfter all the country is better off with two parties presenting alternate viewpoints and prescriptions for the nation; steel sharpens steel and all that jazz.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fignons_missing_8sec",
            "body": "Pete, Polis, klobuchar, Beshear and Shapiro are a couple that come to mind. I very much disagree with them on a lot of issues, and almost certainly (hopefully, will see how the other primary goes) won't vote for them but they are good politicians and I would feel fine with them in the Whitehorse.",
            "score": 3,
            "replies": []
        },
        {
            "author": "agentspanda",
            "body": "Probably Liz Cheney?\n\nI joke but also not really. I used to be a neocon after all; so while I would take issue with a resurgence just because the populist movement is better, I’m not necessarily gonna complain too loud if the left embraces social conservatism. \n\nBut anyone else or anyone actually involved in democrat politics? Probably not.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Davec433",
            "body": "[Governor Whitmer is killing it with getting the message that Democrats have been ignoring large swaths of their constituents.](https://apnews.com/article/michigan-governor-gretchen-whitmer-young-men-e237387d0762e900f2dc7e38a1c49f7b)",
            "score": 1,
            "replies": []
        },
        {
            "author": "basedbutnotcool",
            "body": "Hard to say. There’s no one realistic that I could see running that I’d like. I’d want someone like Bernie Sanders but with good immigration policy, which comprises none of the democrats that I know of.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChallengeRationality",
            "body": "In 2020 I would have been open to considering Bloomberg, Tulsi, Yang Gang or possibly possibly Buttigieg (before he was transportation secretary.)  Watching that massive lineup they had turn into presidential nominee Biden was shocking.\n\nI can’t see myself voting for any Democrats at the moment, I want to see how this plays out.  I’m ready for eight years of Vance, then eight years of Tulsi, then eight years of Barron. (I’m joking… or am I?)",
            "score": 1,
            "replies": []
        },
        {
            "author": "neovulcan",
            "body": "Chuck Schumer maybe. He's done some bipartisan work, speaks intelligently, and might be convincing in 2028. Would have to seriously dig into his positions, as I'm sure we disagree somewhere",
            "score": 1,
            "replies": []
        },
        {
            "author": "quendrien",
            "body": "Probably AOC. She’s a free agent who seems to offer some resistance to the Israel lobby. \n\nGavin Newsom would be great (clearly a capable and ambitious governor who I suspect would be a decent negotiator), but a bit too establishment as a nephew of Pelosi. Although hell, maybe that would be a good thing at this juncture.",
            "score": 1,
            "replies": [
                {
                    "author": "ChallengeRationality",
                    "body": "A yeerk got in this peds ear",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jaded_Jerry",
            "body": "Currently? No.  I have yet to see any Democrat who is willing to stand up to the Democratic Party that hasn't defected from them, and every Dem who does always tells stories about how Democrats manipulate their party through fear and intimidation to keep them from doing anything as crazy as voting in favor of policies that are popular among their constituents if it doesn't align with the greater Democratic party's agendas.\n\nBear in mind I say this as a former lefty.  The Democrats have fallen so far that I'm honestly not sure anymore if they've really \"fallen\" or if they were just always like this.",
            "score": 1,
            "replies": []
        }
    ]
}