{
    "title": "That Big Poll Showing Trump and Biden Are Evenly Matched? Trump Helped Pay for It.",
    "author": "atomicmarc",
    "subreddit": "progressive",
    "rank": 436,
    "score": 108,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 5,
    "url": "https://newrepublic.com/post/175387/wsj-poll-showing-trump-biden-evenly-matched-trump-helped-pay?utm_source=newsletter&utm_medium=email&utm_campaign=the_ticker_rss&mc_cid=a6bb0c90dd",
    "id": "16bpyk2",
    "selftext": "",
    "comments": [
        {
            "author": "None",
            "body": "Don't tell anyone. We want them to vote for Biden like it's do-or-die.",
            "score": 10,
            "replies": []
        },
        {
            "author": "FairLawnBoy",
            "body": "This headline could make some people complacent, was that the goal?",
            "score": 7,
            "replies": [
                {
                    "author": "Grouchy-Culture3946",
                    "body": "If people just read the headline, maybe, the whole article, no.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FairLawnBoy",
                            "body": "Really? The headline nailed the thesis of the article in my reading. What did you read in the article that separates it from what the headline conveys?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Grouchy-Culture3946",
                                    "body": "Ok, before we argue, we need to agree we're arguing about the same thing.  You asked if the headline could make some people complacent and I said maybe, but not if you read the article.  Meaning, no, they would be alarmed, not complacent.\n\nWhat I read in the article is that the whole polling exercise is typical Trumpian bullshit.\n\n>But the Journal neglects to provide information about one of the men behind the poll. Republican pollster Tony Fabrizio conducted the survey in partnership with a Democratic colleague, Michael Bocian. In a separate piece, the Journal acknowledged that Fabrizio “works for a super PAC supporting Trump’s candidacy.”  \n>  \n>What the Journal does not mention anywhere is that Fabrizio also worked as the chief pollster on Trump’s 2016 presidential campaign. And since the start of 2023, Trump’s super PAC, Make America Great Again Inc., has paid Fabrizio’s company more than $567,000, according to FEC filings.  \n>  \n>Fabrizio also has extensive ties to former Trump campaign manager Paul Manafort. Manafort was convicted of tax evasion and bank fraud in 2018 (as well as of having terrible taste in jackets by the court of public opinion).  \n>  \n>Fabrizio owned the firm that made a shady payment of $125,000 to Manafort in 2017. Fabrizio was also the lead Trump campaign pollster at the time Manafort provided raw polling data to Russian oligarch Oleg Deripaska, via Manafort’s associate Konstantin Kilimnik. Deripaska has been under U.S. sanctions since 2018, and Kilimnik has been discovered to be a Russian spy.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}