{
    "title": "Analysis | Americans are buying guns — but maybe not the Americans you think",
    "author": "Maxcactus",
    "subreddit": "progressive",
    "rank": 349,
    "score": 50,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 30,
    "url": "https://www.washingtonpost.com/politics/2023/11/27/guns-us-republicans-democrats/",
    "id": "185us6r",
    "selftext": "",
    "comments": [
        {
            "author": "intronert",
            "body": "Weird article. Focuses on small uptick in one area, completely ignores enormous drop in the number of rural Democrats who have a gun in their home, as shown in its included charts. Almost like click bait…",
            "score": 26,
            "replies": [
                {
                    "author": "Open-Artichoke-9201",
                    "body": "Yeah it’s a waste of time reading",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "st1ck-n-m0ve",
            "body": "Lol it says theres a large uptick in black gun ownership. Conservatives: “we dont mean THAT when we say we support the second amendment, we support it for us.”",
            "score": 5,
            "replies": []
        },
        {
            "author": "iambecomedeath7",
            "body": "As a gun owner, I love seeing gun ownership extend to demographics that aren't traditionally associated with shooting. It's a fine sport that's good for cultivating a lot of good personal traits. I think that the American left has done itself a great disservice by focusing so heavily on gun control. It's part of what fucked us over for the rural vote. For my part, I make it known that I have a standing policy of offering gun advice and training to anybody who wants it. As someone with a lot of LGBT and POC friends, I was surprised by how many people wanted to own guns but felt intimidated by the traditional, stereotypical firearms community.",
            "score": 8,
            "replies": [
                {
                    "author": "Manezinho",
                    "body": "Control doesn't mean banning... I'd feel a lot safer with requirements on training, background checks, mental health, licensing... Like countries that have sane government (and lower per-capita gun violence as a result).",
                    "score": 14,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "charliehorse8472",
                                    "body": "Personally I think an in-person practical test would put off a good amount of people who really shouldn't be owning firearms. Just something where you actually have to interact and be assessed by a real person might reduce the amount of extreme anti social people who purchase them.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Manezinho",
                                    "body": "Like, think a bit harder. We make people take a course to cut hair just in case they hurt someone with a clipper... Yet a gun... A tool with the specific purpose of taking lives... Can be bought with an ID and a smile.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "iambecomedeath7",
                            "body": "We actually have extensive background checking in place for mental health and criminal history. I'm not saying you're guilty of this, but the people who believe guns are unregulated generally don't really know what our requirements for gun ownership actually are. The problem is that our laws aren't really enforced very well.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Manezinho",
                                    "body": "Like... Extensive?  Mental health exclusions require involuntary commitment. Is this person trained? Do they know how to use it properly and legally?  Have they passed some psychological evaluation? Do they need this gun for some purpose? \n\nThe laws across nearly every state are insufficient, but a country where people and goods flow freely across states needs a minimum standard.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DantanaNYC",
                    "body": "So nobody should respond after any of our weekly mass shootings, many of them at schools and allow the gun-manufacturers mafia, the NRA get lawmakers to put assault rifles in the hands of every hand they can, regardless of their mental health or criminal records?!?\n\nNobody is coming for your guns! We want common sense responses to combat the real world problem of mass shootings! Arming every moron is only the answer for those selling guns.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DantanaNYC",
                                    "body": "How many guns did Obama confiscate? \n\nAnd how many extra guns were sold as a result of the propaganda that claimed Obama was coming for your guns?\n\nYou bring up things that COULD be weaponized, while you ignore the death count of people who are killed by dopes who think it’s their right to own a weapon of war?!?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "charliehorse8472",
                                            "body": "Friend look at the sub we're in, we all vote blue, we're not in anyway contributing to the problem your laying at our feet. I live in illinois, I voted for Pritzker who passed the Protect Illinois Communities Act despite the fact that I believe that it's silly and infringes on my rights. I will vote for him again because as stupid as that law is the idea of people in my community loosing access to abortion rights or the possible recriminalization of Marijuana under a republican governor is a much bigger threat to everyone I know. Progressive gun owners (at least those I know) have no issues with gun control but democratic politicians tend to pass sweeping bans on firearms due to specific mechanical features rather than actually refining institutional methods to promote firearms safety.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "iambecomedeath7",
                                                    "body": "Yeah. This is the disheartening thing. I keep voting for the people who will help ensure I have healthcare for my disability or help to ensure that women have the ability to avoid unwanted pregnancies, the people who keep people in LGBT marriages married, the people who keep wages up and who don't pander to anti immigrant/POC hate groups for votes. But like. I wish that those people would rope those of us who actually know about firearms into their discussions about ending gun violence instead of going to uninformed outrage mongers like the Everytown crowd.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "iambecomedeath7",
                            "body": "Oh come off it. We have plenty of legislation around guns, it just isn't done sensibly or isn't enforced. What is the point of banning pistol grips? Bayonet lugs? Barrel shrouds? Telescoping stocks? People go after shit like that instead of working *with* gun owners - the people who know what they're talking about - on things that would actually save lives, like more enforcement on background checks or more accessible safety training. That sort of attitude is why gun control is viewed by us as a botherance rather than as a means to saving lives.\n\nAlso, have a look at the material conditions of our country. We're totally different from the UK, Australia, New Zealand, and Japan. We're no island and our living standards have been declining since the end of the American System in the 70s. We're more like South Africa or former Yugoslavia. Declining living standards cause violence for many reasons. Even if all our guns went away, we'd still have mass killings.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "skankingmike",
            "body": "Lots of minorities of course are going too.  The black community has for years advocated for gun ownership.  I don’t know many black people who don’t own a gun.   And Hispanics I mean half the countries if you don’t have a gun you’re a target.  Every single Puerto Rican family member I have owns at least one if not many.  That island is big into guns… Mexico is a mix bag but most of them love guns too.  The Hispanics have more in common with the Republicans than the democrats.. very religious, into guns, into holding onto old traditions, I’d say the abortion issue is a mixed bag too.  \n\nhttps://www.pewresearch.org/race-ethnicity/2022/09/29/hispanics-views-on-key-issues-facing-the-nation/\n\n\nHe pew is clearly trying not to say it but if 14% of all Hispanics say it should be illegal in all cases and as a whole only 8% of all polled say that then that indicates a stronger pro life in that group..  \n\nIt’s just sad that these groups take advantage of people not understanding how to read statistics. \n\n14-8 is a big enough difference that it shows the views of Hispanics can’t be seen as a monolith that there’s clearly needs to be a better division there.",
            "score": 7,
            "replies": [
                {
                    "author": "iambecomedeath7",
                    "body": "I always think it's interesting how people tend to forget that modern gun control strategies originated in the efforts to deprive freedmen and immigrants of their constitutional right to keep and bear arms. In fact, California's \"assault weapons\" bans were authored by Ronald Reagan, of all people, with a view on suppressing the Black Panther Party.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "CliftonForce",
                            "body": "Conservative intentions are to handle this the way the Nazis did. Remove all gun control.  Then use \"social pressure\" to make sure that Only The Right People Have Guns.  An out-group member has a gun? They will be the center of attention until something else wrong is \"found.\"\n\nExample: There are several YouTube videos about what happens when a white person vs a black person tries legal open carry in the South.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "skankingmike",
                            "body": "It’s why you’ll find mostly cities that outlaw much of the guns in America yet tend to have more gun violence due to other issues.   \n\nA lot of the illegal gun issues are straw purchases and that stems from money and drug issues. You can’t solve the one without the other.   We have a war on drugs that needs to end already.  And we have a poverty issue where people need money and they get it from illegal means like straw purchases, illegal check cashing etc.  \n\nBut our constitution allows us access to firearms.  For better or worse it’s a right.. we have so many other issues that it’s amazing to me we continue to fight one another over limiting our rights instead of fixing and expanding our rights like right to have healthcare or right to not fucking die on the street due to addition or mental illness.  It’s a wild concept that rhe supposed left leaning people push more and pass rhe laws that restrict freedom than expand it.\n\nThere’s absolutely nothing stopping any state in America to make healthcare a right and then provide it to its people through taxes and regulate its medical community to require them to take it if they practice in the state.  Accept their donors the ultra wealthy won’t allow it.   If regular Joe no longer needs to worry about healthcare then how do you keep them prisoner of your labor?  If small businesses can now compete with talent with large ones due to no longer needing to go without benefits or shit ones.. then who wins?? Not Amazon.. \n\nPublic or forced nonprofit insurance (Germany model) would fix a ton of issues including gun issues and abortion issues in America.   Long before limiting what gun you can or can’t buy.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Manezinho",
                                    "body": "Do some mild per-capita analysis on your thoughts here to see how wrong you are. It's BS that's spewed in right wing media to paint big cities as dangerous to a racist rural/suburban audience.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "skankingmike",
                                            "body": "I didn’t say “big cities” I said cities.   \n\nBessemer for example is one of the worst cities in America and it’s not full of poor white people.  \n\nAgain you’re missing the point anyway. \n\nFocusing on race is a great way to never get anything accomplished.   Would public healthcare help black people or do you think it’s purely a race issue and we shouldn’t focus on the high level shit we keep fucking up?  Would legalizing drugs solve much of the inner city violent crime?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Manezinho",
                                                    "body": "I'm not focused on race, I'm focusing on the unrestricted availability of guns... Which was the original premise here.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "skankingmike",
                                                            "body": "But they’re not unrestricted.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Manezinho",
                                                                    "body": "Bruh, in many places it basically is. Florida has you buying anything you want with a driver's license and no training at 16 and open carrying in any public place.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "skankingmike",
                                                                            "body": "There’s still a background check regardless.  Unless it’s a private seller which I disagree with but I don’t live in Florida",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "iambecomedeath7",
                                    "body": "Absolutely. You hit the nail on the head.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "skankingmike",
                                            "body": "I think so much of what we argue about is utterly a waste of time.   Theres a handful of narcissist we allowed to gain power globally and they’ve gotten so good at manipulating us that gone are the days of us rising up and wiping them out.  Without massive event to change this… we’re all just screaming into the void who will not give us the world we should have.  \n\nBut here we are begging for fucking basic human rights in the richest most powerful country on earth maybe ever…  and yet our lives don’t seem to be getting better in terms of mental health etc",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Open-Artichoke-9201",
            "body": "Nobody wants to sign up to read an opinion article of ba",
            "score": 1,
            "replies": []
        },
        {
            "author": "GitmoGrrl1",
            "body": "We're told that gun control laws don't work. Obviously gun anarchy isn't working either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Manezinho",
            "body": "Civilian gun ownership was a mistake 😅",
            "score": 1,
            "replies": []
        },
        {
            "author": "Broad_External7605",
            "body": "I'm a liberal, and I'm for the 2nd Amendment. I think gun owners should have permits, background checks, and red flag laws. But some day I might have to fight the Nazis and Klansmen.",
            "score": 1,
            "replies": []
        }
    ]
}