{
    "title": "Tell your U.S. House representative: Vote no on the \"Fix Our Forests Act\" - Environmental Action",
    "author": "Kunphen",
    "subreddit": "progressive",
    "rank": 58,
    "score": 47,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 9,
    "url": "https://environmental-action.org/take-action/tell-your-u-s-house-representative-vote-no-on-the-fix-our-forests-act/?akid=38.407640.UUJTYM&rd=1&t=2&tag=email_blast%3A-107138&utm_campaign=EAC4-FCNS%3AFOREST-0924&utm_content=EM9%3A00C%3A0HH-LLE&utm_medium=email&utm_source=salsa",
    "id": "1fomqyq",
    "selftext": "",
    "comments": [
        {
            "author": "BathingInSoup",
            "body": "But it’s called the “Fix Our Forrests Act”. Why wouldn’t we want them to do that?",
            "score": 6,
            "replies": [
                {
                    "author": "Kunphen",
                    "body": "\"The Fix Our Forests Act bypasses critical environmental laws that protect wildlife and wild places and restricts scientific input and public participation.\n\nThis bill could have devastating consequences for threatened and endangered wildlife, especially amid rapid extinction rates and a climate crisis, both of which can be helped by keeping our forests standing.\n\nTell your member of Congress to oppose this bad forests bill.\"\n\nHelps to read why.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "BathingInSoup",
                            "body": "Apologies. I thought the /s was clearly implied. I was commenting on the fact that it’s become pretty standard for lawmakers to give  misleading titles to legislation in a bad faith bid to trick people into voting against their interests.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "CommanderMcBragg",
                            "body": "I just read the bill. You haven't cited a single section of this bill or offered any explanation why it is bad or why anyone should oppose it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Galphanore",
            "body": "Really fucking sick and tired of politicians being able to blatantly lie about what bills do, starting right at the name.",
            "score": 2,
            "replies": []
        }
    ]
}