{
    "title": "Friends making fun of me because I don’t really do hookups or “just vibe”",
    "author": "Personal_Poet5720",
    "subreddit": "TwoXChromosomes",
    "rank": 17,
    "score": 858,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 166,
    "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1jdmceo/friends_making_fun_of_me_because_i_dont_really_do/",
    "id": "1jdmceo",
    "selftext": "  So one of my male friends was venting to me about how they had a talking stage with two girls and it didn’t pan out because one of his potential suitors was looking for something serious. He then said to me that “She reminds me of you. You can never just vibe and be casual with someone. You only see someone if it’s something serious.”I basically said to him that there’s nothing wrong with someone wanting something serious. It’s nothing wrong if someone desires something casual. Y’all just want different things but she’s not wrong for mentioning what she wants . He then started laughing and then he made comments about how he’s done with “b****” and other offensive comments about her being a single mother. Now there’s nothing wrong with hooking up with someone you’re not with or casual sex but it’s not for me. This also isn’t the first time a friend has made fun of me bc I’m not a hookup person. Understandable it’s normal in my early 20s but it’s so annoying when people make fun of me for this.\n\nEdit: We are not friends anymore and Im ghosting him. I made this post when this situation was fresh so I wasn’t politically correct my bad. Obviously he’s not a friend so please don’t assume I’m still friends bc those comments are annoying me. Thanks. Also I already was in the process of ghosting him when I made this post. I don’t like how people are assuming I was going to continue the friendship when I wrote this fresh when the situation was happening and I was processing everything. Any comments that says I only considered ending the friendship bc of these comments I’ll block you . ",
    "comments": [
        {
            "author": "one_bean_hahahaha",
            "body": "Your friend is a misogynist and not much of a friend.",
            "score": 1361,
            "replies": [
                {
                    "author": "MGPS",
                    "body": "And he prob wants to hook up with OP or at least just “vibe” her 😬",
                    "score": 497,
                    "replies": [
                        {
                            "author": "sexmormon-throwaway",
                            "body": "Exactly my sentiment. He wants the hookup.",
                            "score": 119,
                            "replies": [
                                {
                                    "author": "grubas",
                                    "body": "\"she's uptight, like you.  You can disprove this by sleeping with me\".\n\n\n\n\nHow bout no.",
                                    "score": 77,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Personal_Poet5720",
                            "body": "Ew not a chance",
                            "score": 158,
                            "replies": [
                                {
                                    "author": "bocaciega",
                                    "body": "Thats guy sucks.",
                                    "score": 87,
                                    "replies": [
                                        {
                                            "author": "Personal_Poet5720",
                                            "body": "He does",
                                            "score": 74,
                                            "replies": [
                                                {
                                                    "author": "lordchankaknowsall",
                                                    "body": "Sounds like he made it clear how to act with him. Why keep him around if this is how he acts?",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Personal_Poet5720",
                                                            "body": "Please read the edit",
                                                            "score": 9,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fraerie",
                    "body": "Also - they’re dissing this girl (OP is being compared to) for not hooking up but also dissing her for being a single mother. \n\nHow do you think she ended up being a single mother. \n\nAnd by looking for something more serious now - she’s putting her kids wellbeing ahead of just having casual fun. Like she is supposed to as a parent. \n\nMake it make sense. \n\nOP - live the life that feels true to you. If you don’t want to casually hook up, then don’t. As long as you’re not shaming those who do want to do that - no harm no foul. The problems start when people get socially punished for wanting to go a different speed to the average.",
                    "score": 269,
                    "replies": [
                        {
                            "author": "Personal_Poet5720",
                            "body": "Exactly",
                            "score": 53,
                            "replies": []
                        },
                        {
                            "author": "Faiakishi",
                            "body": "CLEARLY she should have been better with birth control or just aborted every pregnancy until A Good Man decided he wanted to marry her and was ready for kids.\n\n/s because we live in the dumbest timeline and people will absolutely say this unironically.",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "JackxForge",
                            "body": "also OP said they are in their early 20's. safe to assume dudebro is the same, and probably so is the single mother! Honestly my hats off to the probably early 20's mom for telling this dude to kick bricks.",
                            "score": 33,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah he definitely is.",
                    "score": 62,
                    "replies": []
                }
            ]
        },
        {
            "author": "LennyDark",
            "body": "Sounds like he's pissed you don't want to fuck him lol",
            "score": 590,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "That too",
                    "score": 190,
                    "replies": [
                        {
                            "author": "Whole_Bug_2960",
                            "body": "Yeah, this AH seems incapable of accepting that people are built differently and have equally valid preferences, and it's probably because they aren't providing the service he wants. Yuck.",
                            "score": 93,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "Exactly",
                                    "score": 37,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MLeek",
            "body": "That’s not a friend. \n\nThat’s a man who thinks woman who aren’t available to service his pleasure are broken.\n\nBonus shithead points for hating on single mothers.",
            "score": 193,
            "replies": [
                {
                    "author": "manykeets",
                    "body": "This is exactly the kind of guy who would leave a woman as a single mother, while degrading single mothers.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "Personal_Poet5720",
                            "body": "Exactly",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah he’s gross",
                    "score": 31,
                    "replies": []
                }
            ]
        },
        {
            "author": "depression_quirk",
            "body": "He thought because she's a single mom, she would be desperate enough for crumbs and now he's throwing a bitch fit because she dared to have standards lmaooo\n\nbut honestly, kinda same. I've had one ONS and it was fine. We both came and he went on his merry way; but I probably wouldn't do it again. Even when I'm causal, it lasts a few months and I'm not sleeping with other people. I just like to sleep with people I know well enough to actually like as a person.",
            "score": 151,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Okay agree with you on everything. Also right like even if I were to be casual I need to at least like you as a person to trust you with my body",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "photonsnphonons",
                    "body": "Def the standards part that's tripping him up. She has self worth and he has none. I've done one ONS in the past and it wasn't for me. I like developing an emotional relationship, state that I'm looking for something serious at the start. I've been in the position that I've felt like I was failing by not being comfy enough with a person after a few dates and making out but not feeling ready to take it further. It's cost me physical relationships I desired, but at 38 I can't not be me.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Personal_Poet5720",
                            "body": "Exactly",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AccidentalWit",
            "body": "Sounds like you need some actual friends",
            "score": 117,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah",
                    "score": 28,
                    "replies": []
                }
            ]
        },
        {
            "author": "wingedespeon",
            "body": "Ew.",
            "score": 165,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah he’s annoying and starting to sound misogynistic",
                    "score": 81,
                    "replies": [
                        {
                            "author": "CarinXO",
                            "body": "Starting? The fact that he's gone mask off in front of a woman means that he's probably 10-100x worse behind the scenes with his male friends. You're delulu if you think this dude is salvagable.",
                            "score": 142,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "Girl yes I know that and I never insinuated that he was salvageable so don’t call me Delulu.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "organiclawnclippings",
                                            "body": "But he's your friend?",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Personal_Poet5720",
                                                    "body": "Obviously not anymore. I didn’t know I need to be fully politically correct here. When I made this post I was still annoyed bc the situation was fresh.",
                                                    "score": -11,
                                                    "replies": [
                                                        {
                                                            "author": "organiclawnclippings",
                                                            "body": "This has nothing to do with being politically correct? You call this person a friend multiple times in the post and in comments is all, you're gonna catch flack for it",
                                                            "score": 21,
                                                            "replies": [
                                                                {
                                                                    "author": "Personal_Poet5720",
                                                                    "body": "I didn’t call him a friend in the comments read it again. My point stands. Y’all read with emotions first and nitpick over details. So again MY POINT STANDS . You pissed me off because it seems like you commented to argue or be morally superior like a gotchu moment when I already discovered that. Like I said I made this post when it freshly happened and you nitpicking when first off grieving a friendship can be painful and I mentioned in several comments how I’m ghosting him doesn’t make the situation better. Also don’t defame my name. Nowhere in the comments did I say that the friendship still exist. Don’t make me look like I’m complicit or a pick me girl.",
                                                                    "score": -17,
                                                                    "replies": [
                                                                        {
                                                                            "author": "lancebaldwin",
                                                                            "body": "Starting to sound misogynistic comes off as you not having realized it already.  It's not political correctness, you just weren't being clear and people were making obvious assumptions because of that.  Your attitude towards them for those obvious conclusions is uncalled for, you being annoyed because of your communication skills lacking at the time in not justified.  No one who made those conclusions based on your misleading comments was insulting you.",
                                                                            "score": 17,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Personal_Poet5720",
                                                                                    "body": "I said in multiple comments how I’m ghosting him. So again save it. I obviously realized he is but I was in shock bc I wrote this when the situation was fresh. But obviously Reddit there’s no account for that. So again my point STANDS. Starting meaning that it just became apparent to me after the situation that happened today. I rest my case. Also sir why are you on this page. But I’m done with talking about men today not worth the energy. Post in a ends mens subreddit.",
                                                                                    "score": -7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "lancebaldwin",
                                                                                            "body": "People aren't going to read every comment you've made in the post.  These people were literally just trying to look out for you and you lashed out because you seemingly took it as an insult.  Your point doesn't stand, you're just being defensive and a jerk as a result.",
                                                                                            "score": 10,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Personal_Poet5720",
                                                                                                    "body": "Because she insinuated that even in the comments I said I was still going to befriend him which wasn’t the case. So of course I’ll be defensive and a jerk. I’m done debating with you. Again I don’t need anyone to lookout for me bc I already recognized who he was. So again my point stands. Your point doesn’t stand because you didn’t read her comment where she mentioned how in my comments I said I will still be friends with him. So again my point stands. The end. I have the final say and won’t respond to you or her anymore. Because I know wtf I was talking about because her comment mentioned ; \n\n \n\nThis has nothing to do with being politically correct? You call this person a friend multiple times in the post and in comments is all, you’re gonna catch flack for it. \n\n    \n   So again in the comments I didn’t say he was a friend or refer to him as one. So my point does STAND.\n  \n   Lastly, don’t tell me I’m being defensive for defending myself against false claims.. better yet give me a comment where I said he’s still my friend okay exactly you can’t",
                                                                                                    "score": -6,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "wonder_woman2506",
            "body": "They aren't your and never were your friends. You need to replace them",
            "score": 44,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah I am",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "CryptographerDizzy28",
            "body": "you should distance yourself from this ahole, he is not a friend and he is an awful person",
            "score": 33,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah I am",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "ladyofspades",
            "body": "So he wants casual sex but doesn’t like single mothers…does he understand the basics of intercourse and what can happen??",
            "score": 20,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly even some get pregnant using birth control",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "manykeets",
            "body": "These are the same guys who will degrade a woman for her “body count” and call her “ran through” if she’s had too many casual partners. These type of guys disgust me.",
            "score": 19,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnonPinkLady",
            "body": "You're in the right, this friend sucks ass, there is nothing wrong with wanting romance and commitment. I personally am the same way.",
            "score": 17,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly he’s just mad no one wants to f him",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Fraerie",
                            "body": "I can’t imagine why. He sounds like such a catch. \n\n/s",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "Exactly",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AnonPinkLady",
                            "body": "EXACTLY OP- everyone is entitled to their own comforts and boundaries, why should a woman who knows what she wants bend over backwards to suit his wishes. I'd hit his \"Why can't women just chill out?\" question with \"Why can't you just grow a pair and commit to someone? Too scared of feelings? Why not that?\" and see how quickly he gets his boxers in a knot",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "Exactly and after hearing him speak I don’t blame her",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "query_tech_sec",
            "body": "\n\n>He then said to me that “She reminds me of you. You can never just vibe and be casual with someone. You only see someone if it’s something serious.”I basically said to him that there’s nothing wrong with someone wanting something serious.\n\nI think as women we often think we have to justify who we are and what we want - especially when others frame it as something annoying or bad. Next time - think about just owning it unapologetically and saying something like: \"yes - that's me exactly - I know I don't want to waste any time if it's not potentially serious\". You don't have to tell him there's nothing wrong with that. You don't have to plead your case. It is what it is and you want what you want.\n\nIt sounds like he's the one that needs to just tell women upfront that he only wants something casual.",
            "score": 12,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "MsAndrie",
            "body": "He is a misogynist and open about it to you. He is also trying to neg you into accepting something \"casual\" (likely with him). Why are you still friends with him?",
            "score": 12,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "I’m not friends with him anymore I’m ghosting him",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "8Bells",
            "body": "Sounds like \"reality\" for him is only what he's dicKtated and to heck with other people having choices, lives, and circumstances beyond \"wanting to bone\". \n\n\nMaybe he'll grow up, likely he won't for a good while. But he really shouldn't shit on people for knowing what they want already. \n\n\nAlso note, he's putting down this lady to you, in an effort to chastise you. Like making you feel ashamed for thinking in a similar vein. \n\n\nAs if making fun of her would suddenly make you want to flip your lifestyle on its head and prove you were \"cool' and suddenly decide to sleep with him. \n\n\nAgain, maybe he'll grow up. But if this poor attempt at reverse psychology is all he's got. Eh. Not sleeping with him was the right call for that other girl. (And I know it was her call vs his haha -probably another part of whats got him all butt hurt). \n\n\nHopefully all other girls who have and want a mature relationship vs a fling suss him out as well. ",
            "score": 22,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly and I never wanted to sleep with him either no and now I can’t tolerate him as a friend",
                    "score": 9,
                    "replies": [
                        {
                            "author": "8Bells",
                            "body": "Good point..I'll fix my last line.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "Yeah with him eww never crossed my mind. He was a friend not anymore",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "hday108",
            "body": "Bro is complaining that a single mother doesn’t want casual shit?? Yeah they have a kid dipshit.\n\nIf you want casual why are you asking out the people with an 18 year minimum responsibility??",
            "score": 9,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "And there are single mothers who casual date and nothing wrong with that. But badmouthing one bc she doesn’t",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "cutecatgurl",
            "body": "Girl, I’m hoping this person is no longer your friend. Where do you guys find these people 😭 No male in my life or even an acquaintance or even a mf i met at a party would dare say something like that. Omfg",
            "score": 6,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Im ghosting him but I’m in college and met him there",
                    "score": 2,
                    "replies": [
                        {
                            "author": "cutecatgurl",
                            "body": "Girl yes leave him in the dust, he’s AWFUL 😭 i would even say it’s a better decision to only have actual SEX with people you can be serious about. sex is no joke. from the intense emotional attachment, to the potential for STDs or even pregnancy (bc abortion may not be viable for everyone) for me as a 27 yr old, i only have sex with men who are my boyfriend. seriously",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "Like if I’m dating a guy and vetting him as a potential partner I sleep with him beforehand bc imagine if the sex is bad but I don’t date for casual no bc atp let’s just be friends but I mainly agree with you",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "cutecatgurl",
                                            "body": "Right I totally resonate with that",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Tangurena",
                            "body": "How old is that dude?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "25",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hello_Hangnail",
            "body": "I'd hit them with the \"why hookup when barely any of you are capable of getting a woman off. Why risk pregnancy and sti's for a mediocre lay\"",
            "score": 8,
            "replies": []
        },
        {
            "author": "lurkerdaIV",
            "body": "That's not a friend, that's just freaking weird. Did none of your other guy friends call that out?",
            "score": 7,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "It was a one on one phone convo",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "linkheroz",
            "body": "Imagine only dating people because you're looking for a long term partner. Imagine. 😂 People seem to have forgotten what dating actually is",
            "score": 12,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "See it’s nothing wrong with dating to see what you want bc I did that when I was 18. The problem is when people shame others",
                    "score": 5,
                    "replies": [
                        {
                            "author": "linkheroz",
                            "body": "Of course, you're never going to know what you want until you start dating. Some people even get lucky first try.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Whooptidooh",
            "body": "That’s not your friend. (Nor is he apparently capable of being a friend to other women, if that’s how he talks about them.)",
            "score": 6,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly and yes I know that’s not my friend obviously",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Buddhadevine",
            "body": "That’s not a friend.",
            "score": 5,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "No shit I’m not delusional",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Buddhadevine",
                            "body": "You mentioned him being a friend in the main body of the post. 🥱",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "Read the edit",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheGreatNyanHobo",
            "body": "Honestly, stay away from this person. If he is willing to say these things out loud, I would be concerned about if he has opinions rationalizing overstepping other boundaries.",
            "score": 5,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah I am",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "DConstructed",
            "body": "The thing is that “doesn’t vibe with and be casual with someone” secretly means “I’m salty because I can’t get laid” too bad. \n\nNot every woman will want casual sex and not every woman that might want it will want it with him.  \n\nHe’s exactly like guys who called women “prudes” or “uptight” simply because those women did not see much good in sex with those men.",
            "score": 6,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yup",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "femsci-nerd",
            "body": "Came to here to say this guy is not really a friend so why even listen to him.  Real friends like you just the way you are and are not misogynistic.  What a tool.",
            "score": 3,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "I know I just wanted to vent my bad",
                    "score": 1,
                    "replies": [
                        {
                            "author": "femsci-nerd",
                            "body": "You are not weird. And don't go and try to come on to someone when your in an odd mood. It's not you so don't force it.  There are plenty of good people around. Look for the kind ones, the quiet ones, the ones who don't generalize about others or boast about themselves.  They are out there, they are just a lot quieter.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "I didn’t come onto him. He was a friend strictly friends. I don’t know where you got that assumption",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "femsci-nerd",
                                            "body": "I did not say you came on to him. I've just seen some of my friends try it just to see what happens. I was just saying stay true to being who you are.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "artieart99",
            "body": "you're right to end whatever casual friendship you had with him. he's obviously not mature enough to be in a relationship with anyone.",
            "score": 4,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yes I am ghosting",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ssluna",
            "body": "That’s not your friend, and tbh he needs a dose of reality (and a good cuss out). There’s absolutely nothing normal or okay about “just vibing”. Thats some weird relationship limbo shit they hold over women’s heads to get sex. Either find someone that just wants sex or don’t.",
            "score": 3,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "distorted-laughter",
            "body": "Your friend thinks single mothers should be desperate and lower and their standards but also thinks you should lower your standards too.",
            "score": 3,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah he’s not a friend no more",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lynda73",
            "body": "That’s so gross. Like can you imagine going up to someone and saying they have “problems” because they won’t pity fuck whoever? But guys do it all the time…. The issue is NOT you. Hookups are risky, especially for women, and usually only any payoff for the guy. Surprise. 😑",
            "score": 3,
            "replies": []
        },
        {
            "author": "memekid2007",
            "body": "That's not your friend, and he's mad at you for the same reasons he's mad at her; for not wanting his dick with no effort on his part.",
            "score": 3,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Im ghosting him don’t worry",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OperationRoyal",
            "body": "He was negging you - thinking you would fall right into his lap with that pathetic and misogynist spiel.",
            "score": 4,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Yeah no",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "faetal_attraction",
            "body": "Ew gross these people aren't your friends.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aggressive-You-7783",
            "body": "She doesn’t want what you’re offering. Why is it so hard to get it for these people? We should teach how to receive rejection and move on in kindergarten.",
            "score": 2,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly like would you rather her lie, get feelings involved",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lynda73",
                            "body": "No, they would rather you pretend long enough for them to get the seggs.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "Exactly",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bexybirdbrains",
            "body": "You are absolutely spot on. Your \"friend\" is just mad that women he wants to bone casually won't do it because they want more. And to be honest it sounds like you're one of those women. It's pretty pathetic of him to be honest.",
            "score": 2,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "It is gross and immature",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "blueavole",
            "body": "Interesting book for you or a gift for anyone going to college.\n\nAmerican Hookup: The New Culture of Sex on Campus\nBook by Lisa Wade\n\nFew years old and based on college campuses.  But an interesting read",
            "score": 2,
            "replies": []
        },
        {
            "author": "BananauTrenerci",
            "body": "The promotion of casual dating is literally going to ruin society and I stand by it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sexmormon-throwaway",
            "body": "His response is insecure and gross.",
            "score": 3,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "It definitely is",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "indecentbananas",
            "body": "How does he feel about male forms of birth control? maybe women don't want to have to put up with men's shit and potentially getting pregnant from a one night stand.",
            "score": 4,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "That too…which is why I don’t do hookups bc if I’m going to risk pregnancy for me personally I’d rather risk it with someone I’m commited to however nothing wrong with casual",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "BottomPieceOfBread",
            "body": "Not to go all middle-school gym poster but, “if you can’t change the people around you *change the people around you*”\n\nI tried casual for the first time and now I’ve had the same fwb for 4 years lol. That’s just what works for me! I’m not interested in dating and I can’t see myself doing it with someone else at this point… However, there was a point where I was in emotional turmoil post-nut everytime we had sex because I felt “wrong”, it almost ruined our friendship. As someone in a casual situation I hate the way they’re normalized because they’re honestly *not* for everyone! \n\nI think you should feel proud of yourself for knowing your limitations!!",
            "score": 3,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Right and there’s nothing wrong with casual it’s just not for me",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "shinmegumi",
            "body": "Doesn’t sound like a good friend. May want to expand circle of friends to better people who don’t get their conversational kicks out of insulting other people in order to feel superior~",
            "score": 2,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Obvi",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "celeste9",
            "body": "What a dick. You need better friends, unfortunately",
            "score": 2,
            "replies": []
        },
        {
            "author": "Individualchaotin",
            "body": "You're friends with a sexist man. How do you plan on changing that?",
            "score": 2,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Girl obviously I’m not gonna be friends with him anymore",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dogsbottombottom",
            "body": "One of the reasons my wife and I got married is because she was like you. She told me she wanted something serious up front, and it was fine if I wanted to fuck around but it wasn’t going to be with her. I said great, and so from the beginning we both approached our relationship as something serious and worth the effort. \n\nI always appreciated how upfront she was, and I think it immediately cut out a bunch of bullshit, and meant we invested more of ourselves. We’ve been together since 2012, and married since 2017.\n\nYour friend sucks, and isn’t worth knowing. I hope you find the man, or person who appreciates your standards.",
            "score": 3,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly and I’m not saying I’m better than people who want something casual different strokes for different folks but shaming is where I draw the line",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Robalo21",
            "body": "Yeah I can't imagine why a single mom doesn't want to just vibe... When you have children you don't need a stream of men coming in and out of the house. If you don't understand that I don't know what to tell you. I'm just happy that people are being honest. It's not super difficult for a guy to claim he wants whatever the girl wants just so he can get what he really wants, in her pants. I'm unsure why he thinks bad mouthing the woman, to another woman was in anyway appropriate.",
            "score": 1,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "And he basically negged me in the process but his true colors got revealed so I’m happy",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "BoredMan29",
            "body": "I'm starting to think religion wasn't the thing making some folks real comfortable with telling others how they should live their own lives.",
            "score": 1,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Nope",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "blueavole",
            "body": "American Hookup: The New Culture of Sex on Campus\nBook by Lisa Wade\n\nFew years old and based on college campuses.  But an interesting read",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amazing_Cranberry344",
            "body": " a Tate brother?",
            "score": 1,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Idk and I don’t care to know bc I’m ghosting him",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lev400",
            "body": "You do you !",
            "score": 1,
            "replies": []
        },
        {
            "author": "Onautopilotsendhelp",
            "body": "He isn't a friend.\n\nHe is pissed because no one is seeing him worth the hassle for a basic hookup/casual situation. Also he's seeing women as transactional with a misogynistic flair = I want to fuck her. She won't fuck me because I don't care about her = She must be a bitch then. How do you flirt with someone, get rejected, and immediately go to name calling? Immaturity, that's how. He doesn't get what he wants (transactional view) so he resorts to derogatory name calling. \n\nStop talking to him. If he reaches out somehow past the blocking, tell him to stop being a beta, and then block him again lmao.",
            "score": 1,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly and I’m ghosting him",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "loopi3",
            "body": "I find it infuriating that women keep calling these men friends. I as a man can’t tolerate being in the same room with them. Why do you?!",
            "score": 1,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "I said in the edit I’m ghosting him. Read the full post. I wrote this post in shock when the situation was fresh but Reddit doesn’t take this into account",
                    "score": 0,
                    "replies": [
                        {
                            "author": "loopi3",
                            "body": "This is black and white stuff. You didn’t start off this confident about cutting him off at the begging. It’s only after you got reactions from the sub that you decided. \n\n> Yeah he’s annoying and starting to sound misogynistic\n\nThis is the giveaway. \n\nPlease follow through and cut him off.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Personal_Poet5720",
                                    "body": "I am like I said I’m ghosting him and I was planning on ghosting him and in the process of ghosting him while making this post. My emotions were heightened when I made this post so I didn’t include everything in the post . I was already having bad anxiety when making this post and I’m gonna delete it bc now I feel like I’m being more attacked than him . I already have enough mental health problems. People also aren’t taking into account how friendships need to be grieved to but this is Reddit which doesn’t take into account feelings that go involved with handling a friendship breakup. So assuming that I wasn’t going to cut off the friendship bc I was going through shock and processing is wrong. You don’t know what plan I had. I’m done here",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "loopi3",
                                            "body": "I’m old and have no tolerance for being on the fence for this stuff. I’ve seen and experienced first hand how anything other than a hard rejection of this behavior only encourages it. \n\nNot only do I end up cutting off men I also end up cutting out women that support the men. It’s infuriating and feels like the situation will never improve. \n\nDo with that information what you will.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Personal_Poet5720",
                                                    "body": "I cut him off I already explained this. Yeah I’m logging off bc this is too much. I already started ghosting hud messages and ignoring them when I made this post . But I’m done here. Do with that information WHAT YOU WILL.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "loopi3",
                                                            "body": "You don’t have to respond to every comment. You don’t owe online strangers any of your time or consideration. Just like you don’t owe those men any of your time or consideration. Good luck.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Personal_Poet5720",
                                                                    "body": "I literally said I ended the friendship and was planning to while making this post but now some of y’all are just being bullies. You mentioned how you’re old but you’re being harsh and mean to a 21 year old? Good day bc I’m done here. Although I won’t allow you or anyone to assasinate my character either. I’m pretty sure when you grieved a friendship there were probably things you wanted to say but you didn’t but I’m done here bc everyone here wants to act like perfect angels who would react this way if that happened to them.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "StrawbraryLiberry",
            "body": "I think that's really weird of him. It doesn't bother me when others want different things than I do. I'd just like them to be honest about it!",
            "score": 0,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "Exactly like shaming someone because they want something different than you",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tackybabe",
            "body": "He’s negging you. ",
            "score": -1,
            "replies": [
                {
                    "author": "Personal_Poet5720",
                    "body": "He definitely is",
                    "score": -1,
                    "replies": []
                }
            ]
        }
    ]
}