{
    "title": "It’s happening: “Texas authorities arrest midwife for allegedly providing abortions”",
    "author": "Tadasana_6238",
    "subreddit": "TwoXChromosomes",
    "rank": 4,
    "score": 2825,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 76,
    "url": "https://www.bbc.com/news/articles/c74kr8vp4w0o.amp",
    "id": "1jdzt0h",
    "selftext": "",
    "comments": [
        {
            "author": "SleepPrincess",
            "body": "The generalized plan:\n\nLock women up for helping other women. Oh, you prescribed misoprostol? Jail.\n\nYou gave a woman money who ended up getting an abortion? Jail.\n\nYou drove a woman to a clinic? Jail.\n\nYou bought a woman who had an abortion lunch? Jail.\n\nYou paid a woman's water bill who had an abortion? Jail.\n\nYou talked to a woman on the phone who had an abortion and wanted support? Jail.",
            "score": 1326,
            "replies": [
                {
                    "author": "AylaZelanaGrebiel",
                    "body": "We are back to witch hunts",
                    "score": 569,
                    "replies": [
                        {
                            "author": "CormacMacAleese",
                            "body": "\"If she floats, it's an aborted soul trying to get to heaven...\"",
                            "score": 192,
                            "replies": [
                                {
                                    "author": "Sckillgan",
                                    "body": "It scares me knowing that most evangelicals think this is true.",
                                    "score": 89,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ErraticUnit",
                            "body": "The Taliban say hi",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "lilgrizzles",
                                    "body": "Like. Yeah. But... Also no because the white christians are doing it too. Have been for longer than the Islam religion has been too...",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "ErraticUnit",
                                            "body": "Yeah,  meaning to say they're the same awful ideas :/",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "lilgrizzles",
                                                    "body": "Like, I get it. But we have to be careful about letting racist ideas (oh, they are bad because they are Muslim) instead of just calling a spade a spade.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ErraticUnit",
                                                            "body": "Honestly,  I think it's beyond that (and we're not all in the US). This ideology is abhorrent and insanely damaging and if people connect the two,  great.  They are all awful people.  Full stop.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fluffy_doughnut",
                            "body": "Women hunts, \"witches\" were women",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "AylaZelanaGrebiel",
                                    "body": "Okay see my other comment explaining what and where this term/phrase comes from.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kailalawithani",
                            "body": "They weren’t killing witches, they were killing women.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AylaZelanaGrebiel",
                                    "body": "I’m fully aware of this having studied it in college. The term or phrase in this case is  “witch hunts”. There were millions of women persecuted for perceived “witchcraft” and condemned to death.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "kailalawithani",
                                            "body": "I wasn’t implying otherwise. It’s just always a sobering reminder that history has been told in such a way that we easily forget it wasn’t really a ‘witch hunt’ but instead a ‘woman hunt’.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Illiander",
                    "body": "And then once we're in jail they get to use us as slaves.\n\nThink what female slaves traditionally get used for.",
                    "score": 168,
                    "replies": []
                },
                {
                    "author": "fantasy-capsule",
                    "body": "If a woman has a miscarriage? Believe it or not, jail.",
                    "score": 158,
                    "replies": [
                        {
                            "author": "khjuu12",
                            "body": "Your baby is premature? Jail. Your baby is late? Also jail.\n\nOvercook undercook.",
                            "score": 130,
                            "replies": [
                                {
                                    "author": "Disastrous-Soup-5413",
                                    "body": "You tested positive for drugs that WE GAVE YOU right before you gave birth to facilitate delivery-\n\njail, baby taken away.\n\n**Oh wait, that’s already happening!**\n\nhttps://www.themarshallproject.org/2024/12/11/pregnant-hospital-drug-test-medicine",
                                    "score": 80,
                                    "replies": []
                                },
                                {
                                    "author": "CormacMacAleese",
                                    "body": "Someone once said, \"I believe that it's the fault of the one who last had it. 'Oooh! You had it last!'...\"\n\nWho was that? *(checks notes)* Oh, right, it was Bill Cosby. Imagine that! Getting big laughs with his joke misogyny that wasn't even a little bit in jest!\n\n\\* The context was a story about telling his wife to have a boy, and she went and had a girl. Again, \"joking\" about blaming women for things completely outside their control.",
                                    "score": 27,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "blackday44",
                    "body": "All women now in jail. Probably safest to put tracking collars on them to make sure they stay in safe areas.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "dandeleopard",
                    "body": "Oh, you've been to jail? Guess you can't vote",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "GrandNibbles",
                    "body": "You wrote a mean message on Reddit about a politician in the ruling party? Believe it or not, jail.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -41,
                    "replies": [
                        {
                            "author": "SleepPrincess",
                            "body": "My comments were trying to represent the process we go through in which eventually simply having a phone call with someone ends up being a crime.\n\nIt starts with persecution of one group. Once that is accomplished, you move onto the next thing that is persecuted and criminalized. While it feels far fetched today, who knows what this country will look like I'm 2, 4, or 10 years from now. Iran went from what Americans would consider a relatively normal country to an Islamic government that removed women from public life almost entirely in roughly 1 year. \n\nWe are not immune. We are not immune just because we are the USA.",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "SleepPrincess",
                                            "body": "So while we are focused on the actions of ICE (deplorable btw), we incidentally neglect the reality that they've begun arrests of midwives.\n\nBoth threats are immense. Neither should be focused on while neglecting the other.\n\nI'm not understanding your messaging, honestly.",
                                            "score": 22,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "Diograce",
                                                            "body": "They’ve got you. You’re drinking the koolaid.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Diograce",
                            "body": "You’re blind if you don’t think it could actually happen.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tadasana_6238",
            "body": "From the article: Ms Rojas faces second-degree felony charges, which carry a sentence of up to 20 years in prison and a fine of $10,000 (£7,700) if convicted.\nUnder the Texas Human Life Protection Act - a 2021 law that bans abortion in most cases - state authorities can also fine Ms Rojas at least $100,000 “per violation”.\n\n\nThey know this is wildly unpopular and have undoubtedly chosen this particular provider strategically because they think she will be less sympathetic because of who she is and who she serves. They will launch a PR campaign to villainize her and try to make this acceptable. We will not be fooled. The plan has always been to lock up women, which they’ve already started doing, and now medical providers too.",
            "score": 727,
            "replies": [
                {
                    "author": "NorysStorys",
                    "body": "If she has any sense, she’d get across the border and claim asylum.",
                    "score": 104,
                    "replies": []
                },
                {
                    "author": "solesoulshard",
                    "body": "Is there a gofundme for her expenses or a petition we can sign?🪧",
                    "score": 26,
                    "replies": []
                }
            ]
        },
        {
            "author": "storagerock",
            "body": "There’s already a big shortage of OBs in Texas. That’s extra horrible to take out whatever quality birthing helps remain.",
            "score": 263,
            "replies": []
        },
        {
            "author": "bbtom78",
            "body": "I don't trust that any of the accusations are real. This is a witch hunt. Paxton is a liar. The midwife serves low income Spanish speakers, which he hates. \n\nWomen need to leave Texas.",
            "score": 266,
            "replies": [
                {
                    "author": "emoshortz",
                    "body": "He's also a hypocrite: https://www.theguardian.com/us-news/2023/aug/12/texas-fetus-rights-prison-guard-lawsuit-abortion",
                    "score": 85,
                    "replies": [
                        {
                            "author": "Illiander",
                            "body": "You have to rememebr that conservatives love it when their people are hypocrites in public.  They see it as a display of power.",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "ericmm76",
                                    "body": "Rules for thee but not for me. \n\nThe Conservative Flex.",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "Oh-Kaleidoscope",
                                    "body": "I've never heard it stated like this.. you're absolutely right",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "rosefiend",
                                    "body": "Ooooh, that makes a lot of sense.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jelywe",
                            "body": "That is so effed up.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Emarosa_95",
            "body": "Women should never ever give men childreen ever again. I dont care if people think I am extreme",
            "score": 378,
            "replies": [
                {
                    "author": "TheThingInItself",
                    "body": "That's what the Korean 4B protest is, it's not extreme it's the men's fault anyway",
                    "score": 229,
                    "replies": [
                        {
                            "author": "Emarosa_95",
                            "body": "I still like sex but the rest hell no",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "somniopus",
                                    "body": "Have sex with yourself, fr, you're probably better at it anyway",
                                    "score": 73,
                                    "replies": [
                                        {
                                            "author": "HeyTherehnc",
                                            "body": "I say this all the time, I’ve got a vibrator or hands and they never leave me unsatisfied. Can’t say the same for any single person.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheRauk",
                            "body": "Dobbs was brought by a woman and a woman was the swing vote on the decision.  Woman need to own a fair share of the responsibility for the reversal of Roe.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "acfox13",
                                    "body": "Yeah, 53% of WW voted to fuck the rest of us.",
                                    "score": 40,
                                    "replies": [
                                        {
                                            "author": "TheRauk",
                                            "body": "57% of all women voted Biden\n53% of all women voted Harris\n\nTrump gained women voters every cycle since 2016, in fact the only thing he declined on was white men in 2024.  \n\nRoe is reversed and women increase their votes for the repeal party.  I appreciate your comments, thank you. \n\n[Source](https://cawp.rutgers.edu/blog/gender-differences-2024-presidential-vote)",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "acfox13",
                                                    "body": "It needs to be said. Any woman that voted for maga is out of the club until they do their deconstruction work. I don't support all women. I only support women that voted for women's rights.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "TheRauk",
                                                            "body": "One should support people who share our beliefs.  In my unscientific opinion women hate men because they are men and they hate women because they are women.  \n\nIdeals don’t know chromosomes.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "analyticaljoe",
                    "body": "I think this is the answer. It's not medically safe to have children if abortion is off the table. So ... don't have kids.",
                    "score": 77,
                    "replies": [
                        {
                            "author": "Emarosa_95",
                            "body": "Thank god I never wanted kids and already gotten my sterilization but even women that wanted to become a mother are now like hell no \nBut I am Sure mango Mussolini is going to find a qay to get his white babys one way or another",
                            "score": 22,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Anna__V",
                    "body": "/r/4bmovement",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "SailInternational251",
                    "body": "No women in other states should claim pregnancy and after he gets excited end that shit right there. Fuck em",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "krichard-21",
            "body": "Conservatives have deemed abortions equate to murder. Regardless of nothing being mentioned in any religion.\n\nAbortions are a very popular conservative issue. Who can argue abortions are good?\n\nUnless one considers rape, incest, medical necessity. Or simply a tragic mistake.\n\nConservatives have rallied around this issue and finally removed that right to an abortion nation wide.\n\nLet's remember who this affects… The poor. That's it.\nAny person with the means to travel needs an abortion. They can get one. Period.\n\nLet's see when the first politician or millionaire is arrested for having or seeking an abortion. We can all wait together. IT'S NOT HAPPENING! NEVER!",
            "score": 50,
            "replies": [
                {
                    "author": "Magsi_n",
                    "body": "I would like all women who are of childbearing age, who have a close relationship with an elected official, to call up this official, crying, distraught, because they are pregnant. For whatever reason, this pregnancy must be ended, for whatever reason makes most sense. And record everything. \n\nThen publish it. Let's take a tally. \n\nHow many reassure her that it's ok, they know a provider who can take care of the problem. \n\nHow many say they will support her and be there for her because every baby deserves a supportive family. \n\nHow many say, not my problem and hang up. \n\nHow many say this is God's plan, you're no longer part of my family.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "timelord-degallifrey",
            "body": "Abortions will happen regardless of the law. Only women will suffer and die as a result. Crazy that the courts denied 20 women who said they denied medically necessary abortions.\n\nWe truly are living in a backwards time. I want out of this timeline.",
            "score": 25,
            "replies": []
        },
        {
            "author": "Misubi_Bluth",
            "body": "While I'm not gonna act like it's impossible for a Catholic to perform an abortion, I find it suspect that the first person they arrest under this law happens to be of a religion that stereotypically gives the most pushback on abortions.",
            "score": 38,
            "replies": []
        },
        {
            "author": "mspolytheist",
            "body": "Soon they’ll be reporting these stories with the woman identified only as “Of(husband’s name).”",
            "score": 43,
            "replies": []
        },
        {
            "author": "Snarky_McSnarkleton",
            "body": "We can't stop this from being forced on all 50 states, probably by the end of the year. Get out of the country if you can. My wife refuses to believe it's that bad, and I won't leave without her.",
            "score": 22,
            "replies": [
                {
                    "author": "TEG_SAR",
                    "body": "I don’t think I could leave without my parents. \n\nI have no children and my extended family is toxic. All I have is my partner and my parents. \n\nOnly I work in a field that would qualify for getting a visa to work overseas but what country would also take my non-married same-sex partner and my parents?\n\nI make good money but not enough to buy my way to get them visas. \n\nMy parents are working class who believed social security would be there for them when they qualify plus their own IRAs. \n\nEveryone says to get out of the country but how?\n\nHow are people without STEM backgrounds or wealthy affording to just up and leave the US and support yourself in a legal manner?\n\nI’m not trying to be snarky but genuinely asking. \n\nI can’t leave any of them. They are my life. \n\nWithout them I’m just a grumpy cat lady on Reddit.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "floracalendula",
                            "body": "The grumpy cat lady speaks for me, except I don't have a partner",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Illiander",
                    "body": "Either flee or fight.\n\nPick one and commit to it.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "wrenaissance44",
            "body": "Also from the article: \"Holly Shearman, a midwife who runs a birth centre where Ms Rojas worked part-time, told the Texas Tribune that she was \"shocked\" by news of the arrest.\n\nAccording to the Texas-based news website, Ms Shearman said Ms Rojas was a devout Catholic who provided prenatal care to a primarily Spanish-speaking, low-income community.\n\n\"I don't believe it for one second,\" she said of the allegations.\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "shaylahbaylaboo",
            "body": "It’s almost like…back alley abortions happen. Outlawing abortion only drives it underground. It doesn’t stop it, but guarantees a lot more women will die.",
            "score": 1,
            "replies": []
        },
        {
            "author": "90sfemgroups",
            "body": "Hey Texas, how many unsolved rape cases do you have in each county?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnnabananaIL",
            "body": "Why would any woman live in Texas at this point or Alabama or Mississippi or any of the states that have banned abortion.",
            "score": 3,
            "replies": []
        },
        {
            "author": "feminist-lady",
            "body": "Good grief. I hate it here. \n\nAt the risk of being eaten alive, I will say, it does sound like this woman was a CPM rather than a CNM. Certified professional midwives in the state of Texas have terrifyingly weak standards. As a public health expert, based on their licensing requirements, I am uncomfortable with CPMs providing abortions–they don’t have the training to handle any complications. I’m sure people will respond with well, but, the situation is bad and they’re better than nothing! While I understand that viewpoint, it  doesn’t make this whole thing grind my gears less.",
            "score": 3,
            "replies": [
                {
                    "author": "seabrooksr",
                    "body": "I am interested to know exactly what constitutes \"performing illegal abortions\". \n\nI highly suspect she was providing miso to patients that were under nine weeks pregnant, not performing surgical procedures. The pill is 99% safe and is available in a number of places without medical supervision at all. \n\nTo limit her liability, she might have been asking them to take the first dose in front of her, which I suppose could be twisted into \"performing abortions at her clinic\". \n\nI'm stuck on the fact that people are adamant about her innocence. There's no real way to cover up performing surgery from co-workers and other staff.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "sweetbutcanbesorry",
                    "body": "Did you read the article ?  Someone that works with the women says she was providing birth control not performing abortions.   How about we see the supposed evidence that dick Ken Paxton produces.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Rheinwg",
                    "body": "\"Sounds like\" aka what the cops want you to believe.\n\n\n\nWe don't know a single thing about this woman. Only the AG says and they have every reason to lie. \n\n\nThey know abortion is popular and they're going to try every dirty trick in the book to make her appear unsympathetic\n\nBe very careful about what information you share and what you believe. They will try every dirty trick in the book.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "otempora1",
            "body": "I couldn't figure out how to donate to her legal fund. She's a hero.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TAOJeff",
            "body": "I bet he's already swapping his wardrobe / closet out for shelves and drawers. Double win, beats the rush for when he bans coat hangers and if there aren't any closets, there won't be any gays.\n\n\n(Dark humour for anyone wondering, because a) it's dark humour and b) it's not funny if you have a normal sense of humour but definable not funny for anyone if the gop actually bans coat hangers or closets because of stupid reasoning)",
            "score": 1,
            "replies": []
        }
    ]
}