{
    "title": "I trusted a man and now i have nothing",
    "author": "LegendaryCatfish",
    "subreddit": "TwoXChromosomes",
    "rank": 7,
    "score": 1171,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1je2ijx/i_trusted_a_man_and_now_i_have_nothing/",
    "id": "1je2ijx",
    "selftext": "Before I met him I was doing so good. I dated a person with npd for ten years but for 2 years I rebuilt myself and worked so hard on my mental health. \n\nI saved thousands of dollars to be able to get my first apartment to be on my own for the first time. I didn't go out to eat, I didn't buy luxuries, but I was happy. \n\nBut then I met him and I fell in love. And he made me feel safe. And convinced me to buy things that I didn't need. He even said aren't you happy you don't need to look for an apartment anymore? This is your home. \n\nThen things got bad. But I poured my entire soul into trying to help him. He was severely depressed. I would take care of his kid. I loved that kid, though it was overwhelming at times. I was left begging for love and affection. \n\nBut then he told me to leave. No warning, no you have a week to leave, just leave now. And I have no money. I was doing fine before I met him, but now I'm homeless. I have friends with couches, but when will they tell me to leave too? Even if they don't tell me to leave, I feel like a burden. I am mentally preparing myself to live in my car, but it's just not fair. \n\nI am never doing this again. I deserve stability, and I will give it to myself. I have a job, but I will get a second one. I graduate in May with my AA magna cum laude, and I will apply to finish my bachelor's and apply for as many grants as I can. I will rebuild my life. But I will never live with a fucking man again. I am full of love and empathy and kindness, and I will never give that to someone who will just throw me away like I'm trash. ",
    "comments": [
        {
            "author": "shame-the-devil",
            "body": "This is your sign ladies. If he’s good for you, you’d be adding to your savings, not losing it. If he’s an equal partner, you wouldn’t be pouring everything into the relationship only to be left with nothing. If you continue dating, evaluate weekly and stop giving more than you can afford to give and still be financially and mentally healthy. Otherwise, it’s an unequal partnership and you’re letting yourself be used.",
            "score": 449,
            "replies": [
                {
                    "author": "LegendaryCatfish",
                    "body": "Amen. Never again.",
                    "score": 78,
                    "replies": []
                },
                {
                    "author": "CormacMacAleese",
                    "body": "So much this. If he isn't in effect encouraging you to maintain your readiness at all times to strike out on your own, that in itself should be a red flag. That includes adding to your savings, like shame-the-devil said, but it also means that men who encourage you to quit your job, discourage you from pursuing education, or in any way increase your dependence on them, are setting you up.\n\n\\* My mom spent 50 years in an abusive marriage, and she was only able to survive on her own thanks to an inheritance from her mother. It's not much, but along with social security, medicaid, and medicare, she's living frugally but living her best life.",
                    "score": 40,
                    "replies": []
                }
            ]
        },
        {
            "author": "888_traveller",
            "body": "OMG my story is so similar. I have left my ex with my life in shatters after dedicating the last years to help him turn his life around and achieve all his goals, in the hope of helping his depression and allround negativity. Never again.\n\nThe only difference is that I was the one to leave because I knew his negativity and soulsucking criticisms was dragging down my chances of getting a new job and digging myself out of the mess I ended up in as a result of helping him.",
            "score": 496,
            "replies": [
                {
                    "author": "LegendaryCatfish",
                    "body": "I'm sorry you went through something similar. I had the urge to leave a few months ago, and I ignored it. I thought because I did have an abusive relationship in the past I was just running away from my problems now. I should have been saving every penny as soon as I felt that way. I thought if I was patient, I would have the man I loved back again.",
                    "score": 142,
                    "replies": [
                        {
                            "author": "888_traveller",
                            "body": "From your original post it seems like you're an overachiever. I've read that people like us tend to end up in situations like these because we have the mentality that if we just work harder and power through the obstacles, we can make anything work. But in reality it just leads us to fix other's problems (in relationships) and we even enable the underlying cause. We need let things fail more - BOUNDARIES, basically!! I think in this context it is quite common - I know many successful women persevering with men that cannot live up to their aspirations. I think part of it is that we see the potential in them, but that is all it is: potential. They themselves need to realise it, and we cannot do that for them.",
                            "score": 115,
                            "replies": [
                                {
                                    "author": "LegendaryCatfish",
                                    "body": "Oh god, yeah. I was a gifted program girlie. I did take years to go back to school due to illnesses and dating that other asshole. I find my self-worth in good grades and accomplishments for sure. I am glad that this relationship is over, even though it was really amazing for awhile, and I thought emotional labor was a social media phrase, but damn the emotional labor I put myself through daily was insane. I'm sad, and I'm hurt, but grateful that he let me go, so I didn't get further into this hole. Thank you.",
                                    "score": 56,
                                    "replies": [
                                        {
                                            "author": "888_traveller",
                                            "body": "lol it is so spooky how you are me!",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GalaxyChaser666",
                                    "body": "\"They themselves need to realize it, and we cannot do that for them.\" Well put.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Benderbluss",
                    "body": "I used to call it The Fisher King syndrome, as the main character did the same thing to his love interest. It seems to basically boil down to:\n\n\"You were there supporting me at my lowest points. I'm better now, but I associate you with the times that things were bad, so I'm kicking you out to start fresh\" \n\nIt's an absolute disregard for the humanity of the person who helped them.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Leagueofcatassasins",
            "body": "You did it before, you can do it again. You are not  a burden. Right now you need the village  to help you, at other times you were the village and will be it again.  and congrats on graduating with a Magna cum laude!",
            "score": 108,
            "replies": [
                {
                    "author": "LegendaryCatfish",
                    "body": "Thank you!",
                    "score": 26,
                    "replies": []
                }
            ]
        },
        {
            "author": "Slidje",
            "body": "Imagine how high you will fly now you have dropped all that baggage.",
            "score": 65,
            "replies": []
        },
        {
            "author": "Aromatic-Arugula-896",
            "body": "You need to involve the police here. If you were paying rent or staying there for extended periods of time he can't just kick you out. He has to evict you?\n\nGo to the police and get your things from the house",
            "score": 65,
            "replies": [
                {
                    "author": "CormacMacAleese",
                    "body": "Like Aromatic-Arugula said, you're fully entitled to reclaim your stuff. Often the police (or sheriff, or constable) will be willing to go with you to keep the peace. If necessary, you can get a court order.\n\nIt's up to you what that stuff is worth versus the trouble of retrieving it, but it's *your* decision.",
                    "score": 29,
                    "replies": []
                }
            ]
        },
        {
            "author": "Schattentochter",
            "body": "OP, I'm so sorry. It's tough to learn the lesson and even tougher to learn it like this.\n\n**So to all out there who need to hear it today:**\n\nIf a man is a fixer-upper, they're not ready to date. It is **not** your responsibility to \"help\" them.\n\nIf someone is showing distinct signs of mental illness but **is not** in therapy, drop that like the hot potato it is. Illness isn't the problem (I'd know, happily taken for 9 years with ptsd, autism and AvPD). The problem is when they show you from the get go that they have *zero* plans of putting in the work.\n\nDo not, under any circumstances, evereverever, give even *half* a shit about the following:\n\n- sob stories\n- repeating excuses\n- promises\n- plans\n\n\nJudge them always based on who they are **today, right now**, not for who they could be if they got their life together.\n\n\nYou are not saviours, you are human beings.",
            "score": 58,
            "replies": [
                {
                    "author": "CormacMacAleese",
                    "body": ">* sob stories\n>* repeating excuses\n>* promises\n>* plans\n\nThose are 100% the tools of abusers. They sound like the thing we go through at New Year's, making empty promises to ourselves that \"this year it'll be different,\" so we easily fall for them -- or at least believe that they're sincere. They're not.\n\nFrom an abuser they're nothing but manipulation.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "Kakakow",
                    "body": "AMEN.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "faithfuljohn",
            "body": "you may not have any physical possessions, but you do have more wisdom than you did before you met that guy. You're better equipped (mentally, emotionally) do deal with any possible a-holes that may come your way in the future. \n\nBut don't let him still control your life, by the damage he did to you. Don't let him define who you are or what you do. Move on from him because you have value and so does your life.",
            "score": 17,
            "replies": []
        },
        {
            "author": "goddessofwitches",
            "body": "Went thru this. I swear he is an undx sociopath. I've built back up, now have bought my own home.",
            "score": 14,
            "replies": []
        },
        {
            "author": "browsnwows",
            "body": "You’re hurting, and it’s ok to be angry, but don’t ever regret opening your heart. You loved deeply, that’s beautiful. \n\nYou’ve learned lessons- what to expect from a partner, and what to never tolerate again. That is invaluable! \n\nEvery break up is hard, yours especially so because of your circumstances, but you’re strong and resilient. \n\nYour accomplishments aren’t disqualified, you’ve done it once, you’ll do it again 10 fold. \n\nDon’t let a relationship with someone who didn’t respect you- which is the fundamental issue here not his mental health issues- ruin future possibilities of love. \n\nIf you need to cry or vent, DM me, I can help you find resources too!",
            "score": 12,
            "replies": [
                {
                    "author": "LegendaryCatfish",
                    "body": "Thank you so much!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ifeelnumb",
            "body": "If you are ever ready for a relationship again, try the yours, mine and ours approach to finances.  Plan to have a reserve and a personal retirement fund regardless.  You have a plan now so you're not a burden to your friends.  You're just regrouping.",
            "score": 10,
            "replies": []
        },
        {
            "author": "WontTellYouHisName",
            "body": "I'm so sorry for what you went through.  I have a relative whose story is depressingly similar, and she set some rules for herself, one of which was no more men who need fixing.  You can't fix someone else, they have to do that themselves.  And she would not give up her security again.  She lived on her own until she finished grad school.  In her late 20s she met a man who wanted her to move in, and she asked him if he owned the house outright or there was a mortgage, and would he put her name on the deed?  If she was giving up her home she needed to know she had security.  He wanted more from her but couldn't promise stability, so she stopped seeing him.  A couple years later she met a man who said he would only put her name on his house if they were married, but by that point she owned her own house.  Eventually he moved in with her and got a rental company to manage his house (as an AirBnB, I think).  They did get married and now her name is on two houses.  He gave her more security and stability, not less.  And you deserve the same for your life.",
            "score": 8,
            "replies": []
        },
        {
            "author": "hot_kombucha",
            "body": "I had to learn this the hard way too last year. This man said he loved me and would always be there, I was the one paying for all the dates. I was patient, he had gone through some tough times. I was supportive while he was trying to find a better job. He was living with a friend, and I didn’t feel comfortable with him moving in with me after I had only known him a few months. He eventually left me after he realized I wasn’t going to let him take advantage of me for my resources.  It crushed me. I really liked him, and wanted to build a relationship with him, but I don’t have the financial means or the mental energy to be the only person putting in the effort to make things work. \n\nI’m so sorry you met someone similar.",
            "score": 8,
            "replies": []
        },
        {
            "author": "MacaroniBee",
            "body": "r/4bmovement",
            "score": 30,
            "replies": []
        },
        {
            "author": "Sadielady11",
            "body": "Yep this is woman’s stories.  I made the same mistake and was left destitute after a 20 year marriage.  I swore I’d never put myself in that position again.  I have a great man now and I still refuse to allow him to pay my way.  I stand on my own two feet, that way no one can knock them out from under me.  It gives me hope that this generation of young woman are not tolerating this treatment anymore.  You will rise like a phoenix from the flame when you graduate.  Tear this world wide open!",
            "score": 13,
            "replies": []
        },
        {
            "author": "ApplePaintedRed",
            "body": "Hear this, ladies: Never sacrifice yourself for a man. Not your dreams, not your time, not your energy, and not your money. Especially not your happiness. Men are leaches, they're conditioned to use until there is nothing left while giving very little to nothing in return.\n\nJust know that we're very proud of you, and that we all have faith that you can make it out of this. Cohabitation is a thing of the past, at least with a man. If you ever pursue a relationship with a man again, do not move in with him. Ever. Maintain your finances and stability.",
            "score": 45,
            "replies": [
                {
                    "author": "LegendaryCatfish",
                    "body": "Thank you. Me and my dog will have our own place one day. That is safe and secure. And I will only cook and clean for myself. And be comfortable and fucking happy.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "ApplePaintedRed",
                            "body": "Hell yes!\n\nAnd this is also to say that you don't let some deadbeat dude move in with you either. Relationships should look like hanging out for a few hours or spending one night a week at your place. Bro does *not* live there, that is *your* space.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "LegendaryCatfish",
                                    "body": "Yes! No more being an unpaid caregiver.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Thick-Row280",
            "body": "This is a lesson you have learned early. I didn't learn that until I was 55. I can only rebuild due to inheritances. Good luck and I wish you all the best for a happy and secure future.",
            "score": 7,
            "replies": []
        },
        {
            "author": "kgiov",
            "body": "My first serious partner, who I expected to marry, came from a wealthy family and spent as though he was wealthy, which he was not. I was making very little money and had no grasp of how little his salary (which was double mine) could buy in NYC. He wound up with thousands in credit card debt from things we had done together, which I paid from my savings. The relationship went south for reasons other than money, although it certainly played a role when I realized that we would be unable to afford to have children.\n\nAfter that , I made up my mind that I would never be financially dependent on a partner, and I stuck to that. I got married and had 2 kids. My husband didn’t earn much for most of our marriage, but he is very responsible with money and savvy about investing, and we have more than we need. And he contributed in many other ways. But I think that if I had been depending on my husband to contribute more equally from salary, we wouldn’t have worked out.\n\nOP, you sound like you are on a similar journey. You have incredible potential, and I think you’re going to do great.",
            "score": 4,
            "replies": []
        },
        {
            "author": "fatlenny1",
            "body": "I'm so sorry this happened to you. But learn from this difficult lesson. NEVER depend on anyone else other than yourself. Once you can support yourself financially, never give up that freedom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Milena1991",
            "body": "I did the same, and now I’m stuck with a kid, who I love more than anything. I’m in a similar boat. Don’t let this harden you like it did me (lifetime of abuse on my end). I just got rid of someone like this, and there was physical abuse too. ",
            "score": 10,
            "replies": [
                {
                    "author": "LegendaryCatfish",
                    "body": "I was abused by my dad. Abused by an ex of ten years. I dated a few people before meeting my latest, but I knew they were not great and ended things. But I let my guard down with my latest and trusted again. Things will work out for you and me. But I hope neither of us let another shitty person back into our lives.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Milena1991",
                            "body": "I won’t let no one play in my face. I refuse to let my guard down and trust due to experience. I keep everything surface level until I really get to know you. Trust no one or anything. I will never fully trust a man again. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FeijoadaAceitavel",
            "body": "I went through this with my ex who was borderline. We were both at awful places when we met, so I got into a serious relationship even though she paraded around with red flags. I eventually got better, she had another streak of really bad fights/abuse/depression, so I left. With a sizeable debt, after having bought everything in our (rented) house.\n\nFortunately my family is well-off and paid my debt and helped me rebuild myself. But damn, I am NOT in a hurry to find another relationship after that.",
            "score": 1,
            "replies": []
        }
    ]
}