{
    "title": "\"Women expect Men to provide-\" Anyone irrationally pissed off by that phrase?",
    "author": "BrainBurnFallouti",
    "subreddit": "TwoXChromosomes",
    "rank": 5,
    "score": 478,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 190,
    "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1je8rk0/women_expect_men_to_provide_anyone_irrationally/",
    "id": "1je8rk0",
    "selftext": "Petty, but God I see this phrase CONSTANTLY! \"Men have trouble dating, cause we are expected to be 6feet, provide, and-\", or even shit like \"If Men would just stop providing, women would lose their shit and-\", or any meme variation of \"When WW3 breaks out, women will happily stay home and play housewife, cause deep down, they expect men to be the main provider aka dead man walking\".\n\nDon't get me wrong: I know that society/societal norms are still behind the times, in many ways. Toxic gender roles suck. Men. Women. And they stick to anyone, aka there are likely enough women who do believe men should pay/work for everything. Either because they are traditional/religious...or y'know. \"I'm pretty and have no empathy, so I feel everyone has to prove their worth to me\" Mean Girls.\n\nThat said: I just can't help, but feel pissy. Growing up, I was always surrounded by working women. Working women from ANY group: From blue to white collar. In rural areas, farmers of both genders would work fields and animals, never mind carry heavy stuff and operate mashinery. And in academia/middle-class families, it was fairly normal that both parents worked. Very commonly in the same fields e.g doctor couples. Even as a kid, I was taught how important school/work was, because \"Yes. Men are nice. But if he dies or runs away -who cares for the kids? Yes, you can cry. But you can't feed your kids on tears.\" to quote my very traditional grandmother. ^((the \"die\" part refers to most of our men dying in wars -we're European))\n\nGetting older, this sentiment never changed. On dates, you pay together. And sure, as mentioned there were girls who bragged about their bfs spending money on them -but even that was never put into the same category as dating for love. More dating for status. And in that, it was often mutual: The girl got presents/free lunch, and the guy got to show off his hot gf. Which. To be a bit fair, has been a tactic of many women in the past ^((and present, depending on where you live)) as well. Women who wanted to work, but couldn't due to sexism, and so capitalized on their beauty. *\"Don't you know that a man being rich is like a girl being pretty? You wouldn't marry a girl just because she's pretty, but my goodness, doesn't it help?\"* \\-Gentlemen Prefer Blondes (1953)\n\nAnd yes, yes. I know. I know. A lot is just insecure men being whiny. Men that want a power-structure and are angry they can't have women dependable on them anymore -not just on Reddit, but also, sadly in politics, media & co. Hence keeping the mill rolling, rolling.\n\nBut you know. Just. It's not just insulting to you, but also to all the people you love. Y'know?",
    "comments": [
        {
            "author": "Zelfzuchtig",
            "body": "Hah. If providing means having a job, most couples I know both work full time and have to in order to not live in near poverty. Yet somehow despite putting in equal hours in the office, the women seem to put in more in the home. Who is it that is pulling more than their fair share of the weight really? The issue seems to me to be that providing an income is the *only* expectation.\n\n>Growing up, I was always surrounded by working women.\n\nThis idea that women only started working recently is a type of historical revisionism that seems to be perpetuated by certain groups in order to manipulate angry, isolated and insecure men into participating in the manosphere or the political right. In reality the so-called traditional housewife was restricted to a very small part of history and to a few locations.\n\nOther attempts to change things I have noticed are erasure of violent protests, downplaying of women's contributions to the war efforts, downplaying of womens contributions to science and technology, pretending everyone used to marry extremely young girls and overplaying of the prevalence of \"women and children first\".",
            "score": 293,
            "replies": [
                {
                    "author": "mecegirl",
                    "body": "Yeah. The idea that women work outside of the home because they want to, not because they need to. \n\nYes, a lot of us want to work, but also, a lot of us would have to work regardless. The rent doesn't care that I'm not a man. And yes, I will work the highest paying job that I have the aptitude to because I'm gonna have to work anyway.",
                    "score": 60,
                    "replies": []
                },
                {
                    "author": "BrainBurnFallouti",
                    "body": ">This idea that women only started working recently is a type of historical revisionism\n\nAmerican revisionism especially -at least from what I've seen. Like. Especially those Memes I've mentioned. Every time, it's this American 50s picture of a woman with a casserole. And despite knowing it better, my German ass just thinks \"When?! When tf did women ever act like that in war?\" Because in my head, the first idea of \"women in war\" are women in factories, in field hospitals, or scavengers looking for food in a bombed country.\n\nI guess it's why it makes me so angry. Yes. Men dying as soldiers is horrible. But then you have the horror that just the women in my family lived through. Like. I have a Polish aunt, who had to make her way through WW2 Germany with 7 kids. And how my family lifts her up as a small role model, because \"she kept all 7 alive, and only herself & her oldest daughter got raped\". Including hiding from Russian soldiers in cold cellars, as rats tried to eat her alive.\n\nOr, just my grandmother. Who used her starved body to press herself into small spaces to get food for her siblings. It fucked her up for life. Any visit, she'd make mountains of food. Get concerned if you didn't eat enthusiastically. One time, I even got my mother in trouble with her once: When I was 4-5yo, I was a pretty fussy, impulsive kid. That day, it was just before dinner, and I was constantly grabbing for the pot, not understanding it'd be done in literal 5-10min. At one point, my grandmother called. And with Ma busy in the kitchen, I got the phone first when she called.\n\n\"How are you honey?\", she asked. \"Not good.\" I said sobbing. \"I'm so hungry and Mama doesn't want to give me food.\" (Pause) \"...honey. Give me your mother, please?\"\n\nit took 5-10min of arguing till my mother convinced her of the miscommunication.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "hmmadrone",
                            "body": "My grandmother was a welder for the Navy in WWII. She continued to work at the naval shipyard until she retired.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "floracalendula",
                            "body": "Family lore has Oma looting the Nazis for food. Considering what a kugel she grew into, and that feeding us was her love language... wouldn't be surprised if our grandmothers had similar stories. Solidarity.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "wildturkeyexchange",
                            "body": ">  Men dying as soldiers is horrible.\n\nAnd they were ordered into war by men and they were killed by men, too. Just a big circle of men killing each other at another man's command. Too bad women and children are killed in wars without a chance at defending themselves because they alone were not given the guns, training and protection soldiers are given.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "snowellechan77",
                    "body": "I've seen studies that women underestimate their hours and men overestimate their hours doing home tasks. In fact, the only group that provided equal home labor hours were stay at home men.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "imrzzz",
                    "body": "Very well said, excellent summary of some fundamentally important points.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "SpontaneousNubs",
                    "body": "They can't even provide a clean penis. Sheesh",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Fraerie",
                    "body": "Women have always worked. It’s only recently (in historical term)that work was tracked by payroll getting paid into a bank account. Previously it was the barter of eggs and milk for grain or flour, or working for cash that went into the household funds. They may have helped on the farm, worked in the family shop, been a house maid, cook or nanny ‘up at the big house’, been a governess, teacher, seamstress, bar maid, weaver, nurse, wet nurse, companion, etc…\n\nEven your example of ‘women and children first’ was not the historical norm. It was used on the Titanic when it sank, and was atypical behaviour determined by the captain and had to be enforced at gun point because typically the men would save the,selves first and abandon the women and children. And the captain thought that showed cowardice. \n\nMen who complain that women only want them for their paycheck. - what else are you bringing to the table? In what way do you improve her life and are not interchangeable with any other person who also has a paycheck? Money is ‘easy’, most people can make money to some degree, what makes *you* special and worth being in a relationship with?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "modus-operandi",
            "body": "This has always irked me and I would never want to be in the position where I rely on anybody else to survive or even worse; feel like I owe them something. I don’t know why this is being sold as something one should covet. It’s a choice and it can be done right if both parties are in agreement, but I dislike the part where people feel like you are somehow benefiting from someone else. You know, even if you are doing a shitload of unseen and unpaid labor at home.\n\nFor me personally, having my own career, my own bank account, my own investments and savings gives me monumental peace of mind. ",
            "score": 61,
            "replies": [
                {
                    "author": "Eva_Roos",
                    "body": "I second this wholehartedly. I like being independent, I would get anxious if I would depend on somebody that much. Sure, it works for people, my parents being an example, but not for me.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "yourlifec0ach",
            "body": "These common phrases seem to come mostly from men's spaces. They seem to come from other men rather than from lived experience. They convince each other that this is the case, no need to actually pay attention to what women say they want, men know better 🙄\n\nAnyone parroting these lines is someone to avoid, in my book. And as for your title, I think I am *very* rational in this line of thinking.",
            "score": 267,
            "replies": [
                {
                    "author": "smile_saurus",
                    "body": "I agree, with all of this. And I think that women, as a whole, and generalized. Some men *but not all men* say: 'Women only like X,' or: 'Women don't like Y,' as if all women share common likes & dislikes. Then when women voice what they *actually* like or dislike, we're told that we don't or shouldn't like or dislike those things or we're just ignored entirely. \n\nAll the while, they don't listen to or believe us and then they complain: 'Women are a mystery!' It's either that or they've got that stupid belief that we all want a 6' tall man with a 6-pack who makes 6-figures.",
                    "score": 67,
                    "replies": [
                        {
                            "author": "yourlifec0ach",
                            "body": "Sooooo much generalization. To that point, anyone who's going to tell me \"women like...\" or \"women are...\" or any variation thereof is another person I will avoid.",
                            "score": 18,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sanityjanity",
                    "body": "Right.  These are men who have no female friends, and don't listen to their female relatives, and therefore literally don't know what women want, except (maybe) for the women on tiktok that their algorithm supplies.\n\nThere are about 4 billion women on this planet.  We're just not a monolith.\n\nAlso, how many of us here can name women who have been the primary or sole provider for their family, even when it contains adult men?",
                    "score": 35,
                    "replies": [
                        {
                            "author": "RagnarsHairyBritches",
                            "body": "Off the top of my head, in two seconds, I can name three. Heck, my aunt supported her husband for over 30 years as he worked on his PHD thesis. He died before he could finish.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "snowellechan77",
                                    "body": "His phd thesis took 30 YEARS??",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "RagnarsHairyBritches",
                                            "body": "Yep. And according to those who have read it, it was all crap.\n\n\nReally, it was just an excuse to take advantage of my aunt.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "yourlifec0ach",
                                                    "body": "😭",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Fraerie",
                            "body": "I spent approximately five years as the sole provider while we tried to get a diagnosis for my partner’s seizure disorder as they steadily got worse. There are still male friends of his who talk to me as if I couldn’t possibly understand anything complicated when I’m a senior analyst & manager in a global technology consultancy. Dude.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "waitwuh",
                    "body": "Meanwhile women keep meeting the hobosexual men …",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "wildturkeyexchange",
                    "body": "Seriously! Who would ever look to today's man to 'provide' when they can't even take care of themselves and have to literally have their paychecks garnished by the government to even provide the bare minimum for their own children? What a joke.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PsychologicalLuck343",
            "body": "I'm not sure which is worse, being provided for by a man or providing for a man who resents it.",
            "score": 32,
            "replies": [
                {
                    "author": "BrainBurnFallouti",
                    "body": "Second one, personally. Being provided for can be fun, as long as it's not forever & heavily unequal. For example, when you're sick or on maternity leave. It's an expression of care, then. Nevermind a heavy stress relief, aka, just to give another Gentlemen Prefer Blondes quote:\n\n> **Dorothy Shaw:** Honey, did it ever occur to you that some people just don't care about money?\n\n>**Lorelei Lee:** Please, don't be silly. We're talking serious. You don't want to end up with a loveless marriage, do you?\n\n>**Dorothy Shaw:** Me, loveless?\n\n>**Lorelei Lee**: That's right. Because, if a girl spends all of her time worrying about the money she doesn't have - how is she going have any time for being in love? I want you to find happiness and stop having fun.\n\nContext: \"stop having fun\" refers to Lorelei's criticism of Dorothy always chasing sporty guys with no money, as beauty is linked to time, and the women's main asset (catching the eye of a man in the crowd). Obviously, she wants her to have fun. But she also wants her to be SAFE financially. Especially since it's implied in a song that Dorothy was so poor, she never even got an education, and potentially can't even read/write. With secretary being the main form of job, city women could often have. So a man that loves her, AND provides with a good job would be mutually beneficial.\n\nA man who resents you though? That's worse in any case. I mean. Not only are you providing for another person alone, you're providing for a person that actively hates you. Maybe even sabotage you, in their own insecurity.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "luckystar2591",
            "body": "I can tell you EXACTLY where this comes from.\n\nMen: I want a trad wife.\n\n\nWomen: Okay then, if I'm gonna be doing all the child rearing and domestic labour, I'll need you to be bringing in all the income. Just like you said you wanted. \n\n\nMen: Whoa...gold digger.",
            "score": 30,
            "replies": []
        },
        {
            "author": "blackberry-slushie",
            "body": "They claim they don’t want to be providers but educated and self sufficient women are red flags for them 🙄",
            "score": 22,
            "replies": [
                {
                    "author": "floracalendula",
                    "body": "Of course. Because it's not enough to be wanted for who they already are, we have to be at their motherfucking mercy.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MysteriousJob4362",
            "body": "My financial independence is very important to me. I don’t want a guy to be my provider at all. It’s dual income or nothing for me.\n\nAs far as WW3 nonsense, many of us voluntarily served in the military and the invasion of Ukraine increased female recruitment by 300%, even though they had the option to leave. So there goes that theory.\n\nI’ve mostly given up on relationships.",
            "score": 24,
            "replies": [
                {
                    "author": "th3n3w3ston3",
                    "body": "It's almost like there's always been women willing to serve in the military and fight in wars.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "throwawayRA1776538",
            "body": "It does piss me off, but I feel like it is either a projection or inferiority complex in a lot of cases. \n\nEither these men expect the women they date to be beautiful homemakers or they don’t have those things and don’t treat women nicely. They think they don’t get dates because they’re not 6ft and in finance. In reality, women don’t date them because they’re jerks. \n\nSo yes, it does piss me off because all the women I know don’t care about that very much. They care much more about personality. They make their own money and have their own homes. They don’t want to be with men who act as if women owe them something. It’s why I don’t date to be honest with you. I cannot seem to find a man who doesn’t feel like I should be doing everything when I provide for myself. I don’t want to clean and cook for you and manage your finances, businesses and appointments, all the while providing you with emotional intimacy that isn’t returned. I can do this by myself and have the peace of not having to manage someone else’s life too. And I also work all day and want to come home and relax. I don’t want a second job that I do for free.",
            "score": 88,
            "replies": [
                {
                    "author": "rubitbasteitsmokeit",
                    "body": "Ballerina Farms is a good example.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Fraerie",
                            "body": "Ballerina Farms is a good example of how so many men want a submissive wife, but mostly they want a wife they broke and tamed. They don’t want a wife who is naturally submissive, they want one who was successful and strong and then they put her in a box and clip her wings. Because then they won.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EvilCodeQueen",
            "body": "The whole 50s sitcom, dad with a briefcase and mom in an apron wasn't reality. There has historically been a small subset of the population where the man paid all the bills and the woman took care of the home. Poorer folks, everybody who could make money was making money. Rich folks, many times the inheritance came from the woman. Rural folks had cottage industries because literally, it was the woman in the cottage making stuff to sell at market. Women as breadwinners have been a thing since forever, because men left, died, became disabled. \n\nThe vast majority of women have always worked. Their labor may or may not have been paid, but they, for sure, always worked. Any man who says otherwise can suck it.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Motchiko",
            "body": "I find it almost comical, because the only provider I know are women. \n\nGive them a house and they give you a home. Give them ingredients and they make you a meal. Give them supply and they multiply the value by 10 with almost everything they do. \n\nWomen have always worked. The only thing that’s new is that women get a paycheck now. We don’t work for men for free anymore and can independently provide and that’s what women do. Almost every women I know spends 100% of her paycheck on the family- I can’t say the same for men. \n\nI’m an auditor and I can confidently say that men have the tendency to put money away from the family. Don’t trust them. Even rich men have this attitude by using the gold digger term. They expect to be the price and the women has to prove herself constantly wasting her time. \n\nThe only gold diggers are men and women are the providers.",
            "score": 16,
            "replies": [
                {
                    "author": "IndependentNew7750",
                    "body": "I don’t think that’s entirely true. According to pew data 55% of US households have a male breadwinner, 16% percent have a female breadwinner, and the rest is roughly equal.\n\nPlenty of women in the US have culturally conservative views on who should be the provider. And I don’t just mean politically conservative. Because even POC who typically vote progressive, can still have culturally conservative views on relationships and family life.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "wildturkeyexchange",
                            "body": "The primary earner is based on total income, and men earn more than women for the same job role with the same education and experience - and this discrepancy is widened in Black and Latina populations. Since women are only earning about 84% for doing the exact same jobs as men (or as little as 57% for some demographics), that 55% figure is either representative of equal work or more work on the woman's part.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "IndependentNew7750",
                                    "body": "I’ll just quote this because it’s easier then trying to explain it:\n\n “One of these factors is parenthood. Mothers ages 25 to 44 are less likely to be in the labor force than women of the same age who do not have children at home, and they tend to work fewer hours each week when employed. This can reduce the earnings of some mothers, although evidence suggests the effect is either modest overall or short-lived for many. On the other hand, fathers are more likely to be in the labor force – and to work more hours each week – than men without children at home. This is linked to an increase in the pay of fathers – a phenomenon referred to as the “fatherhood wage premium” – and tends to widen the gender pay gap.”\n\n“Motherhood does have important effects on the potential earnings of women. Women who experience breaks in their careers after becoming mothers sacrifice at least some of their earnings. Some mothers may never work for pay after having children, passing on earnings altogether. But it is difficult to know what the earnings of mothers might have been and, as a result, it is hard to know for certain what the full effect of motherhood is on women’s earnings. Estimates suggest that motherhood may account for much of the current shortfall in the earnings potential of women overall.”\n\nhttps://www.pewresearch.org/social-trends/2023/03/01/the-enduring-grip-of-the-gender-pay-gap/",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Niodia",
            "body": "It's easier for them to blame not being tall enough, or having enough $ for their failures in dating as opposed to them being horrible.",
            "score": 70,
            "replies": []
        },
        {
            "author": "asuyaa",
            "body": "I think it comes down to the fact that men (and many women) dont understand that a lot of labour that women do is not paid or paid very little",
            "score": 29,
            "replies": [
                {
                    "author": "agitated_houseplant",
                    "body": "I would love to be the provider. I can't clean worth shit, but I have a home and can pay the bills. That unpaid \"woman's labor\" is worth a lot to me and I hate doing it.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "RevolutionaryAccess7",
                            "body": "As women, if we make enough, we can hire someone to help with the cooking and cleaning.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "agitated_houseplant",
                                    "body": "True. But it would be nice to have someone to help with the emotional labor of existing as well. I don't like doing that either. I guess I want a sensitive and kind person who likes to clean to live in my home with me. And tell me if I'm being mean/grumpy.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lesliecarbone",
            "body": "Projection is a heckuva drug.",
            "score": 53,
            "replies": []
        },
        {
            "author": "rhyu",
            "body": "I feel like it works best to embrace the statement, and turn it back on them.\n\nYes, I expect men to provide their half of the effort to the relationship. I'm not looking to adopt an adult child.\n\nThere are all kinds of ways and forms a relationship requires effort. For example: Emotional (being supportive, doing things to make each other happy. Etc), labour ( cooking, cleaning, taking care of actual kids or other entities like pets, etc), and of course obtaining the funds necessary to support the rest of your lives together.\n\nIf you don't want to be putting your half of the effort into domestic tasks, then you'd better be finding another option to pull your weight. The big one remaining here is monetary, since a healthy relationship should really have you both putting in equal emotional investment.\n\n I'd also like to note putting in 8 hours a day 5 days a week, doesn't by itself necessarily equal half the work of a relationship, especially if kids are involved.\n\nIf you want to be a house husband and properly take care of the tasks at home while she works, that's cool too. \n\nWhatever amounts to providing your half of the effort for the relationship as it works for those individuals.",
            "score": 11,
            "replies": []
        },
        {
            "author": "DuchessElenav",
            "body": "What exactly are these dudes providing today? Don't get me wrong, I'm sure you could land a cute doctor who's also a great guy, but that's not most men. A lot of them are broke *and* they hate women. This \"women want this, women want that\" stuff isn't real, they're just yapping about reasons they think explain why *they're* alone. And it isn't because of any of that, it's because they *suck*.\n\n\"Women will be happy to be housewives when WW3 breaks out!\" Buddy! I don't want *any* wars to break out! And they wouldn't if MEN would stop starting them for fun. Most of these guys also romanticize dying in battle though, so whatever.",
            "score": 9,
            "replies": []
        },
        {
            "author": "lohdunlaulamalla",
            "body": "Yesterday I saw a reel in which a woman explained that we don't need men for financial reasons anymore. Nowadays men need to be *wanted* by women and they are struggling to adapt. \n\nThe comments were full of men with gotcha questions like \"But what do you do when your car needs an oil change?\"\n\nThat they don't see the difference between a romantic relationship that one enters for companionship and intimacy and a service that anyone (regardless of gender) can both perform and pay for, is concerning.",
            "score": 9,
            "replies": [
                {
                    "author": "IndependentNew7750",
                    "body": "The oil change comment is brain dead because most men aren’t even changing their only oil either. \n\nBut to your original point, I’m a bit skeptical because that’s a feminist perspective on relationships and sometimes people make the assumption that all women are feminists and that’s not really the case in reality.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "lohdunlaulamalla",
                            "body": "I don't think a woman has to identify as a feminist to have certain standards in a relationship. Unless she is part of a community that still asserts very rigid gender roles, she is no longer forced to marry to have food on the table and clothes on your back. She can provide for herself, which allows her to be more picky, when choosing a partner.\n\nThis is a societal mechanism that predates feminism. Spinsters were originally women who could make a living through spinning and therefore didn't have to marry. The term is nowadays used as a slur for a \"left over\" woman, but it was very much a voluntary choice for the original spinsters.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "IndependentNew7750",
                                    "body": "In this day and age, the vast majority of people who don’t have a favorable opinion of feminism are conservative and more supportive of traditional gender roles. \n\nAnd people can have whatever standard they want but that’s kind of how we got here in the first place. For example, in the US, 55% of US households have a male breadwinner, 16% percent have a female breadwinner, and the rest is roughly equal. As expected the gap widens as people age. If we’re not critical, I don’t expect much to change.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Some_word_some_wow",
            "body": "I also find it funny that these same men are usually the ‘women should do all the housework, child work, all domestic labor, all emotional/ mental labor, and men should just have to work their job’ types \n\nSo basically they’re saying that all they provide is income, and then get mad when the women they date actually want them to provide the only thing they say they bring to the relationship.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Spiritual-Square-394",
            "body": "Yes. I've always been particularly annoyed by the 'well men die for everyone in war' thing because it has been a long time since men were drafted, and even then it was still exceptional in the twentieth century. \n\n\nWhat isn't exceptional? Women dying and being injured in pregnancy and childbirth, all the time, right now in every country. Makes me want to tear my hair out when men suggest they are owed something for some imagined future sacrifice in an imagined future war when women sacrifice themselves for families all the time without any recognition. And not just in some imagined future scenario but right now!\n\n\n(Also, just to say, this is obviously just one aspect of being a women, not having kids doesn't make you less of one)",
            "score": 9,
            "replies": []
        },
        {
            "author": "Ellanuma",
            "body": "They just say stuff like this because they’re lonely and don’t want to acknowledge that it might be because of their personality. It’s easier to blame everything on “invisible women’s expectations.” \n\nI’ve tried to talk to these types of men before and explain that most women want a kind partner who treats them with respect, only to be met with “nu uh, you’re lying, all women want 6’5 bodybuilders with no personality other than gym and podcast”",
            "score": 6,
            "replies": [
                {
                    "author": "yourlifec0ach",
                    "body": "Yeah if they're parroting this crap they're likely too far gone. If they're not, then it's going to be a man who brings them back because all of this discourse is too steeped in misogyny for women to fix it.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "-janelleybeans-",
            "body": "The ONLY thing women expect from men these days is *the audacity…*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Traditional-Job-411",
            "body": "Providing drama",
            "score": 11,
            "replies": [
                {
                    "author": "Curae",
                    "body": "Lmao yes. I don't need a man to solve my problems, I'd maybe like to have one if he doesn't become a problem. \n\nI currently don't wish to add to my menagerie of pets tho. :)",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "IndependentNew7750",
            "body": "I’m probably going to get downvoted but I’ve seen a huge trend recently of “feminine dating coaches” suggesting that if a man isn’t paying your bills, he’s essentially worthless. And these aren’t just isolated cases. Some of these accounts and videos have millions of views and likes. They’re also riddled with homophobia and internalized misogyny but that’s a whole other conversation.\n\nShera seven is a good example (she started the whole “sprinkle sprinkle” phenomenon). Ironically, what people fail to realize about Shera is that she begin her relationship with her now husband as the much younger “other woman.” She has no remorse for breaking up their marriage and even brags about it. She’s also openly admitted that there is no physical intimacy in their marriage anymore. Yet somehow people listen to her as if she’s enlightened. \n\nAnd to be clear, I think people are entitled to whatever standard they want but the fact that some of these creators are gaining traction is an issue that needs to be addressed. I don’t think most women feel that way but I do think there’s been a massive push traditional gender roles on social media and since it’s coming from a POC woman (as opposed to a conservative white man), people don’t see an issue with it.",
            "score": 23,
            "replies": [
                {
                    "author": "yourlifec0ach",
                    "body": "I swear social media is a cancer on our society. **Content is not reality.**\n\nTrust your lived experience first and foremost.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "BrainBurnFallouti",
                    "body": "> “feminine dating coaches” suggesting that if a man isn’t paying your bills, he’s essentially worthless.\n\nYeah, I think you mean stuff like \"Female Dating Strategy\", right? I confess, I even followed stuff like that for a while as a teen. I was anxious, depressed and disappointed in violent men around me, so having someone tell me \"Girl! Know your worth!\" felt good at first. But after a while, I realized it was just a Mean Girl bootcamp. Even turning against other girls, for stepping out of line. And I mean: You got kicked, if you commented in subs they didn't like. Cult shit.\n\nThat said: While these coaches might indeed bring in numbers...as cheap as I'll sound rn...they are a very small, loud minority. At least in terms of influence. When you see women comment about men on the Internet, you generally hear a desire for respect, equal treatement and equal chores. Stuff like, not wanting to be the main organizers/caretakers for everything anymore, using their own shitty experiences as example. Like the bleak, very true example of men leaving their sick wives/gfs, while women stay for their sick husbands/bfs.\n\nMeanwhile, the provider thing is not just found in Tatertots. It's a very common phrase said by guys. And very little do you see these men use their own examples either. In fact, it's often single men, with main experiences being from dating apps. The only exception for this, might be in terms of emotional labor. Aka, depressingly, a lot of guys indeed make experiences where crying, or showing weakness is seen as an ick or \"unmanly\" by their partners, with many reporting being left because their gf \"just couldn't see them as a man\" anymore. Which...I'm sorry. There's no excuse in hell for that. If you are a woman that does that, you need to get your head checked. Like. Professionally. And your soul. What the fuck.\n\nYou also see it in statistics. Men become more conservative, pushing themself to the idea of \"Men are supposed to be providers\", while women tend to be more liberal. So to see that and then have those men blame WOMEN on that push...yeah. No.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "CaoilfhionnFlailing",
                            "body": "I suspect a lot of the \"she left me because I opened up and it's unmanly\" crowd is actually \"I trauma-dumped on her for several hours, expected her to play therapist, then she didn't immediately fuck me. After repeating this every time we were together she left me\".\n\n\nBeen there, done that, don't have the degree and if I did I would send you to someone impartial for professional reasons and also because I wouldn't be doing that shit for free.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nottabird_Nottaplane",
                    "body": "Exactly lol. I feel really gaslight by this thread. Granted I’m a guy,  but even as someone who’s not wedded to the idea of being a provider and loses no sleep for “failing” to want to meet that standard — I absolutely hear / see a ton of complaining from women that men aren’t providers. This is primarily on social media, and among young women: 20s - 30s. \n\nLike OP is talking about how it’s obviously “expected” to go half on dates — expected by who? I see endless complaining about just that on TikTok. I saw a woman of around 30 years of age crying real, hot tears because a man she liked asked for separate chèques at the end of the date; the video had 100k likes on TikTok and the comment section was tearing into him.\n\nI think SheraSeven is an outlier and plays up a bit for the camera, but the general direction of her sentiment is not an that far out of the mainstream. If it is at all, tbh. If this thread were on TikTok / Reels, the comment section would be tearing OP apart for being a PickMe or something lol.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "agitated_houseplant",
                            "body": "But that's kind of the point, sites like TikTok aren't reflective of the general population. And the people commenting on that woman's reels are women who already support her opinion. You are seeing that stuff because the algorithm knows you react to it, even negatively, and look at it. \n\nWhat do the women you know in real life think? Have you actually asked *them*? Women have a lot of different opinions, but it's the angry, rude ones that get play on the social media algorithms. \n\nLike many of the women here, I was raised to be able to take care of myself, to want my partner to actually be a partner, not to act like my child or parent. I was told to never go on a date anywhere that I couldn't comfortably afford to pay for myself so that I could politely pay for my half and leave. Never go anywhere without my emergency credit card so that if it goes really wrong I can pay for the whole thing and escape. And to switch back and forth paying for dates, or insist on paying for small supplemental to the date if he insists on paying for dinner. I'm a real person who owns my own condo, and likes guys who are short enough to comfortably kiss (under 5'8\"). \n\nBut this sub, specifically, isn't going to have nearly as many people who follow the types of influencers you are talking about. Because women aren't a monolith, and this sub will attract a mostly different group.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "SoCalThrowAway7",
                                    "body": "After reading this, I asked 10 women I know in real life. 2 of them said they think finances should be split by a percentage of total income, another said a man should cover bills and the woman should use her money to make the home nicer and get things for herself to destress. One is bi said they don’t want rely on a partner only to provide, but they are looking for a partner who wants to take over finances and spoil her and she won’t marry someone unless they want to be their financial provider. The other 6 said some variation of it’s a man’s job to provide. \n\nMy wife has been a stay at home long since before we got married and had kids because I made enough money that it didn’t really matter if she worked at Starbucks or not. She and both her sisters and her mother believe it’s a man’s job to provide, the two sisters complain constantly that their men don’t make enough that they can stop working. \n\nThese women live all over now, but are either from PA where I’m from or CA where my wife is from. Small town PA, so more of a conservative area in general and my wife’s family is from Northern California and definitely conservative, my wife is generally more liberal about everything but this. \n\nSo I’d say it definitely depends on where you live and what the culture is.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "Nottabird_Nottaplane",
                                    "body": "No offense, but I feel like your assumption of me is that I’m some dude who has zero exposure to women and only formed opinions through being drip fed them by Andrew Tate or something.\n\nOf my female friends, I imagine ~0 would burst into tears because a man asked to split the bill. Maybe a couple would refuse to go on a second date because of it maybe; they’d be the minority, and I’m not even confident of that assessment either. I’ve also been part of real-life conversations with women who expressed that they fully expect men to pay (or whoever asks for the date, which generally means men). \n\nOf dates I’ve personally been on, about half asked me to split the bill or to alternate. This is after I offer to fully cover it.\n\nIt’s all been a mixed bag just on that topic with no clear answer. \n\nEven more generally, I can’t really think of too many of my friends who want a “provider” or who want to be stay at home wives / mothers at all. That’s my small N. It doesn’t represent all women or something I extrapolate broadly beyond my friend group. \n\nMy opinions & observations weren’t fed to me by a biased third party nor are they absent from conversations I have off social media. My opinion of what I’ve seen on social media comes from seeing it on social media. That’s it and that’s all.\n\nMy opinion on “being a provider” comes from my own lived experiences, my values, and interactions I’ve had with others. I don’t think women are a monolith, my only point was that I’ve seen the expectation and demands OP is trying to claim don’t exist. That’s all.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "agitated_houseplant",
                                            "body": "**shrug** You specifically said in your comment that you were basing your opinion on what you'd seen on TikTok and other social media from influencers whose target audience is women who don't want to pay for anything and the women responding to those influencers. So my assumption was that they were in your feed, not Andrew Tate and his ilk.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "yourlifec0ach",
                            "body": "Don't believe everything you see on social media. It's *content,* not reality.\n\n\"Trust but verify\" is a good way to go if you want to kind of believe these things.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Nottabird_Nottaplane",
                                    "body": "I don’t believe in any of this in the sense that I think it’s something I should internalize to change my behavior or thinking; I instead just think that ultimately social media is a vehicle for people to express themselves. \n\nIf you’re seeing a lot of the same messages from people, in a variety of contexts in a variety of forms, it stands to reason that perhaps a real sentiment might exist behind those messages. The sentiment isn’t universal, and it might not align with what actually happens in other contexts. But the existence of that sentiment can be reckoned with and should be something one can acknowledge without being gaslit lol. \n\nYou don’t have to agree or disagree with Manosphere dating coaches — or even deny that they’re playing up for the camera — to acknowledge that they exist and represent a real feeling among men towards women. It’s a negative feeling, but the point is that it exists.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "yourlifec0ach",
                                            "body": "> If you’re seeing a lot of the same messages from people, in a variety of contexts in a variety of forms, it stands to reason that perhaps a real sentiment might exist behind those messages.\n\nKeep in mind that there's an algorithm behind your feed that goes for engagement. Positive or negative. Gender war content gets clicks. These content creators have figured out what to tell people that will stoke their emotions and rile them up. The algorithm promotes it, and people relish the feeling of self-righteousness. Stay grounded in reality and you'll see that this is delusion sprinkled with bits of truth. \n\n\n> You don’t have to agree or disagree with Manosphere dating coaches — or even deny that they’re playing up for the camera — to acknowledge that they exist and represent a real feeling among men towards women.\n\nYes, they play on people's *existing* emotions and frustrations. That's how they get clicks and views. It's still delusion sprinkled with bits of truth.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Mamasgoldenmilk",
                            "body": "The push back came after Kevin Samuel’s and Andrew Tate pushing their bs calling for “traditional” and “high value women” who are mostly homemakers or live in bangmaids. This pushed the narrative of providers heavy before that it may have been a bit assumed and considered chivalry but not a requirement.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lilgrizzles",
            "body": "It pisses me off too. You're not alone. Don't have time to give more detailed response but yeah. ",
            "score": 6,
            "replies": []
        },
        {
            "author": "Aliriel",
            "body": "And men expect women to put out. Irrationally pissed off by that as well. Transactional relationships.",
            "score": 4,
            "replies": []
        },
        {
            "author": "gringitapo",
            "body": "I literally don’t know any woman under 50 who doesn’t work full time or who expects a man to provide. I’m sure it happens, but I quite literally don’t meet or interact with women like that at all. Every woman in my life works full time and just tries to find some nice guy who puts in effort and is nice to them to date. The only time I see the “provider” sentiment is online. \n\nI occasionally see women crack jokes about finding a rich guy, but the women I’m friends with who are cracking those jokes are full time employees at corporate jobs with impressive titles. A few of my guy friends have also made jokes about dreaming of becoming house husbands. No one is really serious, it’s more of a “capitalism sucks” type of joke. \n\nAnd I also grew up around women who do the yard work and can change tires. Idk man. I’m just not seeing what all of these hoards of men online are supposedly seeing constantly, to the point where im thinking the only ones perpetuating this narrative anymore are right wing grifters online.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Dogzillas_Mom",
            "body": "If men would just stop and recognize that most women are providing for themselves, we’d all get along much better. They really need to stop watching podcasts or whatever and meet some actual, real people.",
            "score": 5,
            "replies": []
        },
        {
            "author": "SaltyWitchery",
            "body": "Men have very effectively trained me to not expect anything from them.\n\nAnd they wonder why there’s a male loneliness epidemic. \n\nWhat are you willing to give, sirs?? You can’t just TAKE.",
            "score": 9,
            "replies": [
                {
                    "author": "IndependentNew7750",
                    "body": "There isn’t really a male loneliness epidemic women and men report loneliness and roughly the same rate.\n\nhttps://www.pewresearch.org/2025/01/16/emotional-well-being/\n\nhttps://www.pewresearch.org/social-trends/2025/01/16/men-women-and-social-connections/\n\nhttps://newsroom.thecignagroup.com/loneliness-epidemic-persists-post-pandemic-look",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LEANiscrack",
            "body": "Id love for a dude to provide for me lmao \nWho wouldnt? Ive not met a dude who wouldnt be thrilled to be provided for! \nBut I have to say its prob at the very bottom of what Im looking for in a partner",
            "score": 21,
            "replies": [
                {
                    "author": "drainbead78",
                    "body": "I feel like if both partners in a relationship don't provide for one another in fairly equal amounts, it's not going to work. There are a lot of ways that one can be a provider without it being financial, though, and that goes for both men and women.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "LEANiscrack",
                            "body": "True. If we are going to be serious about it then being a stay at home partner even w/o kids can be straight up a fulltime job.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PsychologicalLuck343",
                    "body": "Very often there are strings attached to being provided for. What would you be willing to give up? How much time doing unpaid labor? Would you be okay being made to feel like an appendage of a successful man? Would you be okay with him controlling your behavior because you're dipping from his well?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "LEANiscrack",
                            "body": "Obviously not.\nMy point is what dudes imagine being provided for means is what anyone would want.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "PsychologicalLuck343",
                                    "body": "I see, thanks for responding.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BrainBurnFallouti",
                    "body": "Same. There's this joke in Romance Novels, how a lot of the female power fantasies are \"rich, hot CEOs\". Which...is true. However, a lot also forget to mention that many of these characters are also kind, caring and often on equal footing with the female MC. Y'know. *\"He was a hot warrior. She was a huntress. They lived in a dystopia where she cared for her 7 sisters, shooting mutated rats with bow & arrow. They met as enemies in a fight. Locking eyes, as she threw him down. Making him realize how hot & not like other girls she was for being dominant and wearing pants\"* ^((I'm sorry, I'm sorry))",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Calliope719",
                            "body": "I'd read it",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "uraniumstingray",
                                    "body": "Same especially for the mutated rats",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LEANiscrack",
                            "body": "Haha not REALLY related but it reminded me off my MOST hated trope because tv/books just wont let it die.\n“Ive had to be tough.. I grew up with seven brothers” \nMakes me groan out loud everytime. \n\n(More specifically I was watching brooklyn 99 where its a thing and started to watch the rookie to replace it cuz Ive had rewatched brooklyn too much. And in the first episode that trope shows up.) ",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "IAM_THE_LIZARD_QUEEN",
                                    "body": "I hate to say it but as someone who grew up with three brothers it really is like that sometimes. It's an annoying trope but it's not total bullshit.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "LEANiscrack",
                                            "body": "Yeah but there is so many other reasons a girl can be tough.. All the women I know who have a lot of brothers are more the spoiled princessy types…(they all would call themselves that)  So it might be true but when it seems to be the ONLY explanation its annoying. ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "IAM_THE_LIZARD_QUEEN",
                                                    "body": "Well Brooklyn Nine Nine is probably not a great example in that case because Rosa is tough as fuck, and kind of just because she is.\n\nAmy is not actually the toughest either, she just wants to prove that she is, because yeah, that's a real thing that happens a lot when you're the sole girl among a bunch of boys.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "LEANiscrack",
                                                            "body": "First episode Amy comes in and says “i had to be tough because I have seven brothers” and the same thing happens in the rookie.\nLike its word for word. If it was less obvious it wouldnt bother me as much lol",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "IAM_THE_LIZARD_QUEEN",
                                                                    "body": ">First episode Amy comes in and says “i had to be tough because I have seven brothers”\n\nNo, she doesn't, she doesn't even say anything about it actually. Terry is giving Holt a run down of the detectives and explains that she has seven brothers and so she's always *trying to prove* that she's tough. \n\nIt's not just a throwaway \"this is why she's tough\" line (again, she's not even the \"tough\" woman, Rosa is), it's part of a larger introduction into her character and why she's so competitive and so desperate to prove herself because of her upbringing.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "LEANiscrack",
                                                                            "body": "Yes and its such a tired trope.\n(but she does at one point also say it about herself) ",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "IAM_THE_LIZARD_QUEEN",
                                                                                    "body": ">(but she does at one point also say it about herself) \n\nWhen?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BrainBurnFallouti",
                                            "body": "I think, the point LEA means, is the idea of \"Cool Girl\". Aka: It's not the explanation to why she is tough. Or used to certain topics, or even has skills not commonly found in girls e.g. fixing up cars.\n\nIt's used as explanation WHY she is cool. These stories/authors write homoerotic: Men are their biggest love. Men are the ones that are to be respected. The \"Cool Girl\" in question, is the hetero male fantasy of a man with breasts. I'm serious: Just notice how she is written besides that. How she does only traditionally male sports, drinks beer, calls herself a \"not like other girls\", has little to no female friends and always, always looks like a 9/10 supermodel. \n\nBecause indirectly, everything feminine/womanly is bad, undesirable and worthless if it's not for sex. A heterosexual, homoerotic power fantasy",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Natural-Avocado6516",
                            "body": "What I find really funny is that all these masculinity grifters constantly brag about their stupidly expensive cars, the massive houses, yachts, watches and a lot of men appear to find that aspirational. \n\nHaven't read much romance, but I wanted to know what all the 50 shades of gray hype is about and it's like every second paragraph is about how much the main character *doesn't* like all of this luxury, she's just so into the man that she accepts him *despite* his money. \n\nSo often in women's \"wish fulfilment media\" part of the fantasy is not wanting the fantasy, because lord forbid a woman overtly wanting to have the money or the power or the fame or the hot dude.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MyFiteSong",
                    "body": "> Id love for a dude to provide for me lmao  Who wouldnt?\n\nIt's not worth it.  Any fantasies you have of not working will be crushed quickly by the sheer load of domestic labor and childcare. You'll work far more than he does with no weekends or vacations away from it, ever, and you'll be expected to be grateful for his laziness and complete power over you.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "LEANiscrack",
                            "body": "It doesnt HAVE to be this way lets be clear. \nAnd wanting to be a stay at home wife/partner whatever is valid. ",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "MyFiteSong",
                                    "body": "> And wanting to be a stay at home wife/partner whatever is valid. \n\nOf course it's valid.  You just need to be aware of the reality of it, and of how power imbalances like that work out. Humans aren't wired to be able to handle having that much power over another person. It gets abused.\n\n>It doesnt HAVE to be this way lets be clear\n\nAnd yet it somehow always is.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "LEANiscrack",
                                            "body": "Yea my first post was sort of implying that what dudes thinks being provided for is something most ppl would enjoy. Preaching to the choire here lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SoCalThrowAway7",
                    "body": "I tell people often, I’m praying to see a super rich person about to be hit by a car and save their life so they’ll be my benefactor of living a life of leisure. But alas I still trudge to work every day.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "danamo219",
            "body": "Lmao women staying home to play housewife during a world war is an immediate disqualifier. Who do they think made the world keep turning while all the soldiers were off soldiering? Were nurses just... Unnecessary? During a war? Do they think their MRE's just appeared there? Just because they don't *care* what women were doing during the world wars doesn't mean they were just sitting and waiting for it to be over bffr",
            "score": 8,
            "replies": []
        },
        {
            "author": "Mademoi-Sell",
            "body": "These are the same men who balk at the idea of not being “the provider” of the household. I’m sure there are many women who expects men to provide, but a lot of the pressure men feel is from other men making fun of them if their woman is a go-getter.\n\nSource: I have a masters degree and am fortunate enough to be in a great place in my career for my age. You’d be surprised how this makes me totally undateable to a huge portion of men who feel emasculated by it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Just_here2020",
            "body": "Here’s what I see: a lot of men complain about just being expected to provide BUT aren’t bringing anything to the table except providing. \n\nHalf of mental labor? Nope. He’s not doing that. \n\nHalf of organizing fun parties around her hobbies and friends? Nope. He’s not doing that. \n\nHalf of Christmas shopping and birthday gift giving? Nope. He’s not doing that. \n\n\nHalf of laundry and reminding his partner that she should get new clothing? Nope. He’s not doing that. \n\n\nAnticipating when she’ll run out of shampoo and face wash and buying it for her? Nope. He’s not doing that. \n\n\nHalf of cooking / cleaning / meal prep / grocery shopping? Nope. He’s not doing that. \n\n\nHalf of sick time for kids, arranging sitters, researching extra activities and play dates and daycare and preschool, and packing lunches and organizing bags and upgrading clothing and getting bigger shoes? Nope. He’s not doing that. \n\n\n\nMost men can’t fix a car, roof their house, do a full decent remodel or landscaping, put up a fence, repair appliances, rewire electrical, or most other large household projects by themselves - they pay people - so that isn’t it either. \n \n\nSo other than money, what *is he bringing to the table?* Frankly, money is the easiest part of this all. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "ZinaSky2",
            "body": "The most annoying part is the “expectation to provide” is a gender norm… That idiots like these are the most likely to reenforce.",
            "score": 4,
            "replies": []
        },
        {
            "author": "timefornewgods",
            "body": "Any man who thinks that way is held prisoner by his own limited imagination. Because if you were to look around at all, there are plenty of relationships where women out-earn their male partners. There are plenty of relationships where the man is obviously not 6 feet, jacked or incredibly handsome. Most households are split expenses evenly across the board. They simply cannot imagine that there is more to personhood than being either rich or handsome. It's a victim mentality, plain and simple. Part of me wants to say that this logic is the result of being chronically online but it seems as though it's catching on in real life as well.\n\nMen who think like that don't listen to women at all and will fight for the right to be strong and wrong, even when insisting on their limited understanding is making them miserable. I know people complain about dating posts in gendered subs but it's kind of shocking how little men are inclined to research the wealth of information available in spaces like reddit. If you were to read a thread like [this one](https://www.reddit.com/r/AskWomenOver30/comments/1jbjqqq/what_is_the_biggest_problem_you_see_with_men_who/), for example, notice how no one talks about how little money is being earned. It's more about the lack of ambition, prevailing feeling of detachment, no inclination to take accountability for their own problems, miserliness, etc. It's like if they bothered at all to factor in an opinion from women (not men that are trying to grift them into a visceral reaction to not feeling like they're enough) they might stumble upon a cause to shift their perspective and behavior.",
            "score": 5,
            "replies": []
        },
        {
            "author": "sezit",
            "body": "90% of the guys who say this have working mothers.",
            "score": 5,
            "replies": []
        },
        {
            "author": "stilettopanda",
            "body": "I mentioned that I left my ex when I was a stay at home mom to 4 kids on a post once, and had some mouth breather comment that I made a mistake because I'd never find a man to support me and my kids. \n\nThe satisfaction I felt when I told him I had already bought out my ex, own my home and support myself...",
            "score": 5,
            "replies": []
        },
        {
            "author": "Timely-Youth-9074",
            "body": "They just want to whine and cover all bases.\n\nAlso, claim to want a trad wife but don’t want to support women?",
            "score": 4,
            "replies": [
                {
                    "author": "BrainBurnFallouti",
                    "body": ">Also, claim to want a trad wife but don’t want to support women?\n\nNot the women, and not even their own family sometimes. You see this in Passport Bros a lot. They go & marry women from poor countries, because they are sick of the \"Feminists\" in their country, and want tradition so bad. The women that marry them, as you guess, do it for money. Not just money for them -as a support for their family at home, especially. \n\nThat shit clashes pretty quickly. For example: There was this Tiktoker, named \"From Chad to Dad\". Rich guy, who went out and married a Filipina. Welp. That entire marriage lasted 2 years. Why? Well, not only had he disrespected his wife constantly, he made the mistake to openly disrespect his in-laws. \n\nOn camera, he also admitted that money was a big arguing point for them as a whole: Saying that a man's money is for his kids, not the family of his wife. Which is already the opposite of western \"traditional family values\" (hrough marriage two families become one) -but he said this to a Filipina. Filipinos have VERY strong family ties & values. And that's also why she left him: Disrespecting her, was one thing. But disrespecting her family was the nail in the coffin. \n\nBut yeah. \"Traditional\"",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "hmmadrone",
            "body": "No, I'm rationally pissed off when men say that. They're just throwing their weight around and trying to get women to go for the bad deal they're offering.",
            "score": 4,
            "replies": []
        },
        {
            "author": "FionaTheFierce",
            "body": "The men I am meeting in my age group can’t even provide *for themselves*.  Debt. Drunk. Divorced. Dumpy. Dirty. \n\nWomen want a man who has their life together, is emotionally mature, and a functioning adult, who contributes equally to the relationship.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Coomstress",
            "body": "I think it’s hogwash. I’m 44/F, and myself and all my contemporaries work full-time. I don’t know anyone supported by a man. I only know couples who combine income. \n\nThese dudes are living in the past. Even in the 80s, my mom worked full-time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zuka88",
            "body": "Provide? I just wanted a man who wasn't a financial strain on me! Don't get me wrong, I did try the stay at home wife/girlfriend/mom life. Didn't work. I did my part and then some. Know what they did? Dangle it over my head, or mistreated me because I had no way out and they freaking knew it. \n\n\nI love to work. I love bringing in money and taking care of my own. Because at the end of the day, I don't have some asshole dangling (you wouldn't have this if it wasn't for me) over my head. I can manage my own finances and buy whatever I want as long as my bills and necessities are paid, without some controlling prick questioning every cent. Even though when I WAS playing that sahm role, I never once bought anything outside of groceries, because it wasn't money that *I* made. \n\n\nI don't have to deal with being stuck in ANY relationship I don't want to be in either, because the man is abusive, or can't keep his dick in his pants. I will never not work now. \n\n\nAnd, by the way, if there ever was a war where people had to be drafted, I'd send my kids to their dad and *I* would be the one going and sending money back home to care for them? Why? Because I have an insane amount of years worth of pent up rage and would go hog wild in the field.\n\n\nBecause of the traumas, abuse, and deaths I've dealt with, I'm able to jump into action during complete and utter chaos. Whereas I've seen the majority of men in my life freeze up or act like chickens with their heads cut off, when something goes sideways. It's not about what makes a \"man\" anymore, it's about what makes an adult. \n\n\nAs far as dates have went, even then I shamefully have to \"emasculate\" a guy. I can't risk it anymore. I've been in too many dates where a guy insisted on paying because they say, and I quote, \"the man is supposed to be a provider\". Which is sweet and all, until it isn't, when they expect sex at the end and get pissed off that you won't jump on their Joystick after a $20 dollar meal like it's owed to them. \n\n\nSo yes, even something as simple as a date, I won't let a man provide anymore. I tell them it's because I feel the dates are for both to put in equal effort and it's the getting to know each other and the vibes that are counting here. \n\n\nHad I have lived this perfect little fairy tale life, and never had MULTIPLE men abuse this \"provider\" status, I might not have this outlook. Sad thing is though, it's definitely not just me who's experienced it. It's millions of women, and centuries of this exact scenario as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AsteroidTicker",
            "body": "I’m very rationally pissed by this, because dudes who say that shit are always the ones who wouldn’t be able to mentally handle dating a woman who makes more money than them.\n\nThey look down on women who don’t feel this way as “big bad feminists,” only to use it as a reason that all women are bad. ",
            "score": 10,
            "replies": []
        },
        {
            "author": "SnooChocolates1198",
            "body": "I'm a woman and yet I feel irrationally angry with that phrase. \n\nI guess my reasoning is because unless men are being paid to provide care, they aren't going to provide care because they don't really care about others apart from themselves (and even that is questionable). on top of it, even when they are paid to give a crap about anyone but themselves and what interests them, I personally feel that they don't actually care. \n\nMaybe I'm just jaded on the whole thing because of how my upbringing was, so I don't know.",
            "score": 10,
            "replies": []
        },
        {
            "author": "fromwayuphigh",
            "body": "It's empty-headed bullshit. It's always struck me as an excuse to be a shit partner.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MyFiteSong",
            "body": "It annoys me because while these crybabies are insisting nobody could provide for a family, every single mother is doing it.  Some of them have help from the government or the father, but lots don't.",
            "score": 3,
            "replies": []
        },
        {
            "author": "princesspink11",
            "body": "I’m irritated by literally anything a man has to say.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mermaidish",
            "body": "As the trad wife/alt right stuff has become more and more prominent over the last few years, it was interesting to note that a lot of these men want traditional roles - for the women. They want to come home from work to dinner on the table and then relax in front of the TV with a drink while the woman cleans and takes care of the kids. But these men also don't want the responsibility of being the sole provider because that puts too much pressure on them. They really do want it all and then get outraged when women push back or want a partner who's actually an equal.",
            "score": 3,
            "replies": []
        },
        {
            "author": "The_Bastard_Henry",
            "body": "Thinking about it now, I actually do not have a single female family member, friend, or acquaintance who is unemployed and fully supported by a man. The ones who don't work are all either retired and living on their own retirement funds, or disabled and unable to work full time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Salarian_American",
            "body": "No surprise how many men will say these things without ever acknowledging the things that they expect women to provide.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ChemistryIll2682",
            "body": "Men are expected to \"provide\" the same amount of effort to make a relationship work. Nothing more, nothing less. If they find women that want them to be the providers, they're free not to date those women!",
            "score": 3,
            "replies": []
        },
        {
            "author": "ApplePaintedRed",
            "body": "Yes, I've been saying this for a while now. It's one of their main talking points, how they provide and it's expected, and I'm just sitting here like ??????? And people *go with it*? Like, no, every woman I know and have grown up around has had to work, I work full time and support myself. There is no expectation to provide whatsoever, yet they'll use that as an unrealistic and \"gold digger\" standard. What rock do they live under.",
            "score": 3,
            "replies": []
        },
        {
            "author": "julietides",
            "body": "I don't expect anything, yet am so often disappointed, honestly.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Certain_Mobile1088",
            "body": "It’s historically so untrue. Women produce d so much of what a family needed to survive—as did men. The concept of men as “providers” is simply wrong and annoying AF.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Crazy-4-Conures",
            "body": "Men seem to think that providing no more than their own fathers did, women today will be as satisfied with it as they think their mothers were.  Women in general don't \"want too much in a man\", they want a partner.  They're not looking for an adult male child, They're not looking to become a bangmaid nanny. They want equal recognition for equal work. Most want to work out of the home, but a SAHM is a hard working woman as well.  We're pretty clear in telling men what we want, but they prefer to listen to what their buddies say women want.  When it turns out we don't want what they're offering, they resort to \"women are crazy.\"",
            "score": 3,
            "replies": [
                {
                    "author": "BrainBurnFallouti",
                    "body": "Definitely agree. Especially frustrating is how, when we do tell them, men just accuse us of lying to make ourselves look better.\n\nWomen in general don't \"want too much in a man\", they want a partner. -Honestly. This is true, but in my experiences, also partially cause we're so conditioned to want so less. Just think looks. We're so socially/culturally conditioned that women are pretty and men can't be.  You're a single woman? Struggle to get a bf? Well, then you'll just have to get prettier, because men are visual creatures. Oh. But also don't be picky the same way. As long as he is nice and maybe does the dishes, he's a catch.\n\nAnd no, I'm not being dramatic btw. A while ago, I saw a dating advice post, where the OP described finding a guy nice, but physically repulsive. The entire comment section was like that. Outside of Reddit, I was/still am told similar stuff by women regularly. I don't even have to say much -just that I want a guy that loves me, I love him, and who I find attractive. Not Prince Charming. Not even a specific trait. Just \"I find attractive\" is enough to be called nitpicky. All because of how deeply we've engrained that a relationship isn't about getting an ending that you like -just the chase for a tolerable state of unhappiness so you ain't lonely.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Crazy-4-Conures",
                            "body": "True, they want someone they find \"attractive\", it's a preference.  If we do, it's discrimination.    \n\"No fat chicks\" - preference.  \"Someone taller than me\" - discrimination against shorter guys.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Downtown_Zebra_266",
            "body": "I think it depends on a lot of things. I was primarily raised by my mom and a woman dominated family (immediate and extended). All of which raised me on they points that I am not entitled to anything and never really on some else to support me. I really don't think that is taught enough. I know if my husband started abusing me and Ieft, that I would be ok. Now, let's me clear. What I do expect from my husband is to have a job (because I won't bankroll his life), I do expect him to clean up after himself (because I'm not his mom), I do expect him to be a parent, and I expect him to be a PARTNER in a PARTNERSHIP. \n\nI don't expect to be treated like a queen. I expect to be treated as a person and equal. I don't need to be \"kept\". I am not a doll or an animal. I'm a person. If I want to go get my nails and hair done, I pay for it. Sometimes my husband surprises me and pays for it himself. I buy my own luxury items because I don't expect him to fund my fancy stuff. Sometimes he'll surprise me with them. And all of this, everything he does for me, I do for him because we're EQUALS.",
            "score": 3,
            "replies": [
                {
                    "author": "BrainBurnFallouti",
                    "body": "Yep, same. I think that's another reason why it pissed me off so much. I talk a bit positively here, but, truth be told, my family is overall pretty fucked. Not \"has generational trauma\" -they ARE generational trauma.\n\nAs a girl, I was told to \"woman up\" in the way you describe. Don't expect shit. Care for your own feelings. Accept to be abandoned for chicken shit (my cousins never include me in anything, cause I'm a girl) and EVEN IF family helps you, they will make sure to let you know how much you're bothering at the moment. Doesn't matter how small, or even important. You're expected to raise yourself, and be humble at every second.\n\nAs an adult, I confess, I sometimes can be a bit too independent sometimes. On the flip side, I also take a lot of pride in it. So to be called \"a leech\" and told I'm just a lazy bum that expects to \"leech\" from the person I love? After all those years of being constantly held to shitty standards, and now trying to actually let people in & accept help/support, get therapy, and even visit seminars for communication, *because* I just want an equal, healthy relationship?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Downtown_Zebra_266",
                            "body": "Truth be told, if you don't fit someone's mold, they will label you all kinds of ridiculous shit. I have a few family members who like to crack comments and each time, without fail, I look them dead in the eye and say, \"I am not here to impress you nor am I seeking your approval. My lifestyle isn't hurting anyone, therefore your words are just hot air.\" And I say it as calmly as possible and watch them raise. I know for a fact I am a good person. The problem is, people sometimes expect good people to bend or break for them to make THEM feel better about themselves. I'd rather stay in one piece for myself.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Maybe_Factor",
            "body": "I earn more than 91% of the men in my country... all I expect from a partner is to not be a raging asshole and be kinky in the bedroom. Seems like a low bar, but you'd be surprised how many men fail to meet these expectations.",
            "score": 1,
            "replies": []
        },
        {
            "author": "imsowitty",
            "body": "\"so what you're saying, is:  you hate the patriarchy... \"",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThisOnesForMyStalker",
            "body": "I know this is such a small part of what you said, but these types always talk about war in terms of the actual combatants, but never seem to consider that women suffer in war just as much, if not more, as non-combatants. They never ever think about how shit actually goes for women in war zones and that there's much worse that happens to us in these scenarios, where death may be preferable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ladiesluck",
            "body": "At the end of the day a man with money is only attractive to me because it means he can take care of his damn self, and not rely on me to do so. Sure I’m happy to be treated like royalty, but it’s not the expectation? You know what is? A man who is a grown ass adult who can take care of himself. That’s fucking hot as hell!",
            "score": 6,
            "replies": []
        },
        {
            "author": "Salty_Technician2481",
            "body": "Men tell themselves a lot about what women want. A lot of young men feel disillusioned imho, betrayed by some sort of contract they were taught to be real, because back in the times of their grandparents, women could not provide for themselves (and weren't even allowed to). So a lot of money was basically a guarantee to get a partner. Today, the scales are more balanced and a lot of these men who banked on not having to do character building now find themselves unwanted or rejected a lot. And they throw this resentment into women's direction, because we were expected to want them for what they could give. And now, if a woman wants something else than money from a partner, she is seen as greedy by that incel logic, because they assume she wants it on top of the whole provider package.",
            "score": 7,
            "replies": []
        },
        {
            "author": "EvilCodeQueen",
            "body": "The whole 50s sitcom, dad with a briefcase and mom in an apron wasn't reality. There has historically been a small subset of the population where the man paid all the bills and the woman took care of the home. Poorer folks, everybody who could make money was making money. Rich folks, many times the inheritance came from the woman. Rural folks had cottage industries because literally, it was the woman in the cottage making stuff to sell at market. Women as breadwinners have been a thing since forever, because men left, died, became disabled. \n\nThe vast majority of women have always worked. Their labor may or may not have been paid, but they, for sure, always worked. Any man who says otherwise can suck it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ellasaurusrex",
            "body": "I hate it too. Yes, I expect him to provide. But no more than I expect myself to do the same for him. The idea of being financially dependent on him makes me internally cringe. We're a partnership. Of my friend group, I think only one of us has a husband who \"provides\" in that she is currently a SAHM (and hates it, but she hated her job more, lol), the rest of us make more than our partners.\n\nI do agree it boils down more to misogyny, and the men who think like this are just pissed that they have to actually be good people, as opposed to just a good paycheck. They want women to be dependent on them, because it means they can trap women even if they act like assholes. If they blame women for being \"too picky\", or \"a gold digger\" (which is especially hilarious when they seem to think money is all they need to bring to the table, then they're mad that a woman wants some?), then they don't have to face the fact that they aren't a good partner.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fishCodeHuntress",
            "body": "Maybe it's the online spaces and/or social circles you keep? I don't see this sentiment \"constantly\" unless I'm for some reason browsing incel subs or online dating subs and the like. I'm a woman in STEM who games, fishes, and hunts so I get a lot of exposure to male social circles. I do sometimes hear discouragement from the men around me about how difficult online dating can be. Perhaps they are expressing those frustrations differently online than they are to me.\n\nI think a lot of the times it's frustration and venting that comes off as overly dramatic or severe in an online setting.\n\nI'm not making excuses for those behaviors or comments, more trying to better understand them and provide an alternate perspective. I think an overly negative mindset surrounding these issues does nothing to prevent or help them. I also try very hard to not let anger and negativity take over, because it accomplishes nothing except to make me feel crappy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "hanks58",
            "body": "I couldn’t agree more. Men have never provided for me my whole life, if anything they’ve constantly been in fear of it. My brother and I were raised by a single mother who I might add actually lost money in the divorce and then my bio dad evaded child support, and haven’t seen him since. \n\nI still remember loading up some lumber from a Home Depot and an old man asking where the men were in a joking way. My mom and I just looked at each other and said there were none.\n\nAs for the military I don’t know the statistics but the number one enemy to women serving is their male counterparts. I was once in a helicopter with a veteran who was perhaps 110 lb petite women and I’ve never felt safer in my life. If there were women only units and more even numbers at bases that would help entry into the military. With more entry there would be more women leadership in time. \n\nAs far as body difference the whole lifting your fellow man thing is stupid as there’s plenty of small men who also have to lift and techniques that firefighters use to lift people. The whole point of military training is to learn techniques if you are the smaller person and it doesn’t matter who you are everyone can fire a gun. Anyways that’s my rant",
            "score": 2,
            "replies": []
        },
        {
            "author": "14thLizardQueen",
            "body": "Can I tell you how right you are while at the same time you're missing some stuff. \n\nYou are 100 % right and the women who raised you deserve an award. \n\nin heterosexual relationships, children tend to come along. I don't know if you know but that can put permanent damage on the woman's body where working isn't an option. It's a deadly condition for some even. So, if I'm providing my body, which in this case is more valuable than the mans, he can use his body to provide the security of financial stability.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SandboxUniverse",
            "body": "A lot of women DO place that expectation on men,  but I think not as many as many men think.  Among my sisters and I,  every one of us out-earned their husbands  for most of the marriage.  Two of them supported househusband.  I'm sure we're a bit of an outlier as a family,  but not that much of one.  And while my husband is fine with me earning more, I do see the pressure my husband feels to be a good earner.  He's worked through all kinds of stress,  refused my offer to provide so he could go back to school,  refused to consider a lower paid role,  even if it could later lead to a bounce.  \n\nSome of this is financial anxiety.  We are well off,  but he has seen people fall from where we are,  as have I.  But a big piece of it is in his mind,  he's supposed to always move forward,  not backward,  and he's \"supposed\" to do better.   It's a legitimate social expectation and it's very damaging.  He's worked for years to overcome toxic expectations in his psyche - as have I - but this social conditioning is pretty strong and pervasive,  just like my conditioning around being a Good Woman with all that entails.  \n\nSo I can push back on that expectation, pick pebbles and try to clear this rubble.  In the end,  men do need to do a bit more pushing back of their own,  but I'm glad to help where I can.",
            "score": 2,
            "replies": []
        },
        {
            "author": "furrylandseal",
            "body": "I live in the bluest bubble and the bluest state where women are likely to have degrees from MIT and Ivys and be called professor, Dr, attorney, or scientist, and I haven’t heard any of this nonsense uttered in my local community….ever.  The women are generally in marriages they can just leave if they are treated unequally. When Trump was elected the first time, it was shocking to me that this patriarchal provider mentality still exists, or at least isn’t extremely fringe and dying out with the boomer generation. \n\nTo be honest, I only see this in conservative circles among extremely insecure men and conservative women who by definition devalue themselves. Men are so insecure with egos so fragile they feel they need to subjugate women aren’t men worth knowing. They see vulnerability in conservative women that they can exploit. They make the vulnerable women feel powerful by proximity, put them on a pedestal (for show) but functionally demote them as either wives and mothers (less) or sex objects (less than human). The women believe their only value is in the approval of men because they usually lack their own accomplishments.  I have yet to see a relationship like this where the women aren’t abused in some way.  Most of the women value themselves so little that they aren’t even aware of it. And the ones that finally do don’t figure it out until they’ve had a gaggle of children, given up education and job skills, and have no easy way out. Instead of blaming their abusive patriarchal husbands, they direct their hate toward women like me who knew better and made better choices. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "The_Bastard_Henry",
            "body": "Thinking about it now, I actually do not have a single female family member, friend, or acquaintance who is unemployed and fully supported by a man. The ones who don't work are all either retired and living on their own retirement funds, or disabled and unable to work full time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "kdandsheela",
                    "body": "That's what I was wondering, had to switch to \"new\" to find this comment, my guess is that the post got bombarded with incels",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AnxiousBuilding5663",
                            "body": "I went back to home and clicked again and that time it loaded comments, despite me refreshing multiple times initially\n\n\nI'm seeing this happen on other posts as well and when I repeat this workaround the comments are visible\n\n\nAppears reddit is shitting the bed ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Spiritual-Square-394",
            "body": "Yes. I've always been particularly annoyed by the 'well men die for everyone in war' thing because it has been a long time since men were drafted, and even then it was still exceptional in the twentieth century. \n\n\nWhat isn't exceptional? Women dying and being injured in pregnancy and childbirth, all the time, right now in every country. Makes me want to tear my hair out when men suggest they are owed something for some imagined future sacrifice in an imagined future war when women sacrifice themselves for families all the time without any recognition. And not just in some imagined future scenario but right now!\n\n\n(Also, just to say, this is obviously just one aspect of being a women, not having kids doesn't make you less of one)",
            "score": 2,
            "replies": []
        },
        {
            "author": "saramole",
            "body": "One of the most successful scams is convincing society that unpaid labour is not work. \nIn addition, only paid work can be used to measure a person's worth.",
            "score": 2,
            "replies": [
                {
                    "author": "BrainBurnFallouti",
                    "body": "Or that only a specific gender's work is to be noticed.\n\nLike. When emotional labour/chores are mentioned, you always have guys say \"Well. When if men come home from 9-10h of work, women can be expected to do more chores\". As if most women aren't working too",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "PoorDimitri",
            "body": "I never cared if guys I was dating were headed for high powered jobs, but I cared that they had *drive* for something in their life.  Something they were passionate about and working towards.  \n\nMy (now) husband was pre med when we started dating and when he finished med school had 200k in debt and I was the breadwinner for the first four years of our marriage.\n\nI never cared about the money and still don't beyond the ease it gives us in our lives, it was all about his sense of humor and his brain and his character and his drive.\n\nMen just say we want a provider to excuse their own poor personalities that drive women away.",
            "score": 2,
            "replies": [
                {
                    "author": "BrainBurnFallouti",
                    "body": ">I never cared if guys I was dating were headed for high powered jobs, but I cared that they had *drive* for something in their life. Something they were passionate about and working towards.\n\nHonestly, I understand you so much on this one. It's not that being content is a bad thing. Most of the time, this lack of \"drive\" is about stagnation. Lack of curiosity/interest in the world. Maybe even the opposite: An active xenophobia/anger for any form of change. \n\nA few years ago, I talked about a guy that had interest in me. Even though he was nice, the problem was that we just didn't fit on many levels. Be it education, or interest in current events...the only real talks we could have were about gaming. But the worst thing was his lack of drive/curiosity. He didn't know, but also didn't care to learn. Didn't have a goal in life, or aspirations in his field. And while he was personally happy for whatever I had going on, he also often just \"didn't get\" why I would want more. Or get sad, that I couldn't get something.\n\nBack then, I made a comment like yours on a forum too. Oh boi. A LOT of men did not like that. Complaining that I was classist, hated blue-collar workers, and that a relationship could work, I just had to cut down on my expectations for him. \"Good God if a man is content and not aiming for 6 figures for once\" is a reply I remember.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "PoorDimitri",
                            "body": "Oh jeez, missing the point is an art with some of those people.\n\nAnd it's so funny too because my husband is a person *very* content with where he is in life.  But every day is filled with activity of taking care of and spending time with the kids, working on projects around the house, he just signed up to be a tee ball coach, come summer we will bike around town everywhere we go. He's working through Kenji Lopez's Wok cookbook recipe by recipe, he's helping me get my seedlings started for the summer.\n\nLike he likes where he is and is enjoying it thoroughly, not just sitting on his butt and playing games all the time (and he does game, just mostly at night after the kids are down).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DezzlieBear",
            "body": "This isn't even true for cavemen, it's just a misunderstanding of the division of labor",
            "score": 2,
            "replies": []
        },
        {
            "author": "bravovice",
            "body": "I know I’ll get down votes- I’m not saying only rich guys should have access to women… but I am saying women should be very picky and that includes financial security. I think it’s good for all people to work and earn money. Unfortunately society is stuck in a cycle of women staying home with the kids usually because the man earns more and that math speaks for itself. Do plenty of women make more these days? Sure. But I don’t think it’s even yet. I think when picking a partner, future husband, future father, that it is irresponsible for a woman to pick a financial burden of a man.  So yea I can see where men’s spaces are complaining about this idea that they can’t find love because they are broke. But it’s only the broke ones who are complaining. The men with means don’t have this problem. And by means, I’m not even talking rich, I mean steady and responsible with goals and discipline.",
            "score": 1,
            "replies": [
                {
                    "author": "BrainBurnFallouti",
                    "body": ">Dorothy Shaw: Honey, did it ever occur to you that some people just don't care about money?\n\n>Lorelei Lee: Please, don't be silly. We're talking serious. You don't want to end up with a loveless marriage, do you?  \nDorothy Shaw: Me, loveless?\n\n>Lorelei Lee: That's right. Because, if a girl spends all of her time worrying about the money she doesn't have - how is she going have any time for being in love? I want you to find happiness and stop having fun.\n\n>Dorothy Shaw: That baffles me.\n\n>Lorelei Lee: You'll thank me someday.\n\n\\- Gentlemen Prefer Blondes (1953)\n\nDon't worry. Nobody should disagree on your point. As you can see, financial stability is & always has been a rational concern in dating.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FitnessBunny21",
                    "body": "Being rich also doesn’t mean they’ll be a good partner. Ultimately both individuals should be financially independent and emotionally equipped to enter a partnership. \n\nThem making a certain salary a year won’t protect you from emotional, physical or verbal abuse. Or even just an incompetent partner. In fact; many of the men who depend on their ability to financially provide in order to get a partner aren’t particularly emotionally intelligent or cooperative people.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FitnessBunny21",
            "body": "It’s an annoying statement. But otherwise meaningless. \n\nWhen men say this stuff, let them. They are showing you how they think and perceive the world. I don’t argue - I take note and go about my life. \n\nThe men who view the world this way are fundamentally insecure - and that’s why these narratives are so soothing to them. The weight of rejection is too much. Pathologically insecure people, especially men, don’t make great partners.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BusyTea4010",
            "body": "Women have, by far, been speaking up to counter Trump.  It's been women leading the fight, mostly women of color.  So dudes who repeat this can sit down.",
            "score": 7,
            "replies": [
                {
                    "author": "IndependentNew7750",
                    "body": "Many of women of color are actually huge proponents of traditional gender roles. Most of the content creators who are big proponents of “feminine energy” and finding a “provider” are POC women.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "AKM0215",
            "body": "Yes, I don’t know any “provider” men nor would I not want to work even if I had a wealthy husband. But, at the same time, I do think it’s chivalrous if a man pays for a date. But that date could be coffee or ice cream! I have had dates where a man won’t even pay for my coffee! (On the other hand, I’ve had men pay for nice dinners and drinks.)\n\nI agree a lot of the time with men who say this it’s insecurity or projection.",
            "score": 4,
            "replies": []
        },
        {
            "author": "whatsmyname81",
            "body": "I don't even date men and that shit pisses me off because most women I know out-earn their male partners, do more of the day to day work of their lives (especially if there are kids), and still have to listen to this absolute verbal garbage about how they are being provided for. It feels like we live in opposite land. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "grania17",
            "body": "The thing is, I grew up surrounded by working women. I am a working woman myself. Yet I make a lot less than my husband does, and the gender paygap is a real thing. So yeah, I do expect my husband to step up and contribute more because he has more to contribute. And he does, and he doesn't complain because shock horror he knows it's faie because he makes so much more money than I do.",
            "score": 2,
            "replies": []
        },
        {
            "author": "angrygnomes58",
            "body": "The irony is I feel like reality is the opposite. \n\nMen complain that women “need” them to provide. If that were the case more women would seek them out BUT they have to actually do the work needed to support their family. As it is, most women don’t “need” a man to provide, which means women are looking for men they *want* which means men actually have to do the work to make themselves into a desirable partner. \n\nIn either case it leaves the onus on men to put in work - physical or emotional.",
            "score": 4,
            "replies": []
        },
        {
            "author": "starfire92",
            "body": "The funny part is men don’t want to provide but also want women to fall into traditional gender roles and rear a soccer field of children while she simultaneously works and is also a stay at home mom but is also not a career woman. \n\nI will also say to OP, I somewhat feel like the opinion of gender roles is too rigid to not give any room to any other perspective. I grew up staunchly against gender roles, I have a lot of fem and masc traits and never wanted to rely on any man. I paid for all dates regardless of who asks, I picked up guys and dropped them home every time, I had a car by 17 and was working 3 jobs until my mid 20s, so I can support myself as much as possible. I hated Valentine’s Day and denounced any celebratory day where men are expected to commemorate their woman in any ways, Mother’s Day, relationships monthversaries (which are still silly imo) and I even went as far to brag I dont know, didn’t know and didn’t care about the annual anniversary date between me and my first partner of 3 years, second partner of 3 years and now fiancé of 5 years. I was rude and aggressive towards anything a man said or insinuated I couldn’t do. I was standoffish and was even degrading to my partners, one guy I dated had the same hand size as me and I’d hold it up in front of people and make jokes about how fem his hands looked compared to mine. \n\nWith that being said, as I’m older now, I have fell into some of my gender role despite fighting it my whole life. I work of course but my partner and I started at the same place salary wise and now he makes almost 3x more than me where I increased a measley 5-10k in the same time frame. I am the main cook, and I love it. He does the more physical tasks around the house. I am not as strong as him to do what he does, I am also 5foot 1. That’s not to say women aren’t capable. Imane Khelif is a woman who could probably wipe the floor with majority of men. My mom shovels feet of snow higher than me and she’s shorter than me. But I am tired of proving myself or even getting into tricky situations by trying to push past my limits. Sometimes I do recognize I act like my gender role",
            "score": 2,
            "replies": []
        },
        {
            "author": "jcebabe",
            "body": "I’ve come from a more traditional background and visit more traditional online spaces. There are women that want men to provide. Women won’t loose their shit because lots of women have been raised to do it all. So we’ll be find. Some men are upset because they cannot provide in this economy and because of that they don’t have the same power they had in previous generations. \n\nWhenever bitter men make comments like this it’s always because they can’t do something. If they had the money it would be less of an issue big they were Six foot or taller it wouldn’t matter. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kelmeckis94",
            "body": "No, I expect a job where I hopefully earn enough to live on my own and don't drown in debt. I'm lucky I can still live with my parents. \n\nI want an home for myself, enough money to do things I enjoy and maybe go on a vacation every once in a while. Ofcourse enough money for the bills as well. \n\nWould it be nice to have someone to share the home? Absolutely but at the moment I don't see it happening. That's harder on some days than others.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rhypefiepuppyyu",
            "body": "This also makes me nervous when it comes to dates. Some guys don't like having to pay for dates, while other guys strongly believe they should. I don't mind paying for myself on a date, but of course it's also nice if the guy wants to pay. I just get anxious that I might accidentally offend him one way or the other lol. Last date I was on, I panicked and bought the tickets for him and me, but he did buy our meals/beverages. Idk, maybe I just overthink dating in general.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Miliean",
            "body": "My mom worked, her sisters worked, most of the moms that I knew worked.\n\nHaving said that, every single time that was something that they chose to do.  Staying home was an option it would have meant a lot less money in the family so all of them made that choice.\n\nBut for the men, it's not a choice, it's an assumption that they will work.\n\nThat's the difference.  Women have the option, men do not.  Granted, economic status often takes away the optional part of the word option, but nonetheless society allows women to choose and men do not get to choose. \n\nEven in the dating phase.  Lots of women choose to split the bill, but it's a choice.  As a man, I go into the date under the assumption that I will be paying, unless she makes the choice to split. If I insist on splitting when she does not want to, there's no second date.\n\nAgain, it's the choice, the freedom to choose is the key.",
            "score": 1,
            "replies": [
                {
                    "author": "Coomstress",
                    "body": "What decade are you living in?! I don’t know any women for which working is merely an option. We all HAVE to work to support ourselves/our families.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BrainBurnFallouti",
                    "body": ">But for the men, it's not a choice, it's an assumption that they will work.\n\n>That's the difference. Women have the option, men do not. Granted, economic status often takes away the optional part of the word option, but nonetheless society allows women to choose and men do not get to choose.\n\nTo be fair, that is true and hence something I mentioned in my post. It's why we also have more talks of maternity leave and less paternity leave. For one, obviously, because the woman needs time after birth. But two, as shitty as it is, because society doesn't take men wanting to be home into account so much.\n\nThat said, my focus lies on that \"economic status\" you mentioned: In reality, most women couldn't just stay home. The American 50s idea of the man working, and the woman being the carefree trophy housewife is...well. Just the idea of the idealised American 50s. Most of history, women worked. And if they couldn't it was often due to society not allowing women the same work opportunities. Hence my continous references to Gentlemen Prefer Blondes, and its famous song \"Diamonds are a girls best friend\".\n\nAgain: Don't get me wrong. I believe & am sorry for your experiences. Especially with the rise of online dating, there's this huge push of \"having to prove value\" because everyone can just swipe on a new, \"better\" date tomorrow. Even worse, since Dating Apps are intentional scammy. It's been proven that algorithms push profiles unevenly/hide them, so especially male users pay more money and get more competitive/less good matches to stay longer. It just kills any connection. I can't imagine being dumped, for the sole reason for not paying an equal meal. I mean. Isn't that the point? You both want a nice time with each other? Both picked a place you like? \n\nThat said: My position remains the same. I can't imagine ANY normal person to be good SO material, if they think like that. Sounds harsh, but: Please stop. Don't pay. Communicate equality from the beginning. Respect yourself and set a standard for other young men to do the same. Cause that's my issue: A lot of young men don't blame in such detail. They might have experiences like you & just blame women as a whole. Which could be acceptable -but as we see in society, this often turns young men to shitty places. Not places that promise more equality, but to go back to even worse times, all because they think \"traditional\" means the happy, carefree American 50s.\n\nAnd trust me. The 50s were good for fucking no one. Not even the food",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Joygernaut",
            "body": "My favourite is when men claim to be the provider of the family because they make $60,000 a year… but neglected to mention that their wife makes 55,000… and also birth the children, and takes care of all the household. He acts like his financial contribution is what keeps the entire family afloat.🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kinkajou4",
            "body": "Careful with this kind of content consumption.  Use real life as your education on gender issues, NOT the internet.  The vast majority of women are not the way you describe in reality.  Don’t hang out in online spaces where men assign demeaning intent to women or you will find yourself negatively influenced and believing misogynist propaganda.  The only way to know if a woman believes a man should be her provider is to ask her.  I think you will find that what most women want is equality and reciprocal respect from their partner.  Personally I would never dream of relying on a man to financially support me, I like my career and make more money than any guy I’ve ever dated and would never give that up.  I find men who assume that their paycheck has anything at all to do with my romantic interest to be pathetic, sexist douchebags who need to believe women are whores selling themselves out to the highest bidder they can get.  All of my female friends believe the same.  1953 was a long time ago, back before women were allowed to even have a bank account of their own.  Times have changed.  You can spend your time feeling pissy believing an outdated misogynist phrase is true if you want to, but reality is that’s not going to make you an appealing guy to women.",
            "score": 1,
            "replies": []
        },
        {
            "author": "faetal_attraction",
            "body": "RATIONALLY pissed off. It's very rational to be pissed off by this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WesternUnusual2713",
            "body": "Only 25% of married women on the US are 100% financially supported. I looked it up so I could counter this bullshit. That means 75% co or fully breadwin. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shameless_Devil",
            "body": "Men like this think \"providing\" just means money. They work and make money......... just like their partner works and makes money, so idk why they think they're special in that regard.\n\nBut they don't provide anything else. They don't provide respect, care, consideration, emotional support, or anything else. Just money and some sense of emotional affection (though even that is debatable, as they refuse to be caregivers or do anything else except the bare minimum).\n\nWhen men whine about being expected to be providers, I hear, \"Why can't I just get sex without women wanting anything in return? Why can't I just masturbate with their bodies, get off, and then do my own thing?\"\n\nNo desire to become good, honourable, respectable human beings. Just, \"cmon, just give me a woman to use how I please!\"",
            "score": 1,
            "replies": [
                {
                    "author": "BrainBurnFallouti",
                    "body": ">Men like this think \"providing\" just means money. They work and make money......... just like their partner works and makes money, so idk why they think they're special in that regard.\n\n>\n\njust replied to a guy on here, that said that if he doesn't pay, many women wouldn't agree on a second date. Don't get me wrong: The dude is not lying -there are enough women who think like that. Especially with dating apps, it's the \"Tinder-syndrome\" of you having to \"prove your value\", since a better swipe could be 5min away. \n\nHowever, it just annoys me that none of guys like that get the idea that women like this could just be...well. Y'know. Trash? Or just not compatible in values? Why are you pushing yourself for an unequal relationship from the start? To not be lonely? Ok, ok, fair enough. But then stick to it. *Don't pretend* women are all like that shitty gf that you have actively allowed to be unequal to you. *Don't pretend*, women are \"privileged leeches\" to men, when most of us work the same shitty hours as you do.\n\n>Just money and some sense of emotional affection (though even that is debatable, as they refuse to be caregivers or do anything else except the bare minimum)\n\nthat last part especially. I'm a woman with CPTSD. I swear, I *want* to date, but at this point? I am just so terrified in how much indirect rejection I already got from men. Just a few months ago, one man told me to my face that wanting any empathy/accomondation from my partner was \"selfish\". \"Fatalistic\". To just go to therapy until I was \"healed\". 60+ people agreed with him.\n\nNote: I go to therapy. Therapy doesn't heal you, it just helps you to deal with your issues. Trauma will never stop haunting you. That's the \"C\" in CPTSD.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Midwitch23",
            "body": "I think expecting men to provide was about 2-3 generations ago. Women working is still considered invisible despite them having done it since day 1.",
            "score": 1,
            "replies": []
        }
    ]
}