{
    "title": "My new boss thinks \"beard discrimination\"  is the same as gender discrimination...",
    "author": "-L-i-s-a-",
    "subreddit": "TwoXChromosomes",
    "rank": 2,
    "score": 1157,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 83,
    "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1jeav1u/my_new_boss_thinks_beard_discrimination_is_the/",
    "id": "1jeav1u",
    "selftext": "So today at work, my new boss asked me why I left my previous IT project. I was honest and told him it was due to gender-based discrimination. His response? He told me he could *totally* relate because he once experienced people trusting men with long beards more than him.\n\n...Seriously?\n\nThis man really thought his *beard struggle* was equivalent to the systemic, dehumanizing experience of being a woman in tech. Like, dude, nobody doubted your intelligence, dismissed your ideas, or talked over you *because of your gender.* You weren’t paid less, excluded from networking opportunities, or treated as less competent from day one.\n\nIt’s wild how some men will reach for the *most* surface-level, irrelevant comparison just to center themselves in a conversation that isn’t about them. And I bet he walked away thinking he was being *progressive* by \"relating\" to my experience instead of just…listening.\n\nI swear, the bar is on the floor.",
    "comments": [
        {
            "author": "actuallyamber",
            "body": "Beard discrimination is sending me. Especially in the tech field, I’ve seen so many women who have had to fight to be taken seriously and this man is out here comparing it to his beard and feeling so proud about being a progressive male. \n\nReminds me a little of the professor who tried to relate to me when I was struggling in school because I was 8 months pregnant, going through a break-up, and dealing with his instruction, which was legitimately the worst classroom experience I’ve ever had.\n\nOne day after class he hit me with “I know what you’re going through.” No, sir, I am 100% sure you do not. 🤣",
            "score": 418,
            "replies": [
                {
                    "author": "-L-i-s-a-",
                    "body": "Oof, that professor story is painfully on brand. Like, what exactly was he \"going through\" that compared to being 8 months pregnant, dealing with a breakup and suffering through his terrible classes? Did he stub his toe that morning? 💀\n\nIt’s honestly wild how some men will say anything to center themselves instead of just acknowledging, “Wow, that sounds really difficult.” The bare minimum is right there and they still trip over it...\n\nI honestly can’t even imagine how tough that must have been for you. Juggling all of that while dealing with all the bs? You’re incredible for pushing through, and I hope you had people around you who actually supported you <3",
                    "score": 109,
                    "replies": [
                        {
                            "author": "actuallyamber",
                            "body": "It is wild. I feel like while women also make this misstep, on average men seem to be exceptionally unaware, and I have to attribute this to a system that just makes everything easier for them. There was a kid who did a slam poetry thing at his school one time addressing his cis white male privilege and I think about that a lot.\n\nAnd yeah, I made it through. ❤️ That was 20 years ago, I now have a kind-hearted 20 year old daughter as well as a 16-year-old son and a wonderful husband of 16 years. And three years ago I even went back to school and finished my degree!",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "LionessOfAzzalle",
                            "body": "My own dad once told me a he knew exactly what I was going through, referencing the difficult recovery after his surgery to remove a cancerous kidney.\n\nBless his heart…\n\nThe thing they removed from his intestines was about a fifth of what they just removed from mine.\n\nIt also wasn’t currently chomping down on his nipple trying to nurse, while I was suddenly responsible for keeping it alive.\n\nAnyhow… kiddo turns 10 soon and loves his granddad, so 😀.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MarthaGail",
                    "body": "Yikes! Like, I'll give him the benefit of the doubt that he thought he was saying the nice, empathetic thing, but if he'd just stopped for a beat, he might have chosen his words better. Then again, if his instruction was that bad, he probably wouldn't have had the self awareness.\n\nI've actually worked to remove that phrase from my empathy bag. Sometimes I can know what someone is going through sort of, but I'll have never had the same lived experiences. I prefer, \"I'm so sorry you're going through this. It sounds painful.\" It's more accurate and less foot-in-mouth.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "actuallyamber",
                            "body": "Truly his response to me that day had the exact same effect on me. That was the day I made sure I didn’t use that phrase unless I really meant it. \n\nI’m sure he was trying to be sympathetic, but I also don’t think he gave it a second thought, so it just came off as completely insincere. Also his instruction felt designed to make people fail. He had a significant stutter, which was fine, except that he gave us absolutely no materials to which we could refer—no textbook, no handout, no worksheet—so literally all of the information had to come from his hour-and-a-half long lecture in which he listed many legal cases and precedents and names and dates. It would have been hard to keep track of on the best of days, and I was not having the best of days! 😅",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DaughterOfMalcador",
                    "body": "Bah gawd. As a trans woman I've experienced both LOL\n\nBut as a \"passing\" trans woman I'm gonna say I'd take the former any day -_-",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cl3ft",
                    "body": "And all it took was a \"I know you're going through a lot\" instead. Men can be so ignorant sometimes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "asfierceaslions",
            "body": "It turns out that when you have never had a single real problem, inconvenience feels like oppression. They simply don't have the context to even know how to actually empathize.",
            "score": 543,
            "replies": [
                {
                    "author": "rubitbasteitsmokeit",
                    "body": "I've seen men scream about toilet seat issues in a nongendered bathroom. In their minds anything uncomfortable is oppression.",
                    "score": 115,
                    "replies": [
                        {
                            "author": "Deedeethecat2",
                            "body": "I probably don't want to know but I'm going to ask, what was their specific issue with the toilet seat?",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "SneepleSnurch",
                                    "body": "Not OP, but I’m sure it was about women leaving them down/wanting them left down. And I’m sure the pissy manbabies threw a tantrum about how no one thinks of tHe pOoR mEn who have to put the toilet seat up and then down every time they want to piss standing. ",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "DasVWBabe",
                                            "body": "We are a toilet seat down household. Always have been. Every time I have a party, some gross person leaves the toilet seat up. I have had just about enough of that. I have a cat!",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Deedeethecat2",
                                                    "body": "As a household with 2 dogs and a bunch of cats, we also are toilet seat down for very practical reasons lolol",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "floracalendula",
                                            "body": "Just sitzenpinkel and cope.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Salty_Technician2481",
                    "body": "Excellently put",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "rubitbasteitsmokeit",
                    "body": "I've seen men scream about toilet seat issues in a nongendered bathroom. In their minds anything uncomfortable is oppression.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Deedeethecat2",
                            "body": "I probably don't want to know but I'm going to ask, what was their specific issue with the toilet seat?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "rubitbasteitsmokeit",
                                    "body": "Up vs down.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Deedeethecat2",
                                            "body": "Well at least they are focusing on issues that matter.\n\n/s",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "rubitbasteitsmokeit",
                                                    "body": "Very big issue. If they had to sit down or put the lid down somewhere, someone would know they were less masculine.",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "Joy2b",
                                                            "body": "Lid down is the only fair answer to the debate.  Both sides get to have a bathroom that isn’t covered in a horrible mist.",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "rubitbasteitsmokeit",
                                                                    "body": "Yep. That's what the women kept saying. We all close it (preferably before a flush, one step at a time.)",
                                                                    "score": 13,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Deedeethecat2",
                                                            "body": "I will start a fundraiser for awareness for this very important issue.",
                                                            "score": 9,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "TotoCocoAndBeaks",
                                                    "body": "On almost any other sub on reddit you will get downvoted for saying to leave it down. They will say ‘well you dont leave it up for us’ etc\n\nThey actually would do it except they feel emasculated by being asked to do it by their mum/sister or, in the rare event they have one, girlfriend or wife\n\nSome of them will even put it down when flushing then out it back up just out of emasculated stubbornness",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "rubitbasteitsmokeit",
                                    "body": "Up vs down.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Jadziyah",
                    "body": "Great way to explain this!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SquareIllustrator909",
            "body": "One of my former directors said he empathized with our Black colleges (during the George Floyd protests) who were worried about police violence. He empathized because he had a niece who was a nurse, and he worried for her safety when she went into work every day. Like what??\n\nAlso, he \"experienced discrimination\" because his first job was with a guy \"who only hired guys with blue eyes\"... Like, in this story, you GOT THE JOB!! It's not \"empathizing\" at all!",
            "score": 45,
            "replies": [
                {
                    "author": "pinksparklyreddit",
                    "body": "It's wild that he needed to find a personal reason for having human empathy",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "Humble_Train2510",
                    "body": "I don't think that is that much of a stretch.  My friend is an ER nurse.  Physical violence is a fact of life for her. ",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SquareIllustrator909",
                            "body": "Of course, but that's her job and there are security measures in place (call buttons, police officers on the premises, restraints, etc). She can brace herself for it when she walks into the building for her shift. \n\nIt's very different than just driving home and a cop decides to stop and shoot you.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Humble_Train2510",
                                    "body": "*but that's her job*\n\nNope.  Her job is to stabilze and treat patients. She entitled to a safe work place.\n\n*police officers on the premise*\n\nIt's usually not a real cop. Some rotating cast of security guards. Don't like real cops, but they're likely to be more useful. \n\n*call buttons,*\n\nThe security guard with minimal training who might already be dealing with a different problem? Cool, that makes it super safe. \n\n*She can brace herself for it*\n\nThat's dangerously close to she's asking for it. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ManifestDestinysChld",
            "body": "OP, you have the chance to do the funniest thing tomorrow. Do you happen to own a big fake beard, or can you get one...?",
            "score": 39,
            "replies": [
                {
                    "author": "Anna__V",
                    "body": "I love how you think.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "zoeymeanslife",
            "body": "Most men are highly uninformed if not antagonistic to issues people with vulnerable identities face. Patriarchy keeps them ignorant while also telling them they are somehow 'informed.'\n\nAlso many men dont believe in acting in good faith and also they enjoy incredible entitlement. Its entirely possible he said this on purpose to get you upset and knows its wrong but is enjoying hurting you.",
            "score": 71,
            "replies": [
                {
                    "author": "Substantial_Cake_360",
                    "body": "It’s why the loudest men are often angry when dealing with women and marginalized people more intelligent and educated than they are. \n\nIt breaks their whole world view that “regular men” like them should be the most informed and intellectually competent.",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "MarthaGail",
                    "body": "Telling them they're somehow informed and also somehow also the victim.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChoyceRandum",
            "body": "Wear a Gandalf halloween beard tomorrow",
            "score": 27,
            "replies": []
        },
        {
            "author": "actuallyamber",
            "body": "Beard discrimination is sending me. Especially in the tech field, I’ve seen so many women who have had to fight to be taken seriously and this man is out here comparing it to his beard and feeling so proud about being a progressive male. \n\nReminds me a little of the professor who tried to relate to me when I was struggling in school because I was 8 months pregnant, going through a break-up, and dealing with his instruction, which was legitimately the worst classroom experience I’ve ever had.\n\nOne day after class he hit me with “I know what you’re going through.” No, sir, I am 100% sure you do not. 🤣",
            "score": 13,
            "replies": []
        },
        {
            "author": "fugelwoman",
            "body": "Beards - JFC that’s bad",
            "score": 11,
            "replies": []
        },
        {
            "author": "brickyardjimmy",
            "body": "When does he remember this long beard trust era? Who was it? Gandalf?",
            "score": 24,
            "replies": [
                {
                    "author": "Avlonnic2",
                    "body": "My thoughts exactly.  I don’t remember *ever* seeing people with long beards being trusted more than those with neat, well-trimmed facial hair or those who were clean-shaven.\n\nExcept Gandalf.  I’m pretty sure I’d trust Gandalf with or without his beard.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "SanityInAnarchy",
                    "body": "There's been a long-running *joke* that [men with good beards make good programming languages](https://www.wired.com/2012/06/beard-gallery/). The old-timers of the tech world, especially the Unix world, sometimes get called \"unix greybeards\". Some of them absolutely look like Gandalf.\n\nBut: *This was a joke!* Sounds like maybe OP's boss ate the onion on this...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "actuallyamber",
            "body": "Beard discrimination is sending me. Especially in the tech field, I’ve seen so many women who have had to fight to be taken seriously and this man is out here comparing it to his beard and feeling so proud about being a progressive male. \n\nReminds me a little of the professor who tried to relate to me when I was struggling in school because I was 8 months pregnant, going through a break-up, and dealing with his instruction, which was legitimately the worst classroom experience I’ve ever had.\n\nOne day after class he hit me with “I know what you’re going through.” No, sir, I am 100% sure you do not. 🤣",
            "score": 3,
            "replies": []
        },
        {
            "author": "EdgeCityRed",
            "body": "He says they trusted men with long beards more?\n\nWhere the fuck did this guy work, Erebor? Was he training for the Battle of the Five Armies?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anal_Herschiser",
            "body": "Was this guy a part of some religious community where men are required to grow beards?",
            "score": 7,
            "replies": [
                {
                    "author": "kakallas",
                    "body": "Honestly, this is so rich if it was in the US. A lot of bearded men are going to have cultural associations that are decidedly not WASP and are actually going to be discriminated against for being non-majority religious practitioners. But no way to know unless OP says. ",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "LEANiscrack",
            "body": "Sit him down and explain that most discrimination wasnt just something that “happened”.\nIt was something often put on paper and then taught to the public.\nAbout beards there def was a time where facial hair was considered “uncivilized”.\nBut at bo point was there a push to concince ppl that big bears where good.\nSystematic discrimination is SYSTEMATIC.\nIs a created system, never accidental. ",
            "score": 7,
            "replies": []
        },
        {
            "author": "Kairiste",
            "body": "Until beards, or lack thereof are a protected class, that ain't a case of discrimination.\n\nLawd...",
            "score": 6,
            "replies": []
        },
        {
            "author": "LEANiscrack",
            "body": "Sit him down and explain that most discrimination wasnt just something that “happened”.\nIt was something often put on paper and then taught to the public.\nAbout beards there def was a time where facial hair was considered “uncivilized”.\nBut at bo point was there a push to concince ppl that big bears where good.\nSystematic discrimination is SYSTEMATIC.\nIs a created system, never accidental. ",
            "score": 5,
            "replies": []
        },
        {
            "author": "DConstructed",
            "body": "I wonder if he was making fun of you. \n\nUnless he lived in a culture where long beards were the norm it’s highly unlikely that people would show less respect to men without long beards.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thetitleofmybook",
            "body": "\"beard discrimination\"\n\nthat's a new one on me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fearless-fossa",
            "body": "I'm a woman in IT and have the certifications to prove it. I'm still in a junior position but in terms of general knowledge ahead of even some senior colleagues (admittedly, they know the company's tech better than I do because they were literally there when it was implemented, they know exactly what things are mislabeled etc. - but when you ask them \"what's STP\" they'll just shrug and say they don't believe in that modern nonsense)\n\nMy main duty *still* is making coffee for the department and doing all the phone calls and presentations. Be it higher ups within the company, coordination with another department or talking with external support, because I'm a woman (with diagnosed social phobia btw.) *I* am the one who is good at talking. They sit back and mock every other department because \"those guys are all idiots\" and can't pick up a goddamn phone themselves.  \n\nEven the other trainees/juniors with less experience than me in *every* regard and an abysmal general work ethic on top are held in a higher regard simply because they make the same \"women are only capable of making coffee huhuhuh\" jokes all the time.  \n\nNever again will I work in a place with not at least ~ 40 - 50% women in the department I'm at, and now I read about \"beard discrimination\". I don't know whether I'm currently laughing or crying.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fatalatapouett",
            "body": "white men don't make the difference between an individual problem and a systeming one, because the system in which they live has been built entirely around their needs, their reality, their sensitivities",
            "score": 1,
            "replies": []
        },
        {
            "author": "Butwhatshereismine",
            "body": "*IMAGINE* trying to sound empathetic, plumbing your own *dEpThS* to pull out 'no one trusted me because *beard hair*'",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrossP",
            "body": "I mean, saying could relate isn't saying the struggles were equal. Sounds like a guy was trying to empathize but grasped at straws when looking for an equivalent experience in his life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_OVERHATE_",
            "body": "What the fuck",
            "score": 3,
            "replies": []
        },
        {
            "author": "strywever",
            "body": "Beards can be changed almost as easily as clothes. Gender identity cannot. Your boss is an idiot.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Aromatic-Arugula-896",
            "body": "I would have laughed in his face wtf",
            "score": 3,
            "replies": []
        },
        {
            "author": "OhTheHueManatee",
            "body": "I have people dismiss me all the time cause of my long hair and beard. I get it too. I look like a fat Charles Manson with mange. It's not the same as discrimination at all.",
            "score": 3,
            "replies": []
        },
        {
            "author": "pinksparklyreddit",
            "body": "It sounds like he had a point somewhere, but it got completely swept away. It is true that there's an issue of people trusting masculine men more than feminine ones in positions of authority, and I could see how beards are an example of that. This kinda sounds like him being upset he can't grow a beard tho, tbh.",
            "score": 3,
            "replies": []
        },
        {
            "author": "throwawaycontainer",
            "body": "It's going to be dependent upon the exact wording/context, but I might suggest being cautious in your reading of this.\n\nHe may not have meant to suggest that his beard struggle was the equivalent of gender-based discrimination, but he may be trying to say that he's had a glimpse of some of the frustration of being dismissed for what should be irrelevant factors and with that he may be trying express some empathy with your situation, not diminishing it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kingfish1111",
            "body": "Wow. What a terrible response. I have reached for the ageism response before (in my field, ageism is a very prominent thing) and I unfortunately have a few experiences where my red hair has gotten me sent to HR for being angry and rude, but I never would make the case that those instances measure up to a systematic destruction of my credibility or my ability to do my job. Ageism is a thing, but thankfully I can grow out of that, literally, while proving my worth to the old guy perpetrating it. I think your boss needs sensitivity training or a wake-up call from HR. FFS...",
            "score": 1,
            "replies": []
        },
        {
            "author": "booty_fewbacca",
            "body": "As a bearded man...fuck this moron, someone should hold him down and shave his face.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandomStallings",
            "body": "I understand that the nature of ignorance is that you don't know what you don't know, but come on, man. This was just stupid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hello_Hangnail",
            "body": "Well at least you know he's completely useless at putting himself into other people's shoes and can't be trusted. Not that's a good thing, mind",
            "score": 1,
            "replies": []
        },
        {
            "author": "moonhippie",
            "body": "SURELY you know that men, especially white men, are HORRIBLY oppressed.\n\nJust ask one. They'll tell you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "soniabegonia",
            "body": "Ok, so, definitely yes to all of your frustration and I hear you and agree with you, and beard having is NOT the same as gender. BUT all of that said, I want to focus on this silly thing for a second: \n\n\n> people trusting men with long beards more than him\n\n\n\nIs this a thing??? Because I did notice myself doing this when I was a first year in college -- I was trying to be friendly and meet people so I would go up to people at meal times and introduce myself and sit with them and get to know them, and half way through the semester I realized that I was almost exclusively making friends with beardy men. I assumed at the time it was because my then-boyfriend had a big beard so I was subconsciously looking for men like him but ... Now I wonder if this is somehow actually a thing. Obviously not as much of a thing as gender -- *obviously!!* But, I would find it so hilarious if it's not just me who apparently trusts men with beards more... 😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lucy_Lastic",
            "body": "They’re starting to dig a hole to put the bar in",
            "score": -1,
            "replies": [
                {
                    "author": "SuchEye4866",
                    "body": "The bar's in hell, and they're still digging under it.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "BillyBattsInTrunk",
            "body": "Edit: I say this obtuse remark bc it speaks to: When you’re used to privilege, equality looks like oppression. \n\nI’m gonna go with the guy being ridiculously obtuse as opposed to intentionally insulting. But you may be right!",
            "score": -3,
            "replies": [
                {
                    "author": "____unloved____",
                    "body": "Him being ridiculously obtuse *was* the insulting part. She knows he wasn't being malicious or trying to tear her down. He was, in his mind, trying to find common ground.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lostinpandemic",
            "body": "His beard is actually the same as your pubic hair! He can totally relate!",
            "score": -2,
            "replies": []
        }
    ]
}