{
    "title": "Is there a competition for JetBrains IDEs?",
    "author": "kernel_pi",
    "subreddit": "learnprogramming",
    "rank": 5,
    "score": 7,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/learnprogramming/comments/1jefjes/is_there_a_competition_for_jetbrains_ides/",
    "id": "1jefjes",
    "selftext": "I noticed that JetBrains IDEs are the sole provider of IDEs to the industry, the only other established IDE that I noticed is Eclipse for Java, and it can’t really compete with the IntelliJ heavy weight, while VS Code is not and IDE, so am I missing something or are JetBrain IDEs the only mainstream IDEs that are available?",
    "comments": [
        {
            "author": "Plooel",
            "body": "Visual Studio is probably more popular for C#/C++/VB than the JetBrains equivalent.",
            "score": 27,
            "replies": [
                {
                    "author": "dparks71",
                    "body": "Rider, VS is definitely more popular for .net, or windows development, but it's losing share to VSCode for things that can be done there. Rider has some vocal advocates though, mostly transplants from android or Java since the jetbrains layout is more intuitive for them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FanoTheNoob",
                    "body": "I imagine this is only because it's a Microsoft product so it automatically gets market share from enterprise users \n\nRider blows VS completely out of the water when it comes to C# development",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Plooel",
                            "body": "As a C# dev, it hasn't been my experience at all. Not that Rider is bad in any way, but \"Rider blows VS completely out of the water\" is an absolutely insane statement to me.\n\nI've given Rider a shot several times over the years, but in the end, it hasn't been significantly better than VS.\n\nMy experience is that it really doesn't matter which you choose and you'll have a perfectly good development experience regardless.\n\nRider does have some exceptionally vocal supporters though and I'm not sure this is a positive, lol.  \nSometimes it can feel a bit cult-ish, for example when they make statements that lack any sort of nuance, like \"it blows VS completely out of the water.\" ;)",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "thesituation531",
                            "body": "I think CLion is a lot better too. It's automatically cross-platform, whereas with VS you manually have to configure Clang or GCC.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RangePsychological41",
            "body": "Saying VS Code isn’t an IDE just means you haven’t installed enough extensions yet. It just becomes semantics after a certain point.\n\nIn any case, for anything that isn’t a JVM language I wouldn’t touch IntelliJ. Feels like I’m driving a boeing 747 through a city and all the lights in the dashboards are blinking and fighting for attention.",
            "score": 22,
            "replies": [
                {
                    "author": "lkatz21",
                    "body": "Jetbrains has other IDEs as well, not just Intellij. Clion is top tier and pycharm is not bad at all.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Dobsus",
                    "body": "Exactly, if VS Code isn''t an IDE then I don't find it to be a useful distinction.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Vincent10z",
                    "body": "I switched from VScode to Goland for my day-to-day work as a backend engineer and I love it tbh\n\nHaven’t looked back but ymmv",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Weetile",
            "body": "I've noticed programmers tend to go all-in either in the JetBrains ecosystem or the Neovim ecosystem for the most popular programming languages. You'll get some outliers like some devs that prefer Eclipse for Java, but generally JetBrains tend to be the most popular.",
            "score": 5,
            "replies": []
        },
        {
            "author": "oblong_pickle",
            "body": "Anything .NET you can use the Visual Studio IDE ( not code)",
            "score": 3,
            "replies": []
        },
        {
            "author": "zerslog",
            "body": "Well, I think VS Code is great for developing, whether it may be a \"real\" IDE or not. It is free and with the right extensions supports anything I can think of. It is just that the Jetbrains IDEs provide a smoother experience out of the box in my experience. \n\nHowever, there are many more great IDEs, particularly for certain languages or use cases. For example Visual Studio (without the Code) offers a good experience for C++ or C# Windows dev and .NET and Spyder might be a good choice for Python data science stuff. I also know some people who simply use (Neo)Vim or even emacs and use separate tools for everything else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "usethedebugger",
            "body": "As in another company that exists solely to make IDEs and dev tools? Probably not. But that doesn't mean it doesn't have any competition at all. Visual Studio still has most of the professional game development and dotnet community. I don't think JetBrains strength is competing against existing tools, rather I think they excel in providing tools for ecosystems that don't really have them. Take Python for example. JB makes an IDE exclusively for Python (granted, it's just IntelliJ in the background), which to my knowledge, is one of the only IDEs dedicated to Python. They've done similar things with Rust and web development. Providing professional grade tools to all areas of development is their specialty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whatever801",
            "body": "Well I mean there's Visual Studio itself still and Xcode is there for Mac stuff. Increasingly there is little you can't do with vscode extensions. Devcontainers make it pretty compelling",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pale_Height_1251",
            "body": "There is competition out there, varies by language. Visual Studio, Code etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Khoraji",
            "body": "(n)Vimers rise up",
            "score": 1,
            "replies": [
                {
                    "author": "iduzinternet",
                    "body": "EMACS! jk, I also Vi(m) on remote machines.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "satoryvape",
            "body": "Vim",
            "score": 1,
            "replies": []
        }
    ]
}