{
    "title": "Watching FedNews implode is so funny",
    "author": "Gemini_Of_Wallstreet",
    "subreddit": "Anarcho_Capitalism",
    "rank": 475,
    "score": 124,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1ihgrw3/watching_fednews_implode_is_so_funny/",
    "id": "1ihgrw3",
    "selftext": "It is so enjoyable and such a popcorn enjoying time. \n\n**You** have to hold the line.\n\n**All** avenues for support must be reached.\n\n**Are** we to accept this situation? No, not at all.\n\n**Useless** tariffs are used as misdirection from the fight!\n\n**Leeches** like Trump and his cronies will not defeat us.",
    "comments": [
        {
            "author": "None",
            "body": "The fact that these people think they're some sort of heroes is hilarious. They live in a delusional cartoon world. I hope they all get cut somehow. I mean, I want ALL government gone, but them first please. \n\n\nI'm almost embarrassed for them sometimes. Almost. Then I laugh at their insane, sheltered perceptions.",
            "score": 89,
            "replies": [
                {
                    "author": "Conscious_Tourist163",
                    "body": "They're doing hard, honest work. For example, they banned me just for being on this very sub.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Truly, champions of free speech and democracy.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "PureDiesel1",
                                    "body": "What I don't get is they feel they all have jobs for life.  Noone else has a guaranteed job for life and a company cam get rid of you at any time without severance if they want.\n\nTney are being offered 8 .months pa and benefits.  That's pretty generous.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "When I got out of high school I started working for the Government right away, a county job. My dad got it for me, he worked for the city so he knew people. That was EVERYONE'S attitude there.\n\n\nWhen I quit, a year later, everyone was shocked. \"WHY, YOU DON'T EVEN NEED MORE SCHOOL, THIS IS A JOB FOR LIFE! THIS IS YOUR WHOLE LIFE WHY?!\" I mean, honestly, that was part of it. It was gross working in an environment like that. \n\n\nI guess the shocker to me is, is when I worked government, NO ONE was under any delusion they were \"heroes\" etc. They knew who/what they worked for was deeply corrupt. That's WHY they had a job for life. Everyone was aware. It's another reason I left. These people seem to be under some sort of brainwashed fever dream that them working for such corrupt rotting crap equates to being heroic. It's wild they're so stupid and so willfully ignorant and blind. Like how do you live with yourself like that? I will never understand.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SheriffMcSerious",
            "body": "I don't like redditeurs and I don't like feds, so watching the worst possible people imaginable meltdown is great.",
            "score": 38,
            "replies": [
                {
                    "author": "P1xelEnthusiast",
                    "body": "We might be soulmates",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "drink-beer-and-fight",
            "body": "They’re big mad that the grift is being talked about.",
            "score": 28,
            "replies": []
        },
        {
            "author": "thermionicvalve2020",
            "body": "Casta a la vista, baby!",
            "score": 11,
            "replies": []
        },
        {
            "author": "Free_Mixture_682",
            "body": "Another sub going nuts about foreign policy is r/IRstudies\n\nIR is international relations.\n\nThey are going nuts over USAID, threats of tariffs, the list is endless.\n\nThere is a meltdown going on. Get out the popcorn.\n\nI actually responded on the IRstudies sub to someone who brought up the Marshall Plan. I presented a tldr version of why the plan was just a massive wealth transfer from taxpayers to corporate America because the only nation producing goods that Europeans could buy was the U.S.\n\nI also said free trade would have done far more than the Marshall Plan to bolster Europe.\n\nI had other points with links provided to source everything.\n\nThe responses were funny, if nothing else. One person said I was treasonous. One person said “I am a PhD, and you are wrong” without refuting anything I wrote. I even gave examples of the failure of the Plan by comparing its outcomes with nations that received no aid and between nations receiving different levels of aid. It did not matter.\n\nNot much studies going on over there but it also has me believing these are the same people who infest the foreign policy establishment of this country. And that is why the U.S. is probably hated by all but the few who receive direct financial and military aid.",
            "score": 48,
            "replies": [
                {
                    "author": "Free_Mixture_682",
                    "body": "In case anyone is bored and would like to critique what I wrote, it is a response to someone saying something about how they assume opposition to the Marshall Plan based on current foreign policy shifts:\n\n>Good because the Marshall Plan did nothing other than create a myth.\n\n>After the war ended, Harry Truman’s popularity in the polls began to plummet, as did the prestige of government generally. The American people had made huge sacrifices to fight the war and now wanted curbs in government, which had been administering a centrally planned economy. Most of all, they wanted the foreign policy recommended by George Washington and Thomas Jefferson: trade with all, entanglements with none.\n\n>In the mainstream of thinking was Republican Senator Robert Taft, a hero of all free-market activists at the time. He demanded tax cuts, spending cuts, and an end to “constantly increasing interference with family life and with business by autocratic government bureaus and autocratic labor leaders.” The Republican party swept midterm elections in 1946, taking back the Congress on a hard-core, anti-big government platform.\n\n>Truman had to do something big and he knew it. As Charles Mee reports, he needed “some large program that would let him recapture the initiative, something big enough to enable him to gather in all the traditional factions of the Democratic Party and also some middle-of-the-road Republicans, and at the same time, something that would hamper the Republican phalanx,” and establish him as a world leader.\n\n>The issue was right before him: foreign aid, funneled through the corporate establishment and cloaked in the rhetoric of opposition to foreign communism. Cynically, he would make good use of Russia, which only the day before had been our gallant ally in the war, and transform it into a monster that had to be destroyed. By stealing the Republican’s anti-socialist rhetoric, Truman hoped to frazzle his opponents and make himself a hero on the world stage.\n\n>A little-known business group, founded in 1942 and called the Committee for Economic Development, was elevated into a think tank for a new international order—the economic counterpart to the Council on Foreign Relations. The Committee’s founders were the heads of the top steel, automotive, and electric industries who had benefited from the New Deal’s corporatist statism. Its membership overlapped with the farther left National Planning Association, which was unabashedly national socialist in ideological orientation.\n\n>These groups understood that they owed their profit margins to government subsidies provided by the New Deal and wartime production subsidies. Faced with post-war peace, they feared a future in which they would be forced to compete on a free-market basis. Their personal and institutional security was at stake, so they got busy dreaming up strategies to sustain a profitable statism in a peacetime economy.\n\n>Corporate economic interests, then, overlapped with Truman’s political interests, and an unholy alliance between business and government was born. They would use Europe’s miseries to line their own pockets in the name of “rebuilding” and providing “security” against trumped-up threats to American security.\n\n>Taking a leaf from the Roosevelt playbook, Truman bypassed the usual bureaucracy and established a new bureau—the Economic Cooperative Administration—to distribute the aid. It too was staffed by the heads of major industrial-corporate interests who stood to benefit at public expense. Paul Hoffman headed the group and passed out billions to well-heeled corporate powers. As historian Anthony Carew summarizes, the Marshall Plan “was in all major respects a business organization run by businessmen.” (Hoffman later became head of the far-left Ford Foundation.)\n\n>Most of all, the aid was used for purchases at distorted prices by American tax dollars in the hands of European governments. The mad scramble for tax dollars was a disgrace to behold, creating a low point in U.S. business history. Time and again, Congress intervened to grant corporate America what it really wanted: restrictions that forced Marshall aid to go to purchases of American oil, aluminum, wood, textiles, and machines.\n\n>The aid was also used to directly subsidize particular firms in recipient countries, whether or not there were viable markets for their products. Instead, the firms received money because their continued existence would artificially support “full employment” policies. And since American labor union groups were intimately involved in choosing who got the money, the lion’s share went to companies with closed union shops, paradoxically restricting the ability of labor markets to readjust to new economic realities.\n\n>The result was the largest peacetime transfer of wealth from the taxpayers to corporations until that point in U.S. history.\n\n>A year after the Marshall Plan began sucking private capital out of the economy, the U.S. fell into recession, precisely the opposite of what its proponents predicted. Meanwhile, the aid did not help Europe. What reconstructed Europe was the post-Marshall freeing up of controlled prices, keeping inflation in check, and curbing union power—that is, the free market. As even Hoffman admitted in his memoir, the aid did not in fact help the economies of Europe. The primary benefit was “psychological.” Expensive therapy, indeed.\n\n>The actual legacy of the Marshall Plan was a vast expansion of government at home, the beginnings of the Cold War rhetoric that would sustain the welfare-warfare state for 40 years, a permanent global troop presence, and an entire business class on the take from Washington. It also created a belief on the part of the ruling elite in D.C. that it could trick the public into backing anything, including the idea that government and its connected interest groups should run the world at taxpayer expense.\n\n>And I bet you think government is supposed to be against corporations, not the instrument of their enrichment. Yet that is what happens every time the government intervenes in the economy.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "BlacksmithSeaSmith",
                            "body": "Jesus that is some good political history crash course",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Unhappy-Pie-244",
                            "body": "Thanks for the explanation. Where can I learn more about this?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Free_Mixture_682",
                                    "body": "I am not sure. Finding what I did was hard enough. I think most of the info is going to repeat the party line of “Marshall Plan good” and will not deviate from that.\n\nOne source is JSTOR, but one needs access to view the entire article.\n\nhttps://www.jstor.org/stable/40399984\n\nAnother is CATO\n\nhttps://www.cato.org/commentary/look-behind-marshall-plan-mythology\n\nThere is not real methodological research I can find on it. It is just considered a success because it was declared successful at the time.\n\nAnd if one were to look at the responses I received in the sub, they almost all were either derogatory to me personally or peddling the same thing of asking how anyone can question it at all because it was obviously successful.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TopGrand9802",
                    "body": "I've always wanted to learn more 'real' history. In the interest of educating myself without having to weed through the garbage to find the truth, I'd be very interested in the information you provided.\n\nSorry, I hadn't scrolled far enough.\nThanks for posting!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Free_Mixture_682",
                            "body": "And followed up with this:\n\n>I just provided you with the “test”.\n\n>The control element of destroyed nations that received no aid, and the nations that received substantially greater aid and compared them to the most significant Marshall Plan recipient, W. Germany.\n\n>The Marshall Plan fails the test.\n\n>But lets us look at more examples. Britain received twice as much aid as West Germany did, but economic growth in Britain dramatically lagged behind that of the Germans.\n\n>France, W. Germany, and Italy began their economic recoveries before they started getting Marshall Aid.\n\n>Austria and Greece received a lot of Marshall Aid, per capita, and yet their economic recovery only got under way as Marshall aid was being phased out.\n\n>Given that the UK received more Marshall Plan aid than West Germany, we shouldn’t be surprised that government grew more in the UK. The way the Marshall Plan was set up, for every dollar that you got in Marshall plan assistance, the government of the recipient country had to increase government expenditures by one dollar.\n\n>That is, the Marshall Plan mandated that governments grow in relation to a country’s GDP as a condition of receiving aid.\n\n>But, when it comes to real economic recovery, the same principles applied in Europe as applied in the United States. Where we saw large amounts of economic growth after the war, in the United States, for instance, growth was connected to large declines in government spending and the repeal of many government controls from the war years.\n\n>There is, however, another component of the Marshall plan, and that is, as Hal Brands contends today, the necessity of “the deft use of economic tools for geopolitical gain.” That is, the Marshall plan should be seen less as a tool of economic policy, and more as a tool of foreign and geopolitical strategy.\n\n>In this respect then, the idea of the Marshall Plan is really to buy loyalty from foreign regimes and to execute public relations upon foreign populations. But there’s a problem here too. Given that the Marshall Plan didn’t actually improve the European economy and given that the plan required the additional fleecing of the American taxpayer why not implement a plan to actually helps to both build goodwill and improve economic growth at the same time?\n\n>This, of course, could have been achieved by the adoption of unilateral free trade on the part of the Americans. While it’s true that the Marshall Plan was part of a strategy to increase trade among European states, and trade in general, the tools used were the same that we see today: managed trade deals controlled by states and built upon an edifice of international bureaucracy. By necessity, plans like this always involved central planning to the extent that government planners pick winners and losers by designing trade agreements.\n\n>Unilateral free trade, however, offered, and still offers, a true laissez-faire solution. Imagine moreover, how the post-war world offered an excellent opportunity in this regard. The Japanese and European economies had been temporarily destroyed by the war. The US, meanwhile, was in an excellent position to offer, through markets, both capital and American consumers to the globe. Faced with free and open access to American markets, and with American firms prepared to invest capital overseas, the US had the chance to build greater cultural and economic ties with its former enemies and longtime allies in both Europe and Asia. The US need not even ask these foreign regimes to reciprocate. Opening up American markets to these foreign regimes would have made sense both geopolitically and economically. It would have offered American consumers access to less expensive goods, while also building new trade opportunity for foreign entrepreneurs. No redistribution schemes were necessary. All that was needed was for the US regime to embrace true, free, and open trade.\n\n>Politically speaking, this might even have been an easier sell than usual. Most industrialized foreign economies had been destroyed in the war, and the US was in a position to dominate the global economy. Was it really necessary to protect American markets anymore? The answer is always no, of course, but the case could have possible been made more forcefully at that time than ever before.\n\n>Unfortunately, that’s not what happened. Guided by bad economics, and bad ideologies, the US was simply not prepared to embrace true free trade or free economies of any kind. The chosen path was one that afforded governments the chance to continue to control and direct markets, and to decide who gets what and when. That’s always been a pretty hard deal for governments to give up.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Free_Mixture_682",
                            "body": "I replied to myself in this thread with the response I gave in the sub.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BlacksmithSeaSmith",
                    "body": "I know this is funny and all. You know information. Rebellion.My concern is at the end of the bottom line. Like. Uh. Would this otherwise hurt the the US economy. I’m not that financially literate enough to touch on this subject matter. what happens when it hurts you. Me. We. Us. Financially. Wouldn’t be funny anymore when it hurts the little guy does it? Like your story about you having a beef war with this “I have a PHD, and you’re wrong” type of guy. There’s very much a line and category between hobbies. An obsession. Competency. General knowledge. Experience. That and being an otherwise government approved certified yes man because you went to college years on this topic. Like the whole meme “look at me sonic I’m forklift certified.”  So that means I smarter than you.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ruttin_Mudder",
            "body": "I live in a fed-saturated area and I've known a lot of federal employees in my lifetime. I've heard them talk about \"being dedicated to the public trust\" and their \"commitment to good government\" but NEVER have I heard so many invoke their oath to the Constitution. It's like suddenly the Constitution is useful for them (while probably 90 percent are working in unconstitutional agencies and programs and they can't see the irony).",
            "score": 19,
            "replies": []
        },
        {
            "author": "ghazzie",
            "body": "It’s so hilarious how they are acting like they are some kind of bastion protecting democracy.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Unlucky-Pomegranate3",
            "body": "They honestly think they’re the good guys.  Overwhelmingly biased and can’t understand how anyone could think that’s a bad thing.",
            "score": 2,
            "replies": []
        }
    ]
}