{
    "title": "And to think that this sub wanted me to vote for Chase Oliver.",
    "author": "afieldonearth",
    "subreddit": "Anarcho_Capitalism",
    "rank": 462,
    "score": 991,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 207,
    "url": "https://i.redd.it/mag38oclt5he1.jpeg",
    "id": "1ihnklz",
    "selftext": "",
    "comments": [
        {
            "author": "19_Cornelius_19",
            "body": "Policy aside, Chase is a weak candidate.",
            "score": 208,
            "replies": [
                {
                    "author": "YardChair456",
                    "body": "I heard him on a single podcast that was friendly, and he did not do well.  I listen to lots of podcasts, I should have heard him many times.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "HowardIsMyOprah",
                    "body": "Given that no LP candidate has a chance of even getting on the debate stage, policy is really all they have a lot of times",
                    "score": 58,
                    "replies": [
                        {
                            "author": "critsalot",
                            "body": "which is something that should be changed imo. we need to build a system where people are given air time besides the big 2. other countries have this. yes its kinda stupid sometimes but 2 parties shouldnt be able to monopolize our politics.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "RandomUsername468538",
                                    "body": "Unfortunately the only way to build such a system is if the monopoly allows us to. And why would they do that?",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "QH96",
                                    "body": "Libertarians need to leverage podcasts, engage in debates, go on college campuses, and actively participate in online discussions. They should take inspiration from figures like Charlie Kirk and Vivek Ramaswamy, who effectively use these platforms.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "natedagr8333",
                    "body": "Republican plant to get libertarians to vote trump.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "IamFrank69",
                            "body": "Honestly, I wouldn't rule this out.\n\nOr maybe just astroturfed by Mommy McArdle to gain influence with Trump, while increasing his odds of winning.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "ur_a_jerk",
                                    "body": "based, if true",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "nishinoran",
                            "body": "If we didn't have direct accounts of what went down at the convention, this would be plausible, but there are plenty of people who have explained what happened.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "CauliflowerBig3133",
                            "body": "And? \n\nSo what?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "drebelx",
                            "body": "The only answer.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ChoRockwell",
                    "body": "You can't have gay people or woman headlining your party even in America even 2024. Jorgansen was much stronger but she was a woman, and couldn't ride off of Gary Johnson's wave.",
                    "score": -49,
                    "replies": [
                        {
                            "author": "StalinsPimpCane",
                            "body": "Gary what is Aleppo Johnson had no wave",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "WickedWiscoWeirdo",
                                    "body": "Gary \"bake the cake\" johnson, sucked",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "DMBFFF",
                                    "body": "Trump is far more intelligent than Johnson.\n\nHe's a very stable genius.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Yeshe0311",
                                    "body": "I don't think you realize what you're saying the fact that he didn't know what Aleppo meant was a sign that he was focused on America instead of foreign policy. That is unless you want Big Daddy Govt running the world?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "StalinsPimpCane",
                                            "body": "You can’t stick your head in the sand once America is already involved in these issues, to do so is ignorance, if he was elected president he would have had the job of untangling many of those foreign entanglements and being ignorant of them is just a horrible look",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Yeshe0311",
                                                    "body": ">if he was elected president he would have had the job of untangling many of those foreign entanglements\n\n\nThat is not the job of the President.  The USA is responsible for the USA and the next administration is not responsible or committed to the agenda or policy of the previous, especially if it's someone like Johnson who doesn't fall in to the 2 party uniparty system. The US might be the world super power but that does not make it our responsibility. I care more about our homeless, jobs, manufacturing, borders, senior citizens and OUR people",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ChoRockwell",
                                    "body": "Worst Gary Johnson gaffe is him not knowing what Aleppo was?",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "mrpenguin_86",
                                            "body": "That was enough to get him written off. It's unfortunate, but Republicans and Democrats can call the other side deplorable, basically promise WW3, promise to take everyone's weapons away, promise a police state, etc. and still be considered, but you forget about some conflict in a country we're not even supposed to be in and you're immediately out of the running.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "CaliRefugeeinTN",
                                            "body": "Yes. Even though I’m willing to bet that no candidate knows all that stuff. They hire someone to tell them. And I’m not electing someone to run Aleppo anyway.",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "StalinsPimpCane",
                                            "body": "It’s definitely the one I remember hitting with the public the most",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "ChoRockwell",
                                                    "body": "damn what an indictment",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "StalinsPimpCane",
                                                            "body": "I didnt and still dont care that much, i think it was a silly question, but it certainly had a big negative impact on his campaign at the time",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "not_slaw_kid",
                                            "body": "The worst Gary Johnson gaffe was putting his name on the same ticket as Bill fucking Weld",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "meawy",
                                            "body": "He sold me with the vetos :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "not_slaw_kid",
                            "body": "Third parties always perform markedly worse in an incumbent election. Jo Jorgensen beat the record for third party turnout during an incumbent election, but Gary Johnson didn't beat the record for a non-incumbent election.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "meawy",
                                    "body": "He beat the LP party record.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "ChoRockwell",
                                    "body": "So? He did the best the LP ever saw.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "not_slaw_kid",
                                            "body": "Sure, if you plug your ears and ignore all relevant context, maybe.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DMBFFF",
                                    "body": "America is a 2-party state.\n\nLibertarians should accept this and learn to compromise—you're not going to win if you stick so much to your \"principles\"—as you call them.\n\nWork within the system and maybe you'll get a few things that you want.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "old_guy_AnCap",
                                            "body": "Been there, done that.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Homegrown1129",
                            "body": "Yea it’s because she’s a woman, nothing to do with her stance on 2A or immigration.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ChoRockwell",
                                    "body": "Being pro-gun is always a popular opinion, and so was open borders in 2020.",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "deefop",
            "body": "I didn't expect \\*any\\* of the based shit trump has done in the last few weeks, yet under no circumstances would i have ever cast a vote for that fucking loser chase oliver\n\nI wrote in ron paul",
            "score": 300,
            "replies": [
                {
                    "author": "Itsjustmealex",
                    "body": "I would love a counter of how many ron paul write ins there is every election",
                    "score": 91,
                    "replies": [
                        {
                            "author": "BP-arker",
                            "body": "Yep",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lone_jackyl",
                    "body": "I don't know what bothers the commies more. The fact that he actually won or that he's doing what he said he would do. I'd say it's good combo of both",
                    "score": 62,
                    "replies": [
                        {
                            "author": "ParticularAioli8798",
                            "body": "He issued a lot of executive orders. We're not that far into the presidency at this point. You're getting ahead of yourself.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "igortsen",
                                    "body": "I'm very interested to see how far these exec orders go after the legal challenges run their course.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "lone_jackyl",
                                            "body": "Considering the Democrats are doubling down on their ideology I don't see them winning an election anytime soon",
                                            "score": 39,
                                            "replies": [
                                                {
                                                    "author": "HelpRespawnedAsDee",
                                                    "body": "From what I've seen from their convention.... it honestly feels they are living in an alternative reality.",
                                                    "score": 32,
                                                    "replies": [
                                                        {
                                                            "author": "lone_jackyl",
                                                            "body": "That's what I'm talking about. I watched it yesterday and it's like they're off in la la land not realizing what lost them the election. I was like holy shit these people are delusional",
                                                            "score": 20,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "nlog97",
                                                    "body": "Lol. 2028 is going to be a blue landslide like ‘08 (or at the very least 2012).",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "lone_jackyl",
                                                            "body": "Millions of people were saying that about this election and we see what happened.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "nlog97",
                                                                    "body": "Almost no one was saying that about this election.",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MarvLovesBlueStar",
                                    "body": "What more could he possibly do?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ParticularAioli8798",
                                            "body": "I don't understand your question. My reply was specific to the person above. I don't know where you're going with you question.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "anna_lynn_fection",
                            "body": "Definitely both. I thought they were pissed before, but now they're really pissed that he's doing this stuff and they're starting to call it a coup now.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "lone_jackyl",
                                    "body": "This is what you can expect moving forward from now on from the left. It's a culture thing that they have ingrained in them.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "anna_lynn_fection",
                                            "body": "Yup. Has been for a while. [This is the left now](https://www.msn.com/en-us/news/technology/reddit-temporarily-bans-r-whitepeopletwitter-after-elon-musk-claimed-it-had-broken-the-law/ar-AA1ypYNv).\n\nFor at least the last 20 years, I've personally labeled the left the epitome of hypocrisy. The side that claims to be anti-gun and anti-violence until it's people they don't like. Like Elon, Trump, or an insurance CEO, etc.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ToxicRedditMod",
                            "body": "Well the Left normally lies about their true intentions, so they just assume everyone is lying.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DMBFFF",
                            "body": "It's amazing how he ended the Ukraine-Russia war in 1 day.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "lone_jackyl",
                                    "body": "Is this a new development? I've not heard about this",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DMBFFF",
                                            "body": "Fake media doesn't like to report on Trump's accomplishments.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "underengineered",
                    "body": "I wrote in Spike.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Jarte3",
                    "body": "I expected this based stuff because I paid attention to his first term",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MarvLovesBlueStar",
                    "body": "You should have voted for Trump. But you were too blinded by what the mainstream media told you.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "framingXjake",
                            "body": "No. Ron Paul definitely deserves our votes more.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "deefop",
                            "body": "Yeah, writing in Ron Paul is definitely expected of someone who listens to a lot of mainstream media.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "compozdom",
            "body": "I hate the guy. But damn, he might end up becoming the best President in my lifetime.",
            "score": 133,
            "replies": [
                {
                    "author": "Asangkt358",
                    "body": "That's a pretty low bar, but I agree.",
                    "score": 56,
                    "replies": []
                },
                {
                    "author": "BrooklynRedLeg",
                    "body": "Ain't that a bitch? I don't LIKE Trump, but holy f'ck.....",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "IamFrank69",
                    "body": "Already was.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "compozdom",
                            "body": "Ehh.. Clinton was probably a little better…",
                            "score": -28,
                            "replies": [
                                {
                                    "author": "IamFrank69",
                                    "body": "Hmm, maybe. I think giving presidents full credit/blame for budget issues doesn't paint a full picture, though.\n\nClinton balanced the budget when he had a cooperative Republican Congress. Trump ran up a big deficit when Democrat governors shut down the economy and Congress started spending like drunken sailors.\n\nBoth were horrible on monetary issues.\n\nI'd say Clinton was slightly worse on foreign military intervention, but they're both better than Bush/Bush/Obama/Biden.\n\nIMO it's close between Clinton and Trump, but I'd give Trump the nod, especially after what he's done the past two weeks.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MarvLovesBlueStar",
                    "body": "Maybe you should reconsider why you don’t like him and where you are getting your information.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "compozdom",
                            "body": "I don’t like war criminals. Bombing innocent children is something I hate in people… I think that’s a good start. I don’t like big government guys, there’s another reason. Dude spent like a drunken sailor his first term in office. Maybe I have valid reasons.",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "LordXenu12",
                            "body": "Conmen sexual predators aren’t my cup of tea thanks",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "stayconscious4ever",
                    "body": "Yep",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Huntergio23",
                    "body": "War with Iran and U.S. involvement in Israel is the mark of a great president? Okay",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ronpaulclone",
            "body": "Trump has done more for liberty in 15 days than all libertarian candidates combined.",
            "score": 138,
            "replies": [
                {
                    "author": "BrooklynRedLeg",
                    "body": "Sad, isn't it? We got Ross Ulbricht freed, they're stuffing a microscope up the ass of SOME of the Deep State....and now....this",
                    "score": 59,
                    "replies": [
                        {
                            "author": "ronpaulclone",
                            "body": "He’s also done a lot of bad but come on. The impact is 100,000,000x more than anything the LGBT celebrating masking mandate loving lolbertarians have ever done. Oh yeah he’s not a libertarian and he’s not pure in his ideas at all but look where purity got us: less freedom than just 4 years ago, 20 years ago, 30 years ago. The last 15 days had resulted in more government scope, size and spending cuts than 200 years of libertarian theories.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "BrooklynRedLeg",
                                    "body": "Trust me, I'm not a fan of the militarization of the border, but we could have solved the migrant problem a LONG time ago by cutting them off at the knees as far as taking money out of the system. Now we're in dire straits....but I also hate that immigrants are doing stupid shit like living here for 30 years without at least TRYING to naturalize. Plus, our foreign policy is coming back to bite us in the ass because the Deep State cannot leave well enough alone.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "TehM0C",
                                            "body": "You can’t enter illegally & try to naturalize. You would be pushed to the bottom of the list & deported.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "BrooklynRedLeg",
                                                    "body": "Well, then you take your lumps, go back across the border and try to get in legally.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "DMBFFF",
                                                            "body": "What border?",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "BrooklynRedLeg",
                                                                    "body": "Well, part of it is The Rio Grande....",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DMBFFF",
                                                                            "body": "Who decided that it should be a border? the government?",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BrooklynRedLeg",
                                                                                    "body": "Pretty sure both the US and Mexico decided that well before any of us were born....",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "DMBFFF",
                                                                                            "body": "Both governments are illegitimate.\n\nAll governments are illegitimate.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "TehM0C",
                                                            "body": "Agreed but it’s disingenuous to say they’re not trying to naturalize. If there was an avenue for them to become legal most would jump on that opportunity.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "TheKelt",
                                                                    "body": "I don’t want illegal immigrants to be given the opportunity to naturalize. That is a right that should only be reserved for LEGAL immigrants, people who followed the laws and did things by the books.\n\nWe absolutely need to make the immigration/naturalization process more streamlined and efficient, so it’s less costly and takes less time for well-intentioned folks to become Americans.\n\nBut a “pathway to citizenship” for illegals is nothing more than a Democrat trojan horse tactic designed to reinflate their dwindling voting numbers. Nothing more.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TehM0C",
                                                                            "body": "Don’t disagree with a thing you said.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "fascinating123",
                                                                            "body": "Just give them a path to a green card.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TheKelt",
                                                                                    "body": "Yeah the path is “leave then come back in the right way.”",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "fascinating123",
                                                                                            "body": "There is no \"right way.\" If you want a green card it's high skilled immigration (which you may still not get) or marry a US citizen. You don't fill out forms and wait, if you don't fit a narrow situation, there is no line. \n\nReform the process, everyone who wants a green card gets one.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Komprimus",
                    "body": "Except for the tariffs. The tariffs are beyond stupid.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "ronpaulclone",
                            "body": "Agree entirely. Although 2 of them resulted in absolutely nothing happening. Wild how this dude makes stuff happen by threatening to ruin himself 😂",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mrpenguin_86",
                    "body": "That's what happens when your party is shut out of national politics.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MindOverManner69",
                    "body": "Can you list me some things that Trump did for liberty in the past 2 weeks? Ross is about the only thing I can think of.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DMBFFF",
                    "body": "I can't wait until he starts to cut off Social Security and end Medicare and Medicaid.\n\nAs a Canadian, the reaction might divert his desire to annex us.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AdventureMoth",
                    "body": "how do tariffs support liberty?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ronpaulclone",
                            "body": "They don’t.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AdventureMoth",
                                    "body": "so he hasn't been supporting liberty?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ronpaulclone",
                                            "body": "Do you know what the word “more” means? It doesn’t mean perfect or even good.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AdventureMoth",
                                                    "body": "There are implications to what you say beyond the most literal interpretation.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ronpaulclone",
                                                            "body": "Every thing Trump has done, including the good and the outright awful, since being elected has increased liberty and reduced the size and scope of government than ALL libertarian candidates combined ever.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AdventureMoth",
                                                                    "body": "I'm not sure libertarian candidates have increased the size and scope of government, so even if they've done nothing, I doubt those claims.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "redsteakraw",
            "body": "My vote is paying dividends.  Am in a Blue State voted Trump because I was so pissed at the Dems for the Covid Tyranny and Tech collusion.  Wanted to free Ross Ulbricht ever since I talked to his mother at Porcfest.  DOGE was the sealing of the deal. Wanted Trump to get the popular vote to literally mentally break the opposition.  Mission accomplished there.  Was nervious Ross wasn't going to be freed.  Night 1 but he was freed his first full day one so technically kept to the timeline.  Kash from everything I heard is making me excited.  When your enemies and people in the government are freaking out you know you did the right thing.  At the very least if anything I can say I helped free Ross and got entertainment for the next 4 years. Everything from now on is all bonuses by my book and the only time I felt I actually got anything by voting.",
            "score": 18,
            "replies": [
                {
                    "author": "siasl_kopika",
                    "body": "watching all the federal employees on reddit losing their minds has been amazing. The government should not be allowed to hire people, i hope trump fires every last one.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BarkleEngine",
            "body": "Apparently this will terminate every activity at the Education department which is not expressly specified in legislation. This is most activities.",
            "score": 8,
            "replies": []
        },
        {
            "author": "duru93",
            "body": "I don't think anyone in this sub was voting for Chase Oliver",
            "score": 27,
            "replies": [
                {
                    "author": "CarmeloManning",
                    "body": "I don’t think Chase Oliver voted for Chase Oliver",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "HipHopLibertarian",
                    "body": "I voted for Chase Oliver",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Eranaut",
                            "body": "I did too. It was funny to see him get fewer votes than RFK jr. A guy who publicly pulled out of the race a few months prior.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "IamFrank69",
                            "body": "Eww",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Red_Igor",
                            "body": "Same",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lone_jackyl",
            "body": "I wouldn't vote Chase Oliver even if he was the only candidate on the ticket. He said some bad things about Ron Paul.",
            "score": 32,
            "replies": [
                {
                    "author": "igortsen",
                    "body": "Don't most Ancaps have bad things to say about Ron Paul and Libertarians in general?",
                    "score": -17,
                    "replies": [
                        {
                            "author": "lone_jackyl",
                            "body": "I never said I wasn't anarcho capitalist. I like debating with you guys because you actually know how to debate without just insulting someone. And I'm very curious about your movement",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "P1xelEnthusiast",
                                    "body": "I agree.\n\nI am a libertarian (maybe a minarchist).\n\nThis is simply the best libertarian sub on reddit. \n\nR/libertarian is all largely leftists (but it has shifted a bit - I think they maybe trashed a bad mod)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xAptive",
            "body": "*This* sub wanted you to vote?",
            "score": 11,
            "replies": []
        },
        {
            "author": "backwards_yoda",
            "body": "Too bad he can't abolish it through executive order. Only congress can abolish the department of education and I don't believe trump has any interest in working with congress to actually make this happen.",
            "score": 6,
            "replies": [
                {
                    "author": "BrooklynRedLeg",
                    "body": "Maybe. I think we may see some 'backroom deals' go on that cause major Dems to shift. Schumer and several others with ties to USAID may be offered 'leniency' if they vote for certain bills. Depends on if there really is dirt on them or not and what Trump will do with that. He could always burn them later, after the fact, for the shit they did to him in 2020....",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RedeemedWeeb",
                            "body": "> I think we may see some 'backroom deals' go on that cause major Dems to shift.\n\nThat would be an instant end to their careers. Nobody on either side would vote for them.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IamFrank69",
            "body": "Best possible year to have a weak libertarian candidate!\n\nThank God Rectenwald's smart, but very boring ass didn't win.\n\nGoing forward, though, I think RFK Jr. just gave a great example of what a strong libertarian candidate can do to maximize influence. Combine the stick of \"stealing votes\" with the carrot of dropping out and endorsing the Republican if he gives sufficient concessions/appointments.",
            "score": 13,
            "replies": []
        },
        {
            "author": "berserkthebattl",
            "body": "Does anybody else feel like \"executive orders\" should be few and far between rather than the primary mechanism of employing policy?",
            "score": 20,
            "replies": [
                {
                    "author": "Krackor",
                    "body": "Why should anyone care about checks and balances when government departments are being shut down? You'd rather have a government department stay open than have it shut down through incorrect procedure? What kind of an anarchist are you?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "SovietCapybara",
                            "body": "For the same reason I don't want an executive order to have the fed confiscate all guns or issue IRS audits on all US citizens\n\nAbuse of power is bad even when it's beneficial",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "c00kiesn0w",
                            "body": "Power consolidation is exceedingly becoming a concern. That being said, I agree we should just take the dub here.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Krackor",
                                    "body": "The executive branch closing a department run by the executive branch is the exact opposite of a consolidation of power.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "motram",
                                    "body": "> Power consolidation is exceedingly becoming a concern.\n\nEh. \n\nThe executive has been very weak for a very long time.  The judiciary has become way too powerful. \n\nThis is exactly the point of the executive, so the people can vote for change and have things happen.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Shamalow",
                                            "body": "Ah yes, a strong state, exactly what we want!",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "motram",
                                                    "body": "/eyeroll\n\nYeah, it is actually, so when the govt gets to this level of insanity someone can stop it.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "siasl_kopika",
                    "body": "\\> Does anybody else feel like \"executive orders\" should be few and far between rather than the primary mechanism of employing policy?\n\nThe president should have unilateral authority to deregulate, end wars, shut down parts of the government, and cancel taxes and spending. In fact, there should be a button on his desk that shuts the entire government down for whole year. Hell, put one on his seat too, and scatter them around the floor.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DMBFFF",
                    "body": "The more the merrier.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "CakeOnSight",
            "body": "NBC the most trusted liars",
            "score": 3,
            "replies": []
        },
        {
            "author": "nlog97",
            "body": "Why vote at all? AnCaps don’t believe in democracy.",
            "score": 11,
            "replies": [
                {
                    "author": "afieldonearth",
                    "body": "It’s not an endorsement of democracy to pragmatically make the best of the choices available to you. \n\nElecting Trump achieved exponentially more real world wins for liberty than decades of talking about how principled we are for not voting.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "nlog97",
                            "body": "Trump is going to be as unpopular as Bush was when he leaves office, mark my words.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "gatornatortater",
                                    "body": "Weren't the Dems trying to sell everyone on Bush a year or so ago?  They were even trying to make the claim that neocons were the less extreme part of the party even though everyone knows they're bigger hawks than anyone else.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "nlog97",
                                            "body": "I’m not talking about the Democrats.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DMBFFF",
                                    "body": "Nah, after 4 years of Trump, the US will be a very great country. Everything will be so good. It'll be fantastic. All the illegals will be deported, there will be no more crime, the US will be exporting $trillions to the world. The State of Canada and Mexico will love the US. We will finally have peace in the Middle East.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "nlog97",
                                            "body": "You gotta be careful. Some people might not think you’re joking 😂",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "WedSquib",
                                            "body": "/s?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "DMBFFF",
                                                    "body": "I suppose I'm in a cynical mood.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "WedSquib",
                                                            "body": "Just had to check, lots of people on these subs that support trump for some reason. Not even sure what they’re doing here",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "fullthrottle303",
                                    "body": "Is that supposed to be a bad thing?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "nlog97",
                                            "body": "Maybe you have a slightly different definition of the term “unpopular.” Idk.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AdventureMoth",
                            "body": "'Wins' such as trade restrictions? 'Wins' such as extreme violations of the NAP in the name of \"protecting culture\"?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "yadius",
                    "body": "Startup Monarchy energy, baby!\n\nCurtis Yarvin has entered the Overton window.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "LordXenu12",
                    "body": "They do love forcing their preferences on society tho",
                    "score": -4,
                    "replies": [
                        {
                            "author": "finetune137",
                            "body": "which ones?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LordXenu12",
                                    "body": "Inherently, your personal preferences on what you see as qualifying for a valid claim to private control over land/natural resources that you’re good with the state (that you don’t agree exists) enforcing",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "finetune137",
                                            "body": "🥱",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LordXenu12",
                                                    "body": "Yes I don’t expect authoritarians to care about forcing personal preferences through violence 🙃",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "finetune137",
                                                            "body": "You talk about who exactly there?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "LordXenu12",
                                                                    "body": "Every single supporter of private control over the MoP/nature",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "finetune137",
                                                                            "body": "So me too?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LordXenu12",
                                                                                    "body": "Yes, you’re happy to force your personal preferences through violence because you think you have some divine natural right to what you feel you’re entitled to 🤷‍♂️",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "finetune137",
                                                                                            "body": "Which ones? (promise to correct my ways)",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "LordXenu12",
                                                                                                    "body": "Whatever you think qualifies one for “the right” to private control over nature",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "finetune137",
                                                                                                            "body": "Be more specific. Humans are part of nature. You are saying you're against self ownership? Like I have no right to own myself?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "LordXenu12",
                                                                                                                    "body": "Nope I think sentient beings are certainly entitled to private control over what they inherently are. But we all inherited the same universe. Killing someone over territory you feel you are entitled to private control over isn’t necessarily self defense, but it’s also not necessarily unwarranted aggression",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "finetune137",
                                                                                                                            "body": "Absolutely. Wars are a crime against humanity, I'd say that for sure",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HipHopLibertarian",
            "body": "Here is Chase Oliver's education platform and it seems more coherent than what is coming out of Trump:\n\n[https://votechaseoliver.com/education/](https://votechaseoliver.com/education/)",
            "score": 7,
            "replies": [
                {
                    "author": "MattAU05",
                    "body": "Basically his entire platform is consistent with the whole of libertarian ideology. I get people don’t like him, but it’s so funny to me when people act like he was a socialist or something.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "LordXenu12",
                    "body": "\nloose stool is more coherent than anything coming from trump",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BadMawFawka",
            "body": "Please be real..",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "Oh no. But how will my kids learn about Johnny Appleseed ",
            "score": 2,
            "replies": []
        },
        {
            "author": "shepp1986",
            "body": "Dave was on the tRump train.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jeffraymond29",
            "body": "Schwinnnng!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hutman70",
            "body": "It’s getting real people❤️❤️❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "DMBFFF",
            "body": "WP says Dave Smith lives in NYS, where Harris won with a plurality over 1 million.\n\nIt doesn't matter if a person in New York State voted for Trump or Oliver.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Huntergio23",
            "body": "Cool so we get crack downs on free speech, ethnic cleansing on gaza with US involvement, increased sanctions against Russia further prolonging that conflict, and a trade war with China but in return we get the potential destruction of a singular federal department? Sounds like a shitty tradeoff. Also RFK and Tulsi walking back there stances on things they supported in the past doesn’t bode well for making institution shattering changes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "aceman1138",
            "body": "I got banned from r/Libertarian for saying that I was voting for Trump instead of Chase Oliver.",
            "score": 4,
            "replies": [
                {
                    "author": "stayconscious4ever",
                    "body": "Sad!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Themsah",
            "body": "Correction.. VOTED for Chase Oliver.. he is still a better candidate than Trump or Harris.",
            "score": 4,
            "replies": []
        },
        {
            "author": "HipHopLibertarian",
            "body": "Trump will not be able to do this legally so what is the point?",
            "score": 3,
            "replies": [
                {
                    "author": "tigergoalie",
                    "body": "Legal doesn't seem to matter too much. We'll see what the SC actually sends back, but it doesn't seem like they're getting in the way of his illegal orders too often.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "BrooklynRedLeg",
                            "body": "What will be interesting is if they unleash that can of worms about EO's carrying no weight....a lot of BS goes bye-bye",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Krackor",
                    "body": "What specific legal challenge will it face?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "MindOverManner69",
                            "body": "It was established and spending allocated by congress. It cannot be dissolved by executive order.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "trufus_for_youfus",
                                    "body": "It can be de-staffed though and exist as as a useless husk.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MindOverManner69",
                                            "body": "Are you ok with the harm that could be caused by any of these cuts? Do the ends justify the means?\n\nYou obviously wanna pay less taxes, but if it were, say, to put 1 million people on the streets, would you look the other way? Would that be a violation of the NAP?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "heresyforfunnprofit",
                    "body": "Reddit upvotes.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "BrooklynRedLeg",
            "body": "Leftoids on Reddit are losing their minds right now.....",
            "score": 3,
            "replies": [
                {
                    "author": "GunkSlinger",
                    "body": "They finally owned the libs.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DMBFFF",
                            "body": "Fuck liberalism.\n\nConservatism is the only way to go.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jaejaeok",
            "body": "I’m genuinely stoked! We homeschool for a reason.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CauliflowerBig3133",
            "body": "Enjoy the winning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RealLifeMichaelJosep",
            "body": "I’d argue that this sub was not backing Chase, maybe in pockets but not the majority",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdventureMoth",
            "body": "see what they don't tell you is all the things you don't want to hear.  \nDo not be fooled by the lies. Trump is not a libertarian.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cosmic_Spud",
            "body": "If it werent for the support of Israel, I'd almost start to like the guy. But forcing the Palestinians from their home is pretty disgusting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zzt0pp",
            "body": "10 days later and this still hasn't happened. Idk maybe wait on celebrating things that haven't happened lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "Likestoreadcomments",
            "body": "Most of us weren’t backing Chase, but we couldn’t have asked for a better way to defeat the Obama/Biden/Harris dynasty than we did with chase. So in that case I give props to that dude for falling on his own sword.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lil_Ja_",
            "body": "Ignore the literal concentration camp, mass deportations, tariffs, and potential exiles to El Salvador\n\nOrange man good!",
            "score": -10,
            "replies": [
                {
                    "author": "kurtu5",
                    "body": "> literal \n\nget a new intensifier!  its 2025",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LordXenu12",
                    "body": "Don’t you know ancaps are happy with interference with Liberty and the free market as long as it’s profitable to them personally?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Choppie01",
                            "body": "Ah right, lets gas them up",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LordXenu12",
            "body": "The kids who struggled to get C’s in high school will be ecstatic!\n\nI love how ancaps are cautious about rapid changes to infrastructure for immigration, but not for education. Oh well I guess a further stratification of the plutocracy was always the end goal",
            "score": -6,
            "replies": [
                {
                    "author": "Snoo_69097",
                    "body": "I'm not an Ancap but I still lurk around here. Having said that, Trump said that he plans to let the states manage their own education which means education system is not just going to be let run wild with 0 structure which ancaps may not like still but the choice is not up to them at the moment",
                    "score": 8,
                    "replies": [
                        {
                            "author": "DMBFFF",
                            "body": "The states shouldn't be managing education either.\n\nEducation should be totally, or near totally, private and unregulated, and that's assuming children should be legally forced to go to school in the first place—which they shouldn't.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "LordXenu12",
                            "body": "So he wants to let states decide whether our broken system actively perpetuates economic stratification \n\nI’m all for breaking up power and dividing to states, Especially if it leads to a further discrepancy between red and blue states that leads to blue states halting funding for red states. \n\nI just think it’s poorly executed and will lead to tons of negative nonsense that will be way worse than it needs to be.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gatornatortater",
                    "body": "Where's the correlation there?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "not_slaw_kid",
            "body": "Trumpertarians will be chortling all the way into their graves as the stock market continues to seize itself to death because the world's most powerful manchild (who they helped get into power) won't stop edging economy-wrecking tariff nonsense",
            "score": -19,
            "replies": [
                {
                    "author": "blackie___chan",
                    "body": "The only edging that is going on is the wad I'm going to blow at the next Trump afuera.\n\n![gif](giphy|7FyMQm2vBiTjG|downsized)",
                    "score": 11,
                    "replies": [
                        {
                            "author": "not_slaw_kid",
                            "body": "The next afuera will be 20% of the workforce straight into Guantanamo Bay",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BrooklynRedLeg",
                    "body": "Ah yes, the 'Stock Market is the Economy' fuckwits. God you people are something else.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "CloudMuseum",
                    "body": "Agreed. I’m lost at how trade protectionism is celebrated in an anarcho_capitalist sub. Some real dumb shits worshipping oligarchs. 🤷‍♂️",
                    "score": -2,
                    "replies": [
                        {
                            "author": "DMBFFF",
                            "body": "First impose lots of tariffs, and then get rid of income taxes, at least Federal ones.\n\nIt's not like the Democrats will win in the Mid-terms and keep both the tariffs and income taxes.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DEPMAG",
            "body": "Only smooth brain morons vote republikkkan",
            "score": -1,
            "replies": []
        }
    ]
}