{
    "title": "California Secession Would be Great for the Rest of America",
    "author": "AbolishtheDraft",
    "subreddit": "Anarcho_Capitalism",
    "rank": 464,
    "score": 17,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.youtube.com/watch?v=vXoQH-FUdiU",
    "id": "1iic4vm",
    "selftext": "",
    "comments": [
        {
            "author": "bongobutt",
            "body": "Minor correction to the video: California succession is unlikely to mean residents are no longer citizens - unless a significant campaign is undertaken specifically for that cause. US Federal citizenship is very difficult to revoke. Even expats that leave the US for foreign states are still considered citizens, can still collect federal benefits, and are expected to pay taxes (the ones that apply, anyway, which is too many). A citizen needs to apply directly to have their citizenship revoked, and it isn't a simple process at all. And that is in the case where someone *wants* to revoke their citizenship. Adding a political element is likely to make that more complicated.  \n  \nHistory gives us an analogous example of what we might expect: even after US independence, Britain still considered US individuals to be part of the British empire, and conscripted them - expecting them to conform to British law. These events led to the War of 1812, where the US states needed to assert sovereignty over those citizens where conflict of \"which rules apply\" became relevant. But what if there is no conflict? What if it is entirely possible to follow both rules of \"citizenship\" simultaneously? In those cases, conflict is unlikely, and inertia takes over. So unless California itself pushes strongly for full expat status (and the revocation of citizenship), it wouldn't happen naturally. And even then, if a Californian citizen doesn't want to give up US citizenship status, the US Feds are probably going to side with the the citizens - not the state of California. If there is motivation on the Federal side to revoke the citizenship of all Californians, a similar debacle is likely - with full revocation being politically unlikely, and with the courts likely siding with the citizens that want to remain citizens.  \n  \nHowever, the long term effects might remain the same. Once California secedes, birthright citizenship is an open question. It is possible that California could be treated as Federal territory like Guam or Puerto Rico, thus letting Californians migrate to another US state with full citizenship. Or perhaps not. But in any case, Californians likely won't be able to vote in federal elections without transferring residency/state citizenship to another state. In the short term, a Californian is likely to still be able to collect Social Security, but a future Californian might not (if their state doesn't pay into Social Security anymore). Citizens won't lose benefits they already qualified for, but future qualifications for those benefits will likely drop off naturally. That is, unless there is a significant legislative push to the contrary, but I don't know where the motivation for a deviation from the standard expat treatment we have right now would come from. Politics tends to just follow inertia, and politicians don't usually go out of their way to solve problems proactively without some benefit or incentive involved.  \n  \nAgain, these comments are minor. I agree with most of what he said.",
            "score": 1,
            "replies": [
                {
                    "author": "ElderberryPi",
                    "body": "Succession is what happens in monarchy when the king dies.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bongobutt",
                            "body": "Correct. ~~Succession~~ ❌ -> Secession ✅. My proofreading is terrible. I caught my mistakes a couple times, but definitely missed that one.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TrueNova332",
                    "body": "Revocation of US citizenship is actually rather simple I looked it up and it said to revoke your citizenship you just need to verbally do so in front of a US diplomatic officer which is Secretary of State and anyone under them",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}