{
    "title": "Action, reaction... deep cuts to CIA and euthanizing USAID in rapid order is going to piss off a few too many of the people one doesn't want to piss off.",
    "author": "HarambeWasTheTrigger",
    "subreddit": "Anarcho_Capitalism",
    "rank": 496,
    "score": 0,
    "upvote_ratio": 0.2,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iicuwq/action_reaction_deep_cuts_to_cia_and_euthanizing/",
    "id": "1iicuwq",
    "selftext": "I'm all for deep cuts anywhere and everywhere, and in many cases acknowledge those cuts will impact people and their families adversely. But 30 days notice for USAID staff to pack their shit and leave is too fucking far, at least for staffers with kids and/or those that have been living on assignment abroad for years. It's going to piss off a lot of them, some of which either hold the keys to some important shit or are friends with the people that do.\n\nGut the chaff agencies, but don't fuck over the people that have kept the lights on.\n\n",
    "comments": [
        {
            "author": "Iminicus",
            "body": "My work can terminate my employment without notice. Why do Federal employees get 30 days notice?",
            "score": 22,
            "replies": [
                {
                    "author": "I_Never_Use_Slash_S",
                    "body": "Maybe you should get 30 days notice?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Mountain_Employee_11",
                            "body": "so i can have 30 days to fuck shit up before i go?",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "deefop",
            "body": "Good, I like when the shittiest people in existence are pissed off.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Lostinthesauce1999",
            "body": "They are getting 8 months pay",
            "score": 12,
            "replies": []
        },
        {
            "author": "Mountain_Employee_11",
            "body": "they knew what they were doing was fucked. you pay the price for selling your soul evrntually",
            "score": 10,
            "replies": []
        },
        {
            "author": "Jww187",
            "body": "Yeah someone might try another assassination, get caught, and make their cause look like a bunch of greedy violent radicals.",
            "score": 6,
            "replies": []
        },
        {
            "author": "odinsbois",
            "body": "Bro, I live in Texas, we get 2 seconds to pack our shit and get out. 30 days is plenty.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Anen-o-me",
            "body": "Fuck em.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Level82",
            "body": "Somewhat of an odd post for an 'ancap' subreddit....",
            "score": 4,
            "replies": []
        },
        {
            "author": "mrpenguin_86",
            "body": "If you're a corrupt organization that funnels money to rig elections in other countries, you're lucky your employees get 30 days instead of 30 years if you catch my drift.",
            "score": 4,
            "replies": []
        },
        {
            "author": "CakeOnSight",
            "body": "Get a real job",
            "score": 3,
            "replies": []
        },
        {
            "author": "GoogleFiDelio",
            "body": "I don't care that parasites that have been using taxpayer money to overthrow governments and spread Marxism are inconvenienced. They can learn to code.",
            "score": 3,
            "replies": []
        },
        {
            "author": "thermionicvalve2020",
            "body": "Casta a la vista, baby. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "jmmgo",
            "body": "You should wait for the response when they (hopefully) abolish social security and medicare.",
            "score": 1,
            "replies": []
        }
    ]
}