{
    "title": "A reminder of what we're up against",
    "author": "tocano",
    "subreddit": "Anarcho_Capitalism",
    "rank": 443,
    "score": 96,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1ij6n6t/a_reminder_of_what_were_up_against/",
    "id": "1ij6n6t",
    "selftext": "Recent post in an education sub asking why some people want the federal DOEducation dissolved. I'm not going to link it to avoid brigading accusations, but good lord the comments there are a stark reminder of how far we have to go.\n\nScores of comments about how it's all because people wanting the DoEd eliminated are \"brainwashed\" \"morons\" \"evil\" \"want poor kids to stay poor\" \"rich people want more money\" \"privatize everything so that they can take more of your money and keep people dumb and poor\" and my favorite \"they want control so their kids don't have to learn about the sins of this country and about POC and LGBTQIA+ individuals\" \n\nIt's astounding the wildly superficial level of thought that goes into rebuttals. ",
    "comments": [
        {
            "author": "matadorobex",
            "body": "The populace overwhelmingly voted for Trump. If the masses are brainwashed, poorly educated idiots, shouldn't the left question the efficacy of the Dept of Education that produced them?",
            "score": 60,
            "replies": [
                {
                    "author": "xPofsx",
                    "body": "This is my favorite take now.   Exactly right! If there's a majority of brainwashed idiots, they came from a system that's not working, or in other words the one that they're defending.\n\n\nThe direct conclusion following their logic is that the DOE just produced a country full of Nazis",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "denzien",
                    "body": "Were those same masses 'poorly educated' when they overwhelmingly voted Democrat for decades?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "EconGuy82",
                    "body": "That’s just evidence that we don’t have ENOUGH Department of Education funding! If only there were more, people wouldn’t be as dumb.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Will-Forget-Password",
                    "body": ">The populace overwhelmingly voted for Trump.\n\nYou are wrong and part of the problem.",
                    "score": -13,
                    "replies": [
                        {
                            "author": "matadorobex",
                            "body": "Trump won the popular vote and the electoral college, with most states shifting right. This was a decisive victory for Trump, and his agenda. These are indisputable facts.\n\nTo be clear, I've voted against Trump three times, but can still observe what happened in Nov.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Will-Forget-Password",
                                    "body": ">Trump won the popular vote and the electoral college, with most states shifting right. This was a decisive victory for Trump, and his agenda. These are indisputable facts.\n\nNow let us compare that to what you actually said:\n\n>The populace overwhelmingly voted for Trump.\n\nTrump was actually elected with a minority of the populace vote. The populace includes all Trump voters, all Harris voters, all third-party voters, and all non-voters.",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "author": "Pass_The_Salt_",
                                            "body": "It seems like you are using semantics to split hairs. By not voting doesn’t that imply someone is opting to remove themselves from the voting populace? \n\nAnd actually the word used was populace not voting populace so what about kids, are they not part of the populace? The majority of people who voted, voted for Trump. Therefore the majority of the populace voted for trump.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Will-Forget-Password",
                                                    "body": ">the ~~voting~~ populace\n\nStop moving the goal posts. \n\n>so what about kids, are they not part of the populace?\n\nThey would fall under the category \"all non-voters\".\n\n>It seems like you are using semantics to split hairs.\n\nIt is actually a big deal. The results of the votes affect everyone. Even those that were not allowed to vote. \n\nIt also highlights a major conflict within our democracy. Some one will always be elected. If 99% of the people do not vote at all, some one will still be elected. \n\nNow, in relation to Trump. He does not have a majority in popularity. He got less than 50% of the total possible votes.",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "clshifter",
                                                            "body": "> Some one will always be elected.\n\nYou just hit on the solution\n\nNONE OF THE ABOVE FOR PRESIDENT 2028.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Will-Forget-Password",
                                                                    "body": "Preach!\n\nNot just for president either. Every got dang position.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "denzien",
                                            "body": "lol ... you're including non-voters to claim lower than a 49.8% popular vote in an election with the second largest voter turnout since 1960. That is the dumbest thing I've seen today, but I guess there's still time for a response.\n\nEvery demographic and almost every single county shifted red even if the county stayed blue.\n\nI would call that an overwhelming shift.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Will-Forget-Password",
                                                    "body": ">lol ... you're including non-voters to claim lower than a 49.8% popular vote\n\nCtrl + F \"popular vote\"\n\nIt would be nice if you stopped trying to put words in my mouth.\n\n>I would call that an overwhelming shift.\n\nWell good for you. Holler at me if you feel like getting back on topic.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "matadorobex",
                                            "body": "Actually, fair point. I should have said voting populace, which is less than the total population. You are correct.\n\nI was initially not counting those indifferent to the political process, nor the handful of conscientious objectors that exist, despite my frequent alignment to that latter group. \n\nAs defense for my oversight, my only justification is to point out that I too was educated by the Department of Education, providing one more reason to dismantle the bloated, authoritarian, ineffective mess.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Will-Forget-Password",
                                                    "body": ">I should have said voting populace, which is less than the total population.\n\nDo you have a link to your data we could see?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ExcitementBetter5485",
                            "body": "I don't know why this is downvoted, it's not at all semantics, it's the damned truth and one of the biggest problems with democracy. The populace overwhelmingly did *not* vote for our current president, nor the previous presidents. And that can even be applied strictly to the populace that's eligible to vote. Democracy is not ancap.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Will-Forget-Password",
                                    "body": "To be fair, I took a while to actually realize what is happening. At first, I did not even realize there are alternative methods of democracy. \n\nThe catalysts for me were the LNC and my state ballot. \n\nAt the LNC, they have the ability to vote for \"none of the above\". That solves the lesser of two evils problem. \n\nOn my state ballot, there were multiple positions that had only one candidate. Then the thought came to me, these people are almost guaranteed to be elected regardless of how many votes they receive.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "denzien",
                                    "body": "It would have been if we had RCV or Approval Voting",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "shizukana_otoko",
            "body": "The Constitution does not give the federal government power to be involved in education. The creation of the DOE is in direct conflict with the Constitution. It, along with a multitude of other federal departments, should not exist. \n\nBut they do, and this is one of my arguments, as an ancap, against government. Even if you put it in stone what any government is or is not allowed to do, government will always find a way get bigger, be more intrusive, and take as much money and liberty from you as possible.",
            "score": 50,
            "replies": [
                {
                    "author": "crinkneck",
                    "body": "Not only is it unconstitutional, there is no empirical evidence it’s beneficial whatsoever.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "AToastyDolphin",
                    "body": "From a leftist point of view, absolutely everything is covered in the commerce clause.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "shizukana_otoko",
                            "body": "And there stands the problem with the leftist view - they will use any means necessary to do what they want, regardless of the plain language of the Constitution. Don’t get me wrong, the right does it too, just not as much and a little slower. Which is another proof of the argument against the premise that a Constitution and government can be trusted.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "denzien",
                                    "body": "I live how their 14th Amendment arguments are to go look at the historical use of language, which I agree with, but they toss out historical use of language when it comes to Amendments they don't like.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Intelligent-End7336",
                            "body": "That points out a big issue with the idea of the constitution.  I think the idea of the court system was elevated to such an extent, miniature gods in black robes, they didn't fear enough the role of activist judges to circumvent procedure of changing the rule of law through constitutional amendments.  A government that can reinterpret its own limits is effectively limitless.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "tocano",
                            "body": "Filburn v Wickard",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NonPartisanFinance",
            "body": "These arguments are the logical equivalent as forcing people to run their air conditioner all day everyday to reduce global warming.\n\nbUt It MaKeS iT cOlDeR.",
            "score": 20,
            "replies": []
        },
        {
            "author": "clshifter",
            "body": "I believe it would be enlightening to ask these people two questions:\n\n1) How many teachers are employed by the Federal DOE?\n\n2) In what year was the Federal DOE established?",
            "score": 6,
            "replies": []
        },
        {
            "author": "elcalrissian",
            "body": "This is a theory sub, not an actual political movement. \n\nMaga will still use a centralized bureaucracy to fun education, and like the statists they are, they'll force selected curriculum at their choosing. \n\nSame old system, just new leaders",
            "score": 13,
            "replies": []
        },
        {
            "author": "Barskor1",
            "body": "USA 1 in spending per student dead last in results per student in the whole world yeah sink that in really deep when you have people begging to keep the DOE as is.",
            "score": 5,
            "replies": [
                {
                    "author": "tocano",
                    "body": "Where do you get dead last from? I know it's lousy, but I don't know about dead last. There are countries with virtually no educational infrastructure.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Barskor1",
                            "body": "When you have college students who can not read or do basic maths you tell me what that is.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "xPofsx",
                                    "body": "Illiteracy is definitely not even close to common.  It's not even uncommon.   It's more like poor reading comprehension and slow reading.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "tocano",
                                            "body": "Technically true, but current estimates say around 1/5 qualify as illiterate, but even more starkly, of those that can read, over half of adults read at below a 6th grade level. So maybe not \"illiterate\" but mass \"underliteracy\".",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "flamingspew",
                                                    "body": "Meh. Once we abolish grade levels, this isn’t a problem.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "tocano",
                                                            "body": "Heh... Then it just becomes \"Reading below a 12yo level.\" which isn't much better.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Barskor1",
                                            "body": "..........ok...........lol",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "thermionicvalve2020",
                                            "body": "So low/functional illteracy.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "WishCapable3131",
            "body": "Do you have a counter argument to the ones you posted?",
            "score": 3,
            "replies": [
                {
                    "author": "tocano",
                    "body": "Besides the utter failure of the current DofEd to actually improve achievement? We're at literacy rates that haven't been seen since the 1800s. And it sure as hell isn't the result of \"lack of funding\" as we spend more(in real terms) per student now than ever before. \n\n10s of millions of Americans have been waking up to the failure of current public education and the use of the old Prussian model not to actually educate, but to indoctrinate. Many are pushing for school choice measures to make it easier to take their children to the schools they prefer and the federal DoEd has voiced opposition to such moves. \n\nAnd all the nonsense that people only want to end the DofEd because they want a stupid, poor populace is just cope to make themselves feel better and morally superior.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "tocano",
                                    "body": "Part of the issue is that the DoEd is using federal purse strings to create conformity. And while standards of achievement are good, they should be private. And how the school attempts to meet those achievements is allowed to be flexible and different. Not through strict conformity with a single model that must be followed or else.\n\nThe way this often works is they will issue a new program goal like having an onsite social worker (social workers being leftist political activists) in all schools. They will then issue significant grants either to schools or to the state (especially if the state makes it mandatory across all schools in the state) who conform with this guideline. After many schools follow the guideline, the state will make it requisite for some other benefit before eventually making it mandatory. \n\nOver time, we've seen this slow creep of increased requirements for various assistants, counselors, speech, IEP coaches, ENL translators, life coaches, etc. There has been an explosion in \"Administrators\" in relation to teachers. Meanwhile neither teacher pay nor student outcomes have improved.\n\nLarry Sharpe in NY talks about how there are schools where just to meet the basic requirements mandated by the Feds for the state to continue getting federal dollars, the school is starting their budget process already in the red, with no money for any local endeavors. Everything they want to accomplish, from gym equipment to building expansion to whatever, must be applied for govt grants to accomplish.\n\nLarry's goal as part of running for governor was to stop taking federal $$ so that they could drop the federal requirements and allow local schools to adapt and handle local needs better. \n\nCorey DeAngelis is one to follow on twitter to better understand the reason why so many hate public schools in general and federal DoEd specifically.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "tocano",
                                                    "body": "It's not ALL they do. They also do things like enforce TitleIX - which was fine until it was recenly weaponized to push that schools allow biological males to compete in women's sports AS WOMEN. \n\nPrivate orgs can establish standards like you're describing. \n\nI don't know what \"anti-US material\" means and would be hesitant to try to implement something as it could easily be used to restrict teaching of legitimate abuses of govt.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "tocano",
                                                                    "body": "Why would it take a huge budget? There are private educational orgs out there now that set educational standards, especially for private and home school situations. And standardized tests like SAT and many praxis and others are predominantly private in nature. Just like anything else in private, you can charge for providing a good service. \n\nOk, I see what you mean by anti-US now. Still, I'd avoid it. Too much ability for subjective manipulation.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WishCapable3131",
                            "body": "Does it make people feel morally superior to say we shouldnt have a stupid poor populace? I think thats more like common sense. Public schools do educate, thats a fact. Of course we can talk about the degree of education, but to say public schools dont educate is patently false. If you want to send your child to a private school you are free to do that. But you shouldnt be able to use my tax dollars to fund that decision. I dont want my tax dollars going to a private for profit education company.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "VodkaToxic",
                                    "body": "I don't want my tax dollars to fund a broken public education system.\n\nHow about we abolish the whole thing, keep our money, and use it as we see fit?  Maybe you could even find a non-profit education center.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "WishCapable3131",
                                            "body": "No. I want to maximize freedom. Being able to attend school regardless of ability to pay maximizes freedom.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CakeOnSight",
            "body": "people are dumb and poor now",
            "score": 1,
            "replies": []
        },
        {
            "author": "prometheus_winced",
            "body": "Just compare education standards and outcomes before and after formation of the DoEd.",
            "score": 1,
            "replies": []
        }
    ]
}