{
    "title": "Time to troll the commie Republicans again",
    "author": "CarPatient",
    "subreddit": "Anarcho_Capitalism",
    "rank": 442,
    "score": 147,
    "upvote_ratio": 0.64,
    "num_comments (reported by reddit)": 129,
    "url": "https://www.reddit.com/gallery/1ijb6yi",
    "id": "1ijb6yi",
    "selftext": "",
    "comments": [
        {
            "author": "Alternative-Dream-61",
            "body": "Tell me again how the sovereign wealth fund isn't a command economy.  Or how farmers collecting subsidies aren't welfare.",
            "score": 123,
            "replies": [
                {
                    "author": "None",
                    "body": "I cannot. Because it is and they are",
                    "score": 65,
                    "replies": []
                },
                {
                    "author": "MarvLovesBlueStar",
                    "body": "Of course there won’t be a sovereign wealth fund. The left would raid it the first chance they had. Trump will know this.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "CarPatient",
                    "body": "What is a bigger welfare payment.. farmers or the police force?\n\nOr teachers?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Does it matter which form of theft is the biggest?",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "upchuk13",
                                    "body": "Well  ... yes",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "I guess if I was held at gun point I would prefer the thief that stole less?  But I would treat them the same if I found them later",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Alternative-Dream-61",
                            "body": "There are things I ideologically disagree with but pragmatically accept to have a functioning society.\n\nWhat I can't stand is the hypocrisy of lamenting socialism or single payer healthcare or any other policy that could benefit the \"average\" person but then cheering on the Republican Party as we usher in corporate socialism and wanting to buy a social media platform (state sponsored media YAY!).",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CarPatient",
                    "body": "![gif](giphy|CV61LRKyQf6P6)",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "EdyTheReddit",
                    "body": "Hi,  as a socialist who stumbled upon this sub, I will tell you why it's not socialism (also, you guys have interesting thoughts on shit, open borders, but no welfare, it's like you randomly mixed and matched parts of the political compass)\n\nSocialism (as envisioned by Marx, specifically) means that the workers, or proletariat, control the factory (for example) and get paid according to what they produce. For example,  if you mine 3 kilos of coal and sell them for 30 bucks, you get paid 30 bucks (obviously this wouldn't happen bcs you'd also have to pay for running the mine and for the equipment along with your coworkers,  but that's the main idea)\n\nLenin theorised that since the government works for the people and they get to vote who represents them, the means of production are controlled by the people through the government.  Lenin then died and Stalin centralised a lot of power into his position. Either way, comand economy means that the government owns the factories and gets to decide what they make and how they operate\n\nThis is a very rudimentary explanation and I don't expect anyone here to agree with me or change their mind, I wrote this solely cuz I was bored.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "old_guy_AnCap",
                            "body": "It's not pick and choose. It's principles based on the primacy of the individual and voluntary association.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "SpikeyOps",
                            "body": "You can have that exact company structure in a capitalist economy. No law prevents workers shared ownership of companies.\n\nVery few companies are organised that way. Even less so among the most successful companies in the world. That is because they don’t work as well as the companies that have a different incentive structure.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "> Very few companies are organised that way.\n\nActually, [*lots* of companies are employee-owned](https://www.esop.org/maps/esop-map-us-industry.php).  It's not an uncommon thing at all.  It's quite viable in stable industries with consistent demand and which don't require large influxes of external capital.  \n\n\nIt would be very difficult for entrepreneurship to take place, or for new and untested ideas to be tried in the market, if employee ownership were the *only* option.  But it's certainly viable alongside other ownership structures like in a pluralistic economy.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ILikeBumblebees",
                            "body": "> , open borders, but no welfare, it's like you randomly mixed and matched parts of the political compass\n\nMore like we unscrambled your political compass and put ideologically consistent policies back together with each other.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Renkij",
                    "body": "Tell me how is it fair to our farmers to allow in to our markets food that is not grown under the same regulations we have here.\n\nminimum wages, animal ethical treatment and slaughter, banning the use of certain pesticides and fertilizers...\n\nFarmer subsidies are a socialist patch to a socialist created problem.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Alternative-Dream-61",
                            "body": "So socialism is ok if it's to fix a problem socialism created?\n\nAlternative option - we get rid of the regulations (you're in Ancapistan, this is always the solution) that make it unfair and them unable to compete rather than paying them?",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "xetgx",
                            "body": "I don’t understand how you can make your argument and not come to the conclusion that the problem is regulations.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Renkij",
                                    "body": "The problem are regulations, it's fucking obvious. But guess what? Maybe tearing them all down from the start is not a good thing and you need to be careful about what when and how you take things down.\n\nFor example:\n\nAll of this has to be taken out:\n\n* minimum wages\n* animal ethical treatment and slaughter\n* banning the use of certain pesticides and fertilizers\n\nBefore you start thinking about taking this out.\n\n* Farmer subsidies\n* Tariffs on foreign produce",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "xetgx",
                                            "body": "That’s like saying we need to consider the economic wellness of southern plantation owners before ending slavery.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Crauchs",
                                                    "body": "Ever hear of learning what a fence is guarding against before tearing it down? Closer example would be, maybe we should consider the cultural ramifications of invading the south before we do so and lie about it being for slavery later.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "upchuk13",
                            "body": "But it's the consumers who choose to buy food that doesn't meet these guidelines. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TradBeef",
            "body": "Absolutely. Republicans and anarchists have things in common the way you might with siblings. Don’t get into bed with your sister.",
            "score": 49,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "Reddit never fails to deliver that one excellent piece of wisdom",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "TehM0C",
                    "body": "The pro life advice is always in the comments.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "crankbird",
            "body": "Shouts “You’re all a bunch of socialists”, \n\nrefuses to elaborate, \n\nleaves room.",
            "score": 31,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "I’ll elaborate for as long as you care to engage.\n\nDid you know that Milton Friedman was called out in this exact same way?\n\nhttps://reason.com/2018/09/08/youre-all-a-bunch-of-socialist/\n\nBonus points if you can identify the logical fallacy",
                    "score": 3,
                    "replies": [
                        {
                            "author": "crankbird",
                            "body": "I was thinking to that meeting when I made my post, by likening you to Mises, it was intended to be a mildly humorous complement and puts the republicans in the same camp as Friedman where they probably feel relatively comfortable \n\nPersonally I think it’s funny, if that’s not how it came across, I apologise for my clumsiness",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "CarPatient",
                                    "body": "Keep up the good work brother.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "blackie___chan",
            "body": "How Republicans fix problems when the government gets bigger\n\nhttps://preview.redd.it/t7wn9f1m0lhe1.jpeg?width=755&format=pjpg&auto=webp&s=52745c8e1b7677ab3f23da9b5b99b722cce0c9ed",
            "score": 22,
            "replies": [
                {
                    "author": "rushedone",
                    "body": "Literally this, lol.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "E: Create a taxpayer-funded National Punctuation Reserve to subsidize proper sentence construction.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Click_My_Username",
            "body": "I love Republicans telling me how bad socialism is whilst cashing in social security checks and going to a casino every weekend and then complaining that they won't survive without them checks. \n\n\n\"I paid into that system!\"\n\n\nYeah, and now we're paying for your decrepit ass to live past your due date. If you want handouts, maybe you should focus on being decent to your family.",
            "score": 21,
            "replies": [
                {
                    "author": "oceanofice",
                    "body": "Conservatives are honest about their support for socialism when it comes to education, healthcare, roads, police, and infrastructure.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "MindOverManner69",
                            "body": "> Conservatives are honest\n\nNot intellectually... lol",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "A7omicDog",
                    "body": "Your response would make sense if SS were voluntary.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "GunkSlinger",
                    "body": "I've been saying to them for years that you can't hope to fight socialism if you're afraid to live without it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "keeleon",
                    "body": "Once again, socialists refusing to understand \"consent\".",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheRealStepBot",
            "body": "Finally some good content!!!",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "Maybe instead of spending a fortune on anti-immigration we could cut welfare payouts. Then the only people that will come here are hard workers. And if you can’t compete with someone from a third world country that doesn’t speak English… well then I guess you aren’t very good at your job. ",
            "score": 29,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "Maybe instead of stealing and spending money to try and solve your problems with aggression we could try using more freedom instead...",
                    "score": 12,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Right now it’s either use my money to forcibly remove them or use my money to house and feed them. Why not just not use my money. And let them make their own way?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "CarPatient",
                                    "body": "That’s the first violation of trying to protect the people by stealing their money. \nHow’s that working out for you?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Never met anyone that thinks their tax dollars are being spent well. And yet they still want more for some reason. ",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "CarPatient",
                                                    "body": "Tanstaafl",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CarPatient",
                                                            "body": "https://preview.redd.it/w8qera37mohe1.jpeg?width=760&format=pjpg&auto=webp&s=1cdcc0f547cf7b82be9fece6c1b4c6858d80d029",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Alternative-Dream-61",
                    "body": "Nah, they need the immigration boogeyman.  We need to feel better than the \"other\" and like the \"other\" is the one causing all the issues.  Plus thanks to all the immigrants we will lock up the private prison system will have a massive work force AND get plenty of tax payer dollars for housing them.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "tucketnucket",
                    "body": "Or you're adapted to living at a standard above absolute squalor. I'd prefer the American dream not be \"I hope to co-own a home that me, my family, my two siblings, and their families live in\". \n\nIt's not about the skill. No one is worried that some third-worlders are better workers than them. They're worried that no matter how good they are, they can't put out as much productivity as 3 shittier employees.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "I am not worried about that.  I could see your point if you are in a labor job. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "tucketnucket",
                                    "body": "It applies to every damn job except for maybe doctors and lawyers. I know it applies to engineers.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GreyGreatAuk",
                    "body": ">Then the only people that will come here are hard workers.\n\n\nright",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Ok wishful thinking but whether they are taken care of by a private charity or they starve to death as long as it doesn’t cost me anything I don’t really care",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "trufin2038",
                                    "body": "You do pay for their housing, cell phone, medical care, food, legal defense when they commit crimes, and even pocket money for drugs and such. \n\n\nDon't be a \"commie\" according to op, fork over your income to the greater good.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "mr-logician",
                                            "body": "1. Prisons don’t have to be funded by the taxpayer. Instead, they can be funded through prison labor. The 13th amendment explicitly allows this.\n\n2. Immigrants tend to commit less crime than citizens, and not more.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "So wait, you want more slaves for the state?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "GreyGreatAuk",
                                                            "body": "Such is the AnCap logic.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "mr-logician",
                                                            "body": "No. I’m just saying that the prisons can fund themselves without taxpayer money, and I am also saying that migrants commit less crime (which means overall incarceration rates should actually decrease with migration).",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "GreyGreatAuk",
                                                                    "body": "lol, no they don't.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mr-logician",
                                                                            "body": "https://news.northwestern.edu/stories/2024/03/immigrants-are-significantly-less-likely-to-commit-crimes-than-the-us-born/\n\nhttps://www.migrationpolicy.org/content/immigrants-and-crime",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "> Maybe instead of spending a fortune on anti-immigration we could cut welfare payouts. \n\nImmigrants, even legal ones, are already ineligible for pretty much all federal welfare programs, so there's not much to do here.  The whole \"we can't have open immigration because of the welfare state\" argument that keeps getting circulated is basically a hoax.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TehM0C",
                    "body": "Unfortunately bad actors exist.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CarPatient",
                            "body": "Always will.. that is why people should have guns... And why you should't trust politicians and police.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DrHavoc49",
                    "body": "May I introduced you in some Hoppe?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Duckdodger89",
            "body": "This is the kind of post that got me perma banned from r/libertarian 🤣. There’s a ton of Republicans cosplaying as Libertarians and Anarchists there",
            "score": 14,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "I got banned from /r/libertarian (after posting there for nearly 15 years) because I argued against government censorship.  Welcome to the club.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impressive-Door3726",
            "body": "About time that we fight back. This is our sub, not theirs!",
            "score": 28,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "https://preview.redd.it/k1vre72apkhe1.jpeg?width=225&format=pjpg&auto=webp&s=b181b2e703a85377e7202c84215f9f894e288812",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "blackie___chan",
            "body": "They never follow through because they don't want to reduce government, they just want to use it \"better\".\n\nhttps://preview.redd.it/riksv461zkhe1.jpeg?width=840&format=pjpg&auto=webp&s=c58690a5c0ab0c1809897774732be938058d25ae",
            "score": 11,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "Gonna tax me some memes today.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "PM_ME_DNA",
            "body": "Thank fuck. I understand the pragmatic case however this place is filled with people with zero interest in AnCapistan.",
            "score": 15,
            "replies": [
                {
                    "author": "Nathmikt",
                    "body": "Seeing Ancapistan brought back into public discourse takes me back to 2015.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EconGuy82",
            "body": "> We can’t have a welfare state and open borders at the same time. \n\nI see this argument all the time to defend closing down the border. Why? There are two policy options there. Why do you advocate for closing the border and not for ending the welfare state?",
            "score": 7,
            "replies": [
                {
                    "author": "keeleon",
                    "body": "Because some people believe in helping their fellow countrymen but not being sucked dry by a foreign entity with no shared culture or morality.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "EconGuy82",
                            "body": "The lack of a forced welfare system does not prohibit it you from helping your fellow countrymen.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "keeleon",
                                    "body": "It also doesn't prohibit you from voting as a community to pool together resources to complete projects larger than any individual would be capable of.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "That's true.  People can and do found both commercial businesses and non-profit organizations all the time, precisely to do those kinds of things.\n\nWhere does state intervention factor into that, though?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "EconGuy82",
                                            "body": "Voting is both unethical and for losers.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "not-a-deer",
                                                    "body": "Mega based",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "F1shbu1B",
            "body": "I like #3. Thinking about rolling a blunt for the first time since I was in college.",
            "score": 3,
            "replies": []
        },
        {
            "author": "welcomeToAncapistan",
            "body": "On the Simpson meme I disagree: for the most part the Democrats haven't realized either.",
            "score": 3,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "Democrats haven’t realized that they’re socialist?\n\nMean the government is getting exactly the education it wants for its people and that means compliance…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ClydeMason1911",
            "body": "Not my slave labor!!! 😱",
            "score": 7,
            "replies": []
        },
        {
            "author": "hazael10",
            "body": "woah man, that post is gonna offend some MAGAturds in this sub",
            "score": 12,
            "replies": [
                {
                    "author": "Vinylware",
                    "body": "Good.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "CarPatient",
                            "body": "![gif](giphy|NJlMya8d3RNCw)",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mahwahhfe",
            "body": "First one kinda slaps ngl",
            "score": 7,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "Any rand quote something something contradictions",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 5,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "We don't want it to be perfect. we want people just free to choose.\n\nwe're not saying you can't have your state, we are just saying you shouldn't be forcing people to participate and contribute\n\nhttps://preview.redd.it/bbq68sji7lhe1.jpeg?width=609&format=pjpg&auto=webp&s=3fd84fb08d02c1e21b13791fd51613f851369163\n\n...",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "RonaldoLibertad",
            "body": "Let the butthurt begin.",
            "score": 3,
            "replies": []
        },
        {
            "author": "EconGuy82",
            "body": "If those Republicans could read, they’d be very upset.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Renkij",
            "body": "Yeah, because there is no difference between:\n\n* understanding the US public land as collective property and the US government as a very flawed administration of said property\n* having someone literally own YOU as property.\n\nAs a Spaniard you guys complaining about corruption sound like spoiled brats. You guys don't know real corruption. You guys don't know what is to not have separation of powers and real representation.\n\nYou know you can have everyday doctors taking down presidential executive orders about vaccine mandates in hospitals in court?\n\nOver here the president makes that shit into LAW, not an executive order, a fucking LAW. And you cannot throw it back in court, you need a political party to give enough of a fuck and do it for you in a special court that only political parties can appeal to.\n\nAnd even if the government did something bad like ordering businesses to shut down without the authority to do so. And even if that court of politician appointed judges with term limits to ensure compliance finds the government in the wrong by the government's own laws. Don't you even dare to get your hopes up, the government ain't paying reparations for forcing you to shut down for months without any authority to do so.",
            "score": 2,
            "replies": [
                {
                    "author": "Manuemax",
                    "body": "Me alegra (y sorprende) encontrar a otro español aquí. Parece que aún queda esperanza para este país\n\nEdit: wtf with the downvotes, is that bad being happy for finding people from my country that think in the same way as we do?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CarPatient",
                            "body": "Primero era Gloria Alvarez, ahora viene Javier Milei, no van a ser los últimos latinos. Aunque el presidente del el salvador es muy duro con la ley, muchos están llegando a ver el valor de la estabilidad.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Manuemax",
                                    "body": "Eso espero, sinceramente, España por ejemplo va cada vez peor, y a saber cuanto tardará en salirnos nuestro propio Milei, y la verdad es que ya nos va haciendo falta un Bukele para acabar con la impunidad de muchos criminales",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Renkij",
                                            "body": "El sistema Español en sí es especialmente hostil a un personaje como Milei, o Trump.\n\nMira Rubén Gisbert o como el PSOE se ha gastado millones en propaganda para hundir quiere que lo conozcas \"el tio que se manchó las rodillas de barro para entrar a un garaje con barro por las rodillas\" lo explica muy bien. No hay un sistema democrático en España, hay un sistema oligárquico que premia la expansión del gasto público mediante la creación de títeres politicos en empresas públicas.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Manuemax",
                                                    "body": "Muy de acuerdo contigo, y el único que realmente ha comprendido esto en la escena pública es Alvise. Podremos pensar mejor o peor de él, pero está convirtiéndose verdaderamente en un problema para el sistema y está (aparentemente) determinado a derrumbarlo. Y la verdad, eso me parece admirable",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "> understanding the US public land as collective property and the US government as a very flawed administration of said property\n\nWhat \"public land\" and \"collective property\" are you talking about?  This is about the government restricting what people may do with their own property.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Renkij",
                            "body": "Yeeaaah, because those ilegal immigrants do not EVER lay foot on public spaces...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HKatzOnline",
            "body": "Sometimes you are stuck voting for the least oppression.",
            "score": 2,
            "replies": [
                {
                    "author": "Intelligent-End7336",
                    "body": "That's why you don't vote.  Then you're not voting for any oppression.\n\nEdit - Weird, trufin2038 blocks me after calling me names.  Statists are crazy",
                    "score": 1,
                    "replies": [
                        {
                            "author": "trufin2038",
                            "body": "Lol, that's how you get the greater evil dumbass.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "HKatzOnline",
                            "body": "No, you just get the one the majority of the rest of the country voted for.\n\n  \n<edit> Sorry, if that was sarcasm, I missed it. </edit>",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Intelligent-End7336",
                                    "body": "You do you, if you want to vote for oppression, have fun",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "HKatzOnline",
                                            "body": "Guess so - I see the comparison posted as voting for getting taxed less and a better quality of life (stopping illegal immigration) vs discrimination supporting someone based upon the color of their skin, sex, or \"gender identity\". \n\nI don't see the two as the same. I see lower taxes as less oppression. I see schools that are not overcrowded, crazy house home prices and the like as less oppression. It is voting for lowering the oppression as I am not oppressed by illegal immigration.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dja303",
            "body": "The border question disappears under anarcho-capitalism, as everything is managed by private property.\n\n*however*, it's worth pointing out that under a system of private property, you would only be able to move into privately owned land with the **express permission** of the landowner... sounds a lot like a closed border now doesn't it?",
            "score": 1,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "> sounds a lot like a closed border now doesn't it?\n\nNo, it doesn't. It sounds like normal private property arrangements, where property owners are making their own decisions without being overruled by a monopolistic institution run by strangers.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CarPatient",
                    "body": "Individual determination would be my preference..... And declining to associate is not aggression.\n\nBesides we are not just talking about borders but also property (meaning equipment) and associations. Means that anyone is free to compete on transportation and employment, as long as it's not aggressive/harmful.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NuccioAfrikanus",
            "body": "Are you actually defending Slavery, Serfdom, Tenant Farming, and other forms of labor that Republicanism opposes as economically harmful to markets?\n\nIs this a shit post? Or are you actually saying it’s communist to end slave trades and human trafficking?",
            "score": 0,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "The majority of \"illegal\" immigrants were not human trafficked, they came here on their own money and at Great personal peril and cost in order to build a better life.\n\n is there human trafficking? yes and it's just like any other black market because these people are \"illegal\". it means that there are fewer recourses for those that are human trafficked \n\nmake it a free market and give those people options.\n\nIf you support the free market economy in everything else, why not labor and movement of people?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "NuccioAfrikanus",
                            "body": ">The majority of “illegal” immigrants were not human trafficked, they came here on their own money and at Great personal peril and cost in order to build a better life.\n\nWe just had the largest human migration event in history over the Biden Administration. Ended up bigger than when Pakistan and India became two separate countries.\n\nYou’re probably technically right now. Not sure that the majority were not trafficked by coyotes pre 2016 though. \n\n>is there human trafficking? yes and it’s just like any other black market because these people are “illegal”. it means that there are fewer recourses for those that are human trafficked\n\nThere are types of trafficking, sex slavery, debt slavery, etc. wide variety of situations here. \n\n>make it a free market and give those people options.\n\nWe can’t have both a welfare state and open borders at the same time. Obviously we all here would like a true libertarian state with open borders. But we need to downsize the state a significant portion to allow open borders again. \n\n>If you support the free market economy in everything else, why not labor and movement of people?\n\nI do, again I don’t support creating a secondary status labor entity that can’t access the police, vote, get protected by local legislation or participate the same as the main labor entity/citizen. \n\nThe Democrats are creating a neo serf class of people with illegals. \n\nIn my ideal state, we would have open borders and becoming a citizen would be as easy as going to the DMV. But we are very far off from that goal and exploiting this labor supply like Democrats have historically exploited slaves and tenant farmers won’t help our goals, it will actually hurt our market and is morally wrong.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "> Not sure that the majority were not trafficked by coyotes pre 2016 though.\n\n\"Coyotes\" are folks who are hired by would-be migrants to help them get across borders.  Some of them may be crooked and take advantage of their clients, but the concept itself should not be conflated with human trafficking.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "NuccioAfrikanus",
                                            "body": "If 86% of the women trafficked from Coyotes in 2015 were raped. Then I and most people would have to disagree.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ByornJaeger",
                            "body": "Because one market cannot support the entire globe.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "CarPatient",
                                    "body": "https://preview.redd.it/uozz8vneamhe1.jpeg?width=664&format=pjpg&auto=webp&s=455cf00257b21d9e9d22fb5719185fe1be2b51cf",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ByornJaeger",
                                            "body": "What does your picture have to do with the discussion?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "CarPatient",
                                                    "body": "The free market isn't one thing. It's people making millions of choices based on their preferences. There is no \"one\" market.\n\nhttps://preview.redd.it/vwqeoe6elohe1.jpeg?width=1280&format=pjpg&auto=webp&s=82c0850e0840709cfb989c3b4e08515f24c7e3a4",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kwanijml",
            "body": "Yooo where'd all you cool people come from and where the fuck have you been for the last 8 years?",
            "score": 1,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "Lost in the wilderness since we got banned from Facebook...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "livinlizard",
            "body": "You pickle-lillies aren't happy with any political party. Being a legislative snob doesn't make you cool.",
            "score": -11,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "I'm not a legislative snob, I'm a moral one.\n\nhttps://preview.redd.it/f71z3b6gnlhe1.jpeg?width=1221&format=pjpg&auto=webp&s=6f34f0285eb403b594142fbb02a405167858e6f5",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "\"Why are all of these vegetarians complaining about the available choices?  We have beef *and* chicken on the menu!\"",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Driftmichael01",
            "body": "As long as their are benefits we need sealed borders",
            "score": 0,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "No, that's not correct.  We can just restrict access to welfare benefits by fresh immigrants, without having to restrict immigration itself.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Driftmichael01",
                            "body": "Until\n\n\n\n\n\n\nUntil all welfare is dead immigration must be kept at 0",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CarPatient",
                    "body": "As long as there is theft to fund those benefits you are working with criminals and an accomplice.\n\nWould it surprise you to find out that benefit are much more economical, plentiful and responsive to market demands when provided under a free market?\n\nhttps://preview.redd.it/b847x1subshe1.jpeg?width=470&format=pjpg&auto=webp&s=c9c847d367f98ca13cc9eefb8bdb4e1d058a6c02",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Drafonni",
            "body": "Have you read Carlyle or Hoppe?",
            "score": -1,
            "replies": [
                {
                    "author": "CarPatient",
                    "body": "Slightly familiar with some of Hoppes ideas.. which book or essays do you recommend?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}