{
    "title": "Every single one of them if it was up to me",
    "author": "Kyle_Rittenhouse_69",
    "subreddit": "Anarcho_Capitalism",
    "rank": 433,
    "score": 1086,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 107,
    "url": "https://i.redd.it/vqi625inolhe1.jpeg",
    "id": "1ijgbya",
    "selftext": "",
    "comments": [
        {
            "author": "Aerith_Gainsborough_",
            "body": "Afuera!",
            "score": 81,
            "replies": [
                {
                    "author": "P1xelEnthusiast",
                    "body": "Reading fednews is like a bedtime story",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "carlosdanger31",
            "body": "When I say burn it to the ground I mean to the fucking GROUND",
            "score": 26,
            "replies": [
                {
                    "author": "StuntsMonkey",
                    "body": "The ground underneath might be contaminated, so I think we need to burn that too",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Anlarb",
                    "body": "If you really wanted to go without, you would have moved to a shithole country instead...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "carlosdanger31",
                            "body": "👍🏽",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Click_My_Username",
            "body": "Remember, these redditors currently freaking out over the audit because it violates privacy didn't say a word about the NSA tracking conversations, they didn't say a word about the TSA molesting people, they didn't say a word about the IRS tracking every transaction you make over 600 dollars.\n\n\nThey did not say a single world when it was government doing the raping of privacy. Because it's not about privacy, it's about communism. They want government at all cost, they are no longer human but rather servants of the never ending bureaucracy. \nThe gape is too far to bridge to reason with these people. No more compromise. Remember these feds are the same people who posed like hunters over their trophy of burned children's bodies at Waco.\n\n\nAudit them all. Fire all these parasites and if they complain kindly remind them that they're lucky they only lost their job and not their heads after what they've done. They are rotten monstrous fucks and it's time we stop pretending they're anything else.",
            "score": 75,
            "replies": [
                {
                    "author": "GoogleFiDelio",
                    "body": "The people losing their lavish funding now never had to worry for a day that they'd lose their jobs during COVID, a crisis they created. \n\nThey profited while normal people suffered.",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "NoTrash202",
                    "body": "Your simple minded and you have no idea of the value that parts of government provide. You think you're the only people that hate the FBI agents for Waco and Ruby ridge? Get a clue. But unlike you most people understand there are parts of the government that provide valuable services. If it goes your way we'll be living in Mexico or one of those Narco South American states soon. Congrats.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Click_My_Username",
                            "body": "One of those south American socialist states? Yeah sure, the problem there is certainly not enough gubment.\n\n\nThe government provides NOTHING of value and only takes from the most productive.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Anlarb",
                    "body": "Yeah we did.\n\nYou need to get your shit together, you just enabled a communist coup, a hundred years ago the soviets dismantled their govt, it did not end well. Right out of the gate, trump is already at war with agriculture, demanding purity tests for loyalty and threatening to send people to gulags for opposing him. Easy mode is over.\n\nhttps://www.youtube.com/watch?v=87KQfyLFhDU",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "MFrancisWrites",
                    "body": "Actually a ton of us did.\n\n>and not their heads\n\nAh, totally not fasicsm. Cool cool cool",
                    "score": -27,
                    "replies": [
                        {
                            "author": "Click_My_Username",
                            "body": "Fascism is when you shrink the power of government.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "thermionicvalve2020",
                                    "body": "Anti-fascists sure do love the state.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "shewel_item",
                                    "body": "no government is like *ultra-fascism* then?\n\nor absolute fascism..?\n\nor perfect fascism..?\n\nor total fascism..?\n\nor complete(d) fascism..?\n\nor ultimate fascism..?\n\ngrand fascism..?\n\nor greatest fascism..?\n\n..level 3 fascism..?\n\nfinal fascism..?\n\napocalyptic fascism..?\n\n\nwhere are we going here?\n\n\nit's like property rights only matter when you believe YOU are the one losing them, and you think YOU are the government, even though you haven't been elected to do shit, get shit or lose shit.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "NoTrash202",
                                    "body": "Fascism is shrinking the state? Omfg no bro. Get a clue.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Click_My_Username",
                                            "body": "Sarcasm.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "seenthevagrant",
                                    "body": "I’m not holding my breath that musk is doing this out of principle. The man is a top receiver of pentagon funds.\n\nUsaid was investigating starlink last year before he donated $250 million to trumps campaign. Tinfoil hat time: usaid also played a big part in ending apartheid in South Africa. Seems like it’s just personal vendetta time for musk.\n\nElon made sure his guy became the head of the Air Force. The guy who made sure space x got all the sweet government contracts to the tune of $10 billion plus.\n\nNow that elon has all the info on treasury payments he knows what all his competitors were receiving and much more. All this info is now on the richest man in the world’s private servers. Hilary was a pos for having classified emails on her own servers so I’m even more pissed that a foreign billionaire now has every Americans private info on their own server. In the age of ai how can this data be used? Will he use it to determine a private list of citizens he targets with technology? I’ve shit talked him for years. \n\nMy x account has already had fuckery since he took over, will my taxes be next? Tinfoil hat time part doux: I did my taxes 5 weeks ago and was supposed to have it direct deposited two weeks ago. Still haven’t got it. It’s not even approved yet. Years past my refund would already have arrived. Am I being fucked with? People have said crazier things with less evidence. \n\nYou may be pumped right now cause Elon is jerking ancaps with all his new found power. What happens when someone you disagree with decides to fuck the constitution and use these same justifications to expand government over reach? This admin is just continuing the new tradition of consolidating power to the president where eventually we will just have a king/emperor at some point. \n\nIn the words of Kanye “no one man should have all that power.”\n\nEdit: correcting billion to million in the Elon donation to Trump campaign.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Click_My_Username",
                                            "body": ">You may be pumped right now cause Elon is jerking ancaps with all his new found power. What happens when someone you disagree with decides to fuck the constitution and use these same justifications to expand government over reach?\n\n\nThey've been doing this for literal decades. If Elon starts doing that I guess we're back to the status quo. Elon isn't the one who made an absolute mockery of our Constitution and the time to talk about checks and balances was in the 1930's when FDR started seizing gold from citizens to fund his welfare programs.\n\n\nI don't care about Elon having that information any more than I care about the FBI or the NSA having it. Infact I'm more content with Elon having it because it's not his sole explicit goal to spy on me. I'm also skeptical of how much information he really has, but if you're gonna audit, then audit.\n\n\nIn short, yeah he could go nuts. But the government IS nuts. If you limits it's scope at all, it's a win.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "seenthevagrant",
                                                    "body": "Yeah fuck the alphabet boys having that info but at the very least there you have to have multiple people decide to do some fuckery with it. Now you have the richest man in the world who has built his empire of being a statist able to be the sole decider on how to use or abuse it. \n\nIt’s a big gamble that one man can hold that power and not abuse it to an extreme we have yet to see",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Numinae",
                                                            "body": "He has no actual power. His power is borrowed from the executive as a consultant. This is really a question of whether you trust Trump or not. The irony here is that it's oligarchs destroying the existing oligarchy. Thankfully Trump and Musk are rich enough to be un-bribeable...",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "seenthevagrant",
                                                                    "body": "He is the world’s richest man. That is serious power on its own and now he has access to the most precious data on earth. All during a time where it’s a race to have the most powerful ai which is only as good as the data its feed. There is no telling how deep and far the ramifications of this can go.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Numinae",
                                                                            "body": "Yeah, meanwhile the government has access to ALL of your data, including your bank accounts and every transaction supposedly down to $600 (if not more). But you're worried about a rich guy gutting those poor goverment agencies? If he steps over the line I'll change my opinion fast but so far, this has cost him far more than he'll make from it and it seems the motivation is civic duty....",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "seenthevagrant",
                                                                                    "body": "Im not worried about the gutting, I’m worried about one singular man who is the most powerful man on earth being able to be the sole decision maker for what happens with that data. \n\nAs shitty at it is that the government has the data in the first place there are at least many different heads that have to approve any fuckery. Elon has no such checks\n\nEdit: this will far out weigh a couple hundred million for him. Space x is all but guaranteed to get record contracts. Tesla will get every advantage as the gov still pushes to electrify, and he will be getting at least his money back out of the 500 billion dollar ai bill trump passed. Elon isn’t a principled ancap he is a businessman using this angle for clout and advancing his own position just like Trump.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Numinae",
                                                                                            "body": "\"Most powerful\" is a stretch for anyone but a head of state with their finger on the button that launches nukes. Honestly, as flawed as I think Trump is he's both a narcissist, which means he wants to be loved AND he's wealthy enough to not be bribeable. Musk may be the wealthiest man but he isn't the most powerful. Also, his perversions don't extend to power per se. I think he really wants to achieve his dreams of a better future, amongst the stars. I think he views this as an annoying diversion but necessary to preserve the US in order to continue his actual goals. Also, he's again too rich to corrupt. Regardless of whether their motivations are pure or self serving, their goals at least for the moment align with ours. That definitely could change I'm the future but atm, compared to the alternative of blatantly corrupt, power hungry, petty politicians and bureaucrats I'd prefer the former. ",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "seenthevagrant",
                                                                                                    "body": "Government only has the power that everyone participating in it gives it. That’s the whole point of the deep state. Presidents have the nuke button but they have to go through so many people to make that decision. For all the flaws there are some safe guards. The man with the most capital and influence is definitely shown to be the most powerful. Trump doesn’t have 250 million cash on hand. We know most of his worth comes from over evaluated properties. Musk bought him out and now has free rein. \n\nElon is literally centralizing power under himself. Hell jimmy carter sold his peanut farm so that he would have conflict of interest. Now we have a foreign billionaire who receives tens of billions in government funding now accessing the most integral parts under the guise of “cutting waste”while he himself is the beneficiary of said waste yet won’t stop his own gravy train. There should be more than enough shit to alarm people but he tells you all the nice things so let him go at it I guess",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Numinae",
                                            "body": "So you're sating Musk spent $250 _Billion_ to make $10 Billion? Yeah... maybe my math skills are out of practice but, that's a net profit of -$240 Billion.... ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "seenthevagrant",
                                                    "body": "My bad it’s a typo. He donated 250 million I don’t even think I’m he is quite worth 250 billion total lol. \n\nHowever the 10 billion is pre Trump second term. That’s just what space x has gotten in federal funds over the last decade or however long it’s been going. \n\nThough I’m sure Elon will be getting his fair share of the 500 billion to develop ai. Plus he takes subsidies for most of his other businesses too. It’s funny those seem to be sticking so far",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Numinae",
                                                            "body": "Ok, so didn't Elon already have those contracts? SpaceX is the clear leader in the field as well so it's not like he had to bribe his way to a contract. If anything, this has been an enormous liability to him. Honestly the actual cost to equity _could_ be $250 Billion or more. He's made it very clear why he did what he did and that it was out of civic duty and concern for the future of the country. I mean, like _anyone_ he could be wrong about what decisions he makes but he certainly seems to think he's doing \"the right thing...\"",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "seenthevagrant",
                                                                    "body": "Yes he already had the contracts that is the point. He has a conflict of interest. I don’t want Raytheon seizing treasury data either. \n\nMy point is that since he still has the tens of billions flowing to his companies while wanting to slash fed spending is proof enough that he isn’t doing this out of principle.\n\nIdk why you think him saying this is out of “civic duty” means anything. He’s not just going to flat out say “I bought off Trump because I saw the opportunity to cement myself and my companies as world leaders for the foreseeable future, while demolishing all the parts that I don’t like or that have personal investigated me”",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MFrancisWrites",
                                    "body": "Shrinking without weakening is concentration *and that's much worse*.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Ok with it?  My dick’s never been this hard. ",
            "score": 18,
            "replies": []
        },
        {
            "author": "thermionicvalve2020",
            "body": "https://preview.redd.it/5gwgacvsvlhe1.jpeg?width=225&format=pjpg&auto=webp&s=e61a43614d2d2595367c473b0fc0a2930e8f0afc",
            "score": 23,
            "replies": [
                {
                    "author": "Ya_Boi_Konzon",
                    "body": "💎",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "telepathic-gouda",
                    "body": "Viva la libertad carajo!",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "orwll",
            "body": "Making them unemployed is the moderate position.",
            "score": 9,
            "replies": [
                {
                    "author": "WishCapable3131",
                    "body": "Because true ancaps would use physical violence?",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Doublespeo",
                            "body": ">Because true ancaps would use physical violence?\n\nNo",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "WishCapable3131",
                                    "body": "Then what did you mean before?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Doublespeo",
                                            "body": ">Then what did you mean before?\n\nbefore?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Angry_Cossacks",
            "body": "There will be plenty of factory jobs for them!",
            "score": 8,
            "replies": []
        },
        {
            "author": "Kinglink",
            "body": "\"It's a good start\"",
            "score": 14,
            "replies": []
        },
        {
            "author": "lone_jackyl",
            "body": "70% and no military. I'd be happy",
            "score": 8,
            "replies": [
                {
                    "author": "Southernboiiiiii",
                    "body": "based",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "American_Streamer",
            "body": "![gif](giphy|3o7aTuy3b4TwuUSUzm)",
            "score": 9,
            "replies": []
        },
        {
            "author": "Background_Notice270",
            "body": "![gif](giphy|JeKLoVq2KzdpS)",
            "score": 4,
            "replies": []
        },
        {
            "author": "Zealousideal-Skin655",
            "body": "Hopefully, the defense is next.",
            "score": 8,
            "replies": [
                {
                    "author": "ZealousidealLeg3692",
                    "body": "I wanna see what happens, nationalist zealotism insider bullshit has gone far enough.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mean-Article377",
            "body": "I randomly clicked on a video of an MSBC segment and they were reading some letter written by an FBI agent who is scared of losing their job and trying to appeal to people's humanity with shit like \"I coach your kids soccer game, I pick up your mail when you're out of town, I'm on the PTA...now I'm gonna lose my job...\"   It was literally the funniest shit ever and I was bathing in their tears",
            "score": 3,
            "replies": []
        },
        {
            "author": "Appropriate-Barber66",
            "body": "Millions *",
            "score": 2,
            "replies": []
        },
        {
            "author": "carbonfiber9001",
            "body": "Millions must fry",
            "score": 2,
            "replies": []
        },
        {
            "author": "jimmietwotanks26",
            "body": "https://i.redd.it/t4gamh70l1ie1.gif",
            "score": 2,
            "replies": []
        },
        {
            "author": "GravyMcBiscuits",
            "body": "It never fails to bewilder me when I consider the sheer amount of resources that are required to manage/maintain the income tax.\n\nThere are essentially two sets of armies on both sides of it: lawyers/accountants on the public side to enforce the tax .... and a matching army of lawyers/accountants on the private side to help folks avoid and file their taxes.\n\nAll of these smart diligent folks could be doing something productive instead of managing this insane drag on society.",
            "score": 2,
            "replies": []
        },
        {
            "author": "beyond_XBT",
            "body": "The ancap guy gets it right... but he has no heart.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vlad_putine",
            "body": "The best thing about these people being laid off is that they're going to find out they have no marketable skills. Living off the government teet only teaches you how to be a leech and they will have a rude awakening when they have to step into the private world where your required to, ya know, work for your money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoTrash202",
            "body": "Why don't you just move to a shithole country it would be easier for you and you'd get the results you wanted right now.",
            "score": 0,
            "replies": []
        },
        {
            "author": "MFrancisWrites",
            "body": "Man for a group who's entire identity is based around certainty in superiority of economic knowledge, y'all are sure eager to crash consumer spending with absolutely zero plan on how to mitigate the shocks to an entire system based upon increasing demand.\n\nAnd let's be real, it's not like they're going to shrink the parts of the government that hinder us so much as the ones that hinder them. It ain't shrinking power, it's making it leaner and more consolidated to suit them.\n\nGood luck tho I'm sure a technobro autocratic state will be peak liberty for everyone",
            "score": -25,
            "replies": [
                {
                    "author": "GoogleFiDelio",
                    "body": "Yes, I'm sure consumer spending will crash if we're not funding sex change surgeries in Guatemala...\n\nIdiot.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "ZealousidealLeg3692",
                            "body": "Fucking Republicans and their fear tactics need to gtfo off ancap.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "GoogleFiDelio",
                                    "body": "You think objecting to waste is \"Republican\"?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "GoogleFiDelio",
                                                    "body": "If you support this waste, you're not ancap.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MFrancisWrites",
                            "body": "The meme suggest we rapidly unemploy millions of people.\n\nI made no claim there's isn't waste to be trimmed, but I bet it's less bombs for brown people and not sex changes.\n\nBut keep up the arguing absolutes in culture war talking points, they appreciate you bite on every million dollars of outrage while they pilfer literal trillions.\n\nLike call me when Lockheed gets nervous, not trans people, yeah?",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "lochlainn",
                                    "body": "Maybe they should just learn to code?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "MFrancisWrites",
                                            "body": "So that all the people who learned to code can face wage stagnation after a flood of supply in labor?\n\nLike maybe it's bad we all have to scramble to compete for a shrinking piece of the Pie at a time where the average person can hardly afford to break even.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "GoogleFiDelio",
                                                    "body": "Where was that compassion when this was being done to us?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MFrancisWrites",
                                                            "body": "I've been vocal about the middle class being undermined by special interests since Kent State. When they realized they couldn't control cultural narratives, they started to undermine economic security. Powell Memo of 71.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "GoogleFiDelio",
                                                                    "body": "I don't care about your fantasy world. This waste is making us poorer. When the government locked us down and destroyed the economy they had no mercy on us. They deserve no mercy in return.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MFrancisWrites",
                                                                            "body": "So we can suspend the constitution and ignore the judicial branch to make this right?\n\nSounds like you're trusting the worlds richest man a whole lot to tell me you the truth.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GoogleFiDelio",
                                                                                    "body": "Who said we're doing any of that?\n\nWho said I'm trusting Elon?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "MFrancisWrites",
                                                                                            "body": "The White House Press Secretary, and call it a hunch. If you're excited about all that's being slashed, who's providing the headlines you support? It's mostly been Musk tweets and statements. Oh and today we found a $400M line item for Armored Teslas for the government. And a lot of cuts seem to coincide with Musk's business interests.\n\nIf you think what's currently happening will benefit you, I'd wonder why you think that, who it is that is acting in our best interests? I don't see anyone close to power that I trust at all.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "GoogleFiDelio",
                                                                                                    "body": "Link to her saying that?\n\nThe egregious spending during COVID, funded with money printing, caused a precipitous rise in inflation. That harms me. Reducing this harm benefits me. \n\nTrust is not at stake. This was the less bad option and it's not even close or debatable.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "MFrancisWrites",
                                                                                                            "body": "She said the acts of the judiciary present a constitutional crisis. I'm sure you can find her speech from today.\n\nYou mean the spending of which the majority was approved by the sitting president, much directed and given to his business interests and forgiven, without public or congressional oversight? That egregious spending?\n\nThe overwhelming majority of the increase to money supply came from Trump and a blatantly fraudulent PPP program. So I guess I'm confused when you say this guy is the least bad option. Inflation doesn't happen instantly.\n\nThat said, the US had one of the lowest rates of inflation in the developed world. It was a global pandemic and recession that we seemed to handle better than most. But yes, Trump did spend a whole lot that never made it to the individuals, and we should hold him accountable for that.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                    "body": "That's not what you alleged above, you were lying. I didn't bother with the rest.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "MFrancisWrites",
                                                                                                                            "body": "Tuck and run kiddo. I'm sure every single word you speak is without inference.\n\nAnd of course you didn't bother with the rest. You'd have to either admit you're wrong, or deny the real world exists to uphold the idea Trump wasn't far more responsible for the shitty economy than what was handed to Biden.\n\nSafe travels on that well trodded sheep's trail you follow my dude. Stay curious.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                    "body": "Come back when you can provide evidence of your claim. You claimed she said something that she didn't say so you're not to be taken seriously. \n\nYou guys lost because of this insanity, btw.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "MFrancisWrites",
                                                                                                                                            "body": "I love it here. We have to speak exactly correctly, without inference or error, 100% of the time. Calling a judicial ruling against the executive a constitutional crisis is a pretense for whats to come. But not to you, right, because.... \n\n Trump et al can say whatever they want, and it's true, and if it's not, well it's not what he meant, or if it is, you don't understand the context, or if you do, it'll be true soon just wait.\n\nCome back when you can see that you have your head so far up that guys asshole you can see the back of Ivanka's throat my dude.",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                                    "body": "You lied about what she said.\n\n>Calling a judicial ruling against the executive a constitutional crisis is a pretense for whats to come\n\nIn the Biden regency, the Supreme Court, not some individual Obama appointee on a lower court, ruled that the Biden regency could not force businesses to fire people who didn't take an experimental drug. After it was struck down, after many innocent people were injected against their will, the Biden regency still told businesses to fire employees who didn't submit. When the Supreme Court did the same on the Biden regency's election-year bribe of cancelling student loans it ignored them and still tried to do so again.\n\nIf that wasn't a \"Constitutional Crisis\", this isn't. You're just parroting buzzwords you saw on your television.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "MFrancisWrites",
                                                                                                                                                            "body": ">were injected against their will\n\nThey weren't held down. Conditions of employment, right?\n\nAnd when the court ruled, did Biden respect the ruling?\n\n>parroting buzzwords\n\nYes, ones your regime is saying.",
                                                                                                                                                            "score": 0,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                                                    "body": ">They weren't held down. Conditions of employment, right?\n\nNot if they're imposed by a crisis.\n\n>And when the court ruled, did Biden respect the ruling?\n\nNope.\n\n>Yes, ones your regime is saying.\n\nYou literally just got caught lying about that.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "MFrancisWrites",
                                                                                                                                                                            "body": ">Nope\n\nCitation required. \n\nHey let's talk about who created all that money supply why did we skip that?\n\nOr are you gonna leave because that part makes you icky?\n\nThe fact that y'all will put employer imposed restrictions on the same level as the executive ignoring the judiciary says a lot about how much propaganda you've internalized.\n\nAll set, but like... Just have a line man. Pick some spot where, if the Party gets to that point, you'll abandon them. Because good lord.",
                                                                                                                                                                            "score": 0,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                                                                    "body": "I'm still waiting on the source for your initial claim. I'm not really interested in conversing some Democrat shill who lies all the time.\n\nYou must be grifting the current system hard to bootlick so desperately.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "MFrancisWrites",
                                                                                                                                                                                            "body": "😂 Dawg I work for a living just like you. Why do you think these guys are good for you? Tread Harder Daddy\n\nhttps://preview.redd.it/cvwcfa282vie1.png?width=864&format=png&auto=webp&s=ca587c8a3da1c531f479291c6a595ce56d5e5e5f",
                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                                                                                    "body": "More billionaires backed the opposition. The opposition is why inflation is so high. Try again, commie.",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "MFrancisWrites",
                                                                                                                                                                                                            "body": "Everyone who disagrees is a commie! \n\nAh yes, it must have been that other president before Biden that signed away all that PPP money.\n\nPick a point you'll leave the regime, or die a fascist. Stay as curious as you are insufferable and we'll be fine peace",
                                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "milkoso88",
                    "body": "Please keep crying. Those tears are delicious.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "MFrancisWrites",
                            "body": "Any dissent must mean I'm seething and sobbing lol log off until your balls drop, goon.\n\nBut if you take pleasure in the suffering of others, perhaps instead of politics you could fuck off into the wilderness and get away from other people. I'd wager your sex life would even get better. 😉",
                            "score": -10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "me_too_999",
                    "body": "$40 million to fund gay rats in Guatemala helps US consumers how?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "MFrancisWrites",
                            "body": "Even if I assume what you're talking about is true, can you see that, perhaps, they're distracting you with gay rat story outrage and not shit that actually adds up to something? Like in terms of trillions, let the homo rats have at it.\n\nLike gay rats man? That's the smoking gun? You're *sure* that's not scripted to be just interesting enough you'll repeat and lose sight of the big picture? \n\nCall me when they raid the DOD, NSA, or the military industrial complex. You know, something actually an affront to debt and our civil liberties. Gay rats. Have they run into Alex Jones' frogs? Could make a a hell of a Rogan episode.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "me_too_999",
                                    "body": "Some of that $40 million came from my elderly grandmother's social security check. \n\nHonestly, these criminals should be ashamed if even one dollar is wasted.\n\nAnd yes.  I seriously doubt the gay rats. Someone's illegal campaign fund is a hundred times more likely.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "MFrancisWrites",
                                            "body": ">Some of that $40 million\n\nProbably less than a penny.\n\n>Someone's illegal campaign fund\n\nLike, perhaps, the guy that just rode the back of the world's richest man back into power? Or is it only an outrage when it's Blue?\n\nLike dawg we're getting played, and if you think literal richest man in the world is on your team..... Why?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Character_Dirt159",
                                                    "body": "Trump spent a little more than half of what Harris did and we know that on top of being independently wealthy, Trump was backed by not only the worlds richest man but also the 2nd and 3rd richest. But yea, Trump’s campaign money is totally what’s shady in this picture…",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "MFrancisWrites",
                                                            "body": "We have zero idea how much money each candidate received because Citizens United. Looking at just their campaign spend as an official number is the most basic example of \"just trust the government\"!\n\nHe was incredibly well funded by Musk. Beyond his official campaign. I suspect you know that.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "GoogleFiDelio",
                                                                    "body": ">We have zero idea how much money each candidate received because Citizens United.\n\nThat's not how CU worked.\n\n>He was incredibly well funded by Musk.\n\nAnd? Harris had more billionaires give her more.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MFrancisWrites",
                                                                            "body": "That's exactly how CU works lol you donkey.\n\nSure, I can pull up their donations. But as for private money spent on social media and advertising? \"Free speech\"\n\n>Harris had more billionaires give her more.\n\nPublicly.\n\nHarris can be bought, as can any politician, Red or Blue. Trump has been quite public that he can be both purchased to a high bidder, and easily manipulated if you're willing to flatter him and kiss the ring.\n\nBut sure keep thinking that fascism won't happen when the richest oligarchs partner with the most fragile president BOLD MOVE COTTON",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GoogleFiDelio",
                                                                                    "body": ">That's exactly how CU works lol you donkey.\n\nWrong, CU said that people can't have their freedom of speech limited if they act in groups.\n\n>But as for private money spent on social media and advertising? \"Free speech\"\n\nAh, you're a foreign troll. We have free speech in my country. Is USAID paying you?\n\n>Trump has been quite public that he can be both purchased to a high bidder, and easily manipulated if you're willing to flatter him and kiss the ring.\n\nNah this is just something you made up.\n\n>But sure keep thinking that fascism won't happen when the richest oligarchs partner with the most fragile president BOLD MOVE COTTON\n\nI've already lived through fascism. It was called the COVID era. We just booted the fascists from power and are dismantling their fraud machine.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "MFrancisWrites",
                                                                                            "body": "Fasicsm is when a business won't sell me a sandwich because I'm an insufferable cunt.\n\nBut sure, I'm the paid troll 👍",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "GoogleFiDelio",
                                                                                                    "body": "Fascism was forcing employers to fire employees who didn't take an experimental drug.\n\nFascism was forcing a rag on our faces.\n\nFascism was the government paying the media to lie to us. \n\nIf you're mad the fascists lost, you might be a fascist.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Character_Dirt159",
                                                                    "body": "PACs and super PACs still have to register with the FEC. Including outside money the Harris Campaign spent over 2billion. Trumps campaign spent about 1.4billion. Cool try though.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MFrancisWrites",
                                                                            "body": "What did \"Citizens for American Freedom in Schools\" spend?\n\nThe whole point of CU is that they *don't* have to register to identity with a candidate. They can just \"free speech\".\n\nPlease keep up at the state of the oligarchs strategies if you're going to be so certain.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Character_Dirt159",
                                                                                    "body": "If they are participating in campaigning for a candidate or cause they absolutely have to register with the FEC. The point of Citizens United was that they could spend however much they want because limiting what they spend interferes with their right to freedom of speech. The individual contributors can remain anonymous but the PACs and super PACs have to register and disclose what they spend. Please stop spewing nonsense sense from a place of utter ignorance.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "MFrancisWrites",
                                                                                            "body": "RIGHT but you can see how that very quickly gets muddy. They can just create any cause, sling attack ads, and that doesn't get disclosed under any other candidate, just a cause.\n\nSo the dark money is not tied to any one candidate.\n\nThe idea that money is speech is such a perversion of what any originalist should believe. The whole purpose is that free speech cannot be silenced, but it can be drowned out? Precarious at best.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MindOverManner69",
                    "body": "You're wasting your time. It really seems like most people here would let entire families starve to death in front of them if it saved them $20 of taxes a year.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "MFrancisWrites",
                            "body": "I guess I'm just betting they know more families on that line than they do billionaires?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MindOverManner69",
                                    "body": "Definitely not. They are all billionaires and so are their friends, they're just short a bit right now, only $999,999,999.99!\n\nDistinct lack of any sort of empathy.\n\n100,000 people get laid off! Haha suckers working for the government! Who cares about the actual harm to 400,000 or so people because all government workers are lazy!!!!!! Saves me $5.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}