{
    "title": "Trump 2.0: The most damaging first two weeks in presidential history | Trump’s second term is all about curtailing government’s power and reach.",
    "author": "ColorMonochrome",
    "subreddit": "Anarcho_Capitalism",
    "rank": 426,
    "score": 79,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 64,
    "url": "https://www.washingtonpost.com/opinions/2025/02/04/trump-federal-government-workers-destruction/",
    "id": "1ik1qv7",
    "selftext": "",
    "comments": [
        {
            "author": "NimbleCentipod",
            "body": "Holy, the derangement of conflating nation and state.",
            "score": 66,
            "replies": [
                {
                    "author": "PrevekrMK2",
                    "body": "You can not imagine how many arguments i had with people who sincerely believe it's a different word for the same thing.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "NimbleCentipod",
                            "body": "Public School in a nutshell",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "daregister",
                    "body": "They are the exact same words. I think you are trying to say the people vs those in power.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Tomycj",
                            "body": "They are not the same. State = Nation (\"the people\", with a common cultural/historical identity) + Government + Territory.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "daregister",
                                    "body": "As words they technically have many definitions, but in this context, they are the same.\n\nState = government\n\nNation = government\n\nWhen many people talk politics, they refer to things government does as the STATE doing these things. They also use nation (or the name of the nation ie. USA) to refer to things government does.\n\nThe state enacted a new law. The nation enacted a new law. The USA enacted a new law. The government enacted a new law.\n\nThey all fit and work grammatically.\n\nYou should be clear in your words. The people (individuals living in a state/nation) are not the same as the government. That is what shouldn't be conflated: people/individuals and government.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Tomycj",
                                            "body": "I am precisely being clear in my words, and pointing out others are not. State, nation and territory each have a single formal definition.\n\nYou should not say they are the exact same words, you sould say people often use them as if they were. In other words, they have different *informal* definitions, different from the proper, formal one",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "daregister",
                                                    "body": "I gave examples and explained. You simply STATED things (xdd 1 definition btw).\n\nFormality is also a centralized notion. Language is defined by its users and constantly changing. But even the \"formal\" definitions disagree with you. So I don't really get what you are saying.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "thermionicvalve2020",
            "body": "Is Trump an evil genius now? I can't keep up.",
            "score": 57,
            "replies": []
        },
        {
            "author": "Orbitalsp3",
            "body": "why so MANY people enjoy licking the boots of the state? I still don't have a definitive answer to that",
            "score": 48,
            "replies": [
                {
                    "author": "blackie___chan",
                    "body": "Because why do the easy things?\n\nhttps://preview.redd.it/v6sxgnnqorhe1.jpeg?width=513&format=pjpg&auto=webp&s=86f33c5ad4d0aa89ee20f3351ad60fb20b27f3f3",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "LucasL-L",
                    "body": "Politico alone got 8mi for it. Plenty of newspappers and journalists were filling their pockets",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "thermionicvalve2020",
                    "body": "Anti-fascists looooove the state.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Southernboiiiiii",
                            "body": "not rly, antifascism is a spectrum, even if communists are on that spectrum most antifa ik are anarchists",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "thermionicvalve2020",
                                    "body": "They are commies and statists, not antifascists. They are protesting the reduction of state, therefore they love the state.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Southernboiiiiii",
                                            "body": "\\> They are commies and statists, \n\nthat would be unfair, I'm friends with some\n\n\\> not antifascists. \n\never heard of ancoms?\n\n\\> They are protesting the reduction of state, therefore they love the state.\n\nngl, the last sentence makes no sense to me",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "thermionicvalve2020",
                                                    "body": "I dont care who yer friends with\n\nI have heard of statists who call themselves ancoms, yes. Thry are indeed commies and statists.\n\nAnComs could exist in AnCapistan, form their own community and could trade only with AnComs if so desired.\n\nWould the same be true for AnCaps in AnComland? Would we be able to have capitalist communities who trade with each other but don't voluntarily give up our property to the commies?  If it's not voluntary, it's a state. I don't need an answer, i already know the answer.\n\nIf they are protesting the dismantling of the state, they are statists who love the state. Anti-fascists are protesting less state. lololol.\n\nHave a good day.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lochlainn",
                    "body": "They've been trained since birth to infantilize themselves.\n\nThey despise their parents and need a substitute.\n\nThey despise religion, so invented a new god to worship.\n\nThey despise strength, so they enshrined victimhood.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "GunkSlinger",
                    "body": "Lots of people think they profit off of the state. Not just the workers but average citizens as well. Every service they want from the govt is subsidized with other people's tax money.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "RonaldoLibertad",
            "body": "Afuera!",
            "score": 30,
            "replies": []
        },
        {
            "author": "crinkneck",
            "body": "By damage to the nation they mean the parasites who exist solely off tax payers, right? Right?",
            "score": 80,
            "replies": [
                {
                    "author": "mxracer888",
                    "body": "Ya, damage to the bureaucracy lmao",
                    "score": 26,
                    "replies": []
                }
            ]
        },
        {
            "author": "VodkaToxic",
            "body": "\"Damage to the nation\"\n\nYeah.  Chemo sucks.",
            "score": 50,
            "replies": [
                {
                    "author": "BrooklynRedLeg",
                    "body": "In this case, its more like chopping off a gangrenous limb....",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Aerith_Gainsborough_",
                            "body": "And removing a pile of ticks",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "mxracer888",
                            "body": "I just had a family friend die of a semi rare condition called \"necrotizing fasciitis\" (a flesh eating bacteria that very quickly kills basically any cells it contacts and travels very fast in the host). \n\nDoctors told his family \"ya, normally the only way to fix this is to just cut off the limb that has it so that it can't spread to the rest of the body. But because it's in his neck that really isn't an option...\"\n\nWe aren't dealing with cancer, we're dealing with necrotizing fasciitis here and we need to chop everything off",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MattAU05",
                    "body": "My concern remains this: what is his end game? Cutting waste and spending and vast regulatory government power is, on its own, a good thing.\n\nBut is his plan to simply centralize power with him? Or to centralize it to fewer agencies where he has sycophants in charge? \n\nThe Gaza stuff has me concerned. And recently his talk about “protecting the Christian faith” or whatever smacks of Christian nationalism (if not theocracy).\n\nSo I’ll keep watching. I don’t like or trust the man, and didn’t vote for him, but the tax plan looks solid.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "BrooklynRedLeg",
                            "body": "Apparently, Egypt and Jordan are now signaling they will rebuild Gaza....",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "MattAU05",
                                    "body": "Hopefully Israel will not further destroy it in the meantime. But Egypt and Jordan rebuilding it would be a win. As long as we don’t have to.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "BrooklynRedLeg",
                                            "body": "Amen!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "MattAU05",
                                                    "body": "And then he says stuff like Gaza “will be given to the US by Israel”. Hopefully it’s just bizarre negotiation. We need to get as far away from the Middle East as possible, not set up shop in Gaza.\n\nhttps://thehill.com/homenews/administration/5133161-donald-trump-gaza-proposal-israel-takeover/",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "twobugsfucking",
                            "body": "Seeing a lot of stuff like this in my feed these days. It’s hardly neutral, doesn’t look kindly upon Orban or Trump, but is fact based and an interesting angle, if you’re able to hold your nose and look past the source.\n\nhttps://ecfr.eu/publication/the-orbanisation-of-america-hungarys-lessons-for-donald-trump/\n\n“We have entered the programme-writing system of President Donald Trump’s team, and we have deep involvement there.” Hungarian prime minister Viktor Orban, July 2024.\n\nIf this is true and indicates what you’d expect it does, then you might see a mixed bag of deregulations, antiglobalism, tax cuts, border control, executive expansion, centralization of power, furthering State influence in the economy, social conservatism and legislating morality. Which is more or less what we have been told to expect.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "mxracer888",
                            "body": "Ya, some are calling him a genius... I'm not sure I'll go that far unless he can give up the power himself and just do away with it. But if all he's doing is centralizing then it's causing a much bigger problem both now and in the future when other presidents get in. \n\nBut I'll take shining a light into the dark corners of the government for now. Just want to see what the story is in a month, a quarter, a year, etc",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "MattAU05",
                                    "body": "That’s the issue: any future president can wield the same power he is if the power itself is not dismantled. I warned Democrats against their cheering when Obama heavily used executive orders to get things done. What happens when someone you don’t like is in power? They just undo it all, or go farther. And that’s what has happened. \n\nOf course the problem is that there’s a massive federal bureaucracy under the purview of the executive branch. Congress delegated away their power (and separation of powers) to the president. If Trump can really do away with that, and not just consolidate power, it could all work. I’m just not convinced he will do it.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MindOverManner69",
                            "body": "Just look at Rubio, he went on media appearances after the Kamala debate and was talking about how simply amazing Trump did, how it was his best performance in a debate ever and there was zero question who won which is frankly fucking laughable with the \"concepts of a plan\" and \"eating the cvats and dogs\" and never even answering a single question.\n\nHe's a gaslighting sycophant that will do anything Trump says. A pathetic, weak yes man groveling for a spot at the table.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hblok",
            "body": ">curtailing government’s power and reach.\n\n*You don't have to sell it to me!*",
            "score": 14,
            "replies": [
                {
                    "author": "lochlainn",
                    "body": "I can only get so erect!",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Secretsfrombeyond79",
            "body": "Lol what a bullshit article.",
            "score": 23,
            "replies": []
        },
        {
            "author": "matadorobex",
            "body": "Unless congress gets involved, any positive gain can be undone by future presidents.",
            "score": 5,
            "replies": [
                {
                    "author": "GoogleFiDelio",
                    "body": "You can't unshed light on corruption and waste.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "mxracer888",
                            "body": "Well....you really can when you control the media and social media.\n\nLight was shone on covid stuff, but the media and social media very efficiently silenced any dissenting discussion which kept the light off. \n\n4 years from now, let's imagine a D gets in, it's as simple as ordering the censorship of speech (as they've already very willingly done) and something like Bidens \"ministry of truth\" agency he made (or tried to make?) and bam, all the light is off and the monsters step back into the shadows.\n\nHistory is written by the victorious, not the losers.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "GoogleFiDelio",
                                    "body": "That's the beautiful part: they don't anymore. Elon buying twitter and kicking out the feds gave the truth a way to get in. DOGE destroying their propaganda funding will be the final nail in that coffin. \n\nTrump gets to appoint federal judges and SCOTUS justices for four years. They're wise to the tactics now and seem to have given up on cuckery. You're correct that socialists never stop scheming but I'm optimistic now, especially because the dems have tarnished their brand so badly.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "mxracer888",
                                            "body": "Twitter is but one \"public square\". You have Reddit that is still heavily vested in maintaining leftist propaganda. \n\nAnd you have Facebook (and by extension Instagram), which Zuck has claimed to be awakened to the issue he caused by silencing dissenting voices and is allegedly committed to rolling back that overuse of power. But personally I'm not convinced this change of heart isn't just him going into survival mode, being a chameleon and changing his colors to avoid being attacked by a republican lead government. It's still entirely possible and frankly quite likely that he has another \"change of heart\" next time the Dems have control again. \n\nAnd then you have Google and by extension YouTube which are the number 1 and number 2 largest search engines in the world. SERPs (Search Engine Results Page) are heavily manipulated, to get away from \"trusted news sources\" you frequently have to go many pages away from the first page to finally get to alternative sources of news that don't have the US government designation of \"trusted news source\". And YouTube still very famously has manipulated, silenced, and outright suppressed Right leaning media and podcasters. There's countless stories of people looking for their preferred podcast channel and even when searching the specific channel name they can't find it. \n\nNeedless to say, controlling Twitter is far from enough to reliably say these things can't be hidden back in the shadows later down the road",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cptnobveus",
                            "body": "Pelosi the stock market genius has been known for a while and nothing has been done.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GunkSlinger",
                    "body": "The Epstein list needs to be released.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "BrooklynRedLeg",
                    "body": "I'm hoping they have a bunch of them by the shorthairs with the threat of 'You vote our way or we burn your ass at the stake. Either way, you don't seek reelection.' Supposedly that may be what happened with Lindsey Graham's vote on Gabbard.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CookieMons7er",
            "body": ">Trump's second term is all about curtailing government's power and reach.\n\n\nI see that as an absolute win",
            "score": 5,
            "replies": []
        },
        {
            "author": "Anxious-Educator617",
            "body": "Keep it up",
            "score": 3,
            "replies": []
        },
        {
            "author": "mechanab",
            "body": "Burn it all down.",
            "score": 5,
            "replies": []
        },
        {
            "author": "lone_jackyl",
            "body": "I want to see hundreds of thousands  unemployed and whole bureaucracies cut",
            "score": 7,
            "replies": []
        },
        {
            "author": "sanmateosfinest",
            "body": "I just want the next 4 years to be the absolute worst hell for all covidians.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DeadHeadLibertarian",
            "body": "Yeah because going from 14,000 workers at USAID to 250 is damaging. \n\nWhat???",
            "score": 2,
            "replies": []
        },
        {
            "author": "Significant-Ear-4707",
            "body": "![gif](giphy|gQhJMdOGB8YBJJ0tXu)",
            "score": 2,
            "replies": []
        },
        {
            "author": "SpecialistAd5903",
            "body": "Pretty sure this is a botting account. Their whole post history is just posting the same article to dozens of subreddits",
            "score": 4,
            "replies": []
        },
        {
            "author": "Geo-Man42069",
            "body": "“All about curtailing government power and reach” maybe. I’m just waiting for DOGE to have a final count of “savings” and we just ship that over to Israel lol. Real talk id like to believe, but ima show me the results kinda dude.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Impressive-Door3726",
            "body": "This article is bullshit. The only bad thing Trump has done was some woo woo with Epstein.",
            "score": 3,
            "replies": []
        },
        {
            "author": "dcmathproof",
            "body": "What's this paywall?",
            "score": 1,
            "replies": [
                {
                    "author": "ColorMonochrome",
                    "body": "I included a link to a non paywalled version as the first comment.\n\nhttps://old.reddit.com/r/Anarcho_Capitalism/comments/1ik1qv7/trump_20_the_most_damaging_first_two_weeks_in/mbipk0s/",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ColorMonochrome",
            "body": "[Non-paywalled version of the article.](https://archive.is/3Yisb)\n\nIf Trump 2.0 is all about “curtailing the power and reach of government”, why didn’t more libertarians and libertarian minded people vote for Trump?",
            "score": -1,
            "replies": [
                {
                    "author": "ToxicRedditMod",
                    "body": "Did you see Chase’s numbers?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "ColorMonochrome",
                            "body": "I hadn’t really paid attention to his numbers.  My view of the libertarian vote was a product of what I am seeing here on reddit.  The vote for the libertarian candidate either moved or has fallen off a cliff.  It dropped by about half from 2016 to 2020 then by about 2/3rds from 2020 to 2024.\n\nSo it’s not clear if libertarians are simply not voting or voting for a non-libertarian party candidate.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GunkSlinger",
                    "body": "How many didn't? I want numbers.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thermionicvalve2020",
                    "body": "Drain the Swamp 1.0 didn't happen so...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hardballwith1517",
            "body": "Sounds real fucked up.....",
            "score": 0,
            "replies": []
        }
    ]
}