{
    "title": "DOGE should make Milei-style cuts",
    "author": "delugepro",
    "subreddit": "Anarcho_Capitalism",
    "rank": 413,
    "score": 370,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 35,
    "url": "https://i.redd.it/r4sflv2jmvhe1.png",
    "id": "1ikitnd",
    "selftext": "",
    "comments": [
        {
            "author": "delugepro",
            "body": "Context:\n\nJavier Milei cut government spending [by 28%](https://www.city-journal.org/article/argentina-president-javier-milei-economy-inflation) during his first year in office.\n\nHe abolished half of the government's ministries, fired thousands of bureaucrats, implemented widespread deregulation, balanced the budget, brought down the cost of rent, brought down inflation, and by the end of his first year he brought down the poverty rate to lower than when he took office.",
            "score": 50,
            "replies": [
                {
                    "author": "RonaldoLibertad",
                    "body": "Could you imagine 28% of the US budget? Holy shit, that's a lot of money.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "not_slaw_kid",
                            "body": "That's more than Jeff Bezos' net worth",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RonaldoLibertad",
                    "body": "*end of his first year",
                    "score": 8,
                    "replies": [
                        {
                            "author": "delugepro",
                            "body": "Thanks for catching that typo, I've corrected it now!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Doublespeo",
                    "body": ">Javier Milei cut government spending by 28% during his first year in office.\n\nand yet Argentina already show GDP growth (government spending is oart of GDP calculation)\n\nquite incredible",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "DaWhiteSingh",
            "body": "Stossel is da dude. Been watching since I was a kid, common sense stuff. I was thrilled to see him on YouTube, he convincingly tells us what we already know.",
            "score": 20,
            "replies": [
                {
                    "author": "delugepro",
                    "body": "He's the best",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "thermionicvalve2020",
            "body": " All three met last November right after the election so it's a little more than \"noticed\".",
            "score": 12,
            "replies": []
        },
        {
            "author": "Will-Forget-Password",
            "body": ">But that when they are explained intelligently\n\nAlready impossible.  \n\nAnyways, $6.2 trillion in 2023. \\* 28% = $1.736 trillion.\n\n$1.736 trillion is the number to beat.",
            "score": 15,
            "replies": [
                {
                    "author": "RonaldoLibertad",
                    "body": "What a number.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Doublespeo",
                    "body": ">But that when they are explained intelligently\n\n>Already impossible.\n\nMilei did it",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Southernboiiiiii",
                            "body": "milei explained it to argentinians, try explaining it to americans",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Will-Forget-Password",
                            "body": "Trump is not intelligent. He can not do it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RonaldoLibertad",
            "body": "Afuera! Afuera! Afuera!\n\nCome on, DOGE, you can do it!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Tomycj",
            "body": "Elon's DOGE seems to be adopting a strategy with the same purpose but different: remove components you don't fully know if can be removed, and add them back if you see things fail. This can lead to even stronger cuts, but also can generate more social backlash, losing political steam faster. We'll see how it goes.\n\nAn ancap would say \"no state component is necessary\", but even Milei recognizes that doesn't mean they can be removed instantly or in any order.\n\nAn analysis (in spanish) about that: https://www.youtube.com/watch?v=t2PI0jk9Rdo",
            "score": 8,
            "replies": [
                {
                    "author": "GunkSlinger",
                    "body": "Someone once asked David Friedman *how* government should be abolished, and his answer was \"Carefully.\"",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "Yup.  This approach is incredibly reckless and could have severe blowback.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IC_1101_IC",
            "body": ">DOGE should make Milei-style cuts \n\nYes. No justification needed. If Doge were to improve the government, it should be less marx, more milei.",
            "score": 3,
            "replies": []
        },
        {
            "author": "delugepro",
            "body": "Source: [https://reason.com/2025/01/29/javier-milei-promised-to-take-a-chainsaw-to-argentinas-government-its-working/](https://reason.com/2025/01/29/javier-milei-promised-to-take-a-chainsaw-to-argentinas-government-its-working/)",
            "score": 7,
            "replies": []
        },
        {
            "author": "acanis73",
            "body": "I m sure that's the idea since DOGE is inspired in the Ministry of Deregulation and State Transformation of Argentina. Musk is being coached by Sturzenegger.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Southernboiiiiii",
            "body": "DOGE shouldn't have a government position, he hasn't even been voted into office, he bought himself in, like in the 3rd world shithole of russia",
            "score": 2,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "Yeah, this all superficially has the right intentions, but the means by which it's being carried out are chaotic, constitutionally dubious, and seem in many ways to just be transferring state power from one agency to another rather than actually diminishing state power in absolute terms.\n\nI'm afraid that due to this approach, it will all be easily reversed by the other side when the pendulum swings back in the other direction.  \n\nWe need root-and-branch reform via a structured dismantling of unconstitutional agencies, backed by legislation and jurisprudence, not a bunch of media stunts led by people without any actual accountability.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CsordasBalazs",
            "body": "DOGE is lead by one of the biggest corporate welfare enjoyer... yeah... that will work.",
            "score": 3,
            "replies": [
                {
                    "author": "Southernboiiiiii",
                    "body": "exactly my point, why does no one want to hear this? you guys literally live in an oligarchy now and your hard earned tax dollars will go to elon now instead of africa",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "prodezzargenta",
            "body": "Milei could done all the cuts without major protests because, among other things, he fought like a loner wolf since 2016 to undermine MANY economic myths perpetrated by leftshits, and insisting in reading *Human Action* by Mises.\n\nSo much so that even \"lower class\" people were caught on camera (I think it was CrónicaTV in 2019), during the most important Book Fair in Buenos Aires, buying that book because they \"wanted to progress in life\". THAT'S when people realized there was hope with Milei.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Futanari-Farmer",
            "body": "As a South American, my opinion of doing that in the US is that the US is too rich to even care about that, not to mention that the funding of \"useless\" stuff is what puts the US on the edge of many things, particularly social matters.",
            "score": 1,
            "replies": [
                {
                    "author": "denzien",
                    "body": "Too rich *for now*",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "WOJ3_PL",
            "body": "the government is supposed to spend more than it takes in 😁😁",
            "score": -2,
            "replies": [
                {
                    "author": "Southernboiiiiii",
                    "body": "get out with your keynesian bs the government is nothing more than a corporation that has a monopoly on everything necessary to survive",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "hashtaggnweaslepeckr",
            "body": "Maybe the billionaires should be taxed more, that could help.",
            "score": -1,
            "replies": []
        },
        {
            "author": "teo_vas",
            "body": "argentina has pesos, us has dollars. I love the stupidity of conservative americans. keep it that way, forbid the FED to print money, see the dollar loses its status as world currency and face the consequences.",
            "score": -11,
            "replies": [
                {
                    "author": "Southernboiiiiii",
                    "body": "the fed printed most of the dollars in the last years tho, yk, when there's more of a good availiable it becomes worth less, you see, the dollar used to be worth more than 12 eggs, now it isn't anymore, you get the problem?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "teo_vas",
                            "body": "believe it or not about half the money the FED prints ends outside of the US. so think again if the FED is the problem of the rising prices.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Southernboiiiiii",
                                    "body": "yeah, but do you think it stays outside of the us? that money is used by forgein companies to buy from us companies, which pay us workers, so that money will end up in the hands of americans, which it did now after they printed it all during covid",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}