{
    "title": "Technically true though",
    "author": "No-Alternative7997",
    "subreddit": "Anarcho_Capitalism",
    "rank": 390,
    "score": 335,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 39,
    "url": "https://i.redd.it/ojo85e4pi5ie1.jpeg",
    "id": "1ilkhbg",
    "selftext": "",
    "comments": [
        {
            "author": "fk_censors",
            "body": "Taxation is extortion is far more accurate than taxation is theft, but extortion is a much longer word and many people don't have the intellectual capacity for three-syllable words.",
            "score": 37,
            "replies": [
                {
                    "author": "eelikay",
                    "body": "Why use big word when small word do trick?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "GravyMcBiscuits",
            "body": "Then there's me next to the checkers when I point out that income tax specifically is just a form of slavery.\n\nCrown me",
            "score": 43,
            "replies": [
                {
                    "author": "AdrienJarretier",
                    "body": "Agreed, I call it \"part-time slavery\"",
                    "score": 15,
                    "replies": [
                        {
                            "author": "fk_censors",
                            "body": "While income tax is extremely coercive, it's not akin to slavery because subjects have the freedom to move away to a different jurisdiction or a different country.",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "VelkaFrey",
                                    "body": "Where they are also taxed. Choose your slavery kind of game",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "fk_censors",
                                            "body": "Yes but actual slaves could never pick masters.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "AdrienJarretier",
                                                    "body": "\"you can move\" is not even true for many people. Many people are just born there and unless they have enough money or skills to move somewhere they'll be accepted they can't choose either. It's not like a lot of countries are recruiting new citizens the way companies do. And you can't create your own country the way you can create your own business.\n\nIt's not that easy to move to another country you know nothing about, with a different culture a different language, obscures laws you don't know. It's hard enough when you were born and raised in a country to understand it all.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "fk_censors",
                                                            "body": "You're making a Marxist argument akin to \"The workers cannot easily change jobs so they are being exploited by their employer\". Fine, I'll correct my comment: the taxed have the right to move to a different jurisdiction.",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "AdrienJarretier",
                                                                    "body": "the workers entered a job of their own volition, they weren't born into the jobs. I'm saying the slaves babies were born slaves and it's not that easy to get out of your slave master.\n\nAn employer offers alternatives that's why the marxists are morons. Clearly when you create a business you offer new alternatives for people who can either create their own business like before when no one offered a job or can now work for you.\n\nIt's not analogous to a country where you weren't born into by choice",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Gratedfumes",
                                                                            "body": "And when you turned eighteen and didn't move to another country, but instead, you chose to go out and get a job, therefore, you have chosen to participate in a system that you now call slavery and you say it was forced upon you.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "PrevekrMK2",
                                                                                    "body": "Well yea, after 18 years of brainwashing, it will take time and will to understand that youre slave. Cage is a normal habitat for you after 18 years.",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Gratedfumes",
                                                                                            "body": "What a damn drama queen 😆 \"eighteen years of brainwashing\" get over yourself man!",
                                                                                            "score": -1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "PrevekrMK2",
                                                                                                    "body": "Well, i can see youre still in your cage and call it home.",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Gratedfumes",
                                                                                                            "body": "Let me rephrase that.... if it took you eighteen years to figure out that capitalism is building an institution based on perpetual wage slavery you're dumb, and I don't want to hear you wine about how you \"didn't see it\" that's because you can only see it when it hits you in the face, because you're dumb.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "PrevekrMK2",
                                                                                                                    "body": "First, so you figured it out when you were 3 years old? Amazing. Cap.\nCapitalism? Lol, how deep in brainwashing are you? Capitalism isnt the problem. State is.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Gratedfumes",
                                                                                                                            "body": "Eighteen and three are the only ages? This kind of absurdist extremism is why I keep coming around. 🤡 \n\nThe state is ran by capitalists! Just because you're not good at being a capitalist doesn't change the fact that it's capitalism. Just because they don't agree with your definition of capitalism doesn't change the fact that they have capital and they use that capital to influence the world around them in order to acquire more capital! Capitalism baby!!!",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "PrevekrMK2",
                                                                                                                                    "body": "Any state, no matter the economic system is evil. Its not the problem of economic system. Its problem of state. Socialism killed tens of millions, ,,communism\" killed same, capitalism did same.... blahblahblah. Nope. Its not.the economic system. Its the state.",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "Some slaves were allowed to earn income and buy their freedom. It's the same case with governments, which charge you a high fee to renounce citizenship.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Sea_Journalist_3615",
                                    "body": "You mean go to another plantation.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "fk_censors",
                                            "body": "Yes, another plantation. Real slaves did not have that choice.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "Sea_Journalist_3615",
                                                    "body": "That is not a defining factor of slavery.",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Yodin92",
                                                    "body": "If slaves did have a choice to be a slave on another plantation ,  would it no longer be slavery …..?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GravyMcBiscuits",
                                    "body": "Why should they be forced to move?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "sanguinerebel",
                                    "body": "In a lot of places you can only move with the permission of both the place you are leaving and the place you are going. This is a terrible argument.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MyPhoneSucksBad",
                    "body": "![gif](giphy|3o7TKqFZJpwL8Giz2E)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "lone_jackyl",
            "body": "Wait til they realize the govt is stealing their time. The one thing you can't replace",
            "score": 7,
            "replies": []
        },
        {
            "author": "Silent_Dinosaur",
            "body": "“TAX BAD!”\n\nWhy many word, few word do? ",
            "score": 6,
            "replies": []
        },
        {
            "author": "Barbados_slim12",
            "body": "It's both. If the taxes are automatically taken before you get the money or are given a price, it's theft. If you have to independently pay tax in order to keep what's yours or stay out of prison, it's extortion.",
            "score": 8,
            "replies": [
                {
                    "author": "sanguinerebel",
                    "body": "Agreed. Income tax sort of falls into both. It's extortion until you are behind and they just straight up take it out of your paychecks, and then it becomes theft. Sales tax, medicare, and social security, are all straight theft.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "danneskjold85",
                            "body": "\\>Sales tax, medicare, and social security, are all straight theft.\n\nNo, all three of those are extortion, too. A seller of goods doesn't have to collect sales tax and employers don't have to collect Medicare or Social Security taxes, and you don't have to work for people who comply. They may be required to but there is no physical law of taxation that anyone must obey.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "onecrystalcave",
            "body": "*Thank you for submitting your report to the moderators, a review will be available shortly in your inbox with a decision enclosed. Report reason: *\"I'm in this picture and I don't want it publicly viewable.\"* is grounds for post removal if found in your favor. Thank You - the moderation team.*",
            "score": 6,
            "replies": []
        },
        {
            "author": "OJ241",
            "body": "Taxation is extortion makes for a better ass tattoo",
            "score": 3,
            "replies": []
        },
        {
            "author": "Agitated-Can-3588",
            "body": "Muh roads",
            "score": 2,
            "replies": []
        },
        {
            "author": "blix88",
            "body": "Fuck Taxation",
            "score": 1,
            "replies": []
        },
        {
            "author": "CarTar98",
            "body": "Income tax is slavery. Extortion is pretty much every other form of taxation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GamerNumber1Guy",
            "body": "I've had someone say \"it's coercion\" every single time I'd say \"theft\". And every time they've meant it in the \"it's justifiable and is what it is\" sense...",
            "score": 1,
            "replies": []
        },
        {
            "author": "RonaldoLibertad",
            "body": "Same thing.",
            "score": -1,
            "replies": []
        }
    ]
}