{
    "title": "How do ancapnistan handle holdout problems?",
    "author": "Hairy_Arugula509",
    "subreddit": "Anarcho_Capitalism",
    "rank": 405,
    "score": 2,
    "upvote_ratio": 0.56,
    "num_comments (reported by reddit)": 28,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iltokf/how_do_ancapnistan_handle_holdout_problems/",
    "id": "1iltokf",
    "selftext": "[https://www.lesswrong.com/posts/nAPTfhaJcPF25Yjyw/expevolu-part-ii-buying-land-to-create-a-country](https://www.lesswrong.com/posts/nAPTfhaJcPF25Yjyw/expevolu-part-ii-buying-land-to-create-a-country)\n\nWhat would be a good way to handle it?\n\n  \nBy  the way I like this expevolu ideas. My ideas are simpler and more aimed at creating autonomous private cities like Prospera instead of a whole new country right away.\n\nI think eminem domain is not that bad to be honest. But I am open to other solutions.\n\nI think path toward more and more freedom should be like expevolu. It should be based on experience instead of pure theoretical, it should evolve, the smaller the change the better, and it should be relatively voluntary than alternatives. By winning votes instead of waging war, is relatively voluntary and peaceful in my book.\n\n\n\n# 2) The Holdout Problem\n\nThe situation, however, is even worse because of something called “the holdout problem.” Here is a GPT-4 explanation of the concept:\n\n*In the world of land acquisition for large-scale projects, the holdout problem presents itself when an individual or a group of landowners, realizing the essential need of their land for the project's success, demand a price far exceeding the market value.*\n\n*Picture a situation where a corporation wants to build a new factory. To do so, they need to acquire a large contiguous piece of land made up of numerous smaller plots owned by different individuals. Each owner, knowing that without their specific plot the factory can't be built, might hold out, refusing to sell unless they get a price significantly above the market rate. This is where the term \"holdout problem\" comes from.*\n\n*Here's an in-depth look at the holdout problem:*\n\n***Context***\n\n*The holdout problem is often seen in situations involving collective action, such as land assembly or infrastructure development, where a single project requires the aggregation of numerous separately owned pieces of property. A classic example is the construction of a railway line or highway that needs to pass through several privately owned lands.*\n\n***Issue***\n\n*The issue arises when one or more property owners refuse to sell at the offered price, holding out for a higher price. They can do this because they understand that their land is vital for the project, giving them considerable bargaining power. They essentially hold the project hostage, hoping to extract a higher payment from the buyer.*\n\n*The holdout problem can lead to significant inefficiencies. For example, projects might be delayed or even abandoned because of one or more holdouts, which can result in considerable social and economic costs. Alternatively, projects might be rerouted or redesigned to avoid dealing with holdouts, but this can lead to suboptimal outcomes, such as less efficient transportation routes or increased costs.*",
    "comments": [
        {
            "author": "toyguy2952",
            "body": "Its their land. If they don’t want to contribute or sell it thats the end of the discussion. Im sure any project can always be much more efficient if everyone agrees (or is forced to agree) to contribute their part for no cost. \n\nRealistically, property owners are only going to hold out if they have another opportunity for the land that is willing to offer them a greater RoI. From an efficiency standpoint, the greater demand behind the alternative opportunity implies that is the more efficient use for it in the big picture.\n\n“The holdout problem” is only a problem for violent actors pursuing total economic control",
            "score": 3,
            "replies": [
                {
                    "author": "Hairy_Arugula509",
                    "body": "What about if when the land is bought the owner already know that they have eminem domain rule in the territory?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Middle-Yak4367",
                    "body": "The problem expevolu is trying to solve is that of allowing people to create new countries. As explained in the text, in order to buy land to create a country an individual would have to agregate a gigantic number of properties. \n\nThere is a real market failure associated with this situation, generally referred to as 'Tragedy of the Anticommons'. From wikipedia: \n\n\"The two 'tragedies' may be compared as follows:\n• The 'tragedy of the commons' occurs when a resource has many users, none of whom own it, and thus none of whom have the ability to exclude others from using it, leading to the over-utilization of that resource.\n• The 'tragedy of the anticommons' occurs when a resource has many owners, all of whom have the ability to exclude others from using it, leading to the under-utilization of that resource. \n\n... The model was formalized by James M. Buchanan and Yong Yoon.\" \n\nI do agree that the solution of denying the ability of property owners to veto the sale of their own properties is potentially problematic, but there is a real market failure problem that needs to be overcome for new countries to be established in owned land. \n\nImagine you have to buy every single one of 1000 properties to establish your country, under normal property rules. Even if you could triple the productivity of the area with your new country, how confident would you be that you would be able to buy all the required thousand properties?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "toyguy2952",
                            "body": "If you cant afford to make your new country then either dont make your new country or settle for the land you have.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "finetune137",
            "body": "Imagine there are 9 men and 1 woman left on Earth. They need to procreate to save humanity. A woman decides she does not want to have sex with either man. Should men democratically vote?\n\nThis is the same scenario, just reduced to the basics that even the most dumb midwits understood it.",
            "score": 2,
            "replies": [
                {
                    "author": "Hairy_Arugula509",
                    "body": "And what would stop any of the men from raping the woman? Ah... Right enforcement agency. And which men would want to protect women that don't want to have sex with her?\n\nLike how does she pay?\n\n  \nShe also need food and comfort",
                    "score": 2,
                    "replies": [
                        {
                            "author": "finetune137",
                            "body": "You do realize simps exist? They are main enforcers of society's rules.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "smulilol",
            "body": "It's perfectly fine to not come in an agreement in free market, also if you own land and are not willing to sell it, it's not some kind of violation of market prices, the correct price is whatever both parties agree to.\n\nThe problem here is not for government or some other third party to solve, it's the corporations problem.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ILikeBumblebees",
            "body": "> The issue arises when one or more property owners refuse to sell at the offered price, holding out for a higher price.\n\nThe \"issue\" you're describing is just normal supply-and-demand economics.  If you've defined your project in such a way that it can only be accomplished in that specific spot using that specific person's resources, and you have no backup plans or alternative solutions available, that's completely on you -- the fact that you have made your own demand completely inelastic does not impose any obligation on anyone else to surrender their property to you at a price they're not happy with.\n\n> Alternatively, projects might be rerouted or redesigned to avoid dealing with holdouts, but this can lead to suboptimal outcomes, such as less efficient transportation routes or increased costs.\n\nWhy should other people be obligated to surrender their own resources in order to help you optimize the efficiency of your own projects?",
            "score": 2,
            "replies": []
        },
        {
            "author": "thermionicvalve2020",
            "body": "I don't consider initiating violence on someone a viable solution, so government doesn't have one.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CrowBot99",
            "body": "Something is *essential* yet the higher charge for it is above market value? No; it can't be both. \n\nFirstly, whatever it is, it isn't *essential*. You want it, full stop. Something that heretofore did not exist isn't suddenly going to become *essential*.\n\nSecond, if the location is really that valuable, that translates to a higher price. If it's more valuable... *then it's more valuable.*",
            "score": 2,
            "replies": []
        },
        {
            "author": "Numinae",
            "body": "A distributed denial of service, IRL. Just don't trade with them. ",
            "score": 2,
            "replies": [
                {
                    "author": "DMBFFF",
                    "body": "What if others will trade with them?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Head_ChipProblems",
                            "body": "No one can force you to trade. You as a business owner has to assume the risk that someone will not sell you or will sell you things at expensive prices.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "DMBFFF",
                                    "body": "Agreed.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Numinae",
                            "body": "Don't trade with them as well?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "maxcoiner",
            "body": "LOL @ \"eminem domain\" - Rappers don't own websites!  ;)\n\nSeriously, AnCaps prioritize property rights above all else. ALL else. Anyone on here suggesting that eminent domain is possible in Ancapistan is woefully misinformed. There wouldn't even be anyone to enforce such an idea, and the rest of ancapistan would strongly fight against it.\n\nIt's just our priority. Sure, it means there will be fewer high speed rails and mega-construction problems in ancapistan, but at least we all have a clear conscious because we didn't violently steal property from others.",
            "score": 1,
            "replies": [
                {
                    "author": "Hairy_Arugula509",
                    "body": "It would be possible in private cities. Also ancapnistan don't exist.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "maxcoiner",
                            "body": "Yet.\n\nIt'll likely take a seastead or moonstead to bring one about, but there's a will.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Character_Dirt159",
            "body": "I could get on board with “Eminem domain”. I assume that’s where we have a rap battle to decide. Eminent domain is super evil shit though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Middle-Yak4367",
            "body": "The discussion is a bit muddled. \n\nThe main question of the post is: \"How do ancapistan handle holdout problems?\"\nA link is then provided to a text on how the expevolu system deals with the issue. This may have caused some confusion, because expevolu is a system designed specificaly to allow the creation of new countries. In this context the holdout problem is more damning, so some way to deal with the issue may be required. In a normal country, one in which no new countries need to be established, the changes suggested in the expevolu text may be much less desirable. \n\nThat is, the rules of expevolu may be fit for the purpose of allowing ancapistan to come about, but not as the rules of ancapistan itself. \n\nAnother confusion in the discussion is that people seem to be under the impression that the expevolu solution is eminent domain, however if you read the text you'll see that the proposed solution is quite different.\n\nCool to see expevolu being mentioned in libertarian circles. Promising idea.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DMBFFF",
            "body": "I haven't read all of what you've posted, but if I understand it well enough, the answer is no: anarcho-capitalists really don't have viable solutions to this problem, which means if they succeed, we will have:\n\n(.a) government monopolies replaced by private monopolies in the form of giant companies owning nearly everything,\n\n(.b) chaos,\n\nand/or,\n\n(.c) most ancaps abandoning anarcho-capitalism—if they were anarcho-capitalists to begin with—and approve of eminent domain laws—as Trump does.\n\nIndeed, as much of our infrastructure, such as roadways, is at least partially basted on expropriated land, many of the original owners will want their land back, or at least hefty payments.",
            "score": -8,
            "replies": [
                {
                    "author": "Head_ChipProblems",
                    "body": "How did a guy selling his crap territory for a million dollars, escalate into corporations with infinite money buying everything. Chaos. And everyone trying to retrace hundreds of years to find out who's the original owner of American lands? Yeah, not happening.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "kwanijml",
                    "body": "Not sure how you're coming to that conclusion.\n\nAlways remember that non-state coordinative mechanisms don't necessarily have to be better than the state's versions, in order to have a better situation on net in an anarchic society...you have to factor in the war and democide and torture and abuse and economic stagnation and prohibitions and inefficient policies and bloat and corruption which always come along with having a state, in order to get those apparently winning exceptions like clean air acts and infrastructure provided via eminent domain.\n\nBut that said, I doubt you have even heard of, and/or considered, a number of market mechanisms for coordinating public goods and against holdouts-  things like: assurance contracts/dominant assurance contracts, advertising/value-add, lottery, philanthropy, or sometimes just routing around a problem with entirely new technologies or innovative new market structures (e.g. a deep tunnel, or short-hop flights/taxis, if surface property owners won't sell at favorable rates for a roadway).",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DMBFFF",
                            "body": ">Not sure how you're coming to that conclusion.\n\nImagine America became ancap and a consortium of ancap billionaires wanted you to build an 8-lane highway. They will pay you $1 million a year and $20 million when you are finished. If you know nothing about highway construction, you can hire experts as consultants and/or managers.\n\nThe line between each end of the highway has to be at least 100 miles in distance, but the road length can't be over 1.2x that distance. e.g. If a direct line from end to end is 100 miles, the highway itself must be less than 120 miles. You must have it completed by the end of 2030.\n\nYou will be allowed up $20 billion to construct it (<$200 million a mile, or <$1 million per 264 feet).\n\nDo you think you could do it, particularly without eminent domain? \n\n&#x200B;\n\n>Always remember that non-state coordinative mechanisms don't necessarily have to be better than the state's versions, in order to have a better situation on net in an anarchic society...you have to factor in the war and democide and torture and abuse and economic stagnation and prohibitions and inefficient policies and bloat and corruption which always come along with having a state, in order to get those apparently winning exceptions like clean air acts and infrastructure provided via eminent domain.\n\nWhat if as well as not necessarily being better, it's barely a fraction as good?\n\n&#x200B;\n\n>But that said, I doubt you have even heard of, and/or considered, a number of market mechanisms for coordinating public goods and against holdouts- things like: assurance contracts/dominant assurance contracts, advertising/value-add, lottery, philanthropy, or sometimes just routing around a problem with entirely new technologies or innovative new market structures (e.g. a deep tunnel, or short-hop flights/taxis, if surface property owners won't sell at favorable rates for a roadway).\n\nSorry I don't know what \"assurance contracts/dominant assurance contracts\" means (I might look it up in time), or where philanthropy plays in this, but there are a bunch of land owners who care far less about a new highway than scoring big bucks.\n\nEven if you lined the highway will billboards I doubt it will pay the cost. Under ancapism, there will probably be lots of lotteries. What if the land-owners claim ground rights? I suppose one can go underground, though presumably it'd get more expensive the deeper one built, goodness knows how pile-ups, particularly those involving fire, would be dealt with, and maybe ban all but electric vehicles to deal with possible fires, as well as fumes.  \n\n&#x200B;\n\nI don't think this has ever been tried, at least on this scale.\n\n&#x200B;\n\nAlso, what if the owners wanted no blacks, Asians, or child-less women driving these highways?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}