{
    "title": "Humans crab mentality",
    "author": "CauliflowerBig3133",
    "subreddit": "Anarcho_Capitalism",
    "rank": 358,
    "score": 224,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 40,
    "url": "https://i.redd.it/g2a13yi70mie1.jpeg",
    "id": "1inf36a",
    "selftext": "Because humans have a crab mentality. We are not only selfish. We also compete with other humans for rare resources, mates, etc. Getting rid the more competent competitors are an effective ways to do so. \n\nDEI, income taxes, and Holocaust, and so on are motivated by that. Not going to say those are right or wrong but many people supported those sort of things. \n\nAnd commies are not the only ones complaining about inequality. \n\nMany of you are not commies. Fine. \n\nBut what do you think of a rich guy that has 10 spouses and 50 children? \n\nNot even libertarian people think it should be fine. \n\nIn fact there are so many laws that make those extremely and legally difficult. When crabs can vote they vote to make success difficult for other crabs. \n\nLife, for whatever reason, is not zero sum game like commies say. But it's far more zero sum than what libertarians believe. \n\n",
    "comments": [
        {
            "author": "RonaldoLibertad",
            "body": "If a man wants 10 wives and 50 children, that is fine by me, as long as it is voluntary and he pays for it all himself.",
            "score": 27,
            "replies": [
                {
                    "author": "CauliflowerBig3133",
                    "body": "That is not fine for many people. \n\nIs it fine for me. I used to think it's fine and I see nothing wrong with that. \n\nBut hei that's not the hill I would die on. I mean I have a hard time getting 2",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RonaldoLibertad",
                            "body": "No one's asking you to die on that hill.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CauliflowerBig3133",
                                    "body": "It's not okay for most people. That's all I am saying. Not that people should think that way. I think it should be okay. \n\nBut humans are envious. So they don't",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OppressorOppressed",
            "body": "Quote in image is interesting, rambling above image is incoherent drivel.",
            "score": 20,
            "replies": [
                {
                    "author": "CauliflowerBig3133",
                    "body": "What I am trying to say is most humans prefer outcome where the richest are poorer and the guy with most women got less even everything else is equal. \n\nThey prefer the rich to be poorer even if that means they are poorer too out of envy",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "ExcitementBetter5485",
            "body": "What makes you say that libertarians are against a rich guy having 10 spouses and 50 kids? I've only seen people complain about people having far more kids than they can support and how they only do so because of their reliance on welfare.",
            "score": 19,
            "replies": [
                {
                    "author": "CauliflowerBig3133",
                    "body": "Many people in libertarian forums are in favor of monogamy and anti eugenics. \n\nIn fact someone got banned from libertarian subreddit for mentioning that rich men should be able to just pay many smart pretty women to give him heirs. \n\nAll in all the laws in most democratic countries makes it extremely complex for a rich man to have many children. \n\nChild support laws, for example, make making your children rich extremely cost ineffective. Like how the hell paying $200k a month child support that the mom can squander will help your children got rich? \n\nYet many libertarians support that. \n\nVery few people, even libertarians, believe that rich father can just decide amount of child support  before conception. \n\nIf they can many women would rather simply pick being paid by richer guys instead of marrying someone poor. That is the precise reason why it's legally impossible.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rasputin777",
            "body": "A better way to put it: capitalism has an unequal distribution of wealth. Socialism has an equal distribution of poverty.",
            "score": 9,
            "replies": [
                {
                    "author": "deaconxblues",
                    "body": "I like this framing. Ironically, though, there is usually a privileged class under socialism also. The leadership class and high-ranking military and bureaucrats make out OK while the proles starve. North Korea has limped along this way for quite a while.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "rasputin777",
                            "body": "Yeah, totally agreed. The phrase, and socialism in general don't really apply to the plutocracy and connected government officials.  \n\nYou have a .001% who has all the money, and the rest of the people are destitute. The USSR was like that. China was like that until they embraced Capitalism. North Korea is like that. Many african socialist nations are or were like that.  \n\nThe kids go to Harvard. The rulers vacation in St. Moritz. The citizens live in extreme poverty.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Zealousideal-Skin655",
                            "body": "They seem to be doing okay in Norway.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "Is that the Norway that ranks [10th in the world on the Index of Economic Freedom](https://www.heritage.org/index/pages/country-pages/norway) (in comparison to the US at 25th place) in part because of its \"strong protection of property rights\" and low regulatory burden?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Zealousideal-Skin655",
                                            "body": "Sounds about right.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ILikeBumblebees",
                                                    "body": "Yup.  So how does what's going on in ultra-capitalist Norway relate to how things work with socialism?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Zealousideal-Skin655",
                                                            "body": "When people in America advocate for the same policies as Norway, they're called \"socialists\" and \"commies\".",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ILikeBumblebees",
                                                                    "body": "No, when people in America advocate for socialist policies, they're called socialists and commies.  \n\nSometimes socialists tell lies in order to fabricate examples of their policies working.  \"Norway is socialist\" is one of those lies.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Zealousideal-Skin655",
                                                                            "body": "Maybe you’re not understanding them.\n\nhttps://preview.redd.it/socyhor1xfje1.jpeg?width=223&format=pjpg&auto=webp&s=edb6dce403f045408b50699a1dc4f1fac3b2e5f5\n\n🇳🇴",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ILikeBumblebees",
                                                                                    "body": "Norway doesn't have an particularly \"strong welfare policies\" compared to the US.   Their taxing and spending is only slightly higher than the US.  Total government spending is 47% vs. 42% percent of GDP, and the top marginal income tax rate is 39% vs. 37.5%. \n\nThey do have a pension fund supported by oil revenues, but the US state of Alaska has something very similar.\n\nThe US funds programs through debt much more than Norway does.  US federal debt is 121% of GDP, compare'd to Norway's 37%.\n\nMaking the US's fiscal policies more like Norway's would be moving us further away from socialism, not closer to it.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Zealousideal-Skin655",
                                                                                            "body": "Norway offers universal healthcare that is mostly free at the point of service.\n\nMany people would consider that alone as a strong welfare policy difference. \n\nThey also provide free higher education, helping to reduce long-term inequality\n\nThey provide generous, paid parental leave (often including a dedicated father’s quota) and robust childcare support.\n\nThey avoid huge income inequality gaps through their tax-to-GDP ratios. \n\n>  \nMaking the US's fiscal policies more like Norway's would be moving us further away from socialism, not closer to it.\n\nI can assure you most left-wingers would be fine with that movement if accompanied by the policies seen above.\n\nbtw I've been to Norway. Had a great time. It's very much a capitalist country, but they have more peace of mind.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "deaconxblues",
                                    "body": "I’m talking about actual socialism. State socialism. Not the mixed economy that basically every developed country has, including the US, btw. The difference between Norway and the US is a difference of degree, not kind.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "rasputin777",
                                    "body": "Are you talking about Norway, the nation that taxes people starting at $19K a year in income (in USD) and caps out at 17.7%? Compared to the United States' 37% rate?  \n\nThat's not a good example of socialism. They also strongly encourage those on welfare to work, limit welfare claims to a 2 year max, and many other things I'd love to get here in the US to make the US *less* socialist.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Zealousideal-Skin655",
                                            "body": "That's my point.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vinylware",
            "body": "What are you getting at here? I did not understand a single thing you said because of how incoherent it is.",
            "score": 8,
            "replies": [
                {
                    "author": "Rieux_n_Tarrou",
                    "body": "That is because OP is confused. The quote in the image is spot on, tho",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "ElderberryPi",
            "body": "> But what do you think of a rich guy that has 10 spouses and 50 children?\n\nI think it's a bad idea on a socioeconomic level, but have no problem with it as long as it's voluntary. I don't have to live in their neighbourhood.",
            "score": 5,
            "replies": [
                {
                    "author": "CauliflowerBig3133",
                    "body": "I agree with you there is no problem if it's voluntary. \n\nIt's legally complex",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CauliflowerBig3133",
                    "body": "I think it's good for socio economic. \n\nAren't you tired paying taxes to support welfare.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ElderberryPi",
                            "body": "> Aren't you tired paying taxes ~~to support welfare~~.\n\nYes",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CauliflowerBig3133",
                                    "body": "Well. This will lower taxes and welfare.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SrboBleya",
            "body": "I do not think about such a person. he is the one with the problem, lol\n\n\nSpeaking of crabs...\n\n\n\nI think if you want to \"suceed\" you just gotta do things or go places where no one has before. \n\n\nThis comes with some uncertainty, ya know? \n\n\nSo people will make sure to inform you that you can fail so you feel discouraged. \n\n\nI think this an example of the crab mentality you mentioned.\n\n\nAnd then those words of discouragment may take a toll and the crabs may win, especially if you are facing obstacles in your journey, which is a normal part of life.\n\n\n\nSo it is important to have a growth mindset instead of a fixed mindset in the face of obstacles. The crabs may very well lose then \n\n\n\nAnd yea many are crabs in an effort to protect their egos. It is somewhat natural.",
            "score": 3,
            "replies": []
        },
        {
            "author": "No-One9890",
            "body": "Does anyone else thing the crabs in a bucket thing is really just a misunderstanding?\nLike each crab likely has no idea what influence their actions will have on other crabs. They aren't pulling other crabs back in, they just think they can climb out using that crab. I dont know that crabs rly have a concept of weight and strength and such",
            "score": 5,
            "replies": [
                {
                    "author": "ClimbRockSand",
                    "body": "many humans have the same understanding of the world as a crab.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "No-One9890",
                            "body": "But it's important to note it's not spiteful",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CauliflowerBig3133",
                                    "body": "It is spiteful",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RonaldoLibertad",
            "body": "Based Higgs is based Higgs.",
            "score": 1,
            "replies": [
                {
                    "author": "CauliflowerBig3133",
                    "body": "What is Higgs?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RonaldoLibertad",
                            "body": "Dr. Higgs. The guy in your meme. https://en.m.wikipedia.org/wiki/Robert_Higgs",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sciirof",
            "body": "No income inequality sparks little to no ambition to do the jobs that currently pay more but that can have long hours or require more expertise required in fields like STEM, and others, coincidentally there is a post on AskReddit with this very question about equal wages. The comments speak for themselves, the world would crumble.",
            "score": 1,
            "replies": [
                {
                    "author": "CauliflowerBig3133",
                    "body": "Actually income inequality can be replaced by parenthood inequality. \n\nSo economically productive people don't have to be too rich if they choose to have more children instead. Like Elon having 100 children",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}