{
    "title": "Whitehouse Weaponized DOJ",
    "author": "None",
    "subreddit": "Anarcho_Capitalism",
    "rank": 346,
    "score": 133,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 42,
    "url": "https://www.reddit.com/gallery/1inr3ri",
    "id": "1inr3ri",
    "selftext": "This leaves it fair game for the other side or should the other side just turn the other cheek?",
    "comments": [
        {
            "author": "blackie___chan",
            "body": "It's the boondocks conundrum: is it ok to snitch to the police, on the police? \n\nThe answer is yes. Real world material losses is the only way out. Of all the Judeo-Christian values that will ultimately sink the West it's the over application of 'turn the other cheek'. There is no benevolent benefactor. If you do not secure your rights against tyranny, no one will.",
            "score": 44,
            "replies": [
                {
                    "author": "Intelligent-End7336",
                    "body": "> Of all the Judeo-Christian values that will ultimately sink the West it's the over application of 'turn the other cheek'.\n\nTurning the other cheek wasn't pacifism, it was a subtle act of defiance as it forced the aggressor to either escalate (acknowledging you as an equal) or back down.  Of course, that doesn't work when the other side doesn't care about honor to begin with.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "blackie___chan",
                            "body": "Or care at all because they only covet and recognize power and hierarchy derived from power. The only correct action Republicans have done in recent years was expand the removal of the filibuster for judges. It's never materially expanded since, not for the left not trying, primarily for this reason.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WadeBronson",
                    "body": "Tit for tat theory. Agreed.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "blackie___chan",
                            "body": "Ok an individual level, between rational human beings, I agree with the concept that in a world that practices an eye-for-eye that humans will never see opportunity because everyone is blind. \n\nGovernment, especially in a republic, is not individuals. It is aggregations of people. The turn the other cheek concept isn't even applicable. It's a disingenuous approach by godless people who only worship at the altar of subjugating others to get the other side to unilaterally disarm. \n\nIf I have to play the government game then I choose to elect warriors that will fight against the internal lust for power that is the essence of government over a coward that rolls over on inapplicable principles so they can grift without the media being mean to them.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": ">  Of all the Judeo-Christian values that will ultimately sink the West it's the over application of 'turn the other cheek'.\n\nNote that this is particular to Christianity, and is [not a *Judeo*-Christian value](https://www.chabad.org/library/article_cdo/aid/1791975/jewish/Is-Turning-the-Other-Cheek-a-Jewish-Value.htm).",
                    "score": 4,
                    "replies": [
                        {
                            "author": "blackie___chan",
                            "body": "True. Good correction. Thanks",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "CarTar98",
                            "body": "Actually a significant point.\n\n\nIf Jews believed in turn the other cheek as well as other teachings of non-violence from Jesus, they would never have been the fucking bullies that they are in the Middle East.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "Like bullying Hamas into murdering civilians?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "CarTar98",
                                            "body": "No. More like committing acts that any other nation on the receiving end would call an act of war until extremist groups emerge and become popular because they are talking about revenge while their own government allows Israel to fuck them in the ass.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ILikeBumblebees",
                                                    "body": "> More like committing acts that any other nation on the receiving end would call an act of war until extremist groups emerge\n\nLike what?  Existing?  Why is the whole Middle East filled with extremist groups that are engaging in terrorism and insurrections in all sorts of places other than Israel?  \n\nWhat does Israel have to do with the conflict between Ba'athists, Sunni Extremists, Shi'a Extremists, Kurds, Alaouites, and every other faction under the sun in Syria?\n\nWhat does Israel have to do with ISIL in Iraq, or the Taliban in Afghanistan, or al-Qaeda's terrorist operations around the world?\n\nDo you really think that Israel provoked the emergence of extremist groups, or that being surrounded by extremist groups has provoked Israel's (admittedly sometimes excessive) defensive measures?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CarTar98",
                                                            "body": "Under Arab rule for a long period of history (most of the Middle East modern history) there were never as many or as intense wars in the region. Yes there were skirmishes, but the land was more peaceful without Israel there.\n\n\nYou might have different ideas for why Israel's presence causes such problems, but them just being there was an act of aggression by other nations. When they were established, many people lost their land. That isn't exactly the citizenry's fault, but that was the first impression that the nation made. The leaders gladly accepted stolen land after the war. Since then, they have made little effort to engage in peace. Rather, they invite aggression from other nations and then retaliate to gain more territory and influence in the region. (Cry bullying)",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Celtictussle",
            "body": "Can someone summarize for me? Maybe I’m too tired to see the connection.",
            "score": 17,
            "replies": [
                {
                    "author": "bongobutt",
                    "body": "Seconding the request.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Midnight-Bake",
            "body": "The only responsible action is to create barriers so the DOJ cannot be weaponized by the next president.\n\n\nSaying \"it's my turn to be a tyrrant\" is only a step away from actual liberterian solutions.",
            "score": 12,
            "replies": [
                {
                    "author": "Wrathofsteel",
                    "body": "My thoughts exactly, the most libriaterian first action move going into office would be dismantling the nsa, irs and cia.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "GoogleFiDelio",
                    "body": "No such barriers can exist. Anything done by executive action can be undone with executive action and the people working in the agency will still be partisan zealots.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Midnight-Bake",
                            "body": "Oh hey it's the guy that lied and said I never linked him to FEMA's migrant housing program and then claimed I was gaslighted him when I linked to the comment linking to the FEMA program. Good stuff.\n\n\n\n\nThe Republicans have control of all 3 branches of government. If they were serious about reform they have executive, legislative, and judicial options besides just EO. Hell, democrats are fearful he will target them so they'd probably have votes for constitutional amendment approaches as well.\n\n\nIf the system is so rotten it can't actually be fixed, as you suggest, then whatever is going on now in the administration is at best a shot of feel good heroine while the country dies of cancer.\n\n\nIf you're an accelerationist you do you.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "GoogleFiDelio",
                                    "body": "LOL you lied both times.\n\nThere aren't three branches of government, there's a fourth, called the bureaucracy, and they have no control over it. It created the Russia hoax this time around and is playing the firemen first game over the latest cuts while sabotaging the duly elected president at every opportunity.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-One9890",
            "body": "Well ya, the issue is the difference in treatment between trump, biden, and Obama who all had \"misplaced\" classified documents.\nWe alrdy had proof it was weaponization. All 3 should have gone to prison",
            "score": 5,
            "replies": []
        },
        {
            "author": "Savant_Guarde",
            "body": "If you were to remove Trump's name from any of the narratives and insert anyone else, even Trump’s most ardent enemies would say it was political persecution. \n\nOf course this was weaponization, easy to see.",
            "score": 6,
            "replies": []
        },
        {
            "author": "thelonioussphere",
            "body": "I don’t believe in turning the other cheek on almost any matter",
            "score": 5,
            "replies": [
                {
                    "author": "BarkleEngine",
                    "body": "I think initially, you give some room for misunderstanding. But once it becomes clear that people who disagree with you will do anything to compel your compliance to their point of view it gets difficult.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bongobutt",
            "body": "Fun aside about turning the other cheek:  \n  \nI've heard it argued by a scholar that the \"turning the other cheek\" story is misunderstood.  \n  \n> Matthew 5:38-42 - You have heard that it was said, ‘An eye for an eye and a tooth for a tooth.’ But I say to you, Do not resist the one who is evil. But if anyone slaps you on the right cheek, turn to him the other also. And if anyone would sue you and take your tunic, let him have your cloak as well. And if anyone forces you to go one mile, go with him two miles. Give to the one who begs from you, and do not refuse the one who would borrow from you.  \n  \nIt is obvious that Jesus is arguing for a non-violent form of resistance. \"Kill 'em with kindness,\" if you will.  \n  \nBut it isn't a good understanding to say Jesus is advocating \"rolling over\" when people bully you.  \n  \nUsing the mile example. Roman law said that a soldier on a road had the right to demand free labor from anyone, and force a civilian to carry his bags for up to a mile. So by \"volunteering\" to walk 2 miles, what are you doing? You are making it appear as though the soldier is breaking the law. The soldier is only allowed to force you to go 1 mile, and if he says, \"but the guy *volunteered* to go two miles!\" - no one will believe him. So you are going to get that guy in trouble. And the Romans were not *kind* when disciplining their soldiers.  \n  \nAnd the cheek example: note that it said slapped on your \"right\" cheek. Then offer the other. In other words:  \n\"Ohh. You just hit me with your left hand. That's your weak hand. *Give me a real hit.*\"  \n  \nIn other words, if you understand the context of the society they lived in, most of these things Jesus is calling for is begging for the other person to break the law. This is a call for a stiff spine and just defiance. It is saying not to retaliate, yes, but it is doing so in a way that is even more damaging to your \"enemy\" than hitting back would be.  \n  \nSo yeah. I advocate turning the cheek.",
            "score": 4,
            "replies": [
                {
                    "author": "bluefootedpig",
                    "body": "The context is that Jesus was explaining that we are not of this world, our treasure is up in heaven. So fighting evil here is pointless. \n\nIn your quote, it says \"do not resist evil\", your volunteering to make him look bad would be resisting evil.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "bongobutt",
                            "body": "You are arguing a semantic about resisting *evil,* when you should be arguing a semantic about *resisting* evil. What does *resist* mean in this context? The context is \"an eye for an eye.\" So resist means retaliation, revenge, and tit for tat. \"Resist\" means if you hit me, I hit you. So Jesus is arguing that we should *not* \"return evil for evil.\"  \n  \nSo I'd argue that Jesus isn't using the word \"resist\" in the broadest sense that we would. \"Passive resistance\" is not an oxymoron in our language, but it is an ironic concept.  \n  \nBut here is information about the Greek word for \"resist\" here https://biblehub.com/greek/436.htm :\n  \n> 436 anthístēmi (from 473 /antí, \"opposite/against\" and 2476 /hístēmi, \"to stand\") – properly, take a complete stand against, i.e. a \"180 degree, contrary position\"; (figuratively) to establish one's position publicly by conspicuously \"holding one's ground,\" i.e. refusing to be moved (\"pushed back\").  \n> 436 /anthístēmi (\"oppose fully\") means to forcefully declare one's personal conviction (where they unswervingly stand); to keep one's possession; ardently withstand, without giving up (letting go).  \n> [436 (anthístēmi) was a military term in classical Greek (used by Thucydides, etc.) meaning \"to strongly resist an opponent\" (\"take a firm stand against\").]  \n  \nIn a context of Roman society of the ancient world, I'd argue that the idea of \"passive resistance\" would sound far more like an oxymoron. \"To resist\" meant to not give up *any* ground without a fight. But Jesus is saying the opposite of that. Absolutely *do* concede ground. Take the hit. He isn't calling for a strength that prevents attack, but a strength that withstands it and gets pushed. If you are getting pushed (but are still standing), then by definition you aren't just falling over. So we could differentiate between \"resistance\" and \"repellance\" here - their society would primarily think about the latter, but Jesus is actively calling against the latter. That doesn't mean he is also calling against the former.  \n\nPut this in the context of the 1st century, and in the context of the early Church, and you can see application of the idea. Jesus did not oppose the Romans. He didn't advocate overthrowing Rome, and didn't support political action or terrorism (even though Zealot movements were very popular in the region). Christians weren't trying to overthrow Rome or \"oppose\" Caesar. But Christians had no problem with being a thorn in the side of the Romans. They stirred the pot plenty. They just didn't use force or violence to do it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "doecliff",
            "body": "This is a surprise? All presidents do this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy_Macaroon_1738",
            "body": "The Trump team took presidential records upon leaving the White House, just as every president in modern history has done. \n\nThe argument used by the Biden administration and the media was that Trump didn't follow proper procedures for the declassification of documents. \n\nThe issue with that argument is those procedures don't apply to the sitting President, only to subordinates. The President is free to declassify any document, at any time, for any reason, in any manner he sees fit.\n\nTrump's standing order at the time was that his own records were automatically considered declassified once removed from the White House. \n\nNo one has the authority to contradict the sitting President in such procedures, therefore the documents he left with were declassified. \n\nMonths into the Biden administration, more boxes of documents were delivered to to Mar a Lago. \n\nTrump was told those were his documents. \n\nIf I remember the time line correctly, that's when the conversation with the National Archives started.\n\nThe issue is that the back and forth with the National Archives was nonsense from the start, as an executive order by Obama, that Trump left in place, had all original records go to the Archives. \n\nIn other words, Trump only ever had duplicates in his office, and those are what he took.\n\nUnless of course originals or documents that weren't declassified were delivered to him by someone in the Biden administration. \n\nThat does seem to be plausible, as the charges were filed almost immediately after the delivery by the Biden administration. \n\nThen, during the raid, the boxes were opened, documents removed, put on the floor, and photographed with cover sheets.\n\nThat's the infamous photo. The documents were then placed back in the box out of order.\n\nJack Smith's team had to admit to tampering with evidence due to the existence of those photos.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GunkSlinger",
            "body": "With all the craziness going on I'd almost forgotten about all the classified documents Biden stored in his garage. I wonder if the Trump admin will prosecute him over that. My own stance would be to be above doing that.",
            "score": 0,
            "replies": [
                {
                    "author": "XDingoX83",
                    "body": "I would charge the investigators and staff who knowingly prosecuted a non case for political reasons. This isn't just Trump, more prosecutors should be charged with crimes when they knowingly go after innocent people because they want a conviction. When they withhold exculpatory evidence because their career matters more than the truth. That is one of the primary issues with the criminal justice system. The state has unlimited funds and power to contort the evidence against you with no ramifications. If prosecutors were personally liable for their actions more they would be far more likely to be fair in their prosecutions.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "30_characters",
                            "body": "This is a hard sell with any court. As often as people get frustrated with blatant police abuse of qualified immunity, prosecutorial immunity is even stronger, and weaker only compared to the near-absolute judicial immunity. \n\nThe courts won't look kindly on anything that represents a potential challenge to their special privileges.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "helmutboy",
                    "body": "That was already decided by the Special Council appointed by the Biden administration who determined that Biden two years ago was too feeble to stand trial (let alone be president), something at least half the country knew 4+ years ago.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "orwll",
                            "body": "I was just thinking about that the other day. I wonder when we're going to hear the recording of Biden's deposition in that case.\n\nIf (when) we find out the recording doesn't match the transcript, that's when things could get interesting.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Scipio_Columbia",
                            "body": "Close, but actually very different from what you said. The prosecutor said he thought Biden was fit to stand trial, but that he would use the idea that he was a tottering old man to his benefit such that no case should be pressed.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OSHAstandard",
                    "body": "Didn’t biden find the documents and turn them in and fully cooperate vs trump who refused to return. Then he and his lawyer drafted up a letter swearing that he turned everything over after giving some things back and then he had someone move the rest of the documents and then he got raided and they found the rest. Same same",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MindOverManner69",
                            "body": "Yes *exactly* the same... Conservatives on this sub rarely argue in good faith.\n\nThey're still claiming the guy who hit Pelosi with a hammer was his gay lover.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Will-Forget-Password",
                            "body": "\\*cough\\* Mike Pence \\*cough\\*",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BarkleEngine",
                            "body": "Biden wasn't even aware of the proceedings around him. He belonged in a nursing home.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GunkSlinger",
                    "body": "This also begs the question (colloquially), can a president preemptively pardon *themselves?*",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Will-Forget-Password",
            "body": "Category 5 consisted of any NARA inventory pertaining to the contents of the boxes. These records are being withheld in full.",
            "score": 0,
            "replies": []
        },
        {
            "author": "MindOverManner69",
            "body": "Trump was guilty as fuck. He was fucking recorded bragging about showing the classified docs.\n\nAnyone who thinks he's innocent in this as an absolute moron.",
            "score": -1,
            "replies": []
        }
    ]
}