{
    "title": "Trump shrugs off Libertarianism and might hit Argentina with tariffs",
    "author": "-Longchamps-",
    "subreddit": "Anarcho_Capitalism",
    "rank": 347,
    "score": 79,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 95,
    "url": "https://i.redd.it/ylamdzekgqie1.png",
    "id": "1inukml",
    "selftext": "",
    "comments": [
        {
            "author": "deefop",
            "body": "The guy has literally never been a libertarian.\n\nIt's a mark of how fucking broken the current zeitgeist is when the average moron thinks auditing the most blatant government money laundering is \"radical libertarianism\" as opposed to simply auditing the innumerable money laundering organizations that have been stood up over the last several decades.",
            "score": 174,
            "replies": [
                {
                    "author": "endthepainowplz",
                    "body": "Also cutting funding isn’t libertarian, that’s one part of lowering taxes, but if that doesn’t happen, which it likely won’t, it will just be raising prices through tariffs and taxing us the same. If people continue to equate Trump with Libertarianism it will hurt the image for years to come, it’s not a good look. He’s done some good, but I don’t see the tax cuts happening, which is the really big thing that most people could get on board with.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Gratedfumes",
                            "body": "I never thought he was a libertarian until all the libertarians started calling him a libertarian.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Darmin",
                                    "body": "A libertarian calling someone else a libertarian? \n\n\n*Doubt*\n\n\nPlus I'm the only real libertarian and I never said trump was one, so I have no idea what \"libertarians\" you're talking about. Sounds like fake news",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "loonygecko",
                                    "body": "I didn't see any libertarians calling him libertarian, I saw media doing that to try to smear the libertarians and I saw right wingers doing it to try to get our vote.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MFrancisWrites",
                    "body": "How leftists feel when we get lumped in with neoliberalism and progressivism",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ForFreedomLovers",
                            "body": "Neoliberalism and progressivism definitely aren't right wing.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "\"Neoliberalism\" is the rebranded name for the free-market policies of the late 20th century, i.e. Reagan, Thatcher, etc. influenced by Hayek and Friedman.  The term was created to enable left-wingers to rehash tired, long-refuted arguments against capitalism and free markets and sound like they're saying something new.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "MFrancisWrites",
                                    "body": "Leftists are not liberals. If you're using leftist to describe \"anyone left of center\", that's pretty novel.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ForFreedomLovers",
                                            "body": "that is the common definition, yes.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "MFrancisWrites",
                                                    "body": "Nah, not to people outside this sub. There's more difference between me and a brunch liberal than me and you. We may all be \"left wing\" (even if I think our center leans pretty far right, with some form of capitalism being defended by both parties), but the term leftist refers to a different group.\n\nBut helpful when you can just lump as all in and then make fun of me for Pelosi lol",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "ForFreedomLovers",
                                                            "body": "Yes, to common people, left of center is left.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MFrancisWrites",
                                                                    "body": "The world sure is boring when you reduce everything into binary terms, isn't it?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ForFreedomLovers",
                                                                            "body": "thank you for assuming I am the progenitor of the left-right paradigm.  didn't know i was such a trendsetter.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MFrancisWrites",
                                                                                    "body": "What percentages of your exchanges in these parts, do you figure, have you walking away having learned or grown or accomplished something? What are you doing to help get that number up and make your time on this algo worthy of you?",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ForFreedomLovers",
                                                                                            "body": "Why would you think I owe you an answer to those questions?",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Secretsfrombeyond79",
            "body": "Milei is traveling to the USA in the 19 of February to negotiate a free trade treaty. Since Trump can't simply make exceptions because someone is his friend I'll withhold my opinion on him being a backstabbing piece of shit until a good news about those negotiations comes up.\n\nStill Trump hitting everyone with Taxes including Argentina was within my predictions as well.",
            "score": 41,
            "replies": [
                {
                    "author": "prodezzargenta",
                    "body": ">Milei is traveling to the USA in the 19 of February to negotiate a free trade treaty. Since Trump can't simply make exceptions because someone is his friend I'll withhold my opinion on him being a backstabbing piece of shit until a good news about those negotiations comes up.\n\nI was about to write something similar! I hope that free trade treaty could be finally done. We have some issues with Mercosur (a shitty customs union that only served to be isolated from the world), but I'm hoping Milei could do it.\n\nPS: Happy cake's day!",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "upchuk13",
                    "body": "Being his friend is definitely grounds for an exception. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Secretsfrombeyond79",
                            "body": "He's a president, not the owner of a store, he can't use a country however he wants, and especially not to give exceptions to friends. Not if he wants to not get destroyed in the midterms.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Brutus__Beefcake",
            "body": "The goal shouldn’t be for Trump to be the first libertarian President or be mad if he is / isn’t a true one. The goal should be to get him to help shift the Overton window towards more libertarian politicians.",
            "score": 73,
            "replies": [
                {
                    "author": "CrowBot99",
                    "body": "No, yes.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "loonygecko",
                    "body": "I think a lot of why I was excited about the USAID thing was because it opened more people's eyes about the evils of govt which could work in our favor for the long game.  \n\nUnfortunately most the rest of his stuff coming out has been antilibertarian, tariffs and the recent republican budget proposals to increase defense spending, even though Biden already increased it, they want more increases. We should be cutting that shxt.  \n\nThey also want to cut social programs and long term I am for that eventually but short term, i think we should get the economy up and running first, people really are hurting right now. Other than if they find obvious fraud that's not truly helping people, and can expose it clearly, then I think it's stupid from a political perspective as well as an ethical one to be targeting that before other crap like military and foreign spending.  Quit all the foreign war bs, propping up Israel and Ukraine, etc and we won't be spending so much money on so called 'defense.' And social programs should be last on the chopping block after all the worse stuff is chopped and the economy is better.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "> And social programs should be last on the chopping block after all the worse stuff is chopped and the economy is better.\n\nLibertarian activism needs to be 80% social and 20% political.  And by \"social\", I don't mean going around spouting ideology at people, I mean working to create decentralized institutions capable of doing the things that people currently turn to the state for.\n\nFocusing on the political side of things, and working to cut programs people are dependent upon before we've developed non-political alternatives, will just turn people against us, make enemies out of people who should rightly be on our side, and create an authoritarian backlash.\n\nMaslow's pyramid is real.  If people are relying on the state in order to eat -- even if they acknowledge that their dependence diminishes their autonomy -- threatening to cut those programs will still turn them into tooth-and-nall defenders of the state, because hungry people will pick food over liberty.  If we help them feed themselves first, then they'll happily fight against political interventions alongside us.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "> The goal should be to get him to help shift the Overton window towards more libertarian politicians.\n\nThat would be a great goal.  How do we get him to shop shifting the Overton window towards nationalist and authoritarian positions, and get him to do that instead?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Brutus__Beefcake",
                            "body": "Those get dems to move towards libertarian positions. It’s actually the only time they do. The hard part is being them to keep those beliefs once they are back in power.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "I suppose that's a reasonable point, but then we're just ping-ponging back and forth, with the more libertarian party being the one that has less power at the moment.\n\nHow do we shift the Overton window to more libertarian positions among those who currently have political power?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Brutus__Beefcake",
                                            "body": "Pick the libertarian things already like and focus on pushing those. Example, focus on the slashing and burning they are trying to do to agencies. Have to take small wins and then try and nudge them on other things where they show some wiggle room.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ghost_Turd",
            "body": "Nobody thinks Trump is now or has ever been a libertarian.",
            "score": 71,
            "replies": [
                {
                    "author": "Midnight-Bake",
                    "body": "The former chair of the LNC touted him to the liberterian party as being liberterian and he himself called himself a liberterian.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "CrowBot99",
                            "body": "And I'm an aardvaark.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "ElderberryPi",
                            "body": "My socialist cousin called herself a libertarian during the Ron Paul revolution…",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Midnight-Bake",
                                    "body": "Was she also elected as the LNC chair for 3 years?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "ElderberryPi",
                                            "body": "I did not dox myself.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "loonygecko",
                            "body": "You are going to have provide evidence at this point to be taken seriously bro.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Midnight-Bake",
                                    "body": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1imtwol/comment/mc5iy6h/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button\n\n\n\n\nThis was a whole thread on here a few days ago. Dude also has link to Trump calling himself liberterian somewhere in the thread.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Secretsfrombeyond79",
                            "body": "Didn't that one steal funds from the party and was expelled/left ?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Midnight-Bake",
                                    "body": "Sure, after chairing the party for 3 years and promoting Trump as being liberterian for the whole election cycle.\n\n\nIt's not like she was some unknown or uninfluential person the whole time.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AdventureMoth",
                    "body": "\"Nobody thinks X\" just means *you* haven't encountered it & recognized it.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "ILikeBumblebees",
            "body": "Corrected headline: \"Non-libertarian Trump might hit Americans with higher taxes on products they buy from sellers in Argentina\".",
            "score": 33,
            "replies": [
                {
                    "author": "NichS144",
                    "body": "Those kids would be very upset if they understood economics.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spats_McGee",
            "body": "So much for Milei's \"influence\"....\n\nRemember kids, Trump's particular brand of transactional politics wins out over \"principle\" any day of the week.",
            "score": 18,
            "replies": [
                {
                    "author": "montero65",
                    "body": "\"BuT I tHouGht Milei waS foLloWinG TruMpS plaYbOok?\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "loonygecko",
                            "body": "What? Nah, we just hoped that Trump would follow a tad of Milei's play book.  And he actually did, but only on one thing.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "myadsound",
                    "body": "Seems like if milei had dissolved the state this could have been easily avoided",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "How would Milei magicking the Argentine state out of existence in a single instant have restrained Trump from raising taxes on Americans?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "myadsound",
                                    "body": "Cant put tariffs on a state that doesnt exist!\n\n\nAncaps are anti-state, btw, so the answer was pretty fucking obvious 😂",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "> Cant put tariffs on a state that doesnt exist!\n\nYou can't put tariffs on a foreign state at all.  Tariffs are taxes levied against your own citizens when they make purchases from overseas.  The government of Argentina disappearing wouldn't make all of the businesses in Argentina disappear, and Trump could still attempt to tax Americans for buying their products.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "myadsound",
                                                    "body": "Im happy youve figured that out. Its interesting you felt for some reason its relevent to tell me tho 🤣\n\n\nNot really one for context and caustic humor?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ILikeBumblebees",
                                                            "body": "Ah, sorry.  Didn't realize you were trying for humor.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "myadsound",
                                                                    "body": "The funniest part is milei wont ever dissolve the state",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "loonygecko",
                    "body": "IMO, Milei was smart to try.  Argentina is much weaker than the USA and will do better with cooperation from us so it was totally intelligent for Milei to try to get on Trump's good side. If it didn't work, well all he lost was one plane trip and a few days of schmoozing.  Milei is not going to win every battle, but hopefully he will still win the war.  This tariff thing might also push Argentina more towards Brics again, it will be interesting to see how this pans out. One thing about the last 4 years is that the USA has pushed a lot of foreign allies too far and they are distancing themselves and Trump seems to be just making it worse.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ANightmareOnBakerSt",
            "body": "Does anyone think he is a libertarian? I don’t. Trump himself doesn’t, I am sure.\n\nHas he done some things libertarians might like? Yes\n\nFirst time in my life a president has  actively tried to decrease the size and scope of government. I feel like it’s the first political win I have ever had. \n\nI agree it is tainted win, but…",
            "score": 4,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "> First time in my life a president has actively tried to decrease the size and scope of government.\n\nNot sure how old you are, but I was alive during the era when Reagan was also doing performative theatrics that pretended to decrease the size and scope of government.  \n\nReagan, of course, was a very skilled actor, so his theatrics naturally weren't as hammy and over-the-top as Trump's.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Southernboiiiiii",
                    "body": "he's actually sold himself as a libertarian before though",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Spaceseeds",
                    "body": "Also why should anyone care that he doesn't tariff Argentina? Just because everyone likes their policies they get favorable treatment? What the fuck is this propaganda",
                    "score": -1,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "> Also why should anyone care that he doesn't tariff Argentina?\n\nMaybe they want to buy stuff from Argentina without having to pay more extortion money to the feds?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jeremybryce",
            "body": "Why would libertarianism have any sway on to tariff or not? Dudes throwing tarrifs around to any and every country, including MX and CA. Why would Argentina be any differen't? Trade deficient and/or restrictions on American product imports seem to be the key metric.",
            "score": 2,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "There's no key metric here.  Trade deficit is a bullshit concept that has no economic validity and is just polemic used by corrupt politicians.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Roanokian22",
            "body": "Oh my god. Trump mean!",
            "score": 2,
            "replies": []
        },
        {
            "author": "GoogleFiDelio",
            "body": "In other news the Pope shrugs off Islam.",
            "score": 2,
            "replies": []
        },
        {
            "author": "krazay88",
            "body": "Where are all the usual trump conservative shills now??",
            "score": 7,
            "replies": [
                {
                    "author": "backtotheprimitive",
                    "body": "He done good things, and his economic side in imposing tarrifs is a bad thing .. Not a hard concept to grasp.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "mesarthim_2",
            "body": "Same people who kept telling us that Trump is like Milei, just better, are now gonna tell you how stupid we were to think that Trump is like Milei and that he's in fact, completely different and much better.\n\nJust a normal day in the office for the conservative statists :-D",
            "score": 3,
            "replies": []
        },
        {
            "author": "Impressive-Door3726",
            "body": "He has done some good things, but we need to remember that Trump is a conservative, and not on our side.",
            "score": 4,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "> Trump is a conservative, and not on our side.\n\nHe's neither a conservative nor on our side.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Impressive-Door3726",
                            "body": "Trump isn't a conservative? Then what?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LookAtMyUsernamePlz",
                                    "body": "He has no ideology or philosophy and few, if any, principles. He’s just a populist.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Impressive-Door3726",
                                            "body": "That is a fairly good description, but conservatism is the best ideology to describe him.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ForFreedomLovers",
                    "body": "closer to our side than kamala.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Impressive-Door3726",
                            "body": "Definitely.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "ILikeBumblebees",
                            "body": "Is he?  His economic policies aren't any better, and what else is as important?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "They are slightly better, and I'll take any gains I can get.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "How are they better?  He's threatening to slam us with tax hikes on consumer goods at a time when consumer prices are already massively inflated.  \n\nHarris was threatening to enact price controls, which is batshit crazy, but a lot less of a risk, because the executive branch doesn't have any discretionary authority to do that with, and such a plan would have to trudge through Congress and the courts, whereas there is standing statutory authority that the president can rely on to impose certain tariffs.\n\nSo Trump's economic policies are arguably worse.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "How would kamala be better?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "ILikeBumblebees",
                                                            "body": "Well, like I explained in in the previous comment (the one that you're asking this question in response to), Kamala was threatening to impose destructive economic policies that the president doesn't actually have any discretionary authority to implement, where as Trump was (and is) threatening us with stuff he actually does have some power to do.\n\nIt's like two people are each threatening to shoot you, but only one of them is currently holding a gun.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "AgainstSlavers",
                                                                    "body": "I disagree. She promised much more spending, taxes, and didn't even mention cutting back.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Great_Opinion3138",
            "body": "Isn’t it more about the same treatment ie reciprocity. That’s what he’s been saying constantly. If someone has a tariff then they get the same back now.",
            "score": 2,
            "replies": [
                {
                    "author": "loonygecko",
                    "body": "China has lower than average tariffs, only a tiny bit over ours.  And that's using 2021 rates before Biden raised tariffs on 200 diff countries.  Ours will possibly be some of the highest in the world now that Trump is further raising them.  Many of the countries with very high tariffs are in Africa.   \n\nTrump's main complaint has been the trade deficit which has nothing to do with tariffs.  It's when we import more than we export. But a lot of that is because our country is wealthy and buys and consumes a lot.  And also because our country is wealthy, our dollar is strong and that means goods from other countries are cheap when buying with the dollar.  If those other countries were also wealthy, there'd be no more savings and we'd probably not import nearly as much.  \n\nAlso the importing country business pays all tariffs so it just hurts American businesses. Now I have to pay tariffs to import my agate stones. Biden already cranked up tariffs to Brazil where I buy a lot so it's not like I can just buy from another country instead.  All the countries are tariffed highly and I, the american business, pays all of them.  The other country is indirectly hurt due to me buying less due to me having to raise prices and selling less.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Great_Opinion3138",
                            "body": "Well he also talks about trade deficits which china has a massive one with the USA.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "loonygecko",
                                    "body": "I literally already brought that up and already discussed it in the second paragraph.   I have yet to hear why a trade deficit is automatically a bad thing, especially when a lot of the shxt we buy is nonessential.   If he's worried about the USA being independent, he'd only need to put tariffs on essentials for our country's functioning, not every tiny everything.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MindOverManner69",
                                            "body": "I have a trade deficit with the grocery store. I'm mad. Grrrrrrrrrrr.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "loonygecko",
                                                    "body": "That's ok, we'll fix it by adding a tariff. Every time you buy food, we'll now charge you an additional 25 percent and give that to the govt, now you'll buy less food from the grocery store lowering the trade deficit, yeah!!!   You'll feel more pressure to buy more from the more expensive gas station around the corner and you'll have less dependency on the grocery store in the future.  Problem solved right?  ;-P",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "Countries threatening each other with tariff reciprocity is like two guys in a standoff, each pointing a gun at his own head and telling the other \"drop the gun or I'll shoot!\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impressive-Door3726",
            "body": "The Republicans stabbed us in the back. What a surprise.",
            "score": 2,
            "replies": []
        },
        {
            "author": "EasyCZ75",
            "body": "Bullbutter. Not gonna happen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RacinRandy83x",
            "body": "Why does the orange man think a trade deficit is the US government subsidizing that country?",
            "score": 1,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "Either he's a moron who believes it's true, or he's a cynical manipulator who knows he can get support from morons who believe it's true.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheFortnutter",
            "body": "where are the cuckservative america firsters when we need them?",
            "score": -1,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "Drinking the kool-aid.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheFortnutter",
                            "body": "thats...  my point.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Emergency_Accident36",
            "body": "he's quite the opposite of a libertarian. But much more similar to an ancap than a neoliberal would be.  He may create the world where a \"freemarket\" inherently run by defacto government exists.\n\nIf the US was a private company tariffs would not violate any libertarian principles because that company and its territory would be privately owned and governing themselves",
            "score": -1,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": ">  But much more similar to an ancap than a neoliberal would be.\n\nI mean, the term \"neoliberal\" refers to economic policies influenced by Hayek, Friedman, etc., so no, Trump is vastly less anarcho-capitalist than neoliberals.\n\n> If the US was a private company\n\nIf the US was a pizza, it might have pepperoni on top.  If it was a bicycle, it would have two wheels.  If it was a mountain, people might climb it, and if it were an ocean, people would sail on it.\n\n> tariffs would not violate any libertarian principles because that company and its territory would be privately owned and governing themselves\n\nThe concept of tariffs has no meaning in relation to private entities managing their own property.  This is a complete non-sequitur.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Emergency_Accident36",
                            "body": "Oh a fallacy. What fallacy involves taking two sentences clearly built on each other and diseecting them individually?  [edit] oh wait it was one whole sentece..  even worse",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WillBigly",
            "body": "\"Shrugs off libertarianism\".......bro has an oligarch running around setting things on fire lmao this is the culmination of decades of libertarian policies: fascist oligarchy",
            "score": -6,
            "replies": []
        }
    ]
}