{
    "title": "Disappointed in people",
    "author": "Snoo_64008",
    "subreddit": "Anarcho_Capitalism",
    "rank": 354,
    "score": 17,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1inyl6w/disappointed_in_people/",
    "id": "1inyl6w",
    "selftext": "The other day I was talking to my parents about this show \"India's got latent\" it has been in some controversy recently due to vulgar jokes and stuff and it's all over the news and one of the hosts ranveer allhabadia might potentially go to jail because people say he is ruining \"society\" now I must say I don't watch \"India's got latent\" or Ranveer allhabadia but i think this is clear violation of free speech can't i justify anything with the logic that this harms our culture for example What Hitler did that news are bad for society hence we kill them all. Yet my parents disagree i genuinely thought that people agree with freedom of speech all across the political spectrum but i think I am wrong just wanted to get my thoughts out there i think I feel better after typing this.",
    "comments": [
        {
            "author": "NonPartisanFinance",
            "body": "I'm going to assume English isn't your first language b/c there is 2 total periods.\n\nBut sure going to jail for vulgar jokes is not pro free speech.",
            "score": 17,
            "replies": [
                {
                    "author": "MaelstromFL",
                    "body": "COBOL, period assumed...",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Snoo_64008",
                    "body": "Ye its not my first language",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "brewbase",
            "body": "Free speech is a very uncommon idea even in the west.",
            "score": 14,
            "replies": [
                {
                    "author": "Snoo_64008",
                    "body": "Damm I see it is truly sad then",
                    "score": 8,
                    "replies": [
                        {
                            "author": "MaelstromFL",
                            "body": "Even in America where we have an actual \"right\" written into our constitution, people and our government are trying to limit speach.  That being said, American Television bans a lot of words, and always has. They went through a very convoluted thought process to get there but, in the end they were successful.\n\nHowever, that ban is only for broadcast television, cable and internet are far less strict.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Snoo_64008",
                                    "body": "Ic mostly I feel sad for the creator of the show samay Raina the media trials are very brutal he deleted all the episodes of India's got latent",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Official_Gameoholics",
            "body": "India is a shithole from what I've heard.",
            "score": 4,
            "replies": [
                {
                    "author": "Snoo_64008",
                    "body": "U certainly are not wrong about it.i intend to move out of this madhouse",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Official_Gameoholics",
                            "body": "I wish you the best of luck in that endeavor.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "maxcoiner",
            "body": "Every country has it's own comfort level with freedom of speech. Even the USA, where our 1st amendment guarantees that everyone has a right to speak freely without fear from anyone else. -Yet it took Elon Musk paying $44 Billion to buy twitter for us to be able to speak (mostly) freely online again. We are still constantly policed on all other platforms (even reddit) from talking about certain subjects that those who hold power don't want us talking about.\n\nChina is obviously much worse; you can go to jail just for comparing Xi to Winnie the Poo or bringing up Tienanmen Square. I think India is right in the middle. Modi doesn't want you talking about a lot of things that will embarrass him, and other Indians just aren't comfortable thinking like Americans because they have to stay down under Modi's standards of freedom.",
            "score": 4,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "> -Yet it took Elon Musk paying $44 Billion to buy twitter for us to be able to speak (mostly) freely online again. \n\nNo, that's what it took to speak semi-freely on *Twitter* again.  But Twitter was always a cesspool of horseshit to begin with.  Lots of other places to post stuff online.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}