{
    "title": "Grift",
    "author": "ProtectedHologram",
    "subreddit": "Anarcho_Capitalism",
    "rank": 327,
    "score": 603,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 88,
    "url": "https://i.imgur.com/avxedsv.jpeg",
    "id": "1io22tq",
    "selftext": "",
    "comments": [
        {
            "author": "libertarianinus",
            "body": "For 2000+ years, churches clothed rhe naked and fed the poor. This is why they get tax-exempt status. Churches used to be very very thrifty feeding the hungry because the volunteers do this for free. If Churches get paid by the government, are they contractors/employees for the government?",
            "score": 126,
            "replies": [
                {
                    "author": "GoogleFiDelio",
                    "body": "Yep, this should be the dual of them not being taxed. You don't get taxed but you don't get tax money.",
                    "score": 55,
                    "replies": [
                        {
                            "author": "Likestoreadcomments",
                            "body": "I like that deal, lets just make it for everyone",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "BarkleEngine",
                                    "body": "Even better, you get coercively confiscated money, you don't get to vote.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bluefootedpig",
                            "body": "tax them, and if they are actually doing charity work that is yielding results, we can pay them like we do contractors, and like contractors, tax them on that money too. No special exemptions. My church used to pay for family vacations by writing it down as mission trips. They were family vacations.",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "Likestoreadcomments",
                                    "body": "“Tax them”\n\nLost redditors…",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "bluefootedpig",
                                            "body": "Yes, no special treatment. Why do I get taxed, but someone believing in a sky fairy is not? \n\nHow about, stop taxing me, and tax churches instead.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Likestoreadcomments",
                                                    "body": "No instead, you lunatic. Stop taxing everyone. \n\nAgain, why are you even here?",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ForFreedomLovers",
                                    "body": "yet the government yields negative results by taxing, so abolish the government.  i like it!",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "GoogleFiDelio",
                                    "body": "Nah, most things shouldn't be taxed, but specifically those. Guns shouldn't be taxed either. \n\nThey should not be contracting charity work to government.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Skogbeorn",
                                            "body": "*>*most",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Coy_Featherstone",
                    "body": "Churches are tax exemption ever since the Roman catholic church was legitimized by the state. It was a bargain which said.... you legitimize me, give me tax exemption status, and i will not work against you. Churches aren't allowed to defy the gov or else they lose their tax exemption status. This is still the bargain.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "BlueTeamMember",
                            "body": "Scientology has entered the chat.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mtmag_dev52",
                    "body": "\"But render unto Caesar, durr\" [ especially if Caesar is conveniently left wing\"]",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "maxcoiner",
            "body": "How is it that the day after Trump's inauguration he happened to wind up in her cathedral? I mean what are the odds?",
            "score": 28,
            "replies": [
                {
                    "author": "Senior_Apartment_343",
                    "body": "Trumps playing chess while Rachel maddows aunt is playing checkers",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Southernboiiiiii",
            "body": "don't wanna be annoying, but source?",
            "score": 20,
            "replies": [
                {
                    "author": "ParticularAioli8798",
                    "body": "Just a few links. \n\nhttps://simonmercieca.com/2025/02/03/the-controversy-surrounding-bishop-mariann-budde-and-episcopal-migration-ministries/\n\nhttps://en.m.wikipedia.org/wiki/Mariann_Budde\n\nhttps://apnews.com/article/trump-inaugural-prayer-service-episcopal-bishop-mariann-budde-60d409d1ba9b69ad1065065b9218c558\n\nhttps://episcopalmigrationministries.org/advocate-2025/",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mudhutted",
            "body": "Statist.",
            "score": 27,
            "replies": [
                {
                    "author": "BarkleEngine",
                    "body": "Government Supremacist.",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "xSparkShark",
            "body": "Im sorry but this sub is becoming a right wing cesspool with only very loose connections to anarcho capitalism. \n\nNothing about this is sourced, we’re taking this tweet fully at face value as being true. Furthermore no evidence is presented that she herself is receiving a payday from the supposed government grant. If she was embezzling the money for her own gain that would be super illegal. \n\nIf this were an anarcho capitalist criticism of state funding such things that would be different, but this is clearly posted to take a shot at this woman.\n\nFuck I kinda like that there are subs on this site that are more right leaning to balance out the rest, but this shit is why no one takes American conservatives seriously.",
            "score": 62,
            "replies": [
                {
                    "author": "MindOverManner69",
                    "body": "Last year OP was posting here under 4 different accounts at the same time. He's a GOP or foreign shill. No real person posts 1 sided bullshit under 4 different accounts to the same sub unless they have an agenda.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "zombient",
                    "body": "But but but it’s in meme format so it has to be true!",
                    "score": 23,
                    "replies": [
                        {
                            "author": "seenthevagrant",
                            "body": "And they used an unflattering picture, has to be legit!",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "itsmechaboi",
                    "body": "That's what drives me fuckin nuts about X. \"BREAKING: A THING HAPPENED\" with no source whatsoever and everyone immediately takes it at face value. Of course it's because hot headlines = more interactions = bigger payout. I liked the idea of monetization but it's made the platform much, much worse overall. \n\nBut yeah it's a constant reminder that I don't actually like either side of the coin regardless of how sympathetic I can be to certain aspects.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "LoLItzMisery",
                    "body": "Becoming? My brother in christ it's been a MAGGOT cesspool for a while. Some say there's fraud and corruption taking place as well. Isn't that something? I also heard there's billions and billions and... actually even trillions of bots on here. We need to overhaul this subreddit and drain the corruption in order to restore the ancap subreddit again.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Wll25",
                    "body": "Trump is paying Ice more to resettle immigrants than her organization ever got",
                    "score": -1,
                    "replies": [
                        {
                            "author": "hkusp45css",
                            "body": "The endgame for ICE is getting them out of the country, her endgame was folding them into the populace, under the legal radar.\n\nThey aren't comparable.\n\nWith ICE's plan, they should stop costing us money, at some point. With her plan, they'd \\*always\\* cost us money.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "luciusetrur",
                                    "body": "Endgame for ICE is normalizing the police state more than it already is",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Wu-Tang_Killa_Bees",
                                            "body": "Yep. Can't believe \"anarchists\" support the state going around and kidnapping families because they don't have a magic piece of paper",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Bastyboys",
                                    "body": "Wtf, taxpayers?? Legal citizens? Costing money???",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "hkusp45css",
                                            "body": "Yes, those are all words.\n\nNow, if you add a few more compenents of an English sentence and arrange it all appropriately, you might create a thought someone could understand and respond to.\n\nGive it a shot, I believe in you.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Bastyboys",
                                                    "body": "Integrated legal migrants generally contribute more to their new country than they take. For example in the UK they contribute more than citizens born in the uk",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "hkusp45css",
                                                            "body": "But, those aren't the people we're discussing.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Bastyboys",
                                                                    "body": "Oh \"immigrant resettlement\" isn't for legal peoples?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "hkusp45css",
                                                                            "body": "You still comparing illegal and legal immigration as if they are the same thing",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Bastyboys",
                                                                                    "body": "Is it me not making the distinction or OP?",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Wll25",
                                    "body": "Fuck your legal radar",
                                    "score": -13,
                                    "replies": [
                                        {
                                            "author": "hkusp45css",
                                            "body": "I mean, I'm kind of a big fan of no government and open borders. But, if you want to get there, we need to remove some of the costs associated with people being here without a legal status.\n\nUntil you do, the pragmatist in me says \"we need to uphold the laws as written.\" Not because I agree with them, but because doing away with \"legal status\" BEFORE doing away with all of the laws that are supported by the immigration policy is simply giving up and paying their freight out of my pocket.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Wll25",
                                                    "body": "I'd rather have an illegal immigrant living next to me than a statist",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "author": "hkusp45css",
                                                            "body": "I feel like you're so busy LARPing that you forgot to think.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "blackie___chan",
                                                                    "body": "Correct. What's the easiest way to lose any chance in alleviating the size and burden of the state? Allowing the State to import compliant voters who will vote for more state to support them. \n\nMeanwhile Jabronies like him don't vote, as an act of genuflecting, and can't figure out why the State is out maneuvering him.",
                                                                    "score": 10,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Wll25",
                                                                    "body": "Oops, wrong sub",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "ForFreedomLovers",
                                                            "body": "illegal immigrants are almost all statists, usually even worse statists than natives.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Aggravating-Tea6042",
                            "body": "What do you think the indirect cost is if they stay?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Spe3dGoat",
                            "body": "Do you believe we should enforce laws on the books or not enforce them ? Other countries enforce their borders. Canada is way more strict than we are. What exactly is it you want ?\n\nPersonally I want the USA to merge with Mexico and create  The United States of MexAmerica.  Dead serious.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GoogleFiDelio",
                    "body": "He church has taken tens to hundreds of millions in taxpayer money to facilitate the invasion, which also costs taxpayer money.\n\nIf opposing a destructive doom spiral that grows the government rapidly and leads us to socialism makes me \"right-wing\", then I'm \"right-wing\". I don't want to live in a one-party state run by the Democrats.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Plenty-Green186",
            "body": "Screenshots of tweets are not a good source",
            "score": 3,
            "replies": []
        },
        {
            "author": "yadius",
            "body": "The state corrupts everything is touches, including the churches.",
            "score": 7,
            "replies": []
        },
        {
            "author": "jamesbeil",
            "body": "Even assuming this totally fabricated figure *is* true, the total per year is...\n\n[https://www.episcopalchurch.org/ministries/episcopal-migration-ministries/](https://www.episcopalchurch.org/ministries/episcopal-migration-ministries/)\n\nAbout 6,000 people.\n\n6,000 refugees, per year. The US has a population of 330 millions. This is *below* fractions of a percent, not remotely significant. Show me a source for the money figure and you've got a point, but Christians spending money to get people out of awful situations and offer them safety is hardly earth-shattering.",
            "score": 12,
            "replies": [
                {
                    "author": "GoogleFiDelio",
                    "body": "\"Refugees\"? LOL. And if you believe any of their official numbers you're a fool. They're making tons of money by selling us out.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Spiritual_Squash_473",
                    "body": "9000 per illegal immigrant per year, by just one organization, and for purposes not including food stamps, free health care, etc, seems a bit steep to me.\n\nOut of curiosity, do you pay over 9000/year in taxes?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jamesbeil",
                            "body": "Not in the US, but yes. There are much more egregious examples of overspending in my country before we get to taking money directly out of the hands of refugees.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "GoryEyes",
                                    "body": "It’s money taken directly out of tax payers’ hands and given to the refugees. All of the money belongs to the tax payers.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Johnykbr",
            "body": "If your tax dollars were giving me millions of dollars then you bet your ass I would do everything I could to keep that sweet grift going.",
            "score": 2,
            "replies": []
        },
        {
            "author": "s3r3ng",
            "body": "She is not remotely crazy.   Trump is very much so.   Accusing here of just doing any part of her ministry for money only is cynical crap.   This is not the conservative subreddit BTW.",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "hardballwith1517",
                    "body": "That's a regular lady I think",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "presvil",
            "body": "I thought something had happened to Jeremy Irons",
            "score": 1,
            "replies": []
        },
        {
            "author": "HappyDappyFrog",
            "body": "“Have mercy” -Budde\n\nThis your Trump? \nhttps://www.snopes.com/fact-check/mar-a-lago-goat-trump/\n\nA statue of a goat replacing “In God We Trust” with “In Trump We Trust”\n\n\nBe a good Christian and buy your Trump Bible today!\nhttps://godblesstheusabible.com/",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlueTeamMember",
            "body": "INDULGENCES..... at least she has a future as a Mark Hamil impersonator for birthday parties.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eman9871",
            "body": "I still don't get why MAGAts were so upset that she asked to have empathy on minority groups. It says a lot about them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wll25",
            "body": "Isn't Trump paying more to resettle immigrants?",
            "score": -1,
            "replies": [
                {
                    "author": "yadius",
                    "body": "More than what? A single year supporting them, or a lifetime supporting them?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WarOk4035",
            "body": "This is a female ? Right ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "rustoof",
            "body": "Thats not a source. Thats some words and apicture. Grow up",
            "score": -1,
            "replies": []
        },
        {
            "author": "History_gigachad",
            "body": "But she was right though",
            "score": -9,
            "replies": [
                {
                    "author": "Creative-Leading7167",
                    "body": "about government policy or about christianity?\n\nClearly she was wrong about both, but I'm curious what you're thinking she was right about.\n\nGovernment is wrong to pay money to resettle migrants inside the US. We can talk about whether we should have open borders, but that was clearly not the policy in the US that Trump is ending and that she was actively benefitting from.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "denimdan1776",
                            "body": "She asked for empathy for your fellow man. That’s the core or Christan thought. At the very least “treating others as you would like to be treated”( golden rule) or “loving your neighbor as yourself” Matthew 22:39 was what she was asking for. She didn’t direct policy or really even call him out for the anti Christian behavior he has had in the past. She asked him to think about her fellow man and to have empathy when he is passing these laws.\n\nYou can argue whither or not that fits with your government but that is in line with Christ.\n\nAnd should the current government give money to resettle people safely it is not morally wrong as a Christian to take the money and help people.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "ravinggenius",
                                    "body": ">And should the current government give money to resettle people safely it is not morally wrong as a Christian to take the money and help people.\n\nIt is morally wrong to take money from others, regardless of what you do with the money after.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "MindOverManner69",
                                            "body": "And the guy she was talking to has taken money from so many others that he's been in court something like 3000 times. And found guilty of fraud many times.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ravinggenius",
                                                    "body": "Yeah I don't think Trump is a good person. I was talking about taxation, which is theft.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "MindOverManner69",
                                                            "body": "Sorta, but I mean they're opt in. I know quite a few people that pay zero taxes, I mean, they live on the street and dont work, but they exist. I just see it as a cost of doing business at this point.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Spiritual_Squash_473",
                                    "body": "Ah yes, the core Christian ideal of taking money from Paul to give to Mary.\n\nEveryone knows that Christian belief doesn't require personal sacrifice and charity when you can just take other people's money instead.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "denimdan1776",
                                            "body": "Thats Paul giving to Peter. And Personal sacrifice aside is it not better to use the resources available to aid the needy if it is available. Argue personal political all you want real politick is going to use it the same way you would use a tax loophole to avoid unneeded taxation. You don't see that as a fault, just being smart biased off your personal morals. How would a church be acting differently aside from their moral framework?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Creative-Leading7167",
                                            "body": "That this comment is being downvoted is surefire evidence redditors know absolutely nothing about christianity.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Creative-Leading7167",
                                    "body": "Oh yeah, sure, she really limited herself to \"having empathy\". She didn't mention ANYTHING else.\n\nGeez, grow up. When you're ready to have an honest conversation, we can. But obviously you aren't ready yet.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "denimdan1776",
                                            "body": "What else did she say then?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Creative-Leading7167",
                                                    "body": ">But for some, the loss of their hopes and dreams will be far more than political defeat, but instead a loss of equality and dignity and their livelihoods.\n\n\"Trump is going to take away our beautiful communist equality!\"\n\n>keep us all believing in and working to realize the ideals of the United States of America, ideals expressed in the Declaration of Independence, with its assertion of innate human equality and dignity.\n\nI mean, do I even have to explain why this is wrong?\n\n>But without unity, we’re building our nation’s house on sand, and with a commitment to unity that incorporates diversity and transcends disagreement and with the solid foundations of dignity, honesty, and humility\n\nAh yes, the good ol' christian parable about how we need to build our foundation on, not jesus christ, but diversity and unity. That's the rock upon which we should build.\n\n>I ask you to have mercy upon the people in our country who are scared now. There are gay, lesbian, and transgender children in Democratic, Republican, and Independent families, some who fear for their lives.\n\nThis is just delusional. Nobody is out on homosexual hunting parties to kill all the lesbians. Trump's not going to order the army to round up the gays.\n\nChristian's don't really like histrionics like this. It's just a manipulation tactic to make people submit after feeling guilty for something *they didn't do*. And if they don't submit, it's a rallying cry for others to pile on the hate over something *that never happened.*\n\nThis whole \"unity\" speech was such a sham. She wasn't praying for both sides to put aside their differences. She was praying republicans would \"unify\" with democrats by completely submitting to democrats. You should know this the minute she insinuated gay people's lives were at risk because of trump. This is not a rational debating point. This is a lie and an attempt at manipulation.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "denimdan1776",
                                                            "body": "Brother listen to yourself. The first quote is clearly about people getting deported. Ruining their livelyhoods and and emboldens the racists in our country. Which all has in fact happened.\n\nLoving your neighbor as yourself includes black and brown people and people who are not citizens of your country, it means everyone. \n\nWhat part of asking him to stick to our founding ideals is wrong? The part that says “all men are created equal”? \n\nEvery quote you have is asking him to live by his supposed Christan ideals. As a Christian you should be gracious and accepting of people because you are told TO LOVE THEM. \n\nShe asks for compassion in every single one of your quotes. Just because you don’t like that and apparently don’t follow Christs teaching doesn’t mean the message of calling for unity and compassion is a communist plot. \n\nFinally I’m not even a Christan I left the church bc of this kind of stupid hypocrisy of supposedly loving each other but then spewing hate from the pulpit. If asking to love one another is enough to send people rabid maybe you are in the wrong.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Creative-Leading7167",
                                                                    "body": ">Every quote you have is asking him to live by his supposed Christan ideals. As a Christian you should be gracious and accepting of people because you are told TO LOVE THEM.\n\nYou are once again prove you're not capable of having an honest dialogue. No, she wasn't just asking him to have a general love of his enemies. She repeatedly emphasized egalitarianism (read communism). She blamed him for threatening the lives of gay people which is completely delusional. Nothing about that is christian.\n\n>What part of asking him to stick to our founding ideals is wrong? The part that says “all men are created equal”?\n\nYes, it is an original christian idea that all men are created in the image of God equal. The idea that the state should step in to force this equality is a dystopian perversion of that true principle and is called communism.\n\n>She asks for compassion in every single one of your quotes.\n\nNo she didn't. That's just a straight up lie. She asked for egalitarianism and \"diversity\" she asked for \"unification\" but only under leftist principles. She asked us to deny reality to appease the emotional tantrums of trans activists who have worked themselves into the schizophrenic belief that their lives are at risk.\n\nBut you are fundamentally a liar, so you aren't willing to actually read her words.\n\nI have no problem with having compassion on the people who have butchered themselves because they were caught up in the evil sophistry of the trans cult. Compassion doesn't mean giving in to everything they ask. In fact, doing that is the opposite of compassion. It's more like indifference towards their own self destruction.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "miclem",
            "body": "Looks like a demon.",
            "score": -5,
            "replies": []
        },
        {
            "author": "Siatty",
            "body": "How about you shove your ruzzia sponsored propaganda up your bot ass",
            "score": -4,
            "replies": []
        },
        {
            "author": "SimonJester1",
            "body": "BWAA-HA-HAAA!",
            "score": -3,
            "replies": []
        },
        {
            "author": "GoogleFiDelio",
            "body": "Given what she used the funds for, it's also treason.\n\nShe has a six bedroom mansion in an expensive area of DC and is housing ZERO illegals.",
            "score": -6,
            "replies": [
                {
                    "author": "MindOverManner69",
                    "body": "There's no such thing as treason.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-One9890",
            "body": "Was she using the money for a different purpose?",
            "score": -1,
            "replies": []
        }
    ]
}