{
    "title": "I don't always agree, but this is Fire and needs to be said",
    "author": "None",
    "subreddit": "Anarcho_Capitalism",
    "rank": 319,
    "score": 594,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 133,
    "url": "https://v.redd.it/8xliu2nxwwie1",
    "id": "1iojlho",
    "selftext": "",
    "comments": [
        {
            "author": "CHENGhis-khan",
            "body": "Emotional blackmail is loosing its potency",
            "score": 90,
            "replies": [
                {
                    "author": "Dear_Suspect_4951",
                    "body": "Losing, but strongly agree.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "ZombieTestie",
                            "body": "LoS",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "EarlBeforeSwine",
                                    "body": "LoS?\n\nLaughing out side?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "HansGruberHk",
                                            "body": "Legion of Skanks. Dave Smith (speaking in this video) is a member of the Comedy Podcast Legion of Skanks.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EZeggnog",
            "body": "You can not like Trump and disagree with his policies (I didn’t vote for him and I think he’s an idiot. Also think a lot of his policies are stupid and/or unconstitutional). \n\nBut seeing Redditors do mental gymnastics to somehow hate the fact that this DOGE department is trying to uncover government mismanagement and fraud is genuinely insane. Like, how can you be upset at someone trying to stop the waste of tax dollars? How tribalistic do you have to be to disagree with that?",
            "score": 74,
            "replies": [
                {
                    "author": "s3r3ng",
                    "body": "This is the AnCap group.  We don't like ANY statist autocrat.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ParsleyNo6270",
                    "body": "Definitely. Not a fan of Trump on the whole. I didn't vote for him, and I think the anti-immigrant stuff is ridiculous and he's pushing it with tariffs too. So many things to criticize. But DOGE isn't it. It is in fact possible to look at issues one by one.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ripyurballsoff",
                    "body": "Auditing the government is fine. \n\nLetting a fucking moron do it is not fine.",
                    "score": -17,
                    "replies": [
                        {
                            "author": "GoogleFiDelio",
                            "body": "LOL you think Musk is dumb.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "seenthevagrant",
                                    "body": "No people who think musk has principles are dumb. If someone is claiming to want to cut gov spending and waste why hasn’t he given up his tens of billion in his own federal funding? Why isn’t he going after the actual culprit of debt, the dod? Why isn’t he only going after agencies that have investigated him? Why is he blowing up mole hill spending and feeding it to the media like it’s the biggest scandal in history? \n\nTrump and musk play the lp and continue to do so. I won’t become one of their drones running around like a giddy school girl bc they gave me some lip service.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "GoogleFiDelio",
                                            "body": ">If someone is claiming to want to cut gov spending and waste why hasn’t he given up his tens of billion in his own federal funding?\n\nSo instead of stopping trillions in waste you want his companies to launch the government's payloads to space for free? Is that your argument?\n\n>Why isn’t he going after the actual culprit of debt, the dod?\n\nHe will. Cutting state media off of funds and ending the invasion by stopping the NGOs is more important.\n\n>Why isn’t he only going after agencies that have investigated him? \n\nBecause Biden directed every agency to harass him and his companies, including bribing news agencies to lie about them. There is no agency that wasn't weaponized against him.\n\n>Why is he blowing up mole hill spending and feeding it to the media like it’s the biggest scandal in history? \n\nThe fact that the government has been couping our allies, funding censorship efforts, buying off the media, sowing DEI poison everywhere, and made COVID is the biggest scandal in history.\n\n>Trump and musk play the lp and continue to do so. I won’t become one of their drones running around like a giddy school girl bc they gave me some lip service.\n\nBro I've been a Musk fan since he started landing rocket boosters. Destroying the bureaucracy and your income stream is icing on the cake.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "seenthevagrant",
                                                    "body": "Oh man I would love to see any source showing he is stopping billions in waste much less the trillions you claim.\n\nIf he was only getting paid to use his equipment that would be fine. We all know that’s not the case. Most of the space x r&d has been paid for by taxpayers. That’s just space x. Tesla, nurolink, and boring company all receive funds. He was about to get another 400 million dollar contract for “armored teslas” until it was placed on hold after his hypocrisy was pointed out. \n\nCalling spending 8 million over 10 years “state media” is hilarious. I don’t like that we pay for news subscriptions but it’s clearly not a pay off. Politco runs on way more than a million a year. Gov employees simply turned in their subscriptions as a work expense. It’s not that fucking deep.\n\nHe will never do a meaningful audit of the dod. It’s his sugar daddy. Sure he will gain some access find some weirdly worded task force and spew it all over the news and people like you will gladly keep glazing over saving a couple mil while Elon rakes in billions of tax payer funds. \n\nPlease show some evidence Biden fraudulently went after Elon. \n\nDei is the puppet they want you pissed at when it barely affects 1% of the population, but go on enjoy your meaningless culture war wins.\n\nBeing a fan of someone is fine but shilling for them is just ridiculous. I like some of the advancements he has made, but he needs to stay in his lane. Just because someone is good at one thing does not mean they are good at everything. Making him a savior figure will only lead us to centralized power on par with monarchy per Curtis yarvins ambitions",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "GoogleFiDelio",
                                                            "body": ">Oh man I would love to see any source showing he is stopping billions in waste much less the trillions you claim.\n\nHe's done billions and is on track for trillions.\n\n>If he was only getting paid to use his equipment that would be fine. We all know that’s not the case. Most of the space x r&d has been paid for by taxpayers. \n\nThis is a lie.\n\n>Calling spending 8 million over 10 years “state media” is hilarious. I\n\nOh, it's way, way, way more than that.\n\n>I don’t like that we pay for news subscriptions but it’s clearly not a pay off. Politco runs on way more than a million a year.\n\nThey literally invented a super expensive subscription that costs 10k just for the graft. Stop lying.\n\n>He will never do a meaningful audit of the dod.\n\nPeople like you were saying he'd never land a rocket.\n\n>Please show some evidence Biden fraudulently went after Elon. \n\nHe said it on camera and nearly every agency was sicced on him.\n\n>Dei is the puppet they want you pissed at when it barely affects 1% of the population, but go on enjoy your meaningless culture war wins.\n\nIt affects everyone who works, goes to school, gets on planes, or has a doctor. It affects everyone. \n\n>Being a fan of someone is fine but shilling for them is just ridiculous. \n\nPointing out that you're lying isn't \"shilling\".",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "seenthevagrant",
                                                                    "body": "If you’re going to go around making those claims you gotta actually provide a source or else it’s meaningless. \n\nI’ve never doubted his technical prowess. I loved when he trolled flat earthers with his roadster. Hell I even have [this weird collectible](https://imgur.com/a/U8yck1F) on my bookshelf. \n\nHe’s has done some good but I have principles and lines. He has crossed the line. I have no hope of him doing any meaningful cuts or audits. He seems hellbent on bending the gov to his will in order to advance himself and those of his ilk. \n\nAgain I’m open to sources showing me wrong.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GoogleFiDelio",
                                                                            "body": "Do they not have google on your troll farm?\n\nYet you're doubting his ability to do what he did with SpaceX to the government.\n\nYou don't have any worthwhile principles if auditing the government and reducing waste betrays a lack of principles.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "seenthevagrant",
                                                                                    "body": "Troll farm lol\n\nYou can just say you have no idea what you talking about. It’s obvious anyways",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Nightshade_Ranch",
                    "body": "If they were looking for fraud, they would be using people who have experience doing so. That's not what's happening.",
                    "score": -6,
                    "replies": []
                },
                {
                    "author": "mister4string",
                    "body": "I would agree with you if the premise you put forth - that DOGE is trying to uncover mismanagement etc - were actually true. But I have ZERO faith in any of the motivations these criminals put forth publicly and I really do believe the fact that Musk's team is technical/software-based as opposed to financial in nature raises a huge red flag. Add that to the fact that none of them had any sort of security clearance and to me, you have the makings of a fucking heist. I truly believe they want to loot the country.",
                    "score": -11,
                    "replies": [
                        {
                            "author": "EZeggnog",
                            "body": "Well I’m probably not going to believe that until there’s some concrete evidence",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "FederalProduce8955",
                                    "body": "I would have liked to see some evidence before they started firing thousands of people. There has been no oversight into what DOGE is doing, people asking about it have been told to pound sand. The evidence they have shown has been marginal, vague, misconstrued, or just outright false.\n\nAs it stands they still haven't taxed the rich and until they do its the only evidence I need to see.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "True_Kapernicus",
            "body": "DOGE is there to eliminate waste and make the spending more 'efficient'. They can cut the spending a lot more if Congress gets keen on it.",
            "score": 11,
            "replies": []
        },
        {
            "author": "EccentricPayload",
            "body": "It is a coup, a much needed one. Return the powers to the 3 branches and the states instead of agencies that shouldn't exist.",
            "score": 15,
            "replies": []
        },
        {
            "author": "itsmechaboi",
            "body": "Dave Smith is basically always right though.\n\nIt's from [this episode](https://www.youtube.com/watch?v=zsxglsAzr5k) btw.",
            "score": 44,
            "replies": [
                {
                    "author": "exec_liberty",
                    "body": "https://youtu.be/Dho64EHHEFk",
                    "score": -8,
                    "replies": [
                        {
                            "author": "itsmechaboi",
                            "body": "I've been listening to and watching Dave for years, some hit piece isn't going to change my thoughts of him. Get 10 libertarians in a room together and see if you can get them to agree with each other on everything. Good luck. \n\nI'm assuming this is likely about borders as that's everyone's common complaint and I am also with him on that. In a stateless society that would be an entirely different conversation.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "exec_liberty",
                                    "body": "Whenever he gets asked a \"hard\" question that tests his adherence to the NAP he fumbles. He doesn't think two consenting adults should be able to do whatever they want with/to eachother when it's makes him feel uncomfortable or thinks it's a bad thing to do. That's the whole point of libertarianism... Consent.\n\nIt's not necessarily about being principled vs pragmatic. He has said himself that if you think him not being in favor of defending the right of consenting adults for certain topics isn't a libertarian position, he isn't a libertarian.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "itsmechaboi",
                                            "body": "Can you send me some examples that isn't a bunch of clips cut and pasted together? I really cannot think of anything I've heard that's made me think otherwise, but he also puts out a fuck load of content.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Choraxis",
                            "body": "Open borders is a retarded proposal while we still have the welfare state that we have. Abolish the welfare state, then we can honestly discuss open borders. Dave is right here.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PaperbackWriter66",
                    "body": "Except on immigration. And Ukraine. And Winston Churchill/World War 2. \n\nBasically, he's wrong any time adhering to libertarian principles would require going against the Patrick Buchanan/paleo-con social conservatism that is clearly Dave's real ideology.",
                    "score": -25,
                    "replies": [
                        {
                            "author": "ForFreedomLovers",
                            "body": "He's right on all of those, and he holds to libertarian principles on each.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "PaperbackWriter66",
                                    "body": "\"Dave Smith, how would you have tackled the threat of Hitler?\"\n\n\"I would have told him to knock it off, in a really stern voice.\"\n\nhttps://youtu.be/53x0FECym2M?t=1611\n\nDave is just completely wrong about Churchill and World War II, and is too stubborn to admit he bought into a lie peddled by Patrick Buchanan. \n\nThe libertarian principle is not \"don't do anything to oppose Hitler,\" by the way. The libertarian principle is to defend yourself against aggression.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "ForFreedomLovers",
                                            "body": "first is a joke.  \n\nthe libertarian take is to not fund hitler to begin with and not get involved in ww1 which caused hitler.\n\nhe's right about churchill, who was the first to target civilians for bombing in ww2.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "PaperbackWriter66",
                                                    "body": "And what a lame joke, too. \n\nBut what does it say about the seriousness of Dave's position on Churchill when, in response to a serious and fair question, the best Dave can do is make a lame joke and then change the subject?\n\nWhat is Dave's actual answer? \n\n>the libertarian take is to not fund hitler to begin with\n\nAnd the British didn't \"fund\" Hitler, so what's that go to do with anything? \n\n>he's right about churchill, who was the first to target civilians for bombing in ww2.\n\nReally? \n\nhttps://en.wikipedia.org/wiki/Bombing_of_Frampol\n\nhttps://en.wikipedia.org/wiki/Bombing_of_Wielu%C5%84\n\nhttps://en.wikipedia.org/wiki/Bombing_of_Warsaw_in_World_War_II#Siege_of_Warsaw_(1939)\n\nhttps://en.wikipedia.org/wiki/Namsos_campaign#Air_attacks\n\nhttps://en.wikipedia.org/wiki/German_bombing_of_Rotterdam",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "ForFreedomLovers",
                                                            "body": "there's no accounting for taste.  i laughed.\n\nJust six months before Britain went to war with Nazi Germany, the Bank of England willingly handed over nearly $9-million worth of gold to Hitler - and it belonged to another country.\n\n\nHitler didn’t start indiscriminate bombings — Churchill did\n\nhttps://www.spectator.co.uk/article/hitler-didn-t-start-indiscriminate-bombings-churchill-did/\nhttps://nationalpost.com/news/how-six-months-before-the-second-world-war-britain-gave-hitler-9-million-in-gold-that-belonged-to-another-country",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "PaperbackWriter66",
                                                                    "body": ">the Bank of England willingly handed over nearly $9-million worth of gold to Hitler - and it belonged to another country.\n \nAnd Churchill *opposed* that. The article that you shared even says so! So, again: what's your point? \n\n>Hitler didn’t start indiscriminate bombings — Churchill did\n\nHow can that be, when the Luftwaffe indiscriminately bombed Guernica in Spain *years* before Churchill became Prime Minister? \n\nOr are you going to argue that the destruction of the Polish town of Frampol by the German Luftwaffe in September 1939---months before Churchill became Prime Minister---was \"discriminate\"?\n\nhttps://en.wikipedia.org/wiki/Bombing_of_Frampol#/media/File:Frampol_bombing.jpg",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AgainstSlavers",
                                                                            "body": "DAVIES: Right - and made the British industries and public more vulnerable. You note that Hitler, for several months, declined to bomb London because he was still hoping to convince Churchill to see reason and negotiate a peace treaty. Churchill was insisting he would take the fight to Germany. He had his bombers bomb Berlin.\n\nLARSON: Yes.\n\nDAVIES: And that kind of changed things, didn't it?\n\nLARSON: One key element before this, before it became the - before Germany began its first deliberate bombing attacks on London was it was a mistake that the Luftwaffe made on August 24, 1940, when a group of German bombers thought they were over their target. They were not. They were over central London. They dropped their bombs. And this was the first attack on central London. And it was terrifying to the citizens of London who had felt that, for whatever reason, they were not - this was not going - they were not going to be the subject of attack, you know, by Hitler.\n\nThis gave Churchill what he would describe as the moral right, then, to turn around and bomb Germany. The RAF was in - bomb Berlin, rather. The RAF was a little bit reluctant to do that as well because of the moral consequences, so they'd have to weigh it, like, and so forth. So now suddenly, you have this rapid escalation that leads to, on September 7, 1940, the first deliberate mass intense bombing of the city of London.\n\nhttps://www.npr.org/2020/03/30/823830284/how-winston-churchill-pulled-britain-through-the-early-years-of-wwii\n\nBefore the summer of 1940 British intransigence could be justified by the fact that Western Europe remained in opposition to Germany. Once Germany conquered France and chased the British Expeditionary Force off the continent at Dunkirk, however, the terms changed in a way that highlights one of my main criticisms of Britain’s war policy. As Gray said in his thread above, the strategy of the British Empire toward Europe had long been to use a combination of financial and military means to play one nation off another in order to avoid the emergence of a continental power capable of challenging the Empire. But that strategy had run its course in the summer of 1940. There was no power left to play off against of Germany. The war was over, and Germany had won. There was no plan, and no possibility, of\nBritain mounting a reinvasion of Europe to change the outcome on its own. Yet Britain refused to entertain terms of peace, even when they were offered at the height of Hitler’s power. The question, then, is why would Britain insist on continuing a war she had no means of fighting? True, the hunger blockade made life hard on the continent, but it could not starve Germany into submission now that the latter had a pact with Russia. The only weapon available to the British was aerial bombing that amounted to random acts of terrorism against European civilians. The truth is, the only hope Britain had was that the United States, the Soviet Union, or both, could be pulled into the war to bail them out. Another way of putting it would be that the British strategy was to turn a war that was basically over into a global conflict that, under the most optimistic circumstances, would result in the deaths of many millions of people. And of course that’s what happened, although far from benefiting - or even preserving - the British Empire, World War 2 brought it to an end, and handed the world over to conquest by the United States and the USSR.\n\nChurchill’s refusal to even countenance Hitler’s peace overtures, and his tendency to escalate British bombing campaigns immediately after they were made, made no sense to much of the German leadership. Hitler pointed out, correctly, that a war between Germany and Britain could only end with the destruction of the British Empire, and it was widely believed by German officials that Britain’s irrational escalation of the conflict was proof that International Jewry was influencing British policy without regard for British interests. This was the view among Third Reich leaders. The worsening bombing campaigns against German civilians, even as German planes were forbidden for months from retaliating in kind, and the continuation of the hunger blockade as it began to bite the occupied civilian populations, intensified Hitler’s sense of paranoia and claustrophobia, and his sense that there were forces larger than Great Britain whose only war aim was to see Germany destroyed.\n\nhttps://subscribe.martyrmade.com/p/to-the-perplexed-waudio",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "PaperbackWriter66",
                                                                                    "body": "The German Luftwaffe was terror-bombing civilians long before the British were: \n\nhttps://en.wikipedia.org/wiki/German_bombing_of_Rotterdam\n\nYour point seems to be \"The Luftwaffe wasn't terror bombing *British* civilians, only *other* civilians, so when Churchill began bombing German civilians in response to the bombing of non-*British* civilians, that was Churchill starting the bombing of civilians.\"--which is ludicrous. \n\nAlso, the bombing of London on August 24 was not a mistake: \n\nhttps://www.historynet.com/no-the-london-blitz-wasnt-started-by-accident/\n\n>The war was over, and Germany had won.\n\nNo, it wasn't, because *Italy* had declared war on Britain in the interim. All the pro-peace people in Britain depended on Italy serving as a mediator for the peace deal; with Italy now in the war against Britain, even the pro-peace faction in Britain realized that Churchill had been right all along and they were now in it for the long-haul. \n \nAnd Britain would spend most of the rest of 1940 and 41 fighting Italy, not Germany. \n\nTo say \"in 1940, the war was over\" is just pro-Nazi cope.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ForFreedomLovers",
                                                                                            "body": "But Churchill never said that was why he started bombing civilians.\n\nWhile Hitler had used aerial bombardment against civilian populations in the 1930s to help force capitulation from some European governments, he was worried about retaliation from Britain against the German population and so was reluctant to begin a broad bombing campaign on the British population. However, Hitler actually had little direct control over the Luftwaffe by August 1940. Göring had successfully gained independent control - and was very clever at misrepresenting reports to keep his independence.\n\nStill, during the initial phase of the Battle of Britain, the Luftwaffe mostly targeted shipping, RAF radar and airfields, and plane factories, in an attempt to break the RAF defence and gain the vital air superiority over the Channel which would be necessary to launch an invasion.\n\nThe first bombs on London fell on August 24th. This was probably an accident due to lost pilots. Britain did send bombers to Berlin the next day.\n\nNow, works like The Battle of Britain (which is an excellent movie, and gets most of the history right with some artistic licence) would have you believe that is where it started. Hitler gave a rousing speech and promised \"moar bombs\" in return for what the RAF dropped on Berlin.\n\nBut it was actually two weeks later that the Blitz really started. The Luftwaffe continued pressing their attacks on the RAF and factories until September 7th when Göring and his command (under pressure from a frustrated Hitler) acted on intelligence that brought them to believe the RAF was at breaking point, and the Blitz was seen as the final phase of annihilation before the sea invasion.\n\nSo - while London was probably bombed by accident on August 24th - it was not the primary cause of the Blitz.\n\nhttps://history.stackexchange.com/questions/34829/was-the-london-blitz-accidentally-started-by-lost-pilots",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "PaperbackWriter66",
                                                                                                    "body": "So now you're not claiming that Churchill started the bombing before the Nazis did, you're arguing about the reasons why Churchill retaliated against the earlier Nazi bombings?\n\n>While Hitler had used aerial bombardment against civilian populations in the 1930s to help force capitulation from some European government\n\nI.e. the Nazis started the terror bombing of civilians before the British did.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "ForFreedomLovers",
                                                                                                            "body": "churchill never mentioned luftwaffe bombings of nonbritish civilians as motivation to bomb german civilians.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                    "body": "That was not your claim. Your claim originally was that Churchill started the bombing of civilians before the Germans did. Which is false.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                            "body": "i should have clarified i was referring to the conflict between uk and germany.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                    "body": "The conflict wasn't *just* between Germany and Britain. Your claim only holds up if you deliberately ignore the crimes committed by Nazi Germany. There's a name for what you're doing.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                            "body": "my claim is churchill didn't say he bombed civilians because of germans bombing other countries.  the quote you gave came after he started.  he initiated targeted civilian bombing the day after a few bombs likely accidentally fell on London while the overwhelming majority of bombs targeted military installations.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                    "body": "https://old.reddit.com/r/Anarcho_Capitalism/comments/1iojlho/i_dont_always_agree_but_this_is_fire_and_needs_to/mcnzetp/\n\nIs this you? Here you are, claiming that \"Hitler didn’t start indiscriminate bombings — Churchill did\".\n\nSo do you stand by that claim or not?",
                                                                                                                                                    "score": 0,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                                            "body": "that's the title of the article.  argue with the author if you want.  maybe the link didn't show up, but search for that title, and you'll find it.",
                                                                                                                                                            "score": 0,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                    "body": "The fuck are you talking about? **You** made a claim. *You* claimed that Churchill started the bombing of civilians. \n\nDo you stand by that claim or don't you?",
                                                                                                                                                                    "score": 0,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "AgainstSlavers",
                                                                                                                                                                            "body": "Why are you so worked up?",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                                    "body": "I'm not worked up. I don't like it when people gaslight. It insults my intelligence. I equally dislike it when I see libertarians buying into bullshit. Especially when that bullshit is Nazi apologism.",
                                                                                                                                                                                    "score": 0,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "AgainstSlavers",
                                                                                                                                                                                            "body": "You seem worked up.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                                                    "body": "no u",
                                                                                                                                                                                                    "score": 0,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "AgainstSlavers",
                                                                                                                                                                                                            "body": "Some time off reddit is in order",
                                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        },
                                                                                                                                                                        {
                                                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                                                            "body": "calm down, man",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": []
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                    "body": ">churchill never mentioned luftwaffe bombings of nonbritish civilians \n\nOh really? \n\n>We ask no favours of the enemy. We seek from them no compunction. On the contrary, if tonight the people of London were asked to cast their votes as to whether a convention should be entered into to stop the bombing of all cities, an overwhelming majority would cry, \"No, we will mete out to the Germans the measure, and more than the measure, they have meted out to us.\" {applause} The people of London with one voice would say to Hitler: \"You have committed every crime under the sun. Where you have been the least resisted there you have been the most brutal. **It was you who began the indiscriminate bombing. We remember Warsaw! In the first few days of the war. We remember Rotterdam. We have been newly reminded of your habits by the hideous massacre in Belgrade.** We know too well the bestial assaults you're making upon the Russian people, to whom our hearts go out in their valiant struggle! {cheers} We will have no truce or parley with you, or the grisly gang who work your wicked will! You do your worst! — and we will do our best! {sustained cheering} Perhaps it may be our turn soon. Perhaps it may be our turn now.\"\n\n>>July 14, 1941, in a speech before the London County Council. The original can be found in Churchill's The Unrelenting Struggle (English edition 187; American edition 182) or in the Complete Speeches VI:6448.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                            "body": "that was long after he had been bombing german civilians.\n\nwhat does dave smith say about it?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                    "body": "https://youtu.be/_fLpKzbqpGk?t=3101\n\nHis buddy, Darryl Cooper, lied to Dave's face about the bombings and Dave just sat there looking kinda bored and didn't contradict anything Darryl said because Dave doesn't actually know very much about the Second World War.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                            "body": "So Dave didn't say anything about it, according to you.  So you admit you're mad about nothing.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                    "body": "It was you who brought up the bombings; I never claimed Dave said anything specifically about the bombings one way or another. \n\nDave *has* said other nonsense about Churchill and World War II, just not *that* specific lie.",
                                                                                                                                                    "score": -1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                                            "body": "sure he has",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                    "body": "Dave Smith: \"The circles I float in, it wasn't that crazy to say, it's like yeah: we all know Churchill is the villain. I thought that was common knowledge.\"\n\nhttps://youtu.be/_fLpKzbqpGk?t=194\n\nWhat kind of circles is Dave floating in where *everyone* around him thinks Churchill was the villain in WW2? Sure as hell ain't libertarian, whatever it is.",
                                                                                                                                                                    "score": 0,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                                                            "body": "The amount I've been lied to, I'm skeptical of all historical narratives.  That is consistent with libertarianism.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                                    "body": "Okay, then be skeptical. When someone tries to tell you that Churchill was the villain, be skeptical of that. \n\nWhat do you think makes Churchill the villain of WW2 and not Hitler? On what evidence do you base that?\n\nSkeptical means demanding evidence, not believing the opposite whatever is commonly believed to be true.",
                                                                                                                                                                                    "score": 0,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                                                                            "body": "Hitler is obviously a villain.  He lost, so we know a lot of bad about him and very little good.  Churchill won, so we know a lot of good about him and very little bad.  The victors write the history books.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                                                    "body": "We know a lot bad about Churchill. That you think otherwise tells me you haven't read any of the history books, written by victors or not. \n\nHere's a good summary of the anti-Churchill literature and a response to it: \n\nhttps://historyreclaimed.co.uk/churchill-revisionism/",
                                                                                                                                                                                                    "score": -1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                                                                                            "body": "You're still lashing out; still emotional.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                                                                    "body": "You have no response, you have no argument. Your side in this 'debate' is a joke.",
                                                                                                                                                                                                                    "score": 0,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "None",
                                                                                                                                                                                                                            "body": "[removed]",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                                                                                    "body": "I'm not emotional. Your accusation is just a confession on your part.",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        },
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                                                                                            "body": "Darryl Cooper is the most prominent current Churchill revisionist, and he's right.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                                                                    "body": "Cooper doesn't claim to be a libertarian, first of all, and has called himself a Franco-ist (meaning Francisco Franco, the quasi-fascist dictator of Spain). That tells us a lot about why Cooper doesn't like Churchill. \n\nAlso, Cooper is just dead wrong about pretty much everything. See this break-down: https://winstonchurchill.hillsdale.edu/cooper-koureas/\n\nFor example, in his famous interview with Tucker Carlson, Cooper claimed the Nazis \"had no plan\" for dealing with captured Soviet POWs and Soviet civilians. Not true. The Nazis had a plan: \n\nhttps://en.wikipedia.org/wiki/Hunger_Plan",
                                                                                                                                                                                                                    "score": 0,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                                                                                                            "body": "Why should I trust those sources?\n\nhe only uses primary sources",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                                                                                    "body": "Because they provide direct evidence: eyewitness accounts, contemporary written accounts, the surviving written records authored by the Nazis themselves. \n\nYou know, that thing Darryl Cooper never uses: [primary sources.](https://library.shu.edu/primarysources#:~:text=A%20primary%20source%20is%20a,not%20been%20modified%20by%20interpretation.)",
                                                                                                                                                                                                                                    "score": 0,
                                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        },
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "ForFreedomLovers",
                                                                                                                                                                                                                            "body": "apparently you don't know what a figure of speech is.  of course some nazis had a plan.  that's a lot of people for none of them to have a plan.\n\nyes, it was a figure of speech.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "PaperbackWriter66",
                                                                                                                                                                                                                                    "body": ">They launched a war where they were completely unprepared to deal with the millions and millions of prisoners of war, of local political prisoners and so forth, that they were going to have to handle. They went in with no plan for that. And they just threw these people into camps. And millions of people ended up dead there. \n\nhttps://youtu.be/vOTgPEGYS2o?t=2800\n\nThat's not a \"figure of speech\" that's literally Darryl Cooper denying historical facts. The Nazis had a plan; they deliberately starved millions of people to death, and here Cooper is saying \"the Nazis had no plan\" and these people just \"ended up dead\" as if by accident or negligence. That's straight-up Holocaust denial. He's not denying it happened, but he's *lying about the reasons for it happening.* He is denying that it was deliberate. \n\nHoly shit is it mind-boggling that any libertarian takes this wannabe fascist seriously.",
                                                                                                                                                                                                                                    "score": 0,
                                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "odinsbois",
                                            "body": "And yet Germany didn't attack the US.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PaperbackWriter66",
                                                    "body": "Churchill wasn't Prime Minister of the United States, was he? So what's your point? \n\n\"Nazi Germany didn't attack the US, therefore Nazi Germany wasn't a threat to Britain\"?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ChampionOfUsAll",
                            "body": "Get your head out of your ass dude. He’s basically a 90’s democrat with more nationalist values. 30 years ago liberals would have been sucking him off.\n\nEdit:  metaphorically sucking him off.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "PaperbackWriter66",
                                    "body": "Who? Dave Smith?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChampionOfUsAll",
            "body": "I fuckin love Dave Smith",
            "score": 6,
            "replies": []
        },
        {
            "author": "CakeOnSight",
            "body": "It literally is a coup... but one that's 80 years overdue",
            "score": 14,
            "replies": []
        },
        {
            "author": "festive_napkins",
            "body": "Soft power is a coup. USAID Won’t put a dent in the nation spending however",
            "score": 13,
            "replies": [
                {
                    "author": "rushedone",
                    "body": "Your leaving out he wants to audit the Pentagon too",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "LibertyFive3000",
                    "body": "There can be more than one important thing. In this case, the important thing is exposing to normies just how absurd our governments spending is as well as exposing our politicians slush funds. That’s a valuable goal. Eliminating spending with more zeros is valuable for a different reason.\n\nThey are trying to win the public over against the government. Not everyone already has our views.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "PaperbackWriter66",
                            "body": ">just how absurd our governments spending is\n\nSocial Security is the largest single line-item on the Federal budget, and Social Security, Medicare/Medicaid, plus interest payments on the debt, make up 55% of Federal spending. \n\nHighlighting the ridiculous nonsense funded by USAID is worthwhile, but we should be under no illusions that it is a shiny object meant to distract us from the real problem, while lulling people into the false belief that our spending problem is being meaningfully addressed.\n\nSocial Security and Medicare enjoy a super-majority of support in the US (I think Social Security has something like an 80% approval rating). Make no mistake: we are on the losing side of this issue.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "LibertyFive3000",
                                    "body": "Of course. Note my second sentence where I address that. \n\nThe point isn’t to balance the budget or eliminate all spending in one fell swoop. But right now a bunch of us circle jerking to our ideals isn’t really moving the needle. Meanwhile if they can win over the masses and convert a large swath of people to the “holy shit the government is awful” camp, they can justify the next, way more fiscally meaningful move.\n\nIt seems a lot of this sub thinks the theatrics are to self congratulate themselves for slashing spending. They’re not. The theatrics are to highlight the waste and money laundering for the 99.95% of people who aren’t an-caps.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "PaperbackWriter66",
                                            "body": "This is where we disagree. I don't think DOGE will win over the masses when it comes to *reforming our entitlement programs*--which is the only way the budget ever gets balanced. \n\nThis is nothing but a feel-good cope to make people *think* the budget is getting balanced when, in fact, the chief drivers of the deficit are politically untouchable. \n\nIn that respect, then, DOGE is actively a bad thing because it prevents people from looking at the actual problem and prevents a build-up of the political will to address it.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "LibertyFive3000",
                                                    "body": "I’m just saying that’s why they’re approaching it the way they are. I don’t necessarily think it’s going to be successful. ",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "PaperbackWriter66",
                                                            "body": "Fair.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ForFreedomLovers",
                                    "body": "We have to make the case that it's better to have a controlled demolition of SS/medicare before it collapses suddenly.  The latter outcome would be worse for everyone.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "LibertyFive3000",
                                            "body": "What’s this? A rational take on a realistic way to move things in the right direction? \n\nTurn in your an-cap card you filthy statist.\n\n/s",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "PaperbackWriter66",
                                            "body": "I agree, but, sadly, I think what will happen is politicians in DC will ignore the problem for as long as possible. Then it will become a crisis and voters will demand that we \"save\" Social Security, exactly like what happened in the 1980s, and we'll be stuck with it for another generation until the cycle repeats.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ForFreedomLovers",
                                                    "body": "so make the case",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PaperbackWriter66",
                                                            "body": "It would be nice if some of the prominent libertarians, like Dave Smith, would shut up about Israel for five minutes and talk about this maybe *once.*",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "ForFreedomLovers",
                                                                    "body": "He does talk about that sometimes.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PaperbackWriter66",
                                                                            "body": "When was the last time he did? I honestly don't know.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ForFreedomLovers",
                                                                                    "body": "I don't have the exact episode for you.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CakeOnSight",
                            "body": "normies don't care about anything. They know epstein exists and dont care or forgot. fuck the normies I want it all to burn",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "LibertyFive3000",
                                    "body": "I hear ya bud, I’m just not sure that’s a stance likely to win many over to our cause. Negatively impact your health? Sure. Foster an-cap or liberty forward ideals in people? Ehh.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "True_Kapernicus",
                                            "body": "Normies don't matter, a motivated sliver of the middle classes is what you need.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Undying4n42k1",
                                                    "body": "I thought those were the normies.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nolv4ho",
                    "body": "Do you think DOGE is stopping after USAID?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Aggravating-Tea6042",
                    "body": "Can’t have them all without the first one",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "TehM0C",
                    "body": "Isn’t USAID in itself a coup by this very definition?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rrzibot",
            "body": "The problem is that it is not proportional. You have 10 things and each of them have increased their budget by 20%. Now you come and say let’s cut and you don’t cut proportionally back to 2017 levels on all these things. You cut the once that you don’t like and now you are left with 6 things because 3 of these things make 90 of your budget.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ribblan",
            "body": "I can understand and I would respect if DOGE produced reports for the legislative to use. But having one department decides and cut budgets across ALL departments in the US, to me that just sounds crazy. I mean these cuts arent just \"efficiency cuts\", they are political statements. And they arent even hiding it, lists of reasons typically go under \"this department spent 2 million on gender studies\", or something along those orders. So this one department decides across all departments and above the congress, that this spending is no void. This is political and its undermining whoever and why those budgets where put there in the first place. Now basically anything that trump or elon does not abide by their political ideology can be labeled, \"its just leftist biased waste\", then boom gone. Dont tell me this is overreach. I know you guys hate the government, but right now dont look at what is cut, look at what they ARENT cutting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "s3r3ng",
            "body": "He is a lying shill for Trump.  Trump is breaking impoundment laws made by and for the people.   He is not a hero but an Autocrat who acts above the law.  DOGE is getting access to everything regardless of laws by and for the people limiting who gets to access what data and in what circumstances.  \nNot even the people who voted for Trump voted from him to just flout the law like this.  This is the way to an out of control Autocrat.   That supposed libertarians are cheering it is a VERY BAD SIGN.",
            "score": -5,
            "replies": []
        },
        {
            "author": "kiaryp",
            "body": "We have courts for a reason. Dave isn't smart enough to understand checks and balances or really anything else.",
            "score": -1,
            "replies": []
        },
        {
            "author": "s3r3ng",
            "body": "What fucking bullshit. It is a coup arguably when any POTUS ignores existing law limiting his ability to impound funds and limiting who can see what data for privacy and other reasons in order to have his posse access all the data and himself to illegally impound funds.  \n\nDave Smith is  a fucking shill for this Autocrat.",
            "score": -8,
            "replies": []
        },
        {
            "author": "MFrancisWrites",
            "body": "You can't ignore the judiciary. Checks and balances. You can't do whatever you want. EOs have limited scope. Can't create laws, can't create or eliminate spending. That's the legislative branch. If you care about what the constitution says. \n\nIts so disengenuous when people argue a point that's not being made. But this is the same camp that turned Jan 6 into a peaceful tour.",
            "score": -16,
            "replies": []
        },
        {
            "author": "Kinetic_Symphony",
            "body": "If the deep state shadow government truly exists as we believe it does, and Trump is a legitimate threat to them... why is he still alive?\n\nIs the deep state actually completely impotent after all? Something doesn't make sense in this equation.",
            "score": -12,
            "replies": [
                {
                    "author": "denzien",
                    "body": ">If the deep state shadow government truly exists as we believe it does, and Trump is a legitimate threat to them... why is he still alive?\n\nYou mean apart from the 3 known attempts on his life? Wouldn't that force them out of the shadows if they had to do it themselves?",
                    "score": 27,
                    "replies": [
                        {
                            "author": "Kinetic_Symphony",
                            "body": "Huh? Those weren't the deep state. It's not the 1960s where they need some patsy with a gun. It's 2025 with tech we can't even fathom.",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "LibertyFive3000",
                                    "body": "This isn’t a super strong point but one may say a kid getting indoctrinated with rhetoric that Trump is “literally Hitler” from the media since he was 12 years old is evidence of a concerted effort to influence minds over longer timelines. I don’t love the nebulous term “deep state” but the assassination attempts are certainly a downstream consequence of a decade of anti-Trump media propaganda.\n\nAnd because we should all rage against the conservative infiltration of these subs… disclaimer: that’s no endorsement or defense of Trump.",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "denzien",
                                    "body": "Sure, but using a super high tech assassination tool would kind of point to a shadow government. Isn't the point to remain hidden? Also, it's not the 1960s - we have cameras literally everywhere and news travels faster than ever. I imagine it would be extra difficult. But I'm not in the business.\n\nThe great thing about unknown entities, like God, is you get to make up all kinds of unfalsifiable things about them.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Kinetic_Symphony",
                                            "body": ">Sure, but using a super high tech assassination tool would kind of point to a shadow government. Isn't the point to remain hidden?\n\nIf their options are, remain hidden while Trump destroys their entire foundation of power \n\nOr,\n\nHave slight suspicion cast upon their existence, but fully eliminate the only threat to their power in a century?\n\nPretty sure I'd go with the second option if I were them. \n\nI'm just using pure logic here to demonstrate that the odds that Trump is truly working against the internal power of the government are slim to none.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "denzien",
                                                    "body": "(I'm enjoying this discussion, btw)\n\nYes, interesting dichotomy.\n\nSo the first option you present assumes that this supposed shadow government isn't flexible enough to remain undetected, or to absorb some losses. Like a computer virus that edits the list of running processes, or that hijacks microcode updates to embed itself directly into the CPU, it could be difficult to both find and remove.\n\nIf they truly move like shadows, anywhere the light shines, they'll be somewhere else! That makes the first option a lot more palatable and changes the calculus, does it not? There's nothing better than a perpetual enemy just one room away.\n\nI am definitely a skeptic and think for the most part, this shadow government thing is either nonsense or overblown. It's super entertaining though.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Kinetic_Symphony",
                                                            "body": "Me too, it's not something I see anyone else talking about.\n\nThe first option only makes sense if they believe Trump will not be able to cleanse their virus entirely. Like installing a base level antivirus, not kernel level where they're hiding. \n\nBut even then, why risk it at all? I imagine their tools of assassination are truly beyond anything we can imagine, and we can already imagine untraceable undetectable poisons, micro explosive drones, you name it and beyond... to eliminate him would be effortless, and Vance hardly commands the presence or vision that Trump has been espousing. \n\nSo it's not that they fear Vance replacing him. \n\nBeing revealed? Anyone who believes there could be a deep state already knows about it, I don't think another assassination would wake anyone up who isn't already keen and alert. \n\nTo be clear, by shadow government or deep state, at the simplest level, we're talking about the forces in the CIA, NSA, and the apparatus of our government that works by espionage, deceit and subterfuge. \n\nMaybe it goes even deeper but that would be speculation.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "denzien",
                                                                    "body": "What's better for them though - just eliminating him or driving him insane with amyloid plaque infusions?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Kinetic_Symphony",
                                                                            "body": "Well that's the only other avenue I can think of, let him win, let him reach office, but control / manipulate him in various ways while in office to further entrench themselves.\n\nHard to say only a few weeks in, but I am not hopeful that this is spelling the end of the government or anything like that. It won't go down this easily.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "denzien",
                                                                                    "body": "I'm honestly hoping Trump pushes all the limits as far as he can, so we can reign in all the extra power delegated to the Executive over the last ... 100 years or whatever. The more bat shit insane the better, IMO. It won't bring the government down but maybe people will realize that granting all this authority to an individual can come back to bite you when \"the wrong\" person gets elected.\n\nAnd maybe some good things get done in the chaos like halting the minting of pennies thing we've been talking about for decades, or ending daylight savings time if that's a federal thing.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Undying4n42k1",
                                    "body": "> It's 2025 with tech we can't even fathom.\n\nBureaucrats don't use modern tech. Haven't you heard of the limestone cave they got retirement files stored in? Lol",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Character_Dirt159",
                    "body": "When sane people refer to the deep state shadow government, they aren’t referring to a self aware cabal. We are referring to an unresponsive unelected bureaucracy full of individuals pursuing their own self interest. In this scenario an effective organized assassination seems unlikely as that would require conspiracy and coordination. Instead you would expect to see an assortment of low resource half assed attempts.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Aggravating-Tea6042",
                    "body": "So far",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mtmag_dev52",
                    "body": "Because its a conspiracy theory....",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CakeOnSight",
                    "body": "yawn",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kinetic_Symphony",
                            "body": "Huh?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sks010",
            "body": "He's right, but he's wrong about why he's. People are not calling this a coup for what the Trump admin is doing, but for how it's being done. There are proper ways to do these things that don't include cutting out Congress or ignoring court orders. It's the flagrant law breaking that is the real problem.\n\nThere is also information out there about the plans of some of the people in the Trump administration and people close to Trump, including big financial backers. If those plans come to fruition, and they're on track so far, it will mean the end of democracy in the US.\n\n[The Dark Enlightenment ](https://youtu.be/5RpPTRcz1no?si=HkIQnIM0pmHffwTy)\n\n[Russell Vought speaking about Project 2025](https://youtu.be/PY_chqyaRHo?si=bPNNVKfkAW_H3Tw1)",
            "score": -1,
            "replies": []
        },
        {
            "author": "Aggressive_Plan_6204",
            "body": "Sorry, this guy is just spouting made up garbage he didn’t bother to research. Typical of the right these days. USAID only did one good thing ever so it’s a scam. Nope. Look it up morons.",
            "score": -4,
            "replies": []
        },
        {
            "author": "s3r3ng",
            "body": "Why is this even here?  Take it somewhere where Statists hang out.",
            "score": -8,
            "replies": []
        }
    ]
}