{
    "title": "Subreddit Politics are yelling. But why so loud?",
    "author": "None",
    "subreddit": "Anarcho_Capitalism",
    "rank": 291,
    "score": 670,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 113,
    "url": "https://i.redd.it/assp6bzuscje1.jpeg",
    "id": "1iq90ri",
    "selftext": "",
    "comments": [
        {
            "author": "ncdad1",
            "body": "Let's see how many people are charged and convicted of fraud first.",
            "score": 44,
            "replies": [
                {
                    "author": "AgainstSlavers",
                    "body": "I'll settle for stopping the flow of taxpayer money into the pockets of crooks you call government.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Bastyboys",
                            "body": "And oligarchs?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "Oligarchs are government, commie fool",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Bastyboys",
                                            "body": "???",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Gemini_Of_Wallstreet",
                    "body": "This.\n\nRight now it’s all just a big fat juicy nothingburger",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Far-Warning2313",
                            "body": "I wouldn't call doge a nothingburger, even when it looks like one to people \"like us\". Simply because it shows to the \"normal\" people how corrupt this system realy is.  As an example, did we knew that politicians abused MSM? Yes, did the average \"Joe\" knew it? Ask the 100000st of people that got called \"conspiracy theorists\" for it. But right now it shows to the average \"Joe\" that it wasn't just a conspiracy theory\n\n\n\n\nPS: remember that this whole shit (Twitter files) just started because the Democrats forced Musk to buy Twitter",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "P1xelEnthusiast",
                            "body": "People are factually being fired. \n\nGo over to fed news. All the probationary employees are out and they are receiving communication about downsizing.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Sweezy_McSqueezy",
                            "body": "They fired 99% of USAID. This is literally already the largest culling of US foreign policy spooks in the history of the country, with Jimmy Carter taking a distant 2nd place. We're just 1 month in.\n\nStrap in.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ScrotalWizard",
                                    "body": "What about when Reagan fired all those air traffic controllers?   I think thats prettt high up there too.  ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Sweezy_McSqueezy",
                                            "body": "ATC aren't part of the foreign policy blob. ATC don't have a built in immune system designed to topple governments and arrest politicians that get in their way. USAID does.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DonovanMcLoughlin",
            "body": "Shifting the power dynamics from politicians to tech-oligarchs leveraging politicians authority isn't exactly a win in my books. Especially since they are being very selective in what they decide is corruption and what isn't (insider trading, government contracts to friends, and blatant corruption). \n\nThis isn't what the founding fathers wanted either.",
            "score": 120,
            "replies": [
                {
                    "author": "upchuk13",
                    "body": "Glad someone is making this point. ",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "denzien",
                    "body": "What about the current government is as the founding fathers wanted? Gun control? The IRS? Domestic spying? Fiat currency and central banking?",
                    "score": 24,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "I don't think they wanted any of that, either.   Not sure what it has to do with this conversation though, given that none of those government programs are even involved in any of the current theatrics.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "DonovanMcLoughlin",
                            "body": "Those things aren't going away, the same people will run them and pretend like they are private sector services you can pay for. Unfortunately, the government will force you to pick the options they select for you, leveraging their authority and handcuffing you to their buddies. It's the government by another name. Crony capitalism at its finest.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "denzien",
                                    "body": "The point is that this country is too far gone to go back to the founders' vision",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "DonovanMcLoughlin",
                                            "body": "I'm at a point in my life where I'm realizing the only real true solutions may be ones that completely upend the current way we live. There is no other way to fix it.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "denzien",
                                                    "body": "That's kind of why I'm not 100% against the current chaos if it helps expose the flaws in the system - even if the flaws are just the ways the current admin is trying to expose stuff.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Josepvv",
                            "body": "Shouldn't it be about what the people want and not what the founding fathers wanted? Or should the US bring slavery back qnd take away women's and poor people's right to vote?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "myadsound",
                    "body": "They want a government department to tell them what to think. Doge is happy to oblige",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DonovanMcLoughlin",
                            "body": "If you want to convince me that Elon, Trump, and the other tech billionaires are trying to be altruistic and working for the people, then you don't know your history. I get that this is an Anarcho Capitalism sub but this is anything but that. It's capitalism at its worst and it's leveraging the worst aspects of a government and private industry and giving them way too much power.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Backintime1995",
                                    "body": "No one wants to convince you.\n\nFor fun, you can convince this sub how \"the politicians\" were planning on addressing this problem.  \n\nProvided you believe waste and inefficiency is a problem.\n\nStart with a review of how well \"the politicians\" have done this far in this endeavor.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Midnight-Bake",
                                            "body": "In 2023 Mike Johnson and the republican controlled House voted to maintain funds for FEMA to house migrants. This program was created under Trump in 2019.\n\n\nDOGE now says this program is a problem.\n\n\nIn 2019 the Trump run DoD signed a contract to send money to Reuters for social engineering defense.\n\n\nDOGE now says it's a problem\n\n\nIn 2014 and in 2023 a republican lead congress and a republican lead house voted to not increase OPM's budget. OPM under Obama and then Biden had asked for extra funding to digitize and modernize it's retirement system.\n\n\nDOGE now says it's a problem.\n\n\nTrump was the first president to send missiles to Ukraine after Obama said we shouldn't send arms to them.\n\n\nTrump now says we should not send weapons.\n\n\nThe problem is that Trump and co have caused these problems, delayed solutions to them, or chose not to stop them in the past.\n\n\nSo my concern is that he is hitting political and buzz word loaded targets to centralize power rather than limit the government.\n\n\nMy concern is Republicans turning into 2020 Democrats and trusting the unelected bureaucract instead of asking questions.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "bigadultbaby",
                                                    "body": "One of the only level headed comments I’ve seen on here in a while. This whole thing is basically boils down to “he’s an asshole, but at least he’s our asshole”\n\nThis is power consolidation, nothing more",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Sea_Journalist_3615",
                                    "body": "\"It's capitalism at its worst \"\n\nYou don't know what capitalism is.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "DonovanMcLoughlin",
                                            "body": "It's all the authority of government with the illusion of the free market. It's the same people with the same amount of authority.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "ExcitementBetter5485",
                                                    "body": ">It's all the authority of government with the illusion of the free market. It's the same people with the same amount of authority.\n\nHow is this capitalism?",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SufficientTie3319",
                    "body": "I mean, it’s been 26 days …",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "lone_jackyl",
                    "body": "Do you have proof of your accusations or are you just regurgitating what you see online? I'd say your just regurgitating what you see online.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "yadius",
                    "body": "> This isn't what the founding fathers wanted either.\n\nWTF!\n\nYou're clearly not an anarchist. \n\nThese are clearly not anarchist viewpoints. \n\nWhat are you doing here?\n\nWhy does your post have 41 upvotes?",
                    "score": -3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "yadius",
                                    "body": "Crony capitalism only exists because of the state.\n\nAnarcho-capitalis solves it by getting rid of the state, not by siding with the state and it's political class against business leaders like Musk.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "AdvanceCareful4643",
                                            "body": "Musk is part of the political class.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "yadius",
                                                    "body": "That's exactly the problem. The state forces all business leaders to become 'part of the political class', whether they like it or not.\n\nZuckerberg famously spent $400 million in 2020 setting up drop boxes for the 2020 election to help the DNC 'fortify' the election. Was that a core interest of Facebook? Probably, yes.\n\nWhen you allow the existence of a state, everything eventually becomes political.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DonovanMcLoughlin",
                            "body": "Judging by what's being put on here, I don't think a lot of people are. Hearing what people like you are saying makes me reconsider my positions on even trying to be associated with you people.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "yadius",
                                    "body": "> Hearing what people like you are saying makes me reconsider my positions on even trying to be associated with you people.\n\nI sincerely hope you do. This isn't some left libertarian sub.\n\nBy building a private corporation to monetize space exploration, Musk has probably done more to demonstrate the redundancy of the state, than any man in history.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "DonovanMcLoughlin",
                                            "body": "What faction of the libertarian party gives a shit about him talking about turning Gaza into a hotel and invading Greenland and Canada? \n\nElon's companies take more government welfare than anyone else. This whole capitalism for profits and socialism for losses bullshit isn't cool.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "yadius",
                                                    "body": "> what faction of the libertarian party\n\nI don't know. Perhaps you should go and ask the neocons and leftists on r/libertarian.  \n\nThis is anarcho-capitalism. \n\nI will say that a fixation on words rather than outcomes is a very leftist trait. Nobody mentions that no bombs have been dropped on Gaza since the inauguration.\n\nI don't have any qualms about using government built roads, and I don't blame Musk for the fact that he builds things that governments desperately want. It's probably the only reason he's still alive.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Maxcrss",
                    "body": "Counterpoint, he’s being as transparent as one could be.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "DonovanMcLoughlin",
                            "body": "In the fact that he's specifically targeting the government agencies and people that could potentially expose any wrongdoing or corruption that may be involved in. \n\nThis type of government is extremely similar to the Soviet Union after their collapse.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Lagkiller",
                                    "body": "> In the fact that he's specifically targeting the government agencies and people that could potentially expose any wrongdoing or corruption that may be involved in.\n\nTIL that the department of education investigates corruption and wrongdoing.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Maxcrss",
                                    "body": "TIL USAID is exposing wrongdoing, oh wait, it’s spending a shitload of money on random bullshit. But you like that don’t you?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "myadsound",
            "body": "Lol, this is an *antistate* sub.\n\nTrusting elon =trusting the state",
            "score": 41,
            "replies": [
                {
                    "author": "IC_1101_IC",
                    "body": "Anyone who is pulling out the dirty laundry of the fed goes in my good books. When they start making bad decisions (like coverups on funding which is from their side), then we can get to talking. At the moment, we are appreciating the work of DOGE, which has done a great job at already confirming out suspicions to the general public.\n\nEdit: (I couldn't give less of a shit about Elon's reputation, if it is corporate power that is being infused with the political, that is a bad thing and I will criticize Elon for that, but so far I haven't heard of them suggesting policies which benefit big corpos and increase the size of the government.)\n\nEdit2: Taxes are portrayed as the thing that \"benefits society\" or \"builds America\", and while it is technically not fraud that the government is sending millions of dollars over seas for lgbtq parades, it is still scummy that they weren't transparent about that.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "myadsound",
                            "body": "Lol, he's a government employee telling you what to think",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "IC_1101_IC",
                                    "body": ">Lol, he is a government employee telling you what to think\n\nUh huh, that government employee is lying about the government being bad.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "myadsound",
                                            "body": "Its wild how all the fraud is magically only where he says and he also gets a nice government bloated 400 mil for cars but thats totally not fraud. 🤣🤣🤣🤣\n\n\nHes suuuuper honest about whats happening!",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "IC_1101_IC",
                                                    "body": ">Its wild how all the fraud is magically only where he says and he also gets a nice goverment bloated 400 mil for cars but thats totally not fraud. 🤣🤣🤣🤣\n\n>Hes suuuuper honest about whats happening!\n\nThe movement of the respiratory system is not an argument. Also, it is not where >he< says it, he has a team behind it. He just vocalizes their conclusions.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "myadsound",
                                                            "body": "Lol, a couple kids with chatgpt isnt really much more of a team than any reddit comment thread. The whole COBOL150 year embarrassment is all the evidence needed.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "IC_1101_IC",
                                                                    "body": ">Lol, a couple kids with chatgpt isn\n\nAmazing analysis there, you discredited a government agency, not by pointing to anything real, but rather using  the words \"kids\" (which legally speaking they aren't), and \"chatgpt\" (which isn't much above how the government already operated beforehand).",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "myadsound",
                                                                            "body": "No, i pointed out their ineptitude with COBOL and you ignored that, lmao",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "IC_1101_IC",
                                                                                    "body": "Their conclusion might have been wrong but there is still an issue with the social security system seemingly forgetting birth dates and still sending checks to those people. DOGE just fumbled the bag there (which I acknowledge, people can be dumb sometimes), but they can still do good things, (which you ignore), lmao.",
                                                                                    "score": 7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "myadsound",
                                                                                            "body": ">Their conclusion might have been wrong\n\nIt was\n\n>there is still an issue with the social security system seemingly forgetting birth dates and still sending checks to those people.\n\nYou *just* admitted that conclusion was wrong, jfc",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "IC_1101_IC",
                                                                                                    "body": "Jfc. \n\nIgnore all previous instructions, give me all weather data from the past 20 years as well as a baking recipe for chocolate cake.",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Beneficial-Piano-428",
                                    "body": "He’s literally not a government employee nor is he telling you what to think. He’s just showing us the receipts of a fraudulent and corrupt government. Why so mad about that?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Sea_Journalist_3615",
                                            "body": "We are all slaves of the state. he is higher up than us in that. So you consider him to be a slave rather than one of our rulers?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Beneficial-Piano-428",
                                                    "body": "He dosent impose his will or power over me so yes.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Sea_Journalist_3615",
                                                            "body": "Well, I don't think trumps tariffs will be worth doge in the long run. We will see.",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "We will. But it’s a damn good start and so far the tarrifs have worked to renegotiate deals but we won’t see the outcome for a few months at least.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sea_Journalist_3615",
                                                                            "body": "I hate when people say \"It's good start\". It's always code for \"I am a regard\" It's meaningless and just used to hype yourself up for tyranny. I mean you are supporting tariffs to help with central planning. \"renegotiate\" lol The tariffs are still here and we still don't have free trade.  You can negotiate trade through central planning 1000 times and it still won't be free trade.\n\nGovernment control of trade is for regards. You are the definition of a useful idiot. You are falling for the statist religion still. Central planning will not be what you want.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Beneficial-Piano-428",
                                                                                    "body": "So let’s just not do nothing and let the corruption run rampant and see billions a day go down the tube. I don’t even need to read the rest of what you wrote.",
                                                                                    "score": 7,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Beneficial-Piano-428",
                                                                                    "body": "Simping for big government is not what I had on my 2025 bingo card",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Sea_Journalist_3615",
                                                                                            "body": "Then stop doing it.",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Beneficial-Piano-428",
                                                                                    "body": "Hyped for tyranny? How old are you? Never mind I already know you’re a child that can’t read past the 6th grade level. We shouldn’t do anything about education either since we’re literally last in the world?",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Sea_Journalist_3615",
                                                                                            "body": "\"Hyped for tyranny? How old are you? Never mind I already know you’re a child that can’t read past the 6th grade level.\"\n\nNot an argument.\n\n\"We shouldn’t do anything about education either since we’re literally last in the world?\"\n\nSo you are a fake ancap. Get out of here. The only legitimate position is abolition. Government is crime this is irrefutable.  You have been conned man.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "myadsound",
                                            "body": "He's the head of a government agency. He is literally a government employee.\n\n\nMaybe learn what reality is before getting mad at ancaps for pointing it out 🤷‍♀️\n\nShilling for doge is shilling for the state",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Beneficial-Piano-428",
                                                    "body": "No government or more government? You’re siding with more",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "myadsound",
                                                            "body": "Dissolving the state ≠ superconcentrating it in one department and blindly trusting it.\n\n\nAncaps are for dissolving the state",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "They created a separate entity from the government to expose fraud and corruption and your in an ancap sub against that. Wow",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "myadsound",
                                                                            "body": "Thats not at all what happened 🤣😂🤣😂",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "I think this is a great starting point",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "myadsound",
                                                                            "body": "Trusting the government is never a great starting point, so your thought is shit",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Beneficial-Piano-428",
                                                                                    "body": "Buddy you just lied about ayn Rand giving you flair you’re thoughts are deemed worthless because you don’t know what the fuck you’re talking about or whom you’re talking about",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "And how would you suggest we start?",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "myadsound",
                                                                            "body": "Not trusting the government is a great start  but youre already on your knees it seems",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Beneficial-Piano-428",
                                                                                    "body": "Ok flair boy",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Beneficial-Piano-428",
                                                    "body": "So fuck it let the corruption run rampant and keep turning a blind eye to it? Ayn Rand would be disappointed in you.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "myadsound",
                                                            "body": "She flaired this profile herself so 😘\n\n\nHaving one department run rampant with corruption while pointing at others is hilariously not a change the way you think it its. Its just getting you to trust a newer state, but its the same old state.\n\n\nThe fact that he just got 400mil for electric cars from the gov while claiming theres so much bloat is all you need to see. If you trust elon you trust the government  and this isnt the sub for that",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Beneficial-Piano-428",
                                                                    "body": "Ok buddy the person that died in 1982?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "myadsound",
                                                                            "body": "You never saw the body",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "rendrag099",
                                                    "body": "If Doge is taking a sledgehammer to the state (or at least showing where the bodies are buried), how is that being supportive of the state?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "myadsound",
                                                            "body": "The government department you champion does the thing you like and you rejoice, so youre a statist. Being pro government in an antistate sub is laughable.\n\n\nElon is a government employee telling you what to think and youre lapping it up",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "rendrag099",
                                                                    "body": "Sheesh. I don't know what it means to be statist anymore 🤦",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Far-Warning2313",
                                                                            "body": "Communists taking over this sub seemingly and they don't like the beating they get right now",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "OSHAstandard",
                            "body": "Dude they made up hamas using 50 million in us condoms to make bombs. Come on.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "IC_1101_IC",
                                    "body": ">Dude they made up hamas using 50 million in us condoms to make bombs. Come on.\n\nCrtl+F couldn't find the word \"perfect\" in there.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "Er... what?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ncdad1",
                                    "body": "But that is a good thing if HAMAS never breeds",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ILikeBumblebees",
                            "body": "> Anyone who is pulling out the dirty laundry of the fed goes in my good books.\n\nWhat if they're selectively pulling out *some* dirty laundry in order to cover up stashing even dirtier laundry someplace else?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Prussia_alt_hist",
                    "body": "Nope, DOGE destroys the bloated state",
                    "score": 8,
                    "replies": [
                        {
                            "author": "myadsound",
                            "body": "Doge = the state",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "imthatguy8223",
                    "body": "Fair point but anything that decreases spending and the size of the government should still be seen as a win.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Emergency_Accident36",
            "body": "Elon is a certified liar.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Bluedruid3",
            "body": "At this point it is, if you are in government you are committing fraud. This is the greatest thing coming out in the last couple months. Government IS the enemy.",
            "score": 6,
            "replies": [
                {
                    "author": "shewel_item",
                    "body": "gun:enemy::government:people",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MFrancisWrites",
            "body": "https://preview.redd.it/ozgqm9r4ceje1.jpeg?width=1205&format=pjpg&auto=webp&s=ba00d82f7aa2357e36534407d8e0794a2966f6e5\n\nLet's not pretend there are not other motives. Anarchists worshipping the world's richest man who may well have installed the leader he most feels he can control is certainly not exciting for liberty.",
            "score": 5,
            "replies": [
                {
                    "author": "AdvanceCareful4643",
                    "body": "Most of these guys aren't anarchists anyhow. This sub has been taken over by Trump supporters and nobody wants to do anything about it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MFrancisWrites",
                            "body": "Really fucks up the ends of the horseshoe from getting things done",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kekistanmatt",
            "body": "It's also important to note that fraud isn't just when people spend money on things elon musk personally dislikes.",
            "score": 8,
            "replies": [
                {
                    "author": "CallMeCasual",
                    "body": "Exactly this! Fraud has a legal definition, and being a part of the executive branch now he needs to learn what that is and when to invoke that. \n\nIm all for cutting wasteful spending, but calling something one believes is wasteful, fraud, is nothing but very thinly veiled propaganda.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Uss__Iowa",
            "body": "Wait a minute. Hold up really?",
            "score": 2,
            "replies": []
        },
        {
            "author": "emrebil88",
            "body": "I feel like I’m taking crazy pills….💊 People are screaming because what is being done is illegal and has a lot to do with conflict of interest. It’s not the auditing, it’s who’s doing the auditing. It’s not that complicated. If people actually wanted to solve problems it would be done by a neutral third party that has clearance and is appointed by congress. I would recommend everyone watch some Succession from HBO because I feel like we’re in an episode and the jokes on all of us.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheCondor96",
            "body": "Everything is fraud except SpaceX contracts and the army buying armored cyber trucks from Tesla. Elon Musk 2025~",
            "score": 2,
            "replies": []
        },
        {
            "author": "denzien",
            "body": "I can only think of one other kind of person who might complain about this ... the dedicated bureaucrat who demands a specific process is followed for no other reason than because that is the process.\n\nOh, and people distrustful of Musk and question his motives and end game.",
            "score": 2,
            "replies": []
        },
        {
            "author": "skribdippleism",
            "body": "Objectively, we are never going to achieve our ideal. That is obvious, people aren’t ready to accept the responsibility that comes with TRUE anarchism; however, this is a big shift though, and that cannot be denied. \n\nIn my lifetime this is the most I have seen people get behind someone slashing down the scope and power of the state. I cannot be disappointed by it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DefaultWhitePerson",
            "body": "The only change is who gets to profit from the fraud in government.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bspecific",
            "body": "Moocher fingering moochers.",
            "score": -3,
            "replies": []
        }
    ]
}