{
    "title": "Javier Milei got into crypto bro grifting",
    "author": "kapitaali_com",
    "subreddit": "Anarcho_Capitalism",
    "rank": 308,
    "score": 0,
    "upvote_ratio": 0.43,
    "num_comments (reported by reddit)": 19,
    "url": "https://v.redd.it/kywco5xw4ije1",
    "id": "1iqs1nm",
    "selftext": "",
    "comments": [
        {
            "author": "Aerith_Gainsborough_",
            "body": "As is written in the bitcoin whitepaper: *trust everybody bro, don't verify anything bro*",
            "score": 9,
            "replies": []
        },
        {
            "author": "Secretsfrombeyond79",
            "body": "He dropped it after 4 hours and recognized he fucked up. End of the story for me.",
            "score": 17,
            "replies": [
                {
                    "author": "AIter_Real1ty",
                    "body": "Ah yes, the excuses.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Secretsfrombeyond79",
                            "body": "\"I fucked up, I was wrong and I stopped doing it\".\n\nThat the funniest \"excuse\" I've ever fucking heard, because it sounds like taking responsability.\n\nAlso why the fuck every single account I see talking shit about Milei is a several years old account with almost no activity to speak of ?\n\nEdit-\n\n>Ah yes, the 80 millioms US dollars his team made off of it went right back to the original buyers, right? RIGHT???\n\n>And surely Milei, who knows all about crypto, surely knew what rugpulls were before it happened. I highly doubt he was just a victim of his team.\n\n1 Again, another old account with almost no activity to speak off that appears to farm karma. Color me surprised.\n\n2 Knowing economics and knowing finances are two different fields.\n\n3 But let's say you are right, In order for a rugpull to work you need enough idiots to have bought the coin. So either we have 2 choices, those alleged 80 millions came from the 100-200 Argentinians who bought that because they were dumb enough, and had thousands of dollars ready to change ( haahahahaha right ), or Milei fucked the crypto owners.\n\nEither case I don't give a fuck, if you are dumb enough to fall for a crypto scam that's on you, and if you are a crypto owner you should know the rules of the game. I didn't vote for the guy because I liked him, I vote for him to balance the budget and stop monetary emission. And he's been delivering.\n\nI'm not going back to 25% inflation per month because idiots are still falling in crypto scams in 2025.\n\n>You can still support a crypto scammer, especially given the opposition, but you don’t need to cope and provide excuses for him.\n\nWhat \"excuse\" have I provided ? Every time I talk about this shit, I do it from the perspective that all acusations are right, even if some are outright stupid.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Whole_Sheepherder_97",
                                    "body": "Ah yes, the 80 millioms US dollars his team made off of it went right back to the original buyers, right? RIGHT??? \n\nAnd surely Milei, who knows all about crypto, surely knew what rugpulls were before it happened. I highly doubt he was just a victim of his team.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "WindChimesAreCool",
                                    "body": "You can still support a crypto scammer, especially given the opposition, but you don’t need to cope and provide excuses for him. Milei is either very dumb for this mistake (oops I promoted an obvious scam on a topic I supposedly know a lot about to my millions of followers), or he’s a lying scammer. Even Trump was at least open about his crypto scam and didn’t pretend like he had no relation to it.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "GunkSlinger",
            "body": "Who is this rando?",
            "score": 2,
            "replies": []
        },
        {
            "author": "vertigo42",
            "body": "Source trust me bro",
            "score": 4,
            "replies": [
                {
                    "author": "kapitaali_com",
                    "body": "[https://www.batimes.com.ar/news/economy/milei-accused-of-scamming-supporters-as-he-pushes-crypto-token.phtml](https://www.batimes.com.ar/news/economy/milei-accused-of-scamming-supporters-as-he-pushes-crypto-token.phtml)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "vertigo42",
                            "body": "Accused.\n\nThis guy says he has evidence. Again trust me bro. Show me the internal evidence he says he has.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "kapitaali_com",
                                    "body": "[https://www.nytimes.com/2025/02/15/world/americas/argentina-milei-crypto-trump.html](https://www.nytimes.com/2025/02/15/world/americas/argentina-milei-crypto-trump.html)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "vertigo42",
                                            "body": "again thats not what I am talking aboutl. I am talking about the part where he said he was part of the dev process and knew. Yes he had a tweet where he promoted it. That is not the same as being in on the rug pull.\n\nHe said he has internal evidence from the administration that shows he was part of the project and not just a promoter like so many others.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ptom13",
            "body": "Hey, if Trump can grift a few million people for a ton of money this way, why wouldn’t Milei?\n\nhttps://www.rollingstone.com/politics/politics-news/trump-meme-coin-2-billion-ls-1235261422/",
            "score": 2,
            "replies": [
                {
                    "author": "Will-Forget-Password",
                    "body": "I thought he was different. I thought I could change him. We had a connection.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Mean-Article377",
                    "body": "Did poverty go up or down during Milei's first year? ",
                    "score": 0,
                    "replies": [
                        {
                            "author": "VatticZero",
                            "body": "Down, actually, after the expected spike. It’s now the lowest it’s been since years before his presidency.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "ptom13",
                            "body": "What’s the relevance to the topic of this post?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}