{
    "title": "place your bets, is elon gonna cut himself out of the government?",
    "author": "Southernboiiiiii",
    "subreddit": "Anarcho_Capitalism",
    "rank": 278,
    "score": 21,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 25,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1irgyq1/place_your_bets_is_elon_gonna_cut_himself_out_of/",
    "id": "1irgyq1",
    "selftext": "https://abcnews.go.com/US/musk-works-slash-federal-spending-firms-received-billions/story?id=118589121",
    "comments": [
        {
            "author": "OGmcqueen",
            "body": "lol no",
            "score": 30,
            "replies": []
        },
        {
            "author": "CrunchyLight",
            "body": "Hear me out. If you can undercut what the government is spending wouldn't it be common sense to end the contracts with the others and make gov spend less?\nIt could be good and common sensical but we dont know any details, it could also be very corrupt but it already is so🤷🏽‍♂️",
            "score": 16,
            "replies": [
                {
                    "author": "Southernboiiiiii",
                    "body": "it's the government, you can't make it not corrupt, also elon is a sinner just as we, so I don't think he's gonna be some angel to safe us",
                    "score": 9,
                    "replies": [
                        {
                            "author": "CrunchyLight",
                            "body": "Maybe not, but he has done some good things cutting government, and isn't pro EV mandates even though it would help him",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "WickedWiscoWeirdo",
                                    "body": "I think thats huge. Many in his position would pursue EV mandates. \n\n\nAlthough to be fair, we are what, three weeks into this?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "CrunchyLight",
                                            "body": "We are, and he has said some really stupid things on X that are straight up lies in the past that makes me doubt him, but off actions he isn't the worst",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MaelstromFL",
            "body": "So, the fun part is because of the complaints, he can't review Tesla or SpaceX contracts.  They literally made him incapable of cutting his own contracts!",
            "score": 17,
            "replies": []
        },
        {
            "author": "ExcitementBetter5485",
            "body": "Probably not, but I'm curious, which contracts would you cut and which contracts would you keep, if any?",
            "score": 6,
            "replies": [
                {
                    "author": "Southernboiiiiii",
                    "body": "I would cut the ones the government can't keep up without taxes, I think our next step is a minarchy, so cut everything except keep a fraction of the military and burocrats and maybe space travel, but if we cut biology we should cut astrophysics as well, it's just if we have a state it should be able to defend itself against forgein aggressors",
                    "score": 6,
                    "replies": [
                        {
                            "author": "bruggari",
                            "body": "Why space travel? I'm guessing that you don't think it's fake and gay.. But just why",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Southernboiiiiii",
                                    "body": "I belive that space is the next logical step in human evolution\n\nedit: it should be colonised by private companies tho",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ForFreedomLovers",
            "body": "I don't even care if he does.  Even if he takes over the entire government and cuts 10% of it, I'll be happy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RacinRandy83x",
            "body": "Has he actually slashed any federal spending yet?",
            "score": 6,
            "replies": [
                {
                    "author": "VirPotens",
                    "body": "Are you joking? They fired a shit ton of federal employees and shut down USAID.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "RacinRandy83x",
                            "body": "USAID is not shut down (they don’t have the authority to do that) and we are paying people not to work until the end of September.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Will-Forget-Password",
                                    "body": "I think I saw one of the cases has just went to SCOTUS. Could be interesting times soon.\n\nEDIT: This came out today. [https://storage.courtlistener.com/recap/gov.uscourts.dcd.277463/gov.uscourts.dcd.277463.21.0.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.277463/gov.uscourts.dcd.277463.21.0.pdf)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ed_Radley",
                    "body": "https://usdebtclock.org\n\nLook for the line item DOGE clock. That’s how much spending they’ve curbed so far.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "RacinRandy83x",
                            "body": "*claimed",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ed_Radley",
                                    "body": "You don’t expect anyone to follow through on the claim? Otherwise why make the distinction?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tichy",
            "body": "I don't think \"receiving funding\" is the correct word for selling stuff to the government?",
            "score": 4,
            "replies": [
                {
                    "author": "Southernboiiiiii",
                    "body": "the government always funds stuff in the form of buying stuff, the researchers elon cut were basically selling their scientific services to the government",
                    "score": 9,
                    "replies": [
                        {
                            "author": "TheRealStepBot",
                            "body": "Same with the Thomas Reuters subscriptions everyone was loosing their minds about.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Competitive_Board909",
            "body": "DOGE has a sunset clause",
            "score": 1,
            "replies": []
        },
        {
            "author": "kvakerok_v2",
            "body": "By accident, like with the nuclear.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElderberryPi",
            "body": "He made a deal that will bring us multiplanetary settlement.",
            "score": 0,
            "replies": []
        }
    ]
}