{
    "title": "Damn, I wonder why everyone in DC is suddenly searching for a lawyer and selling their \"modest\" houses",
    "author": "HumActuallyGuy",
    "subreddit": "Anarcho_Capitalism",
    "rank": 262,
    "score": 300,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 48,
    "url": "https://www.reddit.com/gallery/1is0e4q",
    "id": "1is0e4q",
    "selftext": "",
    "comments": [
        {
            "author": "the_collectool",
            "body": "The current cycle has been a disillusionment due to seeing how brain washed people are.\n\nI dont care about the political context, but put whatever lie or truth you want and as long as you have enough followers the sheeple will gobble it completely.",
            "score": 55,
            "replies": []
        },
        {
            "author": "Numinae",
            "body": "Corruption. And criminality.",
            "score": 31,
            "replies": []
        },
        {
            "author": "ExcitementBetter5485",
            "body": "Considering how zoomed out the map in the 2nd picture is, it doesn't seem like a lot of homes for sale. Do you have any data to compare it to from previous years around this time of year/election cycle?",
            "score": 14,
            "replies": []
        },
        {
            "author": "TheRealStepBot",
            "body": "The utter stupidity displayed by both op and the YouTuber who started this is absolutely astounding",
            "score": 18,
            "replies": [
                {
                    "author": "ForFreedomLovers",
                    "body": "if you weren't a jackass, you could have calmly said what was wrong with the OP, and it would have been refreshing.  also, why defend DC, even if he's wrong?",
                    "score": 52,
                    "replies": [
                        {
                            "author": "TheRealStepBot",
                            "body": "Imagine hating an entire city like it’s sports team or something. Sad. Why would I “defend” them?",
                            "score": -29,
                            "replies": [
                                {
                                    "author": "ToxicRedditMod",
                                    "body": "5 of top 10 richest counties in the US are in the DC area. DC area has leeched off the taxpayer for far too long.",
                                    "score": 48,
                                    "replies": [
                                        {
                                            "author": "TheRealStepBot",
                                            "body": "Yeah firing middle management doesn’t change the game. It just makes the game smaller.",
                                            "score": -34,
                                            "replies": [
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "When the game is evil, making it smaller is good",
                                                    "score": 28,
                                                    "replies": [
                                                        {
                                                            "author": "ToxicRedditMod",
                                                            "body": "Like shrinking a tumor.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TheRealStepBot",
                                                            "body": "Madison and I both disagree. Men are not angels. There power needs to be wielded to oppose the evil. But when power is wielded it’s becomes evil itself. Consequently the only protection against evil and by extension power is in an arrangement of powers that oppose and cancel each other out.\n\nThe number of people in government is not proportional to the scale of power they wield over you. On the contrary few people holding power is the very worst of all worlds.",
                                                            "score": -19,
                                                            "replies": [
                                                                {
                                                                    "author": "AgainstSlavers",
                                                                    "body": "Smaller government is better than bigger government. No government is better than small government.",
                                                                    "score": 15,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TheRealStepBot",
                                                                            "body": "Word games with small and big doesn’t make it true. The number of people in a government is not what matters about a government at all. The small that matters is the freedoms enjoyed by its citizens. The small refers to how little it imposes. \n\nMore people in government is the core idea behind the modern order and the rejection of monarchies and dictatorships. Many monarchies and dictatorships have fewer people in them than large successful democracies but they certainly are not smaller in the ways that matter.\n\nI would rather live in government that is diffuse and powerless to harm me than a small and efficient dictatorship that has absolute power over me every single day of the week and twice on Sundays too.\n\nYou bootlickers in here begging for a king really need to piss off.",
                                                                            "score": -3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AgainstSlavers",
                                                                                    "body": "Nobody is begging for a king. Get a life dude",
                                                                                    "score": 12,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "TheRealStepBot",
                                                                                            "body": "Au contraire. Being a bootlicker is very hot right now. Lots of people are literally begging for a king.\n\n![gif](giphy|tBb19eUNiEjBsYeZPhu)",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "AgainstSlavers",
                                                                                                    "body": "I know. You can't stop licking government boots because you want the government as big as possible and complain about any talk about shrinking it.",
                                                                                                    "score": 6,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "TheRealStepBot",
                                                                                                            "body": "A king is the smallest government there is and I certainly want no part of that wonderful world.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "AgainstSlavers",
                                                                                                                    "body": "The number of people involved have nothing to do with size of government. Size of government is determined by the political power of the government.",
                                                                                                                    "score": 4,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "TheRealStepBot",
                                                                                                                            "body": "Well well well how the turntables. My point exactly. Thank you.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "AgainstSlavers",
                                                                                                                                    "body": "No, i haven't changed my position at all.",
                                                                                                                                    "score": 3,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "TheRealStepBot",
                                                                                                                                            "body": "Au contraire\n\nI was the one who said\n\n> The number of people in government is not proportional to the scale of power they wield over you. On the contrary few people holding power is the very worst of all worlds.\n\nNow you are literally saying exactly that. Thank you and good day madam.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "AgainstSlavers",
                                                                                                                                                    "body": "Whether it is a few or many, the total power is the problem, which has been my position all along, madam.",
                                                                                                                                                    "score": 2,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "TheRealStepBot",
                                                                                                                                                            "body": "I said good day sir!",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "AgainstSlavers",
                                                                                                                                                                    "body": "Because you lost",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "TheRealStepBot",
                                                                                                                                                                            "body": "Winners seldom need to inform the losers.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "AgainstSlavers",
                                                                                                                                                                                    "body": "You lost because you abandoned the conversation when I pointed out your hypocrisy.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": []
                                                                                                                                                                                },
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "AgainstSlavers",
                                                                                                                                                                                    "body": "Whether it is 2 million in the government or 10000, the government should be abolished. In reality, when the number of people in the government declines, the government power declines, as people are required to commit the crimes of the government.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": []
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                },
                                                                                                                                                {
                                                                                                                                                    "author": "AgainstSlavers",
                                                                                                                                                    "body": "Whether it is 2 million in the government or 10000, the government should be abolished.  In reality, when the number of people in the government declines, the government power declines, as people are required to commit the crimes of the government.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                },
                                                                                                                                                {
                                                                                                                                                    "author": "AgainstSlavers",
                                                                                                                                                    "body": "I meant: Madame communist larping as ancap.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ToxicRedditMod",
                                                    "body": ":•(",
                                                    "score": 15,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ForFreedomLovers",
                                    "body": "it's a hive of scum and villainy.  sportsball is fake.  government is mass murder.",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "TheRealStepBot",
                                            "body": "Meme away I don’t care, but interacting with and thinking about people through group proxies is cringe and hating one random city is an especially egregious. \n\nIndividuals and ideas matter. This in group vs out group stupidity is just a distraction",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "ForFreedomLovers",
                                                    "body": "it's not a random city; it has the wealthiest zip codes because they've been robbing us for centuries.  get a grip; the gov is your enemy",
                                                    "score": 25,
                                                    "replies": [
                                                        {
                                                            "author": "TheRealStepBot",
                                                            "body": "Sure… they are the ones robbing you. Ignore all the billionaires who’s actual net worth actually shows the results of theft",
                                                            "score": -9,
                                                            "replies": [
                                                                {
                                                                    "author": "ForFreedomLovers",
                                                                    "body": "where do you think billionaires get their power, commie?",
                                                                    "score": 29,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TheRealStepBot",
                                                                            "body": "Have you heard of causality? The randoms living in dc are not the cause of the problem. Not least because they are a variable grouping of people with dozens of motivations. \n\nThere being more or less people getting a cut of the corruption pie does not in the slightest alter its function. There is a pyramid scheme and randoms who live in dc are not the top of that pyramid by a very long shot.\n\nTrimming fat from the middle layers of the pyramid fundamentally is pointless. All it accomplishes is narrowing the pyramid and concentrating power and wealth in the hands of even fewer people. \n\nWith all the name calling I assume you prob don’t get out and read much but had you read the federalist papers you’d have some idea of why more people in the pyramid scheme is generally better. They keep each other down.",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ForFreedomLovers",
                                                                                    "body": "Like when someone visits a city and says \"I didn't like the city.\"  He isn't saying he hates everyone in the city.",
                                                                                    "score": 14,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "ForFreedomLovers",
                                                                                    "body": "I never said they were.  It's your fault for taking everything literally.  Try to come a little closer on the spectrum.",
                                                                                    "score": 8,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "xdisappointing",
                            "body": "It’s not just the government that lives in DC big dog.",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "ForFreedomLovers",
                                    "body": "no shit sherlock;\n\nthis is the kind of comment you waste our time with: https://old.reddit DOT com/r SLASH Firearms/comments/1imjf3e/armed_community_watch_efforts_in_the_historic/mc4vimz/",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tiny_ChingChong",
            "body": "You obviously don’t understand the DC housing market and just watched some stupid video on it 🤦‍♂️😂,spreading nonsense doesn’t make you correct",
            "score": 2,
            "replies": [
                {
                    "author": "ForFreedomLovers",
                    "body": "Where's the nonsense?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Tiny_ChingChong",
                            "body": "Maybe if you look at the facts you’ll see this whole DC metro housing market is crashing memo is nonsense",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "ForFreedomLovers",
                                    "body": "you still haven't given a single fact",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ForFreedomLovers",
                                    "body": "nobody said it was crashing",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ninetales1234",
            "body": "…and who knows? It might be even bigger than this! There are certainly people who *already knew* which lawyer they wanted to hire (from their prior history of wheeling-and-dealing) in which case, there will be no google search.",
            "score": 0,
            "replies": []
        }
    ]
}