{
    "title": "This happened.",
    "author": "RonaldoLibertad",
    "subreddit": "Anarcho_Capitalism",
    "rank": 254,
    "score": 1459,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 94,
    "url": "https://i.redd.it/49jkenibatje1.jpeg",
    "id": "1is2gzc",
    "selftext": "",
    "comments": [
        {
            "author": "Ya_Boi_Konzon",
            "body": "Sadly, many believe that giving out more diplomas does indeed reduce stupidity.",
            "score": 67,
            "replies": [
                {
                    "author": "TimeVermicelli8319",
                    "body": "Or lowering standards so that anyone can get one",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Significant_Donut967",
                    "body": "Whats even worse is people with diplomas thinking that means they're intelligent. It's a dangerous situation.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "btribs",
                            "body": "Personally I think a bigger and more dangerous problem is that there are people who are convinced that holding an uninformed opinion while rejecting critical thinking is an opinion that has equal value to one that does express humility and actively search for the truth",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Normal_Cow_4739",
                            "body": "Diploma or Degrees?\n\n\nWhy is it dangerous?\nI've never known a person that has a diploma proclaim they are intelligent  just for the sake of saying something. \nGetting into an elite university with that diploma,is what makes you intelligent.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Normal_Cow_4739",
                            "body": "Diploma or Degrees?\n\n\nWhy is it dangerous?\nI've never known a person that has a diploma proclaim they are intelligent  just for the sake of saying something. \nGetting into an elite university with that diploma,is what makes you intelligent.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Numinae",
                    "body": "It certainly increases student loan debt though! ¿Yay?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "aricbarbaric",
            "body": "Why don’t poor people just buy more money!?",
            "score": 93,
            "replies": [
                {
                    "author": "AgainstSlavers",
                    "body": "The real money is in selling money.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Jac_Mones",
                            "body": "Unironically the truth since we no longer have a gold standard. Want to get wealthy? Borrow a pile of cash at 3% and use it to get 7% returns or whatever.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "Why many word when few work",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "EatAllTheShiny",
                                    "body": "If you've got direct access to the central bank, it's a hell of a gig...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mxracer888",
                            "body": "True though. The US Federal Reserve (a private company not owned by the government in case you don't know) is in the business of selling money to the US government. Best business model in the world",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "Eh. It's private in the same way the government is private. Try to convince me the government is public.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HepatitisLeeOG",
                    "body": "![gif](giphy|qMDvt69lEC448)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bat-Guano0",
            "body": "Meanwhile Trump is planning to increase the debt limit by several trillion. Watch what they do, not what they say.",
            "score": 23,
            "replies": [
                {
                    "author": "RonaldoLibertad",
                    "body": "But as long as he owns the libtards, then the MAGA crowd will go along with it.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "IamFrank69",
                    "body": "Having a president who is at least willing to articulate the problem is a GIGANTIC step in the right direction!\n\nIt seems literally impossible for a lot of libertarians to ever be happy with anything 🤦",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Bat-Guano0",
                            "body": "Except that he's obviously lying. You think the self-proclaimed \"king of debt\" gives a rat's ass about incurring more debt in someone else's name (yours, that is)? Having a shameless liar for president is a gigantic step in the wrong direction.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Bearynicetomeetu",
                            "body": "He's using the problem to manipulate you \n\nAmerica wasn't headed for bankruptcy and the dollar was strong",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "user3553456",
                            "body": "Trump is a known, regular liar. Him quoting a good guy doesn’t make him a good guy. At least the other collectivists don’t pretend to be on our side and then tarnish our names (eg republicans calling themselves libertarian)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "maxcoiner",
            "body": "Shitcoinery is a real disease... So sad to see both of these rare state downsizers catch it. :(",
            "score": 71,
            "replies": [
                {
                    "author": "Kinglink",
                    "body": "I'm not surprised with Trump, he's a huckster.   But Milei seemed smart enough to avoid that.  Maybe go Bitcoin as a currency (But that's a stretch) but not do a rug pull himself.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "maxcoiner",
                            "body": "My wife & I have been discussing his motive for doing so at length; she thinks it's malice and I think it's stupidity. It's getting harder every day to hold my position though, because this is his \\_2nd\\_ time for him to support a shitcoin.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "twobugsfucking",
                                    "body": "It doesn’t matter it’s strawberry flavored if it’s a rug pull it’s a rug pull.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "maxcoiner",
                                            "body": "Sure, no contest there... But knowing his motives here would be helpful in figuring out how far this self-described AnCap is going to go in reducing the state... Sounds like he may be corrupted already by it.\n\nIf he really just doesn't know any better (which would be quite sad because he's an economist) then he may be hyper-focused on his chainsaw work and just not consider how damaging this was.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "twobugsfucking",
                                                    "body": "I understand. I find it hard to believe he doesn’t know better. But trust should be fickle and indifferent. If broken, motives shouldn’t mend it. So you have the information you need regardless, imo. \n\nNot trying to tell you how to think or get into your convo. Just talking out my ass.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ShameSudden6275",
                                    "body": "I mean he's a brilliant economist be he was always known for being into really weird things; he used to sell cloned dogs.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "commeatus",
                            "body": "A bunch of the people behind Libra also did the trump family's meme coins as well.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rushedone",
                    "body": "Make it not rare then. (I’m planning on it.)",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "GhostofWoodson",
                    "body": "BTC has been shitcoin since 2017",
                    "score": -17,
                    "replies": [
                        {
                            "author": "Red_Igor",
                            "body": "BTC is worth more now than it was 2017 and is far more stable",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "GhostofWoodson",
                                    "body": "So? It's worth lots of Dollars. Grats.\n\nIs that the point of Bitcoin? Does BTC being worth 1 Billion each actually *matter* if the Bitcoin design has been jettisoned?\n\n*hint: it doesn't*",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Red_Igor",
                                            "body": "Yes, actually, it does help that a stable currency alternative does have value. This helps props up other crypto, which would be better at fulling Bitcoins' original purpose.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "GhostofWoodson",
                                                    "body": "BTC is not a currency\n\nIt stopped trying to be in 2017\n\nKeep up",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Red_Igor",
                                                            "body": "And?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "GhostofWoodson",
                                                                    "body": "And so it's not Bitcoin\n\nBitcoin is a currency, \"a peer-to-peer electronic cash system\"\n\nBTC is not that and long ago stopped trying to be that. That it can command high prices is as relevant as the fact that Rembrandts or Maui Mansions command high prices. It gets people excited about the prospect of getting rich, but that has nothing to do with the idea of providing an alternative, superior currency to displace State-backed fiat currencies",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "maxcoiner",
                                                            "body": "I find this argument, especially coming from someone who's cryptocurrency they believe IS a currency, completely arrogant and wrong. \n\nOutside of state-supported currencies, you have Tether, then bitcoin, and basically nothing else at all, being used in the world as currency. Maybe a few gold and silver enthusiasts follow next, way down the chain, and then, way way way lower, a few altcoin groups promoting their coins as bitcoin alternatives. \n\nIf you want to argue that your cute little reddit community + a few hundred small businesses around the world are using your crypto as currency too, I'd suggest that even if you have a million businesses taking it, your total scope is still a tiny, tiny, tiny fraction of a percentage of bitcoin's usage and doesn't show up on anyone's radar.\n\nRemember I once shared a link with you here about a [Federation Bitcoin Circular Economies](https://fbce.io/btc-circular-economies-1)? Some of those have grown huge. Lots of small towns in Peru are using nothing but bitcoin now. South africa has an area (Ekasi) using bitcoin with thousands of people daily. El Salvador is still in the running with cities like Berlin, which has over 200 Businesses all using bitcoin exclusively. No saving in dollars! \n\nSome of these cities are now regularly holding bitcoin conferences, because they've grown so much in the last year or two... You're just far behind the times with that argument now, and it's starting to look like you're willfully ignorant.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "GhostofWoodson",
                                                                    "body": "BTC isn't used as a currency. No currency can have the kinds of frictions BTC does.\n\n>  a tiny, tiny, tiny fraction of a percentage of bitcoin's usage and doesn't show up on anyone's radar.\n\nUsage metric of BTC also does nothing to magically change it into a currency. There are vast hords of gold and silver owners, gold and silver are not more currency than the dollar because of that.\n\n>  Lots of small towns in Peru are using nothing but bitcoin now.\n\nLOL that's not financially possible unless it's all hosted by BTC \"banks\", roughly the equivalent of crypto \"company scrip\"; fees make usage of BTC for daily living a ridiculous proposition even for the wealthy, and for the poor it is another level of ridiculous again\n\nYou are the kind of person who gets bamboozled by social media astroturf on youtube and twitter, and combined with personal holdings, become committed for personal financial, emotional, and psychological reasons. It's certainly not for sound economics or politics\n\nThose are BTC conferences, not \"Bitcoin\" conferences. \"Bitcoin\" is functionally dead right now.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "EndSmugnorance",
                            "body": "Ancaps downvoting fell for small block propaganda?",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "GhostofWoodson",
                                    "body": "It's incredibly disheartening that libertarian communities that are generally more immune to astroturf and propaganda seem to have fallen hook line and sinker for the BTC takeover bullshit. Probably it's because they are invested financially and emotionally and can't think straight.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "maxcoiner",
                                    "body": "Ancaps still believe the large block propaganda?",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "maxcoiner",
                            "body": "The market is laughing at you so hard you now have to call yourself an anti-market anarchist.  ;p",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "GhostofWoodson",
                                    "body": "Lmfao\n\n\"oh my god people pay millions of dollars for these paintings, clearly the market has spoken and paintings are the new currency\"\n\nHow retarded are you exactly?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "maxcoiner",
                                            "body": "Examine your position. I don't have time to explain to you why markets work.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "GhostofWoodson",
                                                    "body": "That's my line you doofus\n\nThe fact that a bunch of people pay high prices for BTC does not mean \"markets have decided BTC is the best Bitcoin\"\n\nIn fact it doesn't even say \"BTC is Bitcoin\"\n\nAll it says is that \"people will pay high prices for BTC\"",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "maxcoiner",
                                                            "body": "What it specifically says is that they trust BTC to perform well and not lose their savings.\n\nThey could probably care less what the 3-letter ticker symbol is or who won the blocksize war, they just know that this asset has a history of going up in value most of the time and that gives them the trust they need to buy it.\n\nYou can argue scalability if you'd like, but to say that \"BTC has been shitcoin since 2017\" is absolutely ignorant of what the word shitcoin means. It's about being untrustworthy. - And BTC is the only trustworthy cryptocurrency, period.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Future-self",
                    "body": "Yeah but trump is downsizing so the gov becomes so small he can more easily become its dictator. GOP are Oligarchs and Dems are Corporatists. Milei is neither.",
                    "score": -19,
                    "replies": [
                        {
                            "author": "SpeakerOk1974",
                            "body": "I hate the man, but do you really become a dictator by making the government smaller? Come on now use a little reasoning here. A \"dictator\" if you mean like a monarchy sure. But the defining characteristic of a dictatorship is making the government bigger. \n\nAlthough I remain unconvinced he's actually making the government smaller and not just funnelling money into the GOP-lead projects.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Fluffy-Feeling4828",
                            "body": "Hitler didn't weaken the Weimar chancellory to get the Reichstag out of his way, he burned the Reichstag.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "yadius",
            "body": "Reading through the comments here, it's clear that the sub is being briggaded by statists from r/FedNews",
            "score": 36,
            "replies": [
                {
                    "author": "AgainstSlavers",
                    "body": "Absolutely. All of reddit is statist commie bot swarms these days. It's pathetic.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "DreamLizard47",
                            "body": "this too will end",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "luckac69",
                                    "body": "Nothing ever happens",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dionysus24779",
            "body": "There are tons of people who unironically believe that.\n\nHaving some academic degree elevates you to some transcended and enlightened state of mind and \"the Experts\" should be our philosopher kings.",
            "score": 13,
            "replies": []
        },
        {
            "author": "smore-phine",
            "body": "I’m sorry, DT’s profile pic is just such a hoot",
            "score": 41,
            "replies": []
        },
        {
            "author": "BasedPenguinsEnjoyer",
            "body": "Would be based if they didn’t induce people to buy shitcoins and then rug pull. That’s just immoral.",
            "score": 40,
            "replies": []
        },
        {
            "author": "blix88",
            "body": "Trump is learning from Milei. There might be hoppe.",
            "score": 12,
            "replies": [
                {
                    "author": "SpeakerOk1974",
                    "body": "Good one",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "hashtaggnweaslepeckr",
            "body": "Pump amd dump....",
            "score": 2,
            "replies": []
        },
        {
            "author": "Secure_One_3885",
            "body": "It's funny because of the degrees Milei holds",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mithra305",
            "body": "Too bad they are both shitcoiners.",
            "score": 14,
            "replies": [
                {
                    "author": "GhostofWoodson",
                    "body": "You mean BTC?\n\nBTC has been shitcoin since 2017",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Kinglink",
                            "body": "Both of them have created meme coins about themselves.   Not surprised that Trump and Melania did, but Milei I thought would have avoided that shit.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WedSquib",
            "body": "Is this real? Does he forget what happened at the end of his last term?",
            "score": 3,
            "replies": [
                {
                    "author": "GunkSlinger",
                    "body": "Maybe he's going to repeal and replace his old way of thinking.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Ebb_5201",
            "body": "Does trump even know who prints the money?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zealousideal-Skin655",
            "body": "Donald can barely read.",
            "score": 6,
            "replies": []
        },
        {
            "author": "GunkSlinger",
            "body": "Given how Trump loves a good shitpost it's no surprise that they'd get along.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MattTheAncap",
            "body": "“Don’t you dare make me fall in love with you.”\n~ Bert Macklin, FBI",
            "score": 2,
            "replies": []
        },
        {
            "author": "TronaldDump247",
            "body": "Pretty ironic coming from a guy who literally ran a fraudulent \"university\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tydyjav",
            "body": "Hahahahaha!\n\n![gif](giphy|hZfm9Pj95F9Mk)",
            "score": 1,
            "replies": []
        },
        {
            "author": "TylerMcGavin",
            "body": "Maybe if there were more diplomas in his country then they'd have noticed the rug on the ground.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PoundMountain3756",
            "body": "Didn’t trump print tons of money in his first term?\nhttps://www.depledgeswm.com/depledge/the-us-printed-more-than-3-trillion-in-2020-alone-heres-why-it-matters-today/",
            "score": 1,
            "replies": [
                {
                    "author": "RonaldoLibertad",
                    "body": "Sure did. Shit tons of it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hot-Spray-2774",
            "body": "Printing money levels the playing field.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Normal_Cow_4739",
            "body": "Anyway,I am about to drink a Pepsi.\n Living my best life until the drone attacks make it to,Alone America.\n\n\nThe most hated country in the world,isn't my thing. The most ridiculous mentally I'll president,isn't bringing me joy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lrc1710",
            "body": "Shitcoiners and zionists.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Emergency_Accident36",
            "body": "Seems like \"and billionaires would end poverty\" would fit as a second simile",
            "score": -3,
            "replies": [
                {
                    "author": "AgainstSlavers",
                    "body": "First, it was Satan. Then it was Hitler. Now it is billionaires. Who is the next bogeyman?",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Emergency_Accident36",
                            "body": "what are you on about?  \"Satan\"?  But yes, Elon and Trump are not far from Hitler.  And it was always billionaires..  remember Soros?  🤣 If this were were Bill Gates or Soros you wouldn't have swallowed so much semen.",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "PacoBedejo",
                                    "body": "> Elon and Trump are not far from Hitler\n\nHuh. Have you drawn your theories out in finger paints you'd like to share with the rest of us?",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "AgainstSlavers",
                                    "body": "Wow you doubled down. Who's the next Hitler after trump?  Is it you?  Are you Next Hitler?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Emergency_Accident36",
                                            "body": "Those are indeed english words.  That's about all the sense I can make of it.",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "Whatever you say Next Hitler",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "VodkaToxic",
                                    "body": "FDR is closer to Hitler than Trump is, as far as presidents go.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Uss__Iowa",
            "body": "Guys tell me the pros and cons of overprint money?",
            "score": -2,
            "replies": [
                {
                    "author": "Jac_Mones",
                    "body": "Pros: Insiders get wealthy\n\nCons: Everyone else gets poor",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Uss__Iowa",
                            "body": "I see a new issues that I didn’t know",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}