{
    "title": "You guys thought on the Ukraine war and USA part in it.",
    "author": "Ribblan",
    "subreddit": "Anarcho_Capitalism",
    "rank": 280,
    "score": 0,
    "upvote_ratio": 0.44,
    "num_comments (reported by reddit)": 64,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1is91vs/you_guys_thought_on_the_ukraine_war_and_usa_part/",
    "id": "1is91vs",
    "selftext": "I cant seem to find on post in this sub discussing the topic. Rarely if not ever is Ukraine mentioned once. And in this time probably the future of Ukraine is literally at stake. I dont know how the media landscape looks like in the US, but here in Europe there is a war and USA is not taking the leadership(without any EU approval) in negotiations with Russia. Personally I wouldnt even called that a negotiations, and im deeply worried about trumps position in this war, to be frank he seems to take putins position in the war more so than helping Ukraine. Im worried that this sets presedence for a new world order where expansionism and aggressive territorial disputes will be the future, not only from Russia but also from USA and China. In terms of USA involvement in this I cant really blame anybody else than trump for facilitating this, he is giving putin all the cards to play. I know most of u guys care about economics, but trump fronts the foreign policy of USA so that also need to be discussed, not just domestic policy and DOGE etc.",
    "comments": [
        {
            "author": "Heraclius_3433",
            "body": "If it’s so important to you as a European why don’t you go fight with Ukraine and send your money to them. Why is your position that the US should be funding a war in Europe.",
            "score": 30,
            "replies": []
        },
        {
            "author": "liharts",
            "body": "I guess it depends on where you live and if you agree or are alined with the current ruling regime.\n\nIf you are in Ukraine, you (the ruling political regime) are literally under attack. If you are in the surrounding countries, you are potentially under threat. If you are the EU, you are also potentially under threat since the current Ukraine regime is allied with them.\n\nIf you are in Ukraine or EU and you don't like the current ruling regimes, Russia might not be a threat. The anti EU parties don't want to fund the war.\n\nIf you are in the US, I don't see how Russia is a threat even if it conquer the entire continent. Invading the US is close to impossible.",
            "score": 9,
            "replies": [
                {
                    "author": "MattyRixz",
                    "body": "There's someone with a gun behind every blade of grass.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "GunkSlinger",
            "body": "Why do you care what anyone in the US thinks? Do you think random people control the government here?",
            "score": 9,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "GunkSlinger",
                            "body": "Why though? How is it anything but an academic exercise that has nothing to do with anyone not in Ukraine or Russia? OP's tone is also accusatory as if Americans in this sub played some part in it. It smacks of nationalist bigotry.\n\nSpeaking for myself, I don't give a fuck what happens in that region because it has nothing to do with me. I have no friends or family there. The only thing I care about is whether my money is being stolen or other rights are being violated to support anything going on there (or anywhere else).\n\nYou should try thinking before shooting your mouth off.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Impressive-Door3726",
            "body": "Russia violates the NAP daily, but americans shouldn't be forced to intervene. I'd rather encourage Europe to engage and defend Ukraine.",
            "score": 9,
            "replies": [
                {
                    "author": "Ribblan",
                    "body": "In my opinion if trump doesnt have ukraines and europe at heart, he should step out and leave it to europe. Currently he is doing the opposite and blocking europe and even ukraine from the process, making backroom deals about europes future without europe there. As a european im disgusted and got 0 respect for trump, i respect neutral countries more than i respect USA atm. they are fighting russias fight, not Europes.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Impressive-Door3726",
                            "body": "I agree.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GoogleFiDelio",
                            "body": ">i respect neutral countries more than i respect USA atm. \n\nEurope is a totalitarian shithole and if you don't like what we're doing it means we're on the right track.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ribblan",
                                    "body": "Yes, russia is the dictator who invades neighbors, and eu is the bad guy, makes sense.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoTie2370",
            "body": "So from a conventional geo political point of view, our responsibility toward Ukraine/Russia is as much as the EU's responsibilities toward Mexican drug cartels vs the US. \n\nUkraine is the EU's neighbor. This confict has EU interests at heart. One of those is buying oil from Russia which is what funds this thing from their side. Which is why that pipeline was blown up. \n\nEverything should be domestic policy. Domestic policy dictates foreign policy.",
            "score": 5,
            "replies": [
                {
                    "author": "mesarthim_2",
                    "body": "So I'm gonna be a devil's advocate on this - how many international agreements did EU sign with drug cartels in Mexico guaranteeing their sovereginty if they give up nuclear weapons?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GoogleFiDelio",
                            "body": "Zero.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "NoTie2370",
                            "body": "I agree, that shouldn't have been done either.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "golsol",
            "body": "Maybe if Europe is concerned it should be Europe's problem. We have already sent ridiculous amounts of money to that corrupt country. We shouldn't have sent them a dime in the first place. America should be focused on our own people and problems not a war started halfway around the world protecting a group of people who are capable but refuse to protect themselves. \n\nThe worst European position is how \"great their social problems are\" when they have been built on the backs of the American taxpayer funding your defense for decades. Enough is enough. Own it or die.",
            "score": 3,
            "replies": [
                {
                    "author": "Ribblan",
                    "body": "Agree that usa can demand more from europe to take part in defense and security. But to me trump goes further then that, he is fighting on behalf of russia. He is telling russia they get all the annex land, no nato troops as security in ukraine, no nato membership for ukraine. Literally the whole point of nato is to protect themself from russia. if you truly care about ukraine sovereignty and security from russia, you dont deny them security guarantees. Right now trump is massaging putins back while shooting zelinsky in the foot. Until this year, USA and EU had a united front against expansionism from Russia, but no more, europe cannot trust trump.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "golsol",
                            "body": "I don't think you read my comment. Americans don't care about Russia or Ukraine. We don't want to send Ukraine money and frankly don't care where Russia draws their boundaries. If Europe cares, then they should handle it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ribblan",
                                    "body": "Its like you dont read what im saying, trump isnt neutral, his position isnt that he doesnt care about ukraine. his position is that russia was in the right to invade ukraine. As of just now he made another press release where he basically blames ukraine for the war, so yeah how am i supposed to take that as \"trump being neutral and just wanna get out\", when he is literally backing putin an invasion on a european country.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GoogleFiDelio",
                            "body": ">But to me trump goes further then that, he is fighting on behalf of russia. \n\nOh fuck off. That Russian conspiracy theory from 2017 forever left a sour taste in my mouth for such accusations. Not wasting money on a dumb foreign war we have no part in is fighting for the American people.\n\nUkraine isn't in NATO. And no, I don't care abut Ukrainian sovereignty, it literally didn't exist when I was a kid.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ribblan",
                                    "body": "I would kinda respect of trumps attitude was \"this is not our war, lets back out\", but he is supporting putin atm. As of just now he made a press release blaming ukraine for the war, so yeah thats the world we live in.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GoogleFiDelio",
                                            "body": "I'm pretty sure he does want us out. \"Supporting Putin\" how?\n\nWe're responsible for the war because we couped Ukraine in 2014, but we're working to deliver justice to the perpetrators now.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ribblan",
                                                    "body": "Im quite sure that russia made their own bed by creating a trade blockade on all exports to russia. They said so in 2013, ukraine cannot choose sides between EU and Russia, if they do they will divide the country. Meanwhile the majority wants an EU relationship. So russia decided to fk with ukraine trade. Why do you think they needed help from CIA to hate the Russians when ukraine people already hated them before because of a very aggressive trade embargo. If Russia had allowed them to choose who they wish to trade with, there wouldnt be any Euromaiden protest. If yanukovic hadnts buckled under pressure from russia, against the people will, people wouldnt protest. Thats russia state interference in a ukraine trade relations, why is that acceptable.\n\nAnd yanukovic fled the country, you cant be president when you flee to your ally. So he got removed from his position with pretty much unilateral votes from the parlament that yanukovic isnt a president anymore. Notice how it started with russia blocking ukraine from a eu trade deal, not with USA. So stop spreading russian propanda, this sub is full of putin shill and im no anarchist, but you as sure hell is further away from anarchism then i am.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "GoogleFiDelio",
                                                            "body": "None of this is my country's problem, at all and the last of my sympathy for them died when they lied and said a Russian missile landed in Poland, which would immediately endanger my family's life. \n\nYou mentioning that the former president had to flee after the coup isn't the flex you think it is. \n\nStop spreading Ukrainian propaganda.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Ribblan",
                                                                    "body": "So russia invading their neighbor, a sovereign legitimate state, thats fine? how many thousands need to die on ukraine soil until you stop sympathize for russia?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GoogleFiDelio",
                                                                            "body": ">So russia invading their neighbor, a sovereign legitimate state, thats fine\n\nWhether it was legitimate or not after the our coup is very debatable. I wish Russia wasn't doing it but it doesn't justify bankrupting my country.\n\n>how many thousands need to die on ukraine soil until you stop sympathize for russia?\n\nI literally don't care. Tell that thief Zelenskyy to give my grandchildren back their money instead of taking it up his nose.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Ribblan",
                                                                                    "body": "its interesting that people on an anarchy sub is backing invasions, i gotta say its fascinating. If USA did something remotely close to what russia has been doing to ukraine, I doubt you would be so forgiving. I mean USA isnt perfect, but you cannot believe that russia hasnt had their hand in the ukraine government, they always have, i mean yanukivic was a russian puppet, its clear from how he dealt with EU before 2014, his support from his elected was based on tying relations with EU, then he did the opposite.  Lets say both countries has expressed soft power on ukraine, and they both have, there is a red line, if you fail you cant just invade the country, thats not how it works. Im just curious if you seem to know about the coup, do you know about what russia did to stop ukraine in the eu trace association before i mentioned it? E.g. do you know about the russian trade emargo of 2013/2014 on ukraine for example? im just curious to what extent you have red up on this, cause people seems to throw the word \"2014 coup\" around here alot but nobody know what led up to it, which i find interesting.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "GoogleFiDelio",
                                                                                            "body": ">its interesting that people on an anarchy sub is backing invasions, \n\nYou keep lying. No one is \"backing\" invasions, I'm saying I don't care. Were you also lying above about Trump supporting Putin?\n\n>If USA did something remotely close to what russia has been doing to ukraine, I doubt you would be so forgiving. \n\nWe do it all the time. Remember Iraq? Afghanistan? Vietnam?\n\n>I mean USA isnt perfect, but you cannot believe that russia hasnt had their hand in the ukraine government, they always have, i mean yanukivic was a russian puppet, its clear both with how he dealt with use before 2014.\n\nSo we get to interfere in their government but Russia doesn't? Ukraine interfered in American politics so fuck them.\n\n>Im just curious if you seem to know about the coup, do you know about what russia did to stop ukraine in the eu trace association before i mentioned it?\n\nDoes it justify the American coup?\n\n>E.g. do you know about the russian trade emargo of 2013/2014 on ukraine for example?\n\nI literally don't care. It doesn't justify the coup.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Ribblan",
                                                                                                    "body": ">You keep lying. No one is \"backing\" invasions, I'm saying I don't care. Were you also lying above about Trump supporting Putin?\n\nHe literally today blamed ukraine for starting the war, thats putins rethoric, he invades ukraine, then blame ukraine sayying he was forced to invade them. Thats not ukraines position, thats putins position. so yes, he is on putins side, clearly...\n\n>We do it all the time. Remember Iraq? Afghanistan? Vietnam?\n\nYes and are you \"unsure who to blame there\", its pretty clear what happened and who is to blame. but with russia, we arent sure who to blame. i mean are you on USA side with gadaffi? no hell no. So what has ukraine done to russia, dont say \"they are corrupt and there was a coup\", maybe it was a coup maybe not, do russia get to invade the country because another country has a coup, no. I mean if mexico has a coup you wouldnt accept that usa to a full scale invasion of them, so why can russia do that.\n\n>So we get to interfere in their government but Russia doesn't? Ukraine interfered in American politics so fuck them.\n\nI think u misunderstood, both countries has interests in ukraine, but there is a red line, both russia and usa has exerted soft power on ukraine, sometimes usa fail sometimes russia fail. What i dont accept is if lets say russia soft power worked, can USA or europe do a full scale invasion of ukraine to take out the government we dont like, nobody would accept that, but for some reason, russia can do that. Acceptable diplomacy happens in trade agreements sharing resources, making mutually beneficial deals, not with force by military. I should have to tell you this on an ancap server should I?\n\n>I literally don't care. It doesn't justify the coup.\n\nGreat so Russia can fk over the ukraine, and the ukraine people should just accept that their president is in bed with putin, whos side are you on? definitly not the Ukrainian people, thats clear.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tsarsaladin",
            "body": "My position; not sure why we’re giving American money, American equipment albeit outdated, to a country that would never do the same for us? They’re not even a nato country. I do not care about ukraine. I care about America and Americas interests, not Ukraine. Now before you all come at me saying “urrrr what about Israel urrr,” same deal. I don’t care about Israel either. They’re not our greatest ally, and don’t deserve a single cent of our money, or a single piece of American equipment.",
            "score": 10,
            "replies": [
                {
                    "author": "jamesbeil",
                    "body": "Ukraine literally sent troops to Afghanistan and Iraq as part of the multinational forces involved. \n\nEven if you don't care about the country itself, you should care about the international trade structure which has made the west the wealthiest society in history, and if that trade slows because Europe is re-arming to fight a war that is being threatened, everyone is poorer as a result.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Possible-Month-4806",
                            "body": "Ukraine also invaded and occupied Iraq with the US. Which blows its argument that invasions are evil.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "GoogleFiDelio",
                                    "body": "LOL checkmate. What Russia is doing is no different from what we do all the time.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GoogleFiDelio",
                            "body": "I literally don't care, that's not a basis for unlimited money to be sent there.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lrc1710",
            "body": "If Putin wants to take Ukraine thats awful but that's not our business. Same if we want to take Panama thats not Putin's business.\n\nI know if you're from Panama you would love Putin's help to prevent the US from conquering you, but Putin doesn't really care, so you bend the knee to America.\n\nThat's just how the world works.",
            "score": 11,
            "replies": []
        },
        {
            "author": "thetheorisingtonpa",
            "body": "Ukraine lost the war in 2023 when their main counteroffensive completely failed, after this point they were slowly getting disintegrated. \n\nThe moment Russia declared this war existential for its statehood there is virtually no amount of aid to Ukraine from EU/US that could have won the war, the only thing that could win is a direct NATO intervention, Ukraine by itself could only hold Russia past this point. Trump realized that, he also realizes that with each passing day the situation will worsen for Ukraine. Initially the deal was, Ukraine does not join NATO and de-facto gives Russia the cities of Donetsk and Lughansk. Now the most likely deal is all of that plus 120,000 square kilometers of Ukrainian land  that has around 40-60% of country’s entire natural resources, and its still considered a “good deal” Russia can ask for more, its advancements on the frontline puts it in very strong position at negotiations. \n\nSooner the peace deal is signed the better the deal will be for Ukraine that what Trump thinks and I agree, all these talks about abandoning Ukraine or siding with Putin is a delusional rumbling by people who misinformed so bad they think more military aid will somewhat give Ukraine an edge over Russia at any moment, when in reality Ukraine practically has no men left to fight to the point they are redirecting specialists from air defense and Air Force into infantry to simply hold the positions.",
            "score": 4,
            "replies": [
                {
                    "author": "Ribblan",
                    "body": "To me that doesnt make any sense, if they are so overwhelmingly winning, they allowed ukraine to bypass the frontline and let them take kursk. Also they have spent 4 years to take 20 % of ukraine while their plan was to go straight into Kiev. Clearly this did not at all follow putins plan, this has a huge cost on putin, they even implemented war economy to fund it. Putin also plans to annex belarus(https://www.atlanticcouncil.org/blogs/ukrainealert/putins-plan-for-a-new-russian-empire-includes-both-ukraine-and-belarus/) , and right now the state is that all of their military is busy fighting ukraine so those plans have to wait. The way I see it, trump could demand alot of russia, but he already conceded everything before the negotiations. Furthermore, im doubtful trump even want the best for ukraine since he is using russian propaganda rhetoric, like doubting zelinsky is a legitimate president etc.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "thetheorisingtonpa",
                            "body": "You don’t really understand how war is going.\nFirst of all Ukraine didn’t take Kursk…, they took several border villages and fields, they have not even taken any actual towns just villages. They took total of 1% of whole Kursk oblast , which Russia already retaken 2/3 of, now Ukraine controls around 420 square kilometers of it (Kursk Oblast total size is 30,000sqk), for reference in January alone Russia occupied around 430 square kilometers of Ukrainian land according to Ukrainian Deepstate map project. The reason why Ukraine was able to took this land is that they attack an inactive frontline and it took Russia several weeks to concentrate their forces in the region, despite that Ukraine still didn’t manage to occupy any place of high interest, like Kursk nuclear power plant or the actual city of Kursk. They didn’t even come close to any of that. They attacked Kursk region with all forces they collected after failed 2023 offensive, now tell me why they attacked a previously inactive part of the frontline instead of using their forces to retake their own territory, because they are unable to perform a break through of the established Russian defense lines, so they attack an uninvolved region where Russian army wasn’t present.\n\nUkraine put a fierce resistance, there are many reasons why initial invasion failed but it has nothing to do with the fact that Ukraine is definitely losing right now, and Zelensky himself already admitted that 1991 borders will not happened and Ukraine will not retake any lost territory through military means, then why should they continue fighting?\n\nRussia does not have a war time economy, you are grossly misinformed, they spend total of 7,5% of their GDP on military, Poland spends roughly the same, it is a not war time economy, Ukraine spends 60%, average country in war spends around 25-50% of their gdp on military in war. When Russia call it’s special military operation and not war they mean it, they have no wartime laws, no curfews, no mobilization after the partial mobilization in 2022, which was primarily for bringing back soldiers whos contracts ended in 2022. Russia has open borders, men are allowed to leave the country. There is no wartime economy in Russia it is a common lie repeated throughout misinformed channels…\n\nAgain people like you who are very uninformed thinking that you have a better understanding of the situation than Trump when he has ultimately more knowledge of the situation than you are, even for the average consumer your level of understanding of this conflict is below surface level yet you believe you can lecture Trump and his administration how to proceed. I am just a Russian/Ukrainian who has been closely following the conflict for whole these years through all possible pro Russian and pro Ukranian sources and even I do not have nearly as much information about it as Trump administration or Putin administration, you on the other hand know even less than me yet you believe you can do a better decisions than Trump can and that he is under some Russian propaganda when he has access to the highest tier intelligence in the world…",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ribblan",
                                    "body": "Russia use 41% of their state budget on their military, in comparison with another country that also spend alot on the military, the USA spend approximate 13% of the state budget. Putin sold it as an operation, later the word war and its legal pretence been used, so yes I know what they meant and thats what failed, putin wasnt meant to go to war, they were meant to take ukraine, he needs support from the russian people and thats much harder when your country is spending almost half the budget and sacrificing peoples life. Thats also why he need completely control of the narrative played to his people, and why western media is blocked in russia. I am not going to say its not costly for ukraine as well, they are working with a much smaller budget, however supplying an occupation is far more expensive than defending your own country, especially when you actually have to fight for years on end, its a different story to steamroll over another country like usa did in iraq.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "thetheorisingtonpa",
                                            "body": "Again, you are wrong, first of all it is 3,4 trillion rubles which is 38,6% not 41%, second of all it is not only a military but combined security and defense budget, third of all it is still less than 7,5% of Russian GDP spending, when it needs to be at least 20%+ of GDP to be considered as a war time economy, lastly over 31% of budget is still allocated to social needs. Russian economy does not fit any criteria of a wartime economy, it is a myth perpetrated by an activist media, same myth as Russia economy collapse or ruble collapse or empty shelves and etc. Russian economy is struggling, inflation on certain products is around 20% interest rates are 21% so loans are not currently viable but it is not in any functional danger of a collapse. \n\nSecondly, I do not understand why did you solely responded to this point when the initial conversation was about the Ukrainian defeat and Trump approach to the situation, why you just single-outed point about Russian economy when it is not the main focus of the conversation. Do you concede that Trump’s approach is correct? Or do you think you can  propose a better course of action?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ribblan",
                                                    "body": "The better course of action would be to not concede territory to russia before the negotiations, give russian guarantees of ukraine not joining nato before the negotiations, and not tell them that usa will not militarily secure ukraine before the negotiations. If he had done that there would actually be something to negotiate over. Also he could demand that ukraine at the very minimum is part of the discussions, thereby legitimizing zelinksy as the rightful ruler of ukraine. Also not question zelinsky as a legitimate president in a pressrelease, when you are supposed to negotiate on behalf of ukraine. It kinda help to not use Russian rethoric when you are supposed to help ukraine.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "thetheorisingtonpa",
                                                            "body": "Territory is already conceded by Zelensky himself before Trump even started the process. It is also conceded by the fact that Ukraine was proven completely incapable of retaking the territory past its initial success in early 2022. Saying that Russia will keep what they took is like saying that Ukraine will not March to Moscow, it is obvious to everybody that it is an only thing that can happen, no point in saying that Russia will have to give the territory back as there is no means to retake it from Russia. It is also a complete non-negotiable with Russia as they already legally claimed occupied Donets, Lughansk and Herson regions as Russian territory, same as Ukraine not joining NATO it is a bare minimum that needs to happen for Russia to join any peace talks. The fact that USA will never directly involve themselves is also obvious to everyone, if Trump even made a hint that he will send troops to Ukraine it will completely jeopardize his entire “America first” and “stop foreign wars” rhetoric he run on whole presidential campaign. On top of that Russia has plenty means to escalate if even a hint of direct NATO involvement will surface. \n\nUkraine is involved, it’s not like they been told that they are not gonna have a say, but it is obvious to everyone that the party that US needs to convince is Russia not Ukraine, there is no point in performative and useless peace summits between Ukraine and US where they ciclejerk each other, like the ones we saw whole 3 years prior. \n\nRussia has a right to be concerned about Zelensky legitimacy, tho it is probably more of the character assassination directed at him, still it is a legal issue as his term is past due and Ukranian laws are not clear on whether war allows for the sitting president to overstay his term. Again, Russian primary goal is probably to discredit him, tho it can be argued that any treaty signed by Zelensky without reelection could also be deemed illegitimate in the future which is a reasonable concern for Russia if they really want to end the war for good. If you support democracy you should have no problem with an idea of Ukraine holding a long overdue elections, especially when Russia already had their despite how rigged they might be.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Ribblan",
                                                                    "body": "By conceding territory, i mean the allowing the territory to be russian, having troops there doesnt mean its recognized as russian territory internationally. What zelinsky means is that he understand that russians wont leave ukraine occupied territory, but it will always be recognized as ukraine occupied territory, not russian territory, thats a huge difference as it can be used as leverage when inevitably russia escalate the conflict again. Thats what the ukraine foreign minister said just a few days ago.\n\nI mean if you really are saying that russia need to be worried about zelinsky, take a looooong hard look at the what is happening. I dont know if you have noticed, but a russian dictator has invaded ukraine, who should be more worried, ukraine or russia. Last time i checked, russia signed a treaty with ukraine in trade of nuclear weapons that they would guarantee their security, but here we are in a fulls scale invasion. Its kinda obvious who is getting raped here and its not putin. I mean I hate to be nitpicky but ukraine has in their constitution that they dont have elections during war times, I really dont know how you hold an election if russia had occupied 20% of their land. If they take land back again, what about the 20%, russia could just claim the 20% is discriminated since they werent part of the election and invade again. I can just go on and on as how russia can fk over their neighbor and somehow look like they are in the right.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "thetheorisingtonpa",
                                                                            "body": "Then why would Russia negotiate? If they refuse to accept the territory as Russian why would they stop? If Ukraine will not forfeit claim for the territory it just means Russia will always feel the pressure and danger of the conflict renewal, this whole situation is why Russia started the war to begin with, they were scared of Ukraine joining NATO and getting better gear and armor and then they could one day retake Crimea when Russia will be weak and judging by how well Ukraine held up against Russia these fears have real merit to them. In such case Russia will aim to not stop until Ukraine stops its existence in any meaningful state. \n\nAgain, what is this rhetoric had to do with Zelensky not having a solid legal claim to presidency which might be a casus belli for the conflict renewal and peace treaty revocation in the future. The morality is irrelevant, it never had a place in global politics. I agree that the invasion was unjust but it doesn’t change anything. Russia is a military powerhouse with most amount of deliverable nukes in the world it’s interests will be put above Ukraine always same as US interests will be put above Mexico or Canada. There is a claim that Zelensky is overdue, Russia is steadfast in their position that they will not recognize his signature as a head of state, Trump understands that and because he wants to end conflict pronto he instead of playing morality like useless EU nations actually makes conditions that Russia will reasonably accept, so the peace will come as soon as possible. And again, I personally do not see the problem with elections in Ukraine, Russia will not challenge them as you claimed as it will be literally Russia saying that their territory are legally Ukrainian and they want right opposite of that and they claim right opposite of that.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Ribblan",
                                                                                    "body": "You seem to trust Russias word, if they promise to not invade ukraine, they would keep their word. Like I said, russia already signed a document which they guaranteed ukraines security, yet they invaded ukraine. Why would ukraine trust them, conceding territory doesnt mean they wouldnt start the war again. Russia only speak force, the only force that so far has repelled ukraine is nato, and now we are even denying them that. See it from ukraines perspective for a moment, and why they cannot trust anything russia is saying. They lie and spread propaganda, if you want to get russias respect, you need military defense, not putins word.\n\nJust to quote you:\n\n>And again, I personally do not see the problem with elections in Ukraine, Russia will not challenge them as you claimed as it will be literally Russia saying that their territory are legally Ukrainian and they want right opposite of that and they claim right opposite of that.\n\nUkraine already was legitimate, zelinsky was a legitimate president when they invaded. and remember they invaded the first time in 2014. And if you think russia will allow ukraine sovereignty, remember what happened before 2014 when yanukovic was president, russia pressured ukraine out of an EU deal by blocking all ukraine exports into russia, they forced yanukovic to back out of a lucrative eu deal against the people will because of russia, thats why they protested, they knew the president was a russian puppet and didnt want to be controlled by them. And they where also right about russia because russia immediately invaded crimea after that, annexing the territory. So why would Ukraine trust russia, when they arent even allowed to choose who they trade with. If they can invade ukraine over a trade deal, ukraine need security, they dont need putins words, they are worth squat.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "thetheorisingtonpa",
                                                                                            "body": "No, I don’t trust Russia’s word, I do not know why you even made this conclusion. In order for Russia not to re-engage the conflict, they need to make sure that all their goals are met, aka No NATO, and occupied territories that Russia claimed will be brought under complete Russian control. I do not know what Trump is planning to do to in order to ensure that Russia won’t invade again but the most proposed idea is DMZ with EU troops, plus if Russia gets what they want it will be unlikely they will invade again just to take some more territory that they do not practically need, even the territory they got now they weren’t planning on getting initially, it’s just a form of reparations from Ukraine, similar to the conclusion of Soviet&Finnish war where after the fierce resistance from finns Soviets took 10% of they territory instead of slightly moving the border as they initially wanted.\n\nAgain Russia does not need Ukraine to trust it, Ukraine lost the war, the guarantees for Ukraine defense are solely on US as it is the only force able to protect them. Ukraine have to trust US, they do not have a choice, as US is the only reason why Ukraine was not completely conquered yet. It is in best US interest and best Trump interest to make a long lasting peace and to end conflict on best possible terms for Ukraine, better the deal will be for Ukraine better the Trump and his administration will look. Do not confuse the “best possible deal” for Ukraine with “good deal” Ukraine lost the war they functionally discussing the terms of surrender not 50/50 “fair exchange” between Russia and Ukraine.\n\nFirst of all, I do not really care but new Ukrainian regime emerged after an armed coup (maidan) where they overthrew democratically elected pro-Russian president Yanukovich. Whenever the Yanukovich was fairly elected or the elections were rigged is frankly irrelevant right now, again I do not care for moral arguments as they are useless but since you started claiming about Ukraine legitimacy it is very bad faith to ignore how new and current Ukraine regime got into power in 2014 to begin with, it was not through referendum or elections it was through bunch of people with quite active segment of actual neo-nazis amongst them taking over the Kiev by force, and I assure you that overwhelming part of eastern Ukraine did not approve of that, hence why Russia was able to organize an uprising so easily as majority of Donets and Luhansk supported Russia. Second of all, the legitimacy of the sitting president could be legally brought under question as he is long past his term. And I do not see why on earth it is a problem for him to host an election if he still has 70% support as he claims he will win in a landslide and only reinforce that people of Ukraine stand with him, it will be only a positive for Ukraine.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Ribblan",
                                                                                                    "body": "How is an parliament election to impeach yanukovic the same as overthrowing him? I mean it was yanukovic who fled, he didnt have to, he could stay and face the consequence of being an unpopular president.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Possible-Month-4806",
            "body": "I would suggest watching the Prof. John Mearsheimer's YouTube video from about 2021 on the conflict. Or watch the two Oliver Stone documentaries on Ukraine on Netflix. One is called Ukraine on fire. Or read Stratfor's stuff on how the 2014 coup in Ukraine was the most blatant coup in history.",
            "score": 2,
            "replies": []
        },
        {
            "author": "teo_vas",
            "body": "single cell brained americans don't realise that Putin invaded Ukraine because of the US",
            "score": 2,
            "replies": [
                {
                    "author": "Ribblan",
                    "body": "He invade after yanukovic turned on the people on an eu association agreements after pressure from russians and a trade embargo on them, leading to the euromaiden. Putin might disagree that ukraine would join nato, but he invaded crimea because of a trade agreement between EU and ukraine. An ukraine had good reasons to dislike the russians before euromaiden, the trade embargo stopped 1/3 of ukraine exports, I cannot see how they needed to be convinced by anyone else, e.g. CIA needed to convince ukraine people that russians are bad people when they did a very aggressive trade embargo, they already knew that before euromaiden. In addition polling shows that majority of the people where pro eu deal, so the only reason yanukovic turned on the deal was from outside pressure from russia, and the people knew that.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "teo_vas",
                            "body": "before 2014 americans were pushing for Ukraine to join NATO. Germany and France were opposed. Putin believes that europeans are american puppets and eventually Ukraine would join NATO.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Ribblan",
                                    "body": "True but, thats not why he invaded. He invaded because over a trade agreement deal that didnt go according to putins plans. If they werent worried about Ukraine trade deals with europe putin wouldnt have implemented a trade embargo on ukraine.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ihiwszkpseb",
            "body": "It’s a proxy war between Russia and the US. Zelensky isn’t even a part of the negotiations, the first meeting of which [literally happened today (Feb 18 2025)](https://www.theguardian.com/world/2025/feb/18/us-russia-ukraine-talks-riyadh-saudi-arabia) in Saudi Arabia, initiated by the Trump administration.\n\nHopefully the negotiations do scale back the expansionism. Trump has already said he wants to do a deal with Russia and China to scale back all 3 powers’ military spending by 50% which would be incredible.\n\nAs a European if you want to support Ukraine and the US’s expansion, go over there and enlist. Your life expectancy will be [4 hours](https://www.businessinsider.com/eastern-ukraine-soldier-life-expectancy-meat-grinder-2023-2), and you can help escalate this conflict to nuclear war, possibly ending all life on earth. \n\nPutin *does* hold all the cards in terms of the direct conflict between Ukraine and Russia, Russia has almost 150M people and strategic and tactical nukes, while Ukraine is a poor corrupt client state of the US with a fraction of the population, it was never going to win. Realists like Mearshimer have been warning about this since 2014 after Obama overthrew Yanukovych and installed Poroshenko. The US sacrificed Ukraine on the altar of NATO expansion. No superpower would be ok with TLAM dual use (conventional and nuclear) tomahawk missile launchers placed right on their border. If Russia overthrew Mexico, installed a Russia-friendly dictator, then started placing the Russian equivalent of tomahawks inside Mexico, the US would invade and overthrow Mexico instantly.",
            "score": 1,
            "replies": [
                {
                    "author": "Ribblan",
                    "body": "You call them negotiations, if zelinsky says no, that would be like me and you talking about it with no effect, thats why i call them \"negotiations\".\n\nAs for the russian propaganda you are spouting, I really thought more of this sub that I really have to defend that country borders should be respected. If you really think ukraine needed to be planted ideas from CIA to understand that russia was fkn them over before euromaide, look at how it started with the eu trade association which btw. the majority of ukraine was for, and this was russian response(https://en.wikipedia.org/wiki/Russian\\_embargo\\_of\\_Ukrainian\\_goods#:\\~:text=Russian%20embargo%20of%20Ukrainian%20goods%20refers%20to%20trade%20sanctions%20Russia,imports%20from%20Ukraine%20to%20Russia.). A trade emargo blocking all ukraine exports into russia. Ukraine who was already suffering economically, was now being cucked by putin because they dont like that ukraine decide to trade with the EU. Why do you think CIA needed to tell ukraine that they where being blocked by russia, you think the people didnt feel that 1/3 of the exports suddenly was stopped at the russian border. Why do you think ukrainians stopped bying russian goods before the euromaide. and furthermore, yankukovic eventually bucking under the pressure from russia, against the people will and decide to go for a customs trade union with russia, which btw only had 13% support in a poll right before the decision. And you wonder why ukraine protested??? stop spreading russian propaganda, you russian shill... im a leftist and im more aligned with ancap ideals than u...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ihiwszkpseb",
                            "body": "You really think Zelensky has any say at all in this matter? He’s a puppet of the West, he’ll be lucky to get out of this without being Gaddafi’d. It’s not Russian propaganda, it’s reality, which is why you and every other corporate media enjoyer is reduced to repeating the slogan “Russian propaganda” instead of actually debunking any of the facts that realists or libertarians lay out. I don’t have to support the invasion to recognize the reality on the ground.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ribblan",
                                    "body": "Zelinsky has the say, if the west support him, if europe and usa says that zelinsky is part of the talk, he would be. Bringing zelinsky is part of legitimizing him as the rightful ruled of ukraine, not bring him is the opposite, and you know what trump has both done and said. Thats why im telling you trump is selling out ukraine as parts. The only thing stopping the two from sharing the pieces is europe currently. so yeah, fk trump, he is worse than realistic, he is fighting on russias side.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "temapone11",
            "body": "You have to be a fucking idiot to think Russia is strong enough to invade Europe. They wouldn't even go through Poland. Russia is weak!\n\nThey did that to Ukraine because it was all part of a plan from the deep state to weaken Russia. That's why they removed the nuclear weapons from Ukraine. All part of plan. Russia was forced to react, otherwise Ukraine would join NATO. \n\nNow Russia suffered heavy losses and won't let go. There is nothing to be done for Ukraine. I hate Russia more than you btw.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Long_Brother6345",
            "body": "I don't think the war was going anywhere- I have also heard many many have died... for what? and why should the deaths continue? Isn't peace a good thing? stopping the killing is positive isn't it? why Is this decision getting so much hate, atleast trump can make a decision, about something.",
            "score": 1,
            "replies": [
                {
                    "author": "Ribblan",
                    "body": "I mean if you say there would be peace when russia invaded kiev if zelinsky allowed them to take ukraine, in that sense yes people wouldnt die. But there wouldnt be anymore ukraine either. We also could say that the second world war didnt have to happen, britain and usa could just give europe to hitler, there wouldnt be any war and nobody had to die. Thats also a solution. But you are also throwing international law under the bus, we made those laws so that we wont have more war, but it requires people to respect those laws. If countries dont respect those laws somebody needs to hold these responsible, the way thats done is that putin is recognized as a war criminal and that we dont give putin what he wants, doing to the laws are basically ineffective. Especially in this case where there was only external forces starting the war, there would be no war in ukraine hadnt russia invaded. If you compare it to other conflicts e.g. syria, you could say its wrong that russia and usa backs different siden in a proxy war, there at least was a conflict domestically.  That wasnt the case in ukraine. its completely and 100% russia who caused that war, therefore he needs to be held responsible. And now we have trump blaming zelinsky for the war.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "usmc_BF",
            "body": "Americans attempting to do munich agreement 2.0 is fascinating",
            "score": 1,
            "replies": []
        },
        {
            "author": "Will-Forget-Password",
            "body": "Fuck Trump. He already sent money to Israel and Egypt. Ukraines cause is more worthy than Israels.",
            "score": 0,
            "replies": [
                {
                    "author": "Ribblan",
                    "body": "I mean in the israel palestein case, both have been in the wrong, arguably personally I think israel has overstepped their response when they bombed gaza to shits and pieces. However it should be no doubt who are in the wrong in ukraine, sure ukraine wasnt perfect, it was suffering from corruption and oligarchy, but why invade though, ukraine never threatened russia, they dont have nukes, they have a shitty economy, why are they afraid.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}