{
    "title": "Amazon revokes the concept of owning books, can edit books you already bought; PIRACY IS THE ANSWER!",
    "author": "DontTreadOnMe96",
    "subreddit": "Anarcho_Capitalism",
    "rank": 240,
    "score": 128,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 51,
    "url": "https://www.youtube.com/watch?v=XfcoUdWCB9M",
    "id": "1it1ik7",
    "selftext": "",
    "comments": [
        {
            "author": "yadius",
            "body": "The entire publishing industry makes my skin crawl.\n\nFortunately, technology makes very it easy to bypass.\n\nKobo, Calibre, and epub",
            "score": 17,
            "replies": [
                {
                    "author": "Talkless",
                    "body": ">Kobo\n\nThe market provides. I use one.\n\nAlso, there's PocketBook European brand.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Synthetic2802",
            "body": "Animal farm was always about Hitler and the Nazi, you can see it here on my Kindle!",
            "score": 16,
            "replies": [
                {
                    "author": "DreamLizard47",
                    "body": "nazis were socialists.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "ripyurballsoff",
                            "body": "[Nazis were not socialists.](https://www.britannica.com/story/were-the-nazis-socialists) This is accepted fact by every WW2 historian on the planet. It’s crazy how people on this sub constantly repeat false narratives just because socialism is in the name. Do you think China is really The People’s Republic ?",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "Background_Maybe_402",
                                    "body": "Their whole schtick was “a different kind of socialism” in the form of things like interest free loans for german families and nationalized industries etc. It was definitely socialist, just not the globalist kind.  The only people that say the nazi’s weren’t socialists are “not real communism” leftists",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "darwyre",
                                            "body": "Socialist in racist towards jews flavour?\nOr socialist in class discrimination flavour!\n\nThey both lies and smells like shit just like Marx.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ripyurballsoff",
                                            "body": "Downvoting me instead of admitting you’re wrong, what an ancap thing to do 😅.",
                                            "score": -4,
                                            "replies": []
                                        },
                                        {
                                            "author": "ripyurballsoff",
                                            "body": "Wrong. Actual historians who’ve studied this field their entire lives clearly state they weren’t socialist. \n\n“To say that Hitler understood the value of language would be an enormous understatement. Propaganda played a significant role in his rise to power. To that end, he paid lip service to the tenets suggested by a name like National Socialist German Workers’ Party, but his primary—indeed, sole—focus was on achieving power whatever the cost and advancing his racist, anti-Semitic agenda. “\n\n“Over the following years the brothers Otto and Gregor Strasser did much to grow the party by tying Hitler’s racist nationalism to socialist rhetoric that appealed to the suffering lower middle classes. In doing so, the Strassers also succeeded in expanding the Nazi reach beyond its traditional Bavarian base. By the late 1920s, however, with the German economy in free fall, Hitler had enlisted support from wealthy industrialists who sought to pursue avowedly anti-socialist policies. Otto Strasser soon recognized that the Nazis were neither a party of socialists nor a party of workers, and in 1930 he broke away to form the anti-capitalist Schwarze Front (Black Front). Gregor remained the head of the left wing of the Nazi Party, but the lot for the ideological soul of the party had been cast.”\n\nThey touted socialism because they knew it sounded attractive to the suffering population and it was a way to get in power. They had zero intention of actually implementing it. \n\n“In April 1933 communists, socialists, democrats, and Jews were purged from the German civil service, and trade unions were outlawed the following month. That July Hitler banned all political parties other than his own, and prominent members of the German Communist Party and the Social Democratic Party were arrested and imprisoned in concentration camps. Lest there be any remaining questions about the political character of the Nazi revolution, Hitler ordered the murder of Gregor Strasser, an act that was carried out on June 30, 1934, during the Night of the Long Knives. ANY TRACES OF SOCIALIST THOUGHT IN THE NAZI PARTY HAD BEEN EXTINGUISHED.”",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "DreamLizard47",
                                                    "body": "The core socialist idea is that you can seize and centralize power and manually change the structure of society and economy in the name of greater social good. If you look through this lense there's no difference between the red Khmers or nazis. They acted exactly the same covering their actions with retarded anti-scientific bullshit ideas. Socialism is command economy + collectivism (anti individualism).",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "ripyurballsoff",
                                                            "body": "So you’re saying the action of seizing power but never actually implementing socialism is still socialism ? That doesn’t track. Also, the core of socialism is the public owning the means of production, *not* exterminating minority groups and trying to take over the world. The Nazis never intended to make society better, the people never owned the means of production, they never had any say in how anything is governed or produced etc. The Nazis were not socialists. Hitler just acted like he was to seize power, than dropped it immediately for fascism.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "DreamLizard47",
                                                                    "body": "public ownership doesn't exist. It's always government ownership. Or in other words command economy. Nazi Germany didn't have free market. They had command economy. Nazi Germany was a totalitarian state. Which implies total control over every aspect of society including the economy.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ripyurballsoff",
                                                                            "body": "Command economy:\nIn a command economy, the government dictates what goods are produced, how much is produced, and at what price, essentially making all economic decisions. \n\nSocialism:\nSocialism aims to create a society where the means of production are owned and controlled by the people, either through the government or worker cooperatives, with a focus on social equality; it can include aspects of a command economy but doesn’t necessarily require complete government control.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Ok-Peach7867",
                                                                                    "body": "Public ownership is state ownership, dumbass.",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ripyurballsoff",
                                                                                            "body": "Is a co op government owned ? Dumb ass",
                                                                                            "score": -1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Ok-Peach7867",
                                                                                                    "body": "The vast majority of times? Government-backed and connected to state unions",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "ripyurballsoff",
                                                                                                            "body": "That does not support your incorrect point. \n\n“Most bodies of water are ocean, so all bodies of water must be oceans.” \n\nJust admit you’re wrong my guy.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Ok-Peach7867",
                                                                                                                    "body": "A wholesale redistribution of resources require the state to operate. As defined by AnCaps, the state is something that has a monopoly on force (the collective public or dictatorship of the proletariat) and the public or collective perfectly fits in with this.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "ripyurballsoff",
                                                                                                                            "body": "No one said a socialist state wouldn’t have governance. But saying the state HAS to own the means of production is false. Absolute statements are almost never true, and most issues have varying levels of nuance. It’s a good thing I don’t subscribe to the ancap definition of a state.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Ok-Peach7867",
                                                                                                                                    "body": "Coercion = state. And even if you don't subscribe to that, legal authoritarianism and justification for taking away resources is still aggression. Also, the AnCap definition is literally the common definition according to most ideologies. Something along the lines of \"something that has a monopoly of legal authority in a geographical area.\"",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "ripyurballsoff",
                                                                                                                                            "body": "You understand that monopoly on legal authority is a lot different than monopoly on violence ? You seem to be conflating a lot of things in this convo. Because things are similar does not make them the same, even if it aids in trying to prove your point. And I could say the same thing about capitalism. You have to work or die. Capitalists literally hold resources hostage. If that’s not coercion I don’t know what is. At least in a socialist state the goal is to work together to serve all people. Not just line the pockets of the 1% that want to see us divided and powerless to stay under their boot. Also, 99% of people wouldn’t have to worry about the redistribution of wealth, that’s why the capitalists at the top are terrified of it catching favor, and they toil day and night pumping propaganda at us to try and make us hate it. Pure individualism doesn’t work for any one but the 1%.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Ok-Peach7867",
                                                                                                                                                    "body": "Legal authority necessitates monopoly on violence. I thought you'd know that much",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "ripyurballsoff",
                                                                                                                                                            "body": "Every societal structure ends up with some kind of authority. That does not mean it is guaranteed to respond in violence. Some times it’s necessary, most times it’s not. The way you worded it was acting like State=violence. That’s an oversimplification. I could argue in ancapistan the ruling structures would be far more violent because any one can do whatever they want on private property. For the most part government means working out ways to live with each other. Individualism means doing whatever you want which inherently means you don’t have to have consideration for your neighbor, which could be violence.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Ok-Peach7867",
                                                                                                                                                                    "body": "See egoism and natural rights",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": []
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                },
                                                                                                                                                {
                                                                                                                                                    "author": "Ok-Peach7867",
                                                                                                                                                    "body": "Your freakout means that you have no idea what negative rights or voluntary transactions are. You are not entitled to other people's labour. Hint: being forced to work for other's needs is called slavery.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "ripyurballsoff",
                                                                                                                                                            "body": "Freak out ? Right… I never said I’m entitled to your labor. But people should have a fair share of their own labor. And there’d still be trade and private property under socialism. People would own homes and possessions. You’re thinking of authoritarian socialism/communism where the people have very little rights and the economy is centrally planned. Those types are awful and never work.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Ok-Peach7867",
                                                                                                                                                                    "body": "If you wanna run a commune or co-op go ahead, by the vast majority of people will run under a market system based on property rights. LTV is inherently something that can't be put to scale.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "ripyurballsoff",
                                                                                                                                                                            "body": "Sure it can. The problem is capitalists actively work to crush it. They know when people realize collectivism is better they’ll lose power and their palatial estates. There’s a never ending class war and we’re getting destroyed. Anarcho capitalism will inherently keep a ruling class intact, which will enable them to keep the masses powerless.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "Ok-Peach7867",
                                                                                                                                                                                    "body": "The more I look at the horseshoe theory, the more evident it becomes that it is true. Class war. Race war. Class consciousness. Race consciousness. National. International",
                                                                                                                                                                                    "score": 2,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "ripyurballsoff",
                                                                                                                                                                                            "body": "I also think the horseshoe theory is true to some degree. Some are actively working to collude, with some honestly good people on both sides. But for the most part the powers that be that don’t really have a side besides domination, are working from the shadows to make things work their way. Class war is their too priority though.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                },
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "Ok-Peach7867",
                                                                                                                                                                                    "body": "What is your definition of collectivism? Also, it seems you've not looked at any literature or concrete arguments, because AnCap is Volunteerism, and not something that can generate a constant upper class.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "ripyurballsoff",
                                                                                                                                                                                            "body": "Collectivism is a broader term for people working together, and may not have been as exact as I should have used. I believe volunteerism is very valuable and we should use it as often as possible. But the main problem with capitalism, is the main goal is concentrate as much capital, property, and power over the economy as possible. Right now we have concentrations of wealth not seen before as in the past. Monopolies are the end goal, and after a certain point the public has no choice but spend their money at these businesses. This is a type of coercion which is what ancaps are so against. In my opinion, too far in any ideology is problematic. Too much government is bad, and too much capitalism is bad. Monopolies stifle entry in business sectors, and so does too much regulation and taxes. I think most of the public falls some where near the middle, and needs some kind of regulation. I’m fully for much lower taxes, but think we need *some* regulation and social safety nets, as some people will act nefariously without some safeguards in place. I don’t have all the answers. But think people working together has gotten the human race where we are today, and too much individualism will let the concentrated power at the top keep us divided, participating in class wars, and fighting together so they can keep their power. \n\nIm not sure how much further this convo can go but I do appreciate the mostly cordial discord and conversation.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "siasl_kopika",
                                    "body": "\\> This is accepted fact by every WW2 historian on the planet\n\nwhy push the \"appeals to authority\" fallacy as your only argument when it is a definitionally losing position ? \n\nAnyone who agrees with you is proving that they are not a historian but a political tool.\n\nyou can make a good living being a revisionist historian, as we have seen with the recent USAID revelations, they pay good money for leftist lies.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ripyurballsoff",
                                            "body": "It’s definitely a losing position ? 🤣🤣🤣. You people never cease to amaze me. I literally posted a link proving I’m right. And it wasn’t an appeal to authority. I was saying the facts are settled, and undisputed. The ONLY people who disagree are uneducated people like you that populate fringe subs, and are prone to conspiracy theories and “alternate facts” because it some how makes you feel superior that you “dare” to believe something others don’t. It somehow makes you feel like a big man to “not follow the herd” and you’re super tough for doing so. When the reality is you’re probably lacking in critical thinking skills or  cognitively behind most people. \n\nI’m begging you to cite some sources proving Nazis were socialists. I promise I’ll act surprised when you post from some bullshit alright website.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "siasl_kopika",
                                                    "body": "\\> lacking in critical thinking skills\n\nAdding more fallacies to your pile?\n\n\\> I’m begging you to cite some sources proving Nazis were socialists.\n\nliterally their entire policy platform.\n\nIm clearly talking to a bot, so goodbye",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SirBiggusDikkus",
            "body": "Jokes on them. I only buy physical copies of books.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AbbeyNotSharp",
            "body": "Maybe read the TOS and don't buy from them if you don't like it? Also they can't do anything about people archiving the shit out of older editions of the e-books so maybe do that if it's such a big deal.\n\nAmazon isn't actually violating anyone's legitimately held property rights here.\n\nI generally like Rossman but he absolutely does not understand natural law and libertarianism. He's starting with the assumed premise that current statist law is mostly correct and going from there.",
            "score": 4,
            "replies": [
                {
                    "author": "rushedone",
                    "body": "How does changing the EULA after you buy it conform with natural law or libertarianism? If it does that's a very twisted version of it then.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "DreamLizard47",
                            "body": "Don't sign shit you don't agree with",
                            "score": -16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Southernboiiiiii",
                    "body": "such bad conditions should be illegal, only if it's a monopoly tho, also I blame the interventionist market ultimately, because in a free market there would be good competition\n\nsry if you had a stroke, I'm stoned af, which is my good right",
                    "score": 0,
                    "replies": [
                        {
                            "author": "mesarthim_2",
                            "body": "Amazon is not a monopoly",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "DreamLizard47",
                            "body": "don't buy from amazon. the solution is really simple",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sanguinerebel",
            "body": "I'm assuming they are doing this in order to combat piracy, and it's really annoying. A lot of people just won't buy ebooks from amazon because of how they operate and this will probably make that even more so the case. Calibre with extensions and the old version of pc kindle makes it pretty simple to convert most kindle books and remove DRM, so I've just made a habit of that for a long time when I get new kindle books (mostly with free credits for accepting slower shipping with prime). This way I can easily read them from any device without all the headache of the kindle app. My number one gripe with kindle is not only can you not loan books, but you can't easily even share a device with another user, so if I want to loan somebody my tablet, I can't just make a separate user account for them to be able to access their own kindle books. It goes through and erases all my downloads if I sign out of my kindle account, and they only allow a family with 2 adults, I think with a one year wait to change, which is just unrealistic as hell in this day and age.",
            "score": 1,
            "replies": []
        },
        {
            "author": "siasl_kopika",
            "body": "lol, paying amazon for DRM locked books is anti-freedom behavior.\n\nIf you just cant find the book elsewhere, at least have the common decency to deDrm it and post it for others.\n\ncopyright communism is lame.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mesarthim_2",
            "body": "As is typical for Rossmann, it's completely misleading. Amazon is not 'revoking ownership' or whatever. They're enforcing what was always in the ToS you signed more strictly.\n\nYou can disagree with what is in ToS or even the concept of intellectual rights (I do), but that still doesn't change anything on the fact that Rossmann is just spreading commmie gobldygook.",
            "score": 1,
            "replies": [
                {
                    "author": "CarTar98",
                    "body": "I support anyone's right to archive and sell/give-away previous editions, but I also support a company's right to piss off their customers with terrible business strategies.\n\n\nEdit: why are people downvoting you but upvoting me?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "mesarthim_2",
                            "body": "No idea, I suppose people like Rossmann because they hate woke corporations or something like that. Sometimes this sub is wierd :-D",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Low-Concentrate2162",
                    "body": "Downvoted for speaking facts. Doesn't get more Reddit than that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "kurtu5",
                    "body": ">  Amazon is not 'revoking ownership' or CHANGING THE EULA YOU ALREADY AGREED TO.\n\n\"whatever\" hides a lot",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mesarthim_2",
                            "body": "They didn't change the EULA. It was always in the EULA that you cannot remove the DRM from their product, it was just easy to do.\nSimilarly, they could always edit the book or even revoke the license. Always, what you purchased for Amazon Kindle was a digital license to a content.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}