{
    "title": "Are there any Anarcho Capitalists here??",
    "author": "GingerCookies0",
    "subreddit": "Anarcho_Capitalism",
    "rank": 233,
    "score": 200,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 275,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1it3jrx/are_there_any_anarcho_capitalists_here/",
    "id": "1it3jrx",
    "selftext": "All I see on this Sub is Republican Neocon shit all day.\n\nIf there is any surviving Ancap here, it's time to move on and make a new Subreddit",
    "comments": [
        {
            "author": "Skogbeorn",
            "body": "It's reddit, mate. Whole site's been a wash for a while now.",
            "score": 65,
            "replies": []
        },
        {
            "author": "kurtu5",
            "body": ">If there is any surviving Ancap here, it's time to move on and make a new Subreddit\n\n\n\nNo.  This is not an echo chamber.  This is where ancap ideas are exposed to normies.  We let normies talk here freely.",
            "score": 146,
            "replies": [
                {
                    "author": "GingerCookies0",
                    "body": "Keep feeding the Socialists and they'll devour you.  \nIt's already impossible to express an Ancap opinion here without being downvoted by morons",
                    "score": -41,
                    "replies": [
                        {
                            "author": "bongobutt",
                            "body": "And this is an argument for leaving the sub and starting the cycle over again in a new sub... why? ...exactly?  \n  \nIf they overrun AnCaps here, they'll do it in the next sub too. I fail to see the point in what you're advocating.",
                            "score": 36,
                            "replies": []
                        },
                        {
                            "author": "kurtu5",
                            "body": "> It's already impossible to express an Ancap opinion here without being downvoted by morons\n\nOpen your eyes.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "GingerCookies0",
                                    "body": "The downvotes on my comment just proved my point lol",
                                    "score": -26,
                                    "replies": [
                                        {
                                            "author": "maxcoiner",
                                            "body": "We AnCaps did that. (Because socialists aren't the majority here.)",
                                            "score": 42,
                                            "replies": []
                                        },
                                        {
                                            "author": "kurtu5",
                                            "body": "No they didn't.  You said nothing related to ancap philosophy and were only making false assertions, so you got downvoted for it.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "siasl_kopika",
                            "body": "\\> It's already impossible to express an Ancap opinion here without being downvoted by morons\n\nLol, you are being downvoted for posting socialist butthurt. \n\nMaybe try posting ancap opinions instead.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "GingerCookies0",
                                    "body": "Try saying that they are chocking with Trump's cock to see what happens",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Classy_Mouse",
                            "body": "Disallowing contrary ideas because they are popular? How AnCap of you",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "GingerCookies0",
                                    "body": "Since when being an Ancap has to do with popularity?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Classy_Mouse",
                                            "body": "When did I say it did? I see you glazed right over the part where I mentioned disallowing speech. That was the part where I was calling you an authoritarian",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tvrin",
                            "body": "> It's already impossible to express an Ancap opinion here without being downvoted by morons\n\nIt builds character :)\nIt's definitely overflowing with Trump apologists that were evicted from other discussion spaces right now, but I wouldn't worry, in a few months things should normalize a bit.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Banned_in_CA",
                            "body": "It's not the socialists that are the problem here.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "TheSov",
                            "body": "some ancaps have strange idea's like not having a border. while i would agree the ancap principle goes there. we must also understand that the world isnt ancap and people are up to no good. not having a border is stupid given that governments exist. so idea's like open borders are non starters for me, cuz im not that naive.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "maxcoiner",
                                    "body": "I'd agree with your overall sentiment, but it's not the imaginary line that makes so much trouble... It's the fences, armed guards, policy, and most importantly, the incentives like welfare that make people want to scale those fences and break the country's laws. \n\nI dislike borders but if they were just lines drawn on a map that indicates 'all tax slaves inside the line pay taxes to DC, while ppl outside that line pay taxes elsewhere' then we'd never have a need to talk about them.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "onecrystalcave",
                            "body": "every time I make a real ancap post here I don't feel at all crowded out. Granted I don't post often, but I do feel you may be being slightly overdramatic.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RandomPlayerCSGO",
            "body": "Yes, we are just tired of reapeating the same arguments to statists who never listen or try to understand anything other than what their overlords say.",
            "score": 94,
            "replies": [
                {
                    "author": "GunkSlinger",
                    "body": "https://preview.redd.it/3rhhm163q3ke1.png?width=750&format=png&auto=webp&s=34c149ef7319adc8966a3ec4ad6b46d359d90963",
                    "score": 87,
                    "replies": []
                },
                {
                    "author": "kurtu5",
                    "body": "A lot of old soldiers here that the new guys don't know about.  I keep at it, because the LLMs will read what I have said and the god like AI that will rule the hubblesphere will know I fought a good fight.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "RandomPlayerCSGO",
                            "body": "I'm so tired I think the best answer is to be like that guy that just quotes a list of books every time some statist asks anything. \n\nReally our ideology is too complex for regular people who are just used to politicians being like football where you support one team no matter what.\n\nTo understand our system you need deep knowledge of economics, theory of the state, history knowledge and an open mind to be able to think how to substitute the services monopolized by the state.\n\nMost people dont have that and don't want to develop it, they just want to argue about regular trending politics topics like immigration and whatnot.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "theobmon",
                                    "body": "I mean... How hard is it really? It's pretty simple I think!...\n\nGet any group of people together with power over others and it will inevitably devolve into fascism. \n\nThat's it. That's all there is to it.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "dp25x",
                                    "body": "\"Really our ideology is too complex for regular people\"\n\nWhat is complex about it? Don't coerce other people.  Don't defraud other people. Not much more than that.  It's what most people do in 99% of their social interactions by default. It's the folks that want to justify deviations from that default that introduce complexity.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "RandomPlayerCSGO",
                                            "body": "Understand why free market is better than government intervention required some reading and it's hard to for people raised in statist systems",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "dp25x",
                                                    "body": "Maybe it's just a quibble, but to me, the ideology is about the means, whereas the good stuff you get from adopting those means, like more efficient and effective markets, is about the ends.  But I can see how someone might run into complexity linking a certain set of means to desirable ends.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Dethbridge",
                                            "body": "I'm a socialist here for the lols, and I agree that Ancap is not complicated, rather I think the resulting society would be much worse for most people, and also that statelike institutions will crop up very quickly as well as local forms of democracy and taxation. ",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "dp25x",
                                                    "body": "I don't think that I've ever seen an argument that says your conclusions here are impossible.  In fact, unless we would reach a certain tipping point where incentives can realign, your conclusions might be inevitable.  The system as it is is stacked that way.\n\nBut there are a few things that still make the ancap ideology a practical pursuit.  The main one is that it's hard to argue that a more violent society is better in the main than a less violent one, so why not aim to remove violence from our lives and from our institutions?  Also, there's nothing to say that the conclusions you reach are necessary under any possible incentive structures.  Isn't it worth a bit of work to see if we actually could avoid the things you mention? I'm sure there was a time in the past where the ways things were set up, it made monarchs seem inevitable. And the list goes on.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "kurtu5",
                                    "body": "> Most people dont have that and don't want to develop it, they just want to argue about regular trending politics topics like immigration and whatnot.\n\nSure.  But then 10 years ago people like Joe Rogan had no idea what an ancap was.  Ideas are infectious.  that is the victory.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "TheWastelandWizard",
                                            "body": "He still doesn't. He thinks Elon is an Ancap rather than an Authoritarian carpetbagger.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "kurtu5",
                                                    "body": "> He still doesn't.\n\nHe knows the word.   That is a victory.  This used to be fringe ideology.  As in people thouhgt about it, but still voted and argued for thier guy.    Not so much anymore.\n\nVicotry.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "hudsonhateno",
                                    "body": "lol, just keep dropping links to Power and Market, the Ethics of Liberty, and Human Action…",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "ElderberryPi",
                                    "body": "> To understand our system you need deep knowledge of economics, theory of the state, history knowledge and an open\n\nNo, you just have to understand the simple concept of **\"Don't hurt anyone, don't take their stuff, and keep your promises.\"**.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "RandomPlayerCSGO",
                                            "body": "That's what you need to understand in order to live in ancap society. But nowadays people's heads are full of statists bullshit about how government intervention is necessary, and it takes economic knowledge to recognize it as bullshit and realize the free market is better.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "kurtu5",
                                                    "body": "> it takes economic knowledge to recognize it as bullshit and realize the free market is better.\n\nMacaque monkeys understand this 'economic knowledge'.  They understand fairness and can recognize bad transactions.\n\nI am sure an indoctrinate human can to if someone just points out the obvious to them.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Gatewayfarer",
                                    "body": "“The state is bad and all its functions can be privatized so end the state.” is a complex ideology?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RandomPlayerCSGO",
                                            "body": "No but that's the easy part, the hard part is explaining to indoctrinated statists why it is better than statism",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LudwigNeverMises",
                            "body": "I’m an AnCap and 10 plus year sub veteran. \n\nI like many of the new guys. They know how to engage in politics and still spread the ideas.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Secure_One_3885",
                            "body": "Okay but you're one of the neocon \"not-like-the-other-girls\" republicans in here.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "trahloc",
                                    "body": "There is a difference between turning pragmatic over the decades and actually rejecting the underlying premise. Especially those of us who reached adulthood in the 80s/90s.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Secure_One_3885",
                                            "body": "Way to keep on topic.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "trahloc",
                                                    "body": "Read your message again. You did an ad hominem against someone who has been here for nearly 20 years. The topic was already tea bagged.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Secure_One_3885",
                                                            "body": "Their tenure here doesn't make them any less a neocon. Saying \"I didn't sell out, I bought in\" doesn't change one's position.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "trahloc",
                                                                    "body": "Perhaps but my only interaction with you is the claim that I'm the one who went off topic after you veered off a cliff ... so your word just isn't enough for me.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "kurtu5",
                                                                    "body": "> Their tenure here doesn't make them any less a neocon.\n\nOk moron, what makes me a neocon?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "International_Lie485",
                    "body": "Just call them bootlickers and done.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Ribblan",
                    "body": "Well this sub is also filled with people who typically holds these points:\n\n\\- The russian dictator was legitimate in invading ukraine.\n\n\\- I dont support russia, BUT, zelinsky is a dictator and 2014 was a coup and hunter biden and cia and blablabla.\n\nFew people in here oddly dont hold any grudge or content vs putin who started a war, its really odd to. Like sure you claim to be ancap and say that even if ukraine is a state who you dont like, surely we can all agree democracy > dictatorship and war > peace. Or am i wrong on this.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RandomPlayerCSGO",
                            "body": "This people are not ancap. We do not give a shit about any state. Putin is a cunt for starting a war yes, politicians are cunts for making people kill each other. We countries in NATO stick our noses in other countries business and bomb people, our politicians are cunts too same as Putin and same as any other political overlord. \n\nDemocracy is just a fuss word, is it better than a dictatorship?  Well it depends on many factors but that's completely different debate.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ribblan",
                                    "body": "Democracy is a lose term i agree, but respecting borders is a pretty clear distinction vs not respecting borders.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RandomPlayerCSGO",
                                            "body": "Well Anarcho capitalism does not support borders. Communities can refuse and banish people but there would be no IDs or passports or national border control. As long as you find someone willing to give you work and someone willing to rent/sell you a place to sleep you can go wherever the fuck you want. Building a place to sleep yourself in some unclaimed land in the outskirts of a city is also an option.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ribblan",
                                                    "body": "And the way to explain that, is the same as respecting borders.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "hehexd3169",
            "body": "I agree. I am Ancap. The sub needs to be purged.",
            "score": 11,
            "replies": []
        },
        {
            "author": "FishStickLover69",
            "body": "This place has been a pro-Trump sub for months now. Him and Elon chop some extremely low hanging fruit (which is a good thing), and people in here will tell you that real ancaps should be impressed by that. You're a \"purist\" if you turn your nose up at that. Meanwhile, they're taking steps every day to turn the executive branch into a defacto dictatorship. But that's OK. We can let those particular idiots consolidate all the political power, so long as we cut that low hanging wasteful spending Rand Paul has been bitching about for years during his festivus grievances that no one cared to be hot and bothered over.",
            "score": 6,
            "replies": [
                {
                    "author": "cavari924",
                    "body": "Exactly, Trump is turning the executive branch into a Juggernaut and their followers fail to understand that the same political juggernaut they're enjoying right now, WILL be the same Juggernaut the democrats are eventually going to inherit in 4-8 years.\n\nAnd as my only ancap uncle (RIP) used to say, there's only three thing that never go back: Women (financially), men (sexually) and governments (in acquired powers): Once a woman dates a man with his own car and own apartment, once a man dates a woman that swallows, and once a government expands its powers or creates a new tax, there's no coming back. \n\nUnironically, Trump is moving the U.S. faster into socialism than many presidents before.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jac_Mones",
            "body": "I'm not an ancap, but I find ancap philosophy to be more logically consistent than socialist philosophy. Most ancaps are willing to live and let live; no socialists are. My biggest disagreement with ancaps is that I believe some level of state is necessary, however the differences in my ideal and the ancap ideal are small enough that our political goals are 90%+ aligned.\n\nWhen I discuss issues here I do my level best to keep this in mind. Furthermore, I can argue an ancap point without agreeing with it. Playing with ideas is one way of finding truth.",
            "score": 8,
            "replies": [
                {
                    "author": "jozi-k",
                    "body": "Amazing comment. Can I honestly ask why you believe some services cannot be provided without government?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "undeadbird",
                            "body": "Not OP but I agree with their point about needing some government framework. I think my biggest thing with needing some sort of oversight is that there needs to be protections against human greed. I know ancaps are staunchly against regulation but I just don’t trust companies to have their consumers best interests at heart. \n\nThe most iconic example is the jungle by upton Sinclair. I just don’t trust that without regulations and worker protections, companies won’t go back to doing just that. After all, they want to maximize profit. So they’ll sacrifice the health of their workers and customers to do just that. Like cars or buildings are another big example. Say regulations are lifted. So the company builds a janky car or building. But people don’t find out because the cars seatbelt fails or the building collapses. I get in a ‘free market’ framework, consumers would avoid the manufacturer in the future. But I can’t reconcile letting some people be the Guinea pigs in that situation and losing their lives.\n\nI’d be curious what the pure ancap solution is to managing that sort of greed.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jozi-k",
                                    "body": ">I think my biggest thing with needing some sort of oversight is that there needs to be protections against human greed.\n\nThis is what am I trying to understand. Are there any domains where we don't need oversight? Let's say, do you think kids should be learning how to talk/walk under some regulatory framework? If not, then I would like to see what is common for those \"special\" domains. You can just list them, maybe we find the denominator together.\n\n>I just don’t trust that without regulations and worker protections, companies won’t go back to doing just that.\n\nDo you know anyone running a company who would do that? No person from my network is going to do so. Someone might try, but workers will run away and work for competition, don't you think?\n\n>After all, they want to maximize profit.\n\nIs this general statement for all companies or only for some? I can show you few counterexamples: non-profit organizations, charities, research, investments. I am running one company (employing 20 people) just for fun, I've been in red numbers for 25 years.\n\n>Like cars or buildings are another big example. Say regulations are lifted. So the company builds a janky car or building. But people don’t find out because the cars seatbelt fails or the building collapses.\n\nHonestly, would you buy such a car, if you weren't sure seatbelt is working? Making 50k payment, without finding out such a critical information? Would you like to live in a house which might collapse? Would you be willing to pay let's say 1M USD for such house? Maybe you would, but I think it is clear that people don't want to drive dangerous cars, and live in collapsible buildings.\n\n>I’d be curious what the pure ancap solution is to managing that sort of greed.\n\nFor houses: companies which would specialize in providing certificates. Insurance companies would definitely play big role here as such houses are quite huge expenses.\n\nFor cars: again, certification companies. Healthcare would be heavily involved as similarly to previous example, you pay for expenses of insured people, which will put a lot of incentives to make really sure your clients don't use such cars!\n\nAnd, of course, I cannot predict future (that's why we argue for free market!) and thousands of companies will try different solutions, 95% of them will fail, but those who come up with best solution, they will be most valuable to people in offering best protection in your car or house.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DeltaSolana",
            "body": "There's dozens of us I tell ya. \n\nStart up an unregistered gun workshop, and nobody bats an eye. Start an unregistered HRT lab, and everyone loses their minds.",
            "score": 59,
            "replies": [
                {
                    "author": "vvfella",
                    "body": "Loving the idea of an unregistered gun workshop/unregistered HRT lab co-working space",
                    "score": 14,
                    "replies": [
                        {
                            "author": "DeltaSolana",
                            "body": "It's actually hilarious to me how statists have a problem with these. \n\n\"People want to make their own decisions with their defense and their bodies? Oh, the absolute horror. I absolutely must back an authoritarian nightmare state to stop them\"",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "vvfella",
                                    "body": "It’s all about freedom until someone tries to freely live outside of their preconceived norms, even in groups like this",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sarcasmoverwhelming",
                    "body": "![gif](giphy|ReBGGJtbXrjbQJwByP|downsized)",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "CauliflowerBig3133",
                    "body": "What is hrt?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "DeltaSolana",
                            "body": "Hormone replacement therapy. The testosterone, estrogen, androgen, etc, that someone takes when transitioning. \n\nNaturally, the statist conservatives want it completely outlawed. Which is antithetical to free market capitalism and bodily autonomy.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "International_Lie485",
                                    "body": "I'm 36 male and just started TRT a couple of weeks ago.\n\nI feel like a 20 year old in the gym, healed all my back pain.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "DeltaSolana",
                                            "body": "Yo, that's awesome. \n\nHave you run into any stupid laws when trying to get it?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "International_Lie485",
                                                    "body": "No, but I think ALL males over 35 should consider doing it.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "DeltaSolana",
                                                            "body": "The military did leave me with a few permanent aches. I'll look into it. I appreciate the insight.",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "CauliflowerBig3133",
                                                            "body": "I uses hcg. Not try. Do the same",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "International_Lie485",
                                                                    "body": "Tell me more please, I'm interested.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "AgainstSlavers",
                                    "body": "I haven't seen a big push to outlaw HRT for adults.  The outcry seems to be against mutilation of children.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "thefoolofemmaus",
                                            "body": "This. No one seems to care if adults cut themselves to pieces, but for the same reason we don't let children sign contracts, enter marriages, or a host of other life long consequence things, hrt or even puberty blockers for kids should be restricted.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "afieldonearth",
                                    "body": "I don’t want it outlawed, and I don’t care what grown adults do with their bodies.\n\nBut administering it to children is grotesque child abuse and is, IMO, in the same category as sexual assault on children.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "DeltaSolana",
                                            "body": "I use the guns and HRT comparison a lot because I think they're rather similar. \n\nYes, both technically **could** be used to harm kids. However, that's no excuse to take everyone else's rights away. \n\nThere's even safe ways to allow kids to engage in both. Could take a family day on the range, starting them out with a Ruger 10/22 just like I did. Conversely, if a little boy wants to wear a skirt and go by she/her for a bit, I don't see any harm in that either. \n\nThis doesn't mean give a 10 year old a S&W 500 magnum, or start surgery/hormones right away. That's something for them to pursue themselves when they're old enough.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "trahloc",
                                                    "body": "If that was what the vanguard of those positions pushed for I don't think there would ever have been any *meaningful* kickback.\n\nWhich is why the kickback at taking your kid to the range was tried and people laughed at it. Even most anti gun people failed to understand why that was bad so it was dropped pretty quick.\n\nChopping off body parts gets everyone but the vanguard to take a step back and go \"wait, they weren't lying about that!?\"",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "siasl_kopika",
                                    "body": "\\> Naturally, the statist conservatives want it completely outlawed.\n\nThis is where you fell off the train tracks.\n\nConservatives are calling to ban \"unauthorized gene therapy imposed on other people's children\"\n\nThey are also calling to ban mandatory handling of people who have taken such treatments which is incongruent with their gender.\n\nI have not yet seen a conservative calling for a wholesale ban on HRT, especially not in cases where someone actually needs it and its not being imposed on them by coercion.\n\nSo, in the main, the conservative opinion in the ancap one. We are pretty much in sync with them on this topic.\n\nnoone should be able to bully and poison other peoples children.",
                                    "score": -2,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "DeltaSolana",
                                            "body": "Nope? Nope what?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "DeltaSolana",
                                                            "body": "Understood. Have a nice day.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Derpballz",
                    "body": "OMG it's you! I remember you from r/Politicalcompassmemes last year! 😍😍😍",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DeltaSolana",
                            "body": "Didn't know I had any fans, but I appreciate it nonetheless. \n\nWhat post/comment exactly do you remember me from?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Derpballz",
                                    "body": "I remember you saying \"oh my gawsh, you really had passion to debate the Statists, I usually get too tired over it\". The post was one of those posts which caused Statists to create hilarious rage responses.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DeltaSolana",
                                            "body": "Oh, I remember now. You're damn near surgical when arguing. Nice to see you're keeping up the good work.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Derpballz",
                                                    "body": "Now I have an even more succint fashion to debunk statements\n\nhttps://preview.redd.it/lisx6iwqq3ke1.png?width=648&format=png&auto=webp&s=02e5ff8b76ae0dea0bf0ea91be854e7c69dd15b0",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ParticularAioli8798",
                    "body": "![gif](giphy|yoJC2GT9aupktQCUOk|downsized)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PacoBedejo",
            "body": "Yep. You've caught us celebrating a significant shift of the Overton Window and government reducing itself.\n\nHere's a breakdown of who you'll find here:\n\n**Autistic AnCaps** who can't stop performing purity tests, rejecting anything or anyone that's less than 100%. These folks are guaranteed to make the perfect the enemy of the good. They are useful sentry bots and sometimes even get into good discussions on the core ideology. But, beware their pathological need to shout down literally every libertarian, capitalist, anarchist, or philosopher you've ever heard of. They will definitely let you know which logical fallacies you accidentallied.\n\n**Libertarians.** Note the L. You know the types. They're natural contrarians, so there's simply no way they could be Democrats or Republicans... even though they definitely align with one of those parties' primary goals. These people like their statism with the woody scent of individualism. They like the style. They just can't engage in second order thought to understand the negative outcomes of their government schemes to violently control and steal from their neighbors.\n\n**Minarchists** who think that they're definitely different from the Libertarians because they have a better understanding of the evils of government... that they think they still need because <insert pet project(s) here>.\n\n**libertarians**. Note the l. These are the same as above but haven't yet heard the misnomer \"minarchist\".\n\n**Confused NeoCons** who have had ***some*** of their bloodlust slaked after 20 years of bullying goat herders and the present threat of war with nuclear states. I think they're only here because we don't ban confused idiots. \n\n**Displaced 2-Partiers** who seem to be on a journey of discovery and may end up becoming AnCaps... if they don't get trapped in a feelings-loop. A classic example of the so-trapped can be seen in the addled mind of Glenn Beck. Be kind to these people and try to explain to them how their feelings and supernatural beliefs don't excuse NAP violations.\n\n**Agorists** who would, once again, like us to remind you to stay away from their homesteads unless you have something to barter. \n\n**Actual Anarcho-Capitalists** who understand the only moral life is centered on voluntary association and non-violence. But, they understand the only path towards such runs through education and slow governmental change. These people sometimes accidentally praise Drumpf when he talks about little things like... closing whole-ass government agencies and literally reducing the size of the government's labor force. Angry morons often think these are Confused Neocons.\n\n**Angry Morons**. Previously mentioned, they're on the prowl for things they're angry about. They often play the role of Autistic AnCap, but only so they can shout down whatever angers them. Their stupidity frequently stops them from thinking through their positions to find paths of efficacy. They're the sort who might go into crippling debt \"because credit ratings are bullshit, man\".\n\n^^/NoTrueScotsman",
            "score": 58,
            "replies": [
                {
                    "author": "Banned_in_CA",
                    "body": "I feel both attacked and in complete agreement with this assessment.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "vvfella",
                    "body": "Every time I read this I love it more!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "CarTar98",
                    "body": "Would you include people that reject immigration restrictions in the autistic ancap section?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "PacoBedejo",
                            "body": "Are you asking about in the current, continent-wide, involuntary, extortion-funded communes where so many are living at the expense of others... or are you asking about in theoretical AnCapistan?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "CarTar98",
                                    "body": "Current",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "PacoBedejo",
                                            "body": "Currently? My personal preference is to have fewer people living off of my earnings against my will. I'm not going to shed tears for people who break the current mafia's rules and live off of my labor when they get deported by the current mafia. I'm not cheering it either. Those who haven't committed felonies and who live off their own labor... well, I wish the current mafia would let them stay.\n\nIdeally? No borders apart from small communes and limited-size city states which focus on voluntary association. Nobody living off of my labor against my will.\n\nAs far as where those who weep and moan about immigration restrictions in the current situation, I'd have to create a \"Useful Idiot\", \"Suicidal Altruist\", \"Doesn't Have Taxed Income\" category.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "CarTar98",
                                                    "body": "My stance is, \"condemn anti-immigration while also condemning the welfare that makes immigration expensive. In the same way, you would condemn subsidized healthcare while condemning the regulations that cause healthcare to be expensive.\"",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "PacoBedejo",
                                                            "body": "So, no room for incremental steps?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "CarTar98",
                                                                    "body": "Incremental? Like getting rid of one and then the other? Sure. But if getting rid of one makes the other immediately possible, why not get rid of both at the same time? If you have the authority to do it, do it.\n\n\nI would continue criticizing the anti-immigration stances of the Republican party even if they get rid of the welfare state in the same way I would criticize Javier Milei for keeping a ban on drugs despite having the power to remove it and the economy is stable enough to survive the initial crime wave that would come after removing the ban.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PacoBedejo",
                                                                            "body": "> If you have the authority to do it, do it.\n\nI don't have the authority.\n\n> I would continue criticizing the anti-immigration stances of the Republican party\n\nEvery Republican I've heard speak on the matter, no matter how tribal their foolish mouths make them sound, still says something like, \"come through the right way\". I'm okay with the mafia preventing destitute criminals from coming here and living off my labor.\n\nI'd rather a free market deal with it. But, that isn't an option for me to choose. I'd prefer the ruling mafia making it easier for peaceful, productive people to come here and to help me and mine flourish and... for the first time in my life, I'm hearing the aristocrats paying that some mind.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "CarTar98",
                                                                                    "body": "I would criticize them IF they continued doing it without the welfare state as the excuse. There are many people that would come to America tomorrow if you lifted the restrictions today, and many of them would be a benefit to society. The criminals would only bother us if they refused to prosecute criminal behavior or if the welfare state is still active.",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kt54g60",
                    "body": "I still can’t quite tell where I fall in, but I love it.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "2strokeYardSale",
                    "body": "My man.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LadyAnarki",
                    "body": "How can I buy the Actual Anarcp-capitalist flare please? I can also barter it as an agorist :D",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MoneyPowerNexis",
                            "body": "First you have to pass the purity test by not being one of the Autistic AnCaps.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "LadyAnarki",
                                    "body": "Damn it. Someone told me I was slightly autistic once.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "myadsound",
                    "body": "This post is a lazy mischaracterization of AnCaps.\n\nPurity tests? No, just consistency—rejecting all theft and coercion, including \"lesser evils.\"\n\n\nLibertarians/minarchists? Not AnCaps. We don’t argue for \"small government,\" we reject government entirely.\n\n\nNeoCons/2-Partiers? Not AnCaps. War-mongering statists don’t belong here.\n\n\nAgorists? Not AnCaps. Dressing up black markets as a full ideology doesn’t make them anti-state philosophers.\n\n\nCelebrating government cuts? No, because any government downsizing controlled by statists is still state power shifting, not disappearing.\n\n\n\"Angry morons\"? Another baseless insult—rejecting fiat slavery isn’t \"stupid.\"\n\n\nAnCaps aren’t celebrating government agencies or statist politicians right now, no matter what you hope to convince people of with a wall of garbage text.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "bongobutt",
                            "body": "This comment could be a case study for the importance of reading comprehension.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "myadsound",
                                    "body": "Few in this sub have any level of reading comprehension, unfortunately reddit doesnt have a crayon font for them",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PacoBedejo",
                            "body": "Ah. The angry moron.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "kurtu5",
                                    "body": "I know there is only the one of him, but I think you should make a place for him in your copy pasta.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "PacoBedejo",
                                            "body": "He's either the autist at the top or the moron at the bottom.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "myadsound",
                                                    "body": "Im the ancap between the 3 of us and the both of you are increasingly desperate to convince yourselves otherwise",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "myadsound",
                                                                            "body": "Lmao, no",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Starman164",
                                                                                    "body": "You're right, it's way more than half of the time :\\^)",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "myadsound",
                                                                                            "body": "Theres yet to be a situation where an *ancap* disagrees with me",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Starman164",
                                                                                                    "body": "Of course, because you think you are the one true ancap, and therefore anyone who disagrees with you must by definition not be an ancap! ;)",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "myadsound",
                                                                                                            "body": "No, just cause ancaps agree with me. Statists take issue all the time tho",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Starman164",
                                                                                                                    "body": "Seems kind of sus to me that in a sphere infamous for infighting and no true scotsman fallacies, there is not a single person you consider an ancap who has ever disagreed with you on something\n\nalmost like you dismiss anyone who disagrees with you as a statist\n\nbut I repeat myself",
                                                                                                                    "score": 2,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Schowzy",
                            "body": "Lmao right? They're so stupid it hurts. \"Erm, He's actually reducing government by giving only himself the power. A monarch is ancap, right guys?\" ☝️🤓",
                            "score": -8,
                            "replies": []
                        },
                        {
                            "author": "GravyMcBiscuits",
                            "body": "Of course it is. It was made by a confused neo-con ... A trumper.\n\nPrinciples/philosophy bad ... Love the Trump!",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "GravyMcBiscuits",
                                            "body": "Yes ... \"actual anarcho-capitalists\" spend a lot of time \"accidentally\" praising Drumpf.\n\nDon't be an angry autist ... just praise the Drumpf! (You see what I did there ... I can't possibly be one of his cultists because I called him \"Drumpf\" ... tee hee .. wink wink)",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "PacoBedejo",
                                                    "body": "I didn't say we're praising Drumpf. Head out of ass. Here it is again for the fucking idiots:\n\n> You've caught us celebrating a significant shift of the Overton Window and government reducing itself.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "GravyMcBiscuits",
                                                            "body": "There's no shift. That's just your imagination at play\n\nHow much would you wager that the vast majority of the folks who upvoted your post are actual Trumpers? You think that it's irrelevant that MAGA/Trumpers/GOP have a strong incentive to imply principles are stupid things only angry autists would care about? You think it irrelevant that your post plays heavily into their agenda?\n\nMaybe you aren't a Trump cultists ... I'd wager the vast majority of your upvoters are. My message is for them. Enjoy your \"significant shift\" ... haha.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "PacoBedejo",
                                                                    "body": "> There's no shift. That's just your imagination at play\n\nThe people I encounter IRL are now talking about all manner of things they used to not be aware of. Taxation is theft. Government should be smaller. You know, good things.\n\n> How much would you wager that the vast majority of the folks who upvoted your post are actual Trumpers?\n\nI have no clue and neither do you. Quit the sophistry.\n\n> You think that it's irrelevant that MAGA/Trumpers/GOP have a strong incentive to imply principles are stupid things only autists would care about?\n\nThere's ideal and there's a path to get there. Autists dismiss the path. Angry morons have a problem with portions of the path. Idiots think that Trump is centered on that path.\n\n> Maybe you aren't a Trump cultists ... I'd wager the vast majority of your upvoters are. My message is for them. Enjoy your \"significant shift\" ... haha.\n\nI'm a pessimistic pragmatist. These aristocrats will never do all of what I want. They don't give a fuck about my principles. I wish they'd just go off into a mansion and fuck one another. But, they go to DC and fuck me. I celebrate when they fuck me less. I complain when they fuck me more. My first principle is not being fucked. After I'm not being fucked, I have room for other principles.\n\nIt'd be really cool if they weren't deporting productive, peaceful people who broke some lame \"rules\". I have no problems with them rounding up people who have committed classic felonies and \"sending them West\"... so long as it's done accurately with due process. I don't think that's happening. But, these same aristocrats tend to mass murder on the regular, so giving them plane rides elsewhere is a big improvement over the usual shit. Gangs who claim territory manage their territory. News at 11. Let me know if you have a way to get them to renounce their territorial claims...\n\nI'm here for 100% voluntary association and everything that entails. Call it whatever. \"Anarcho-Capitalism\" is a bit of a poisoned misnomer at this point. \"Voluntaryism\" has baggage. \"Libertarian\" is a useless term nowadays. People sound like assholes when they say \"Classic Liberal\"... and that never had a fully settled meaning anyhow.\n\nIf something isn't voluntary, then it's aggression and shouldn't happen.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GravyMcBiscuits",
                                                                            "body": ">I have no clue and neither do you. Quit the sophistry.\n\nOh c'mon ... don't be naive.\n\n>They don't give a fuck about my principles\n\nCorrect. You are just an angry autist to them. You should keep that in mind while you carry their water.\n\n>But, these same aristocrats tend to mass murder on the regular, so giving them plane rides elsewhere is a big improvement over the usual shit.\n\nOh ha ... you really are a Trumper. Shocked.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "GravyMcBiscuits",
                                                                                            "body": "Calling the folks who discuss philosophy/principles a bunch of angry autists ... \"I'm not so tribal\".  Sure ...\n\n\"It's just a joke bro!\" .. sure Trumper. Mass government enforced deportation  = \"greater good\". Just pragmatism I'm sure.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "PacoBedejo",
                                                                                                    "body": "> Calling the folks who discuss philosophy/principles a bunch of angry autists\n\nNo. Those are actual AnCaps. You're an Autistic AnCap if you dickride the idealized vision, making the perfect the enemy of the good. You're an Angry Moron if you pick and choose which parts of the ideal you're going to dickride.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "myadsound",
                                                                                                            "body": ">You're an Angry Moron if you pick and choose which parts of the ideal you're going to dickride.\n\nHe says with zero self-awareness while lobbing \"no true scottsman\" at his ideological superiors",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "[removed]",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "myadsound",
                                                                                                                            "body": "I love how difficult this is for you",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "GravyMcBiscuits",
                                                                                                            "body": "You either love Trump or you're an angry autist moron. That is clearly your agenda here.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GunkSlinger",
                    "body": "Isn't this a purity test in itself?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "PacoBedejo",
                            "body": "See the bottom of the comment.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IC_1101_IC",
            "body": ">All I see on this Sub is Republican Neocon shit all day.\n\n>If there is any surviving Ancap here, it's time to move on and make a new Subreddit\n\nUh uh, let's make r/trueanarcho\\_capitalism, and when that fails because of who we deem as impure, we make r/true\\_true\\_Anarcho\\_Capitalism, and when that fails we-....\n\nYea I don't think that will work out.",
            "score": 9,
            "replies": [
                {
                    "author": "GingerCookies0",
                    "body": "Actually not\n\nYou just need some moderation.  \nMods here have allowed this subreddit to rot.\n\nWe just need to ban all socialist crap (something that hasn't been done here)",
                    "score": -2,
                    "replies": [
                        {
                            "author": "IC_1101_IC",
                            "body": "The unfortunate thing about that is that once we give power to censor to moderators, and if they appoint anyone which has any socialist leanings, we will end up like r/libertarian, which has moderation, and what has happened is that they went from socialism to MAGA, with some libertarian icing on top. Unless we have some regulator on their powers, I don't think it would turn out well.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jbbest666",
            "body": "100% better than libertarian sub",
            "score": 5,
            "replies": []
        },
        {
            "author": "EconGuy82",
            "body": "Very few. It’s almost all MAGA now.",
            "score": 4,
            "replies": []
        },
        {
            "author": "HumActuallyGuy",
            "body": "Yes, we do exist, you'll find us in the weakly larpers clensing post",
            "score": 3,
            "replies": []
        },
        {
            "author": "zm1216",
            "body": "Im an Ancap and welcome anyone who comes in good faith. This is how we expose our ideas to the rest of the world and get people familiar with them. We provide FAQs on the classic questions like \"the roads\" and \"the warlords\", we provide a list of good books to read, and countless other resources. If this was an Ancap only sub we wouldn't have that stuff. The sub description reads: \"a place to discuss free market capitalist anarchism and related topics\" it does not say \"a place strictly for anarcho-capitalists and nobody else\"",
            "score": 5,
            "replies": [
                {
                    "author": "GingerCookies0",
                    "body": "It also doesn't say:  \na place to discuss the latest Elon Musk deed",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "adelie42",
            "body": "1) yes.\n\n2) being solution oriented, there needs to be an appropriate ancap driven approach to moderation. It is all aboit freedom, but freedom of association means right to exclude from your space which contrasts trying to moderate what people do everywhere, like when you get banned from a sub you have never visited before which, despite against moderation rules sidewinder, happens far too often.\n\n3) there is a major troll problem. If moderators can tag people as neocons, trolls, terminal TDS suffers, minarchists, and maybe even Hoppeans versus Rothbardians, people could choose to block those they don't want to interact with.\n\nThis would maximize freedom in terms of freedom of association and freedom to not associate.\n\nRight now moderation is a complete condom-free fuckfest and all you can smell is the VD. If \"we\" can't find a better way to actually apply the principles advocated, how can it be expected anyone will adopt them in the reql world?",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "adelie42",
                            "body": "I agree, and that is standard moderation. That doesn't happen, hence the compromise. \n\nI agree with everything else (too?).",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Infamous_Bus1578",
            "body": "ima minarchist but agree, many neocons",
            "score": 3,
            "replies": []
        },
        {
            "author": "claytonkb",
            "body": "Ancap reporting for duty.\n\nNeocons are self-refuting. \"Never interrupt your enemy while he's making a mistake\", in this case, whenever a Neocon speaks, it's a mistake because they spew such obvious lies...",
            "score": 3,
            "replies": []
        },
        {
            "author": "Stunning-Project-621",
            "body": "Ancap here",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tandoori7",
            "body": " 90% of users here are closeted trump voters.",
            "score": 10,
            "replies": []
        },
        {
            "author": "BonesSawMcGraw",
            "body": "I’m just here for the lolz. I guess I’m an ancap but i don’t care too much about that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Undying4n42k1",
            "body": "What are you gonna do, ban statists? If you don't, they will just follow.",
            "score": 2,
            "replies": [
                {
                    "author": "GingerCookies0",
                    "body": "Yes. Thats the idea",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Undying4n42k1",
                            "body": "No thanks. I like this sub because we can talk about the subject without the risk of being banned. If you just want an echo chamber, then I'm afraid your new sub will be boring.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ancapworld",
            "body": "Ancap here.",
            "score": 2,
            "replies": []
        },
        {
            "author": "clarkstud",
            "body": "yes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "muffinman210",
            "body": "So a lot of people voluntarily express approval for Trump, and that's the reason to start a new subreddit? Regardless of whether or not you agree that Trump is the most anti-government government official right now, if you feel like people have to stop supporting him or anyone else for that matter, you're missing the point of the subreddit. The point is about free thinking and to ultimately have an open discussion, in case you forgot.",
            "score": 2,
            "replies": [
                {
                    "author": "GingerCookies0",
                    "body": "I dont give a shit about Trump  \nbut if you like politicians you are not an Anarchocapitalist by definition   \nIt is the same as \"voluntarily express approval\" for a rapist",
                    "score": 0,
                    "replies": [
                        {
                            "author": "muffinman210",
                            "body": "Who said anything about liking him?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TexFarmer",
            "body": "Am I being detained?",
            "score": 2,
            "replies": []
        },
        {
            "author": "AilsaN",
            "body": "I'll admit I am not but I'm definitely a voluntaryist and I respect the views of Anarcho-Capitalists. I'm here to learn.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mattmayhem1",
            "body": "Yes, but it's getting harder and harder to have conversations with all the conservative/right wing  trolls in here.",
            "score": 6,
            "replies": [
                {
                    "author": "afieldonearth",
                    "body": "No, it’s just that some of us have grown up enough to realize that the enemy is *never going to leave you alone.*\n\nWhat we’re witnessing is the bifurcation of AnCaps who actually want to move the needle and realize the difficulty and real action it takes to do that…\n\nAnd then the AnCaps who are just interested in winning theoretical purity debates on the internet while the world around them devolves into tyranny.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "AgainstSlavers",
                            "body": "I think the latter are commie infiltrators and not ancaps.  Gatekeeping is a classic divide and conquer technique. If an \"ancap\" can't celebrate government agents getting fired, I'm immediately suspicious of him.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AgainstSlavers",
                    "body": "You're a commie. Stop pretending to be ancap.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "mattmayhem1",
                            "body": "Spoken like a true conservative. Anyone that disagrees must be a commie. 🤦🏾‍♂️ Have a nice day dude lol.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "No, I'm an ancap. Everyone who reads your comments knows you're a commie.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "AgainstSlavers",
                                    "body": "Conservatives are soft commies, as they want entitlement programs, mass murder, mass theft. Heck you could be a conservative.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AgainstSlavers",
                            "body": "Commies are out in force!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bananabastard",
            "body": "I thought all the neocons were democrats now.\n\nAs for who is in this sub, it's reddit, go over to r/AskMen and half the answers given are from women.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "I am an anarcho capitalist but I'm anti immigration whilst there is still a welfare state so I probably come across as neocon. I simply don't care.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Inside-Homework6544",
            "body": "Come join us at r/mises the last true refuge for actual Anarcho Capitalists on this socdem infested site.",
            "score": 4,
            "replies": [
                {
                    "author": "kurtu5",
                    "body": "Do you spread the ideas of ancaps to non-ancaps on that forum?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sunstoned1",
            "body": "Head over to r/goldandblack dissenters get banned. Used to be a good sub. But it's become an echo chamber. I value the diversity of ideas and debate here.",
            "score": 4,
            "replies": [
                {
                    "author": "calmbill",
                    "body": "Thanks.  I've never really considered what ancap meant beyond assuming that it was centered on free trade and no government which I think are good goals to strive for.  This sub seems like a place with interesting topics that was ok for me to participate in.  It's good to know there's a place to see discussions between ancaps about ancap.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Sunstoned1",
                            "body": "And we welcome the range of respectful, curious truth seekers. Commies are welcome. Just be chill and debate in good faith. Neocons? Sure. Same thing.\n\nWe all arrived here from different places, the journey is what it's all about.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PacoBedejo",
                    "body": "Their mods didn't like me saying that taxation was theft in an argument. Not a great place.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "BrooklynRedLeg",
            "body": "\\>Republican Neocon\n\nNot sure I remember people spouting Wilsonian 'Make the World Safe for Democracy' BS in here. Examples?",
            "score": 2,
            "replies": []
        },
        {
            "author": "NeoGnesiolutheraner",
            "body": "The socialist plague is stronger than ever. Good that I have taken the right vaccine against socialism instead of the big-daddy-injection. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impressive-Door3726",
            "body": "Hoppean ancap panarchist here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheWastelandWizard",
            "body": "Why bother shouting into the wind when I can be on a hill watching the fire spread? Fuck it, shit's going live soon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Competitive_Case_537",
            "body": "🙋🏻‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "sumwhatkiller",
            "body": "r/goldandblack",
            "score": 1,
            "replies": []
        },
        {
            "author": "Past-Ad-1604",
            "body": "I is here",
            "score": 1,
            "replies": []
        },
        {
            "author": "kriegmonster",
            "body": "🫡",
            "score": 1,
            "replies": []
        },
        {
            "author": "Covidpandemicisfake",
            "body": "No we took advantage of the no laws thing and shot 'em all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "azraelpk",
            "body": "Not any more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "uncontractedrelation",
            "body": "I've just finished Mises; The Last Knight of Liberalism and you're all a bunch of socialists",
            "score": 1,
            "replies": []
        },
        {
            "author": "UniversalGundam",
            "body": "Sure, AnCaps That Are Secretly Establishment Bootlickers would be a great sub for you to start",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anen-o-me",
            "body": "Yes, this is a free speech sub however. Sounds like you might enjoy r/Goldandblack",
            "score": 1,
            "replies": []
        },
        {
            "author": "majoroutage",
            "body": "I'm slowly getting there.\n\nThe way I keep seeing people vote for more koolaid, the more I think letting the whole thing burn is the only way out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "prometheus_winced",
            "body": "Me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "silentsurfer86",
            "body": "If Anarcho capitalism means becoming a pirate or warlord, then yes!🙌",
            "score": 1,
            "replies": []
        },
        {
            "author": "casinocooler",
            "body": "There was a guy posting earlier saying he was the last true ancap. I am fine with uncompromising purists going elsewhere. Did you ever think we could get as many drastic cuts as we have been privileged to witness?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Krono5_8666V8",
            "body": "If ancap was a party, I'd vote for it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stubrocks",
            "body": "This\nIs\nREDDIT",
            "score": 1,
            "replies": []
        },
        {
            "author": "DEL-J",
            "body": "It’s not my place to act, but one good place for ancaps is this Discord, which may give a place to push for a new ancap subreddit, if something relevant doesn’t already exist.\n\nEdit: I just realized it’s not clever to post the link openly like this. If there is any interest, just message me and ask.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stayconscious4ever",
            "body": "Hi I'm a Rothbardian ancap.",
            "score": 1,
            "replies": []
        },
        {
            "author": "noeffingway1",
            "body": "Rothbardian here. In the current reality, I'm willing to negotiate in some ways with conservatives/libertarians/minarchists to deplete all forms of state power, but I have my limits even with them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "8ion-from-the84513",
            "body": "I feel ya",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leading_Air_3498",
            "body": "I am. Have a question for me?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Joshhhhhhyy",
            "body": "Idk but it reminded me of the time Hayek got so upset at the Mont Pelerin convention and said “You are all a bunch of socialists” when someone introduced the idea of adding a progressive income tax and other state interventions might be acceptable which in Hayek eyes betrayed free market and laissez faire , 😂according to Milton’s book",
            "score": 1,
            "replies": []
        },
        {
            "author": "nationcrafting",
            "body": "This was the reason that r/goldandblack was created many years ago now...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Seeking_Serenity567",
            "body": "Neocon shit? Arguing for fighting foreign wars that has nothing to do with our own people? Why would they want to hang out here?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nineinchnailzpsn",
            "body": "As an ancap I’ve never seen so much of what I wanted from an administration.  It’s a great time to be alive.  Enjoy the show.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yadius",
            "body": "All I see is shitlib libertarians all day. Shitlibtarians if you will.\n\nI'm aware that not that long ago r/libertarian was taken over by these shitlib libertarians, who's are basically leftists who's only libertarian values are legalized weed and gay sex. On every other issue they are statists.\n\nApparently r/libertarian got new management recently kicked them all out. \n\nMy fear is that they interpreted 'anarcho' as 'left', and have now flooded this sub with this with their toxic statism.\n\nAnarcho-capitalism believes in the goal of zero government. It's not a left wing version of libertarianism.",
            "score": 1,
            "replies": [
                {
                    "author": "majoroutage",
                    "body": "Weird. Most of what I see as far as shitty libertarians go are conservatives that are into cosplay.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "yadius",
                            "body": "They're around. But you have to admit that the current iteration of conservatism has undoubtedly moved toward the liberty end of the spectrum. Their traditional small government, low tax & pro free enterprise sentiments are increasingly supplemented by anti war, anti security state, pro legalization sentiments.\n\nWhereas the left have kept their pro big government, tax the rich sentiments, and are now increasingly also pro war, pro security state, and pro corporations in bed with their regulatory agencies.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "zippy9002",
            "body": "Yeah",
            "score": 1,
            "replies": []
        },
        {
            "author": "LKPOX",
            "body": "i have idea of creation but i dont know ill people join or no",
            "score": 1,
            "replies": [
                {
                    "author": "LKPOX",
                    "body": "r/LibertySquare btw",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AgainstSlavers",
            "body": "Yes, it's mostly ancaps in this sub.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pavickling",
            "body": "It seems you are looking for /r/goldandblack",
            "score": 1,
            "replies": [
                {
                    "author": "PacoBedejo",
                    "body": "...if you want to be banned for saying that taxation is theft.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "ConquestAce",
            "body": "I am anarchist, I think Anarcho-capitalism is a complete joke.",
            "score": 1,
            "replies": []
        },
        {
            "author": "McGobs",
            "body": "I'm idealistically an ancap and practically a republican. I'll do whatever it takes to move the ball closer to liberty. This is akin commies voting democrat and moving the ball closer to communism. I decided it's better to get results than to act principled and get antithetical results. I can tell you why you should be an ancap and also why voting your principles is or can be antithetical to your principles. I also believe the only way to get the left to give up their power structure is to show them the overwhelming force of the right's power structure. I would be happy to work with the left to take power away from the executive et al.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CauliflowerBig3133",
            "body": "I am a network of private cities moldbugian\n\nI support network of private cities rune explicitly for profit. \n\nLike feudalism but replacing dynasty with joint stock companies\n\nGovernment doesn't need to be eliminated. Just privatized and run for profit but have to compete. \n\nTax doesn't have to be 0. Just like phones and rents don't have to be 0. Fair tax rate is the market rate. Go to where tax is lowest. Also government should have strong incentive to attract economically productive tax payers. Productive don't mind paying small regressive tax and sponsor those who make them happy",
            "score": 0,
            "replies": []
        },
        {
            "author": "onearmedmonkey",
            "body": "I am a Republican.  But I am no neocon.  I'm a tea party conservative with libertarian ideals.",
            "score": 1,
            "replies": [
                {
                    "author": "TheRealStepBot",
                    "body": "Probably really enjoying the current trans crack down then I take it?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "onearmedmonkey",
                            "body": "I don't see it as a 'trans crack down'.  I just don't like getting verbally beaten over the head with the trans cudgel every day.  And, as a man, I wish feminism can go back to being pro-woman instead of anti-man (\"Down with the patriarchy!\" and all of that.)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TheRealStepBot",
                                    "body": "Where is the trans cudgel? Did someone put a new label on the supposed gay cudgel now? It’s literally the exact same game being played out again and everyone is hitting their marks perfectly just as they did for the colored people in white spaces marks before that.\n\nIf you can’t come out and strongly say “I dream of a world where immigrant gay married trans couples can protect their marijuana plants with automatic weapons” you’re just a republican who is embarrassed by your party’s full throated embrace of authoritarianism but is too scared of actually rejecting them because you don’t actually have any real principles but vote almost exclusively on a tribal basis.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "sanguinerebel",
                                            "body": "The way I see it, most of us just want to be left alone, not in media constantly trying to push more and more extreme rhetoric, and certainly not forcing people at gunpoint to say certain pronouns. That being said, the media does what the media does and sensationalizes everything they can, and the internet does what the internet does, and every 13yo with an axe to grind screams loudly at every perceived slight. I feel like the \"trans cudgel\" isn't a thing if you are touching enough grass.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PhilosopherShort6979",
            "body": "No, only gatekeepers like yourself.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Taintraker",
            "body": "In order to maintain purity of thought, introduce some rules…. Oh yeah, oops. No rulers, no rules.",
            "score": 0,
            "replies": [
                {
                    "author": "frud",
                    "body": "Anarchy means no government, rules are fine.  How those rules are enforced matters.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Taintraker",
                            "body": "Rules can only be enforced by rulers. Rulers are Gubmint. Unless you can get consensus? But we can’t even get consensus in an AnCap Subreddit.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "frud",
                                    "body": "When you were a kid did you ever play with other kids, unsupervised by adults?  Rules happen all the time, without government.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Taintraker",
                                            "body": "And I got into fights with those other children when a consensus couldn’t be reached. Or a bully would enlist help from followers and terrorize the playground because there is strength in numbers.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "frud",
                                                    "body": "I believe you.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Taintraker",
                                                            "body": "That’s 2! Now we just need every other redditor in here to get it too! Consensus is right around the corner!!",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GingerCookies0",
                    "body": "wow IQ of 20",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Taintraker",
                            "body": "Smarter than you if you think the sheep that over-represent humanity will ever embrace liberty. Being right doesn't matter when you are outnumbered by those too lazy or scared to not lick boots.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "daregister",
                                    "body": "Many of the sheep are far too gone because they grew up in government schools and brainwashed by government media. With the internet, the tides are shifting. It still will take generations, but don't think it to be impossible.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Taintraker",
                                            "body": "No reason to not try.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ribblan",
            "body": "I dont have everything in common with ancaps, but I gotta say, there is a lot of russian support here. Or as they say it themself \"they dont support putin, but his rethoric after there being nazis is ukraine is correct and zelinsky isnt really a president and 2014 was a coup, also im not making a stance on russia invasion, BUT ukraine did all these things\".",
            "score": -8,
            "replies": [
                {
                    "author": "fascinating123",
                    "body": "Fuck Putin, fuck Zelenskyy. This isn't hard.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Ribblan",
                            "body": "Yes, but i dont see how you ignore somebody who is bombing you though. You can fk em, ukraine cant though \\^\\^",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "kurtu5",
                                    "body": "Not my problem.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Ribblan",
                                            "body": "Thats great, but unless you are being bombed by putin in ukraine my comment wasnt really about you, enjoy your freedom wherever you live :)",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GunkSlinger",
                                    "body": "It's easy, really. It has nothing to do with me. Go be the King of Pain somewhere else.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Ribblan",
                                            "body": "Is it impossible for ancaps to live in ukraine, or is every non ukrainian who is currently not being bombed by putin going to comment that its not about them because they are not the person i was referring to?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "GunkSlinger",
                                                    "body": "None of that has anything to do with me. I'm not a collectivist like you. I have no tribal impulses regarding ideology. I see no reason to sacrifice anything to people I don't know. Not only is it not in my moral framework but it is cannibalistic at the societal level to think that I or anyone else have a duty to. This belief in duty to strangers is the bedrock principle of Fascism. People do not have the same moral value to me. Those I know and love I take care of out of my own self-interest. Strangers are on their own. You'll just have to live with that.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Ribblan",
                                                            "body": "Yes, i know it has nothing to do with you, i dont need a whole speach about how you dont live in ukraine and not being bombed by putin. Im sure people in china dont care either. thats great but you all dont need to comment just to say that (Y)",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "GunkSlinger",
                                                                    "body": "\\>i know it has nothing to do with you\n\nYou don't sounds like someone who does.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ribblan",
                                                                            "body": "i dont know it has nothing to do with you, when im telling you i know it has nothing to do with you... are you okey or is this some bad attempt at gas lighting?",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GunkSlinger",
                                                                                    "body": "Things are easy to say.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "kurtu5",
                                                    "body": "do north korea next!",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Ribblan",
                                                            "body": "Is north korea invading somebody or being bombed?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "kurtu5",
                                                                    "body": "Its being invaded\n by nonsequittor",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ribblan",
                                                                            "body": "how can a question be a nonsequitor",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "kurtu5",
                                                                                    "body": "https://www.google.com/search?q=how+can+a+question+be+a+nonsequitor&sourceid=chrome&ie=UTF-8",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Ribblan",
                                                                                            "body": "Yes, and i asked i question, i didnt make an argument did i. \"A **non sequitur argument** is distinguished by reasoning or evidence that is completely irrelevant to the claim being made\".",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "kurtu5",
                                                                                                    "body": "Lots of places have issues.  North Korea included.  Not our problem.  If you bring up a question about how hard it would be to be an ancap in some other country, then its a nonsequitor.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Ribblan",
                                                                                                            "body": "Who are \"you people\"? am i in an american only sub? im sure ive spoken to ancaps from other countries as well...",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "finetune137",
                    "body": "You triggered the hive mind",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ribblan",
                            "body": "Seems like it, your are part of a cult if you cant separate the action from the person. Because if you support trump in domestic policy, doesnt mean you need to support trump when he backs a dictator invading a neighbor country.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "finetune137",
                                    "body": "It's too early to claim anything like this",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ribblan",
                                            "body": "Have you seen how many people who are on putins side on this sub, i didnt realize ancap aligned with dictatorships.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "finetune137",
                                                    "body": "Ancaps are only 10 percent of this sub population. At best.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Classh0le",
            "body": "lol so true. this sub has been so coopted",
            "score": -4,
            "replies": []
        },
        {
            "author": "ParsleyNo6270",
            "body": "There are definitely plenty of neocons, but not everyone saying anything positive whatsoever about the Trump administration is a neocon. Cutting entire swaths of the federal government is pretty great, even if the man doing it is a narcissist with no principles.",
            "score": 0,
            "replies": []
        },
        {
            "author": "frozen_pipe77",
            "body": "Labels.  Labels sure are important",
            "score": -2,
            "replies": []
        },
        {
            "author": "Synthetic2802",
            "body": "Are there any non conservatives left out there that don't think that defending yourself and your way of life is toxic masculinity? \nI find it fascinating how some anarchist refuse to understand that their ideology is utopian in nature and don't have the foresight to plan for what happens in the real world when humans are actually different and some of them think morality is murdering your sister if she gets raped or something...",
            "score": -7,
            "replies": [
                {
                    "author": "kurtu5",
                    "body": ">  their ideology is utopian in nature \n\nWe are not the ones pretending you can hand monopoly power to one group and they will protect you and that you control them.  That is uptopian.  We realize people suck, so there is no trust like you, only verify.  And if not, vote with our money.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Synthetic2802",
                            "body": "It's utopian because none of the amazing principles discussed here can ever exist in reality with humans.\nTake all the ancaps in the world, multiply their money by 10 and it's still nothing compared to one leftist like George Soros so you ain't voting with your wallet. \n\nI agree with all the comments philosophically, hell I might even agree with you that even a majority of conservatives are Utopian at best and naive trusting idiots at worst but at least we have seen benefits from some of the policies they have implemented. How have ancap policies ever influenced the real world?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "kurtu5",
                                    "body": "> It's utopian because none of the amazing principles discussed here can ever exist in reality\n\n99.99% of my interactions are 100% voluntary.  So, do deny reality and keep supporting your rulers.  They love you for that.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "kurtu5",
                                    "body": ">How have ancap policies ever influenced the real world?\n\n\n\nOxymoron.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shizukana_otoko",
                    "body": "There is nothing utopian about ancap philosophy. We are fully aware that there will be people that make horrible decisions, and that there will always be freeloaders and grifters. We understand that there will always be people that are poor. We know fully well that there will be people that try to take advantage of others, and those that will choose violence. Never, not one time, have I ever seen an ancap claim none of these things will exist in an ancap society. \n\nPerhaps you would be better off if you actually educated yourself on the subject before you begin to talk about it.",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}