{
    "title": "The Dawn of a New Age",
    "author": "LudwigNeverMises",
    "subreddit": "Anarcho_Capitalism",
    "rank": 167,
    "score": 747,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 95,
    "url": "https://i.redd.it/r2rgtvpk4ske1.jpeg",
    "id": "1ivwt8q",
    "selftext": "",
    "comments": [
        {
            "author": "kagerou_werewolf",
            "body": "AFUERA!!!",
            "score": 75,
            "replies": [
                {
                    "author": "RandomGuy92x",
                    "body": "One has to be extremely naive to assume that Trump is a libertarian. I mean the guy literally wants to impose the death penalty for drug dealers and has praised communist China for their harsh anti-drug laws.\n\nAnd he's talking about setting up a sovereign wealth fund and has proposed that he would use that to buy TikTok, which would make TikTok the first ever social media platform owned by the US government.\n\nBut keep believing that Trump is a libertarian.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Fit_Group604",
                            "body": "If he was fiercely anti drugs, he wouldn't have pardoned dread pirate Roberts.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RandomGuy92x",
                                    "body": "That had a lot less to do with drugs and was much more about making the crypto community happy. Trump has definitely said many times that he wants to impose the death penalty for drug dealers.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Doublespeo",
            "body": "trump is no Ancap..",
            "score": 56,
            "replies": [
                {
                    "author": "dangered",
                    "body": "He isn’t, he treats the country like a business and makes sure it profits but isn’t making it the ancapistan dream Ron Paul would have made it back when I voted for him. Still beats every dnc run candidate since Bill Clinton though. ",
                    "score": 33,
                    "replies": [
                        {
                            "author": "Tomycj",
                            "body": "Why would it be good to treat something that you don't own as if it were a business that you own? What does it even mean to treat the country as a business?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dangered",
                                    "body": "Balancing a budget, maintaining beneficial trade relationships and axing parasitic relationships. Growing GDP in the same way companies grow revenue to keep growing both economically and in headcount (population). \n\nBill Clinton at least balanced the budget. \n\nWhy would it be good to do the alternative like past politicians who have taken no ownership of the country and used taxpayer dollars like a fratboy does his dad’s corporate credit card?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Tomycj",
                                            "body": "Okay, with that elaboration it makes more sense, thanks.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "alcoholismisgreat",
                            "body": "I mean Clinton signed in NAFTA and pushed all the manufacturing out of the country... which crippled the middle class and we saw what it did during covid. There are still year long back orderes on parts I need for work. Not to mention the crime bill that doubled or tripled the incarceration rate (I'd have to look it up) to pad the pockets of private prisons. All politicians are criminals imo",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dangered",
                                    "body": "I don’t mean to say he was good but he at least balanced the budget. I can’t say he did it responsibly or was great with policy but the bar has been so low since then, I’ll take a balanced budget alone as a consequential win.  \n\nOverall he was awful and created and/or contributed to some of the biggest problems we face today. As a person, he may have been even worse and used his presidency to open the door to those actions. Credit where credit is due though.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "alcoholismisgreat",
                                            "body": "True that gotta give credit where credit is due for sure. Seperate the artist from the art and all that. Just seems In the last 20 years everyone developed political brain worms and turned into unreasonable single issue votors. Good to see someone is still thinking ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kinglink",
                    "body": "Trump is no Libertarian either. Like I would be fine if someone is on the path of shrinking the government.  He's not for that.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "LudwigNeverMises",
                            "body": "He’s literally doing it. You don’t have to be an Ancap to shrink the government. \n\nHe’s probably not even thinking about philosophical end points, but it’s good to be guided by people who agree with us like Milei.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ThatGuyFromSpyKids3D",
                                    "body": "The recent budget proposal from Congress does not back up your claim. Cutting all these jobs and reducing all this spending doesn't help if they simply redirect the spending elsewhere. The new house budget allows for 2.8 trillion in deficit spending, in 2024 it was budgeted for 1.9 trillion. \n\nTrump raised deficit spending considerably in his first term even when we don't include COVID. Biden upped the ante. \n\nAll these cuts mean nothing if the current budget proposals go through.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Doublespeo",
                            "body": ">Trump is no Libertarian either. Like I would be fine if someone is on the path of shrinking the government.  He’s not for that.\n\nI agree",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Medical-Formal1335",
                    "body": "Trump is the best of the worst for libertarians",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "SirMeep2",
            "body": "Oh look, 2 guys who are determined to dissolve their respective governments and cut the unnecessary parts.",
            "score": 87,
            "replies": [
                {
                    "author": "MattAU05",
                    "body": "I see one guy who wants to do that, and one guy who wants to consolidate power and hand it to the Christian nationalists.",
                    "score": -24,
                    "replies": [
                        {
                            "author": "Kinglink",
                            "body": "Don't know why you're being downvoted because Trump absolutely DOES NOT want to dissolve the government.  Even if we believe everything he says, he only is removing parts of it he disagrees with.... But even so he created the \"White House Faith Office\"  Sounds like someone dismantling the entire government to anyone?\n\nThis sub really needs to stop upvoting this crap, because he's absolutely not a true libertarian, and anyone who gave him a life long membership to the party should have been fired out of a cannon.",
                            "score": 53,
                            "replies": [
                                {
                                    "author": "MattAU05",
                                    "body": "People get triggered by “Christian nationalist” I think. But he is literally allowing those folks to run his government and determine his agenda.\n\nI think it’s because that term is used by the far left a lot. Just because they’re wrong about a lot doesn’t mean they’re wrong about that.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "_0bese",
                            "body": "Bring back christian values.. voluntarily.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "baronvonlitschi",
                                    "body": "Seriously. What's the point of our God given free will otherwise?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Numinae",
                            "body": "Yeah and I see a delusion, brainwashed poster from Reddit (not a shocker). ",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "MattAU05",
                                    "body": "It’s glaringly obvious that Trump has become the poster boy for Christian nationalists, and he’s more than happy to play the part. Just look at his recent moves: appointing Russell Vought, a staunch advocate for infusing Christian ideology into government, to head the Office of Management and Budget. Vought’s agenda? Pushing policies that align with Christian nationalist views, from restricting abortion to promoting “biblically based” family structures. And let’s not forget Trump’s promise to establish a task force aimed at combating “anti-Christian bias” in federal agencies, a move that panders directly to his Christian nationalist base.  ￼ ￼\n\nBut it’s not just about policy; it’s about the company he keeps. Trump’s inner circle is filled with figures who champion Christian nationalism, and his administration’s initiatives reflect a concerted effort to embed these ideologies into the fabric of American governance. From reshaping federal agencies to reflect Christian values to actively courting the support of white evangelical Protestants, who overwhelmingly back him, Trump’s actions speak louder than words. It’s a calculated alliance, one that sees both Trump and Christian nationalists using each other to further their own agendas, all while undermining the pluralistic foundations of our democracy.  ￼\n\nBut sure, close your eyes if you want.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Numinae",
                                            "body": "Uggghh God this shit gets _so fucking exhausting...._ We get it. You don't like Trump. Your argument is about as substantial as me calling you a commie-fascist puppy fucker. I mean if Trump acted like Jerry Falwell or something you might have a point but he's hardly a religious ideologue. _You_ on the other hand are _certainly_ an ideologue....\n\n\n\n\nYou know, when you call everybody and everything you disagree with \"Nazi Christo Fascism\" (or whatever other ridiculous hyperbolic claim) NOBODY takes you seriously. You're like a political Chicken Little / Boy Who Cried Wolf. One of these days, there'll be an actual Fascist and litteraly _nobody_ will take you seriously. They'll just assume it's more squawking at the sky..the The irony is you fuckers tend to act _far more_ like actual Fascists than the modern right....",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "MattAU05",
                                                    "body": "Oh ok.\n\nSo it’s just going to be one of those things where you just ignore the facts I offered or pretend they don’t mean anything?  Frankly Vought alone is proof to support what I said. But it’s all good. I’m just a fascist, right? Lol.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Numinae",
                                                            "body": "Dude, we live in a Christian majority culture. You're shocked that out of his appointments there's Christians? Btw your \"gotcha\" is that he wants to eliminate _anti-christian_ policies, NOT encourage _pro-christian_ policies other than encouraging nuclear family units (which statistically result in better outcomes and aren't the province of any religious ideology)? So he's against persecution of the primary religious affiliation in the country and most of the armed forces... OMG, sounds like persecution to me!!! /s Would you be bitching and moaning about going against anti-muslim, anti-jewish (well, you guys have become pretty antisemetic so that one might not surpirse me), anti-hindu or anti-atheist policies?\n\n\nYou know who else is highly represented in Trump's circle, including him? They were _Democrats._ What does _that_ tell you? If everyone else seems like an an extremist to you except you and your buddies, maybe _you're_ the extremist? Has that ever occurred to you? You might have shifted the Overton window so hard litteraly everyone else looks \"far-right\" to you but that doesn't mean _you're right...._",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "MattAU05",
                                                                    "body": "Again, you’re just ignoring what is in front of your face. And you’ll continue doing that despite all objective evidence. You have eyes and can read the Project 2025 book published online. You’re also welcome to look at the policy goals for the Center for Renewing America, which Vought was the president of.\n\nOr just go to the 50 second mark of this video where Vought himself says you have to “rehabilitate Christian nationalism”:\n\nhttps://youtu.be/PY_chqyaRHo?si=QBPaMdB4_OZ3fVL-\n\nHe is explicitly a Christian nationalist. That’s how he describes himself and his policy goals. If any politicians describe themselves as Islamic nationalist, Hindu nationalist, or Jewish nationalist, I will be equally as concerned. Theocracy is not how America needs to operate.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Numinae",
                                                                            "body": "Project 2025 is from the Heritage Foundation NOT the Trump administration. This is like saying the WEF policy goals are the Democrats'.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MattAU05",
                                                                                    "body": "Are we really pretending the Trump admin isn’t executing Project 2025? He’s literally following the playbook, which was largely produced by Vought, who is the Direct of the OMB. The big connection here is Vought. You see this right?\n\nOdd you have no comment on the video I linked.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Numinae",
                                                                                            "body": "So it's like this? \n\n\nhttps://images.app.goo.gl/u6rqGfSrMRnR9zgB7",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Numinae",
                                                                                            "body": "I don't find your video compelling when it comes to Trump's motivations, only Vought. Oh, and look, you say the same thing here:\n\n\nhttps://www.reddit.com/r/Anarcho_Capitalism/comments/1ivwt8q/comment/medrx80/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "MattAU05",
                                                                                                    "body": "Do you think it’s some kind of gotcha that I made the same point in reply to different comments?\n\nWhat don’t you find compelling about the video? You implied it was crazy to think Trump was giving power to Christian Nationalist, and I offered a self-described Christian Nationalist who is literally Trump’s Director of the OMB. You can just admit you were wrong. Or move the goalposts if you want. But just resting on “uh, but I don’t find it compelling,” is pretty weak.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Numinae",
                                                                                                            "body": "I find it rather funny you litteraly said Trump _wasn't_ a \"Christian Nationalist\" there and then argue he _is_ one here....",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "Numinae",
                                                                                                            "body": "\"I don’t think Trump is a Christian (or even a theist), let alone a Christian nationalist\"\n\n\nYour words. And I'd agree. He's the one in charge and anyone under him serves at his pleasure. ",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "MattAU05",
                                                                                                                    "body": "Yes, and I said he is handing the country over to Christian nationalists. You are still dodging the actual issue and just using a straw man. But that’s what you’ll continue doing, so I won’t waste anymore time.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kyle_Rittenhouse_69",
                            "body": "Are the Christian nationalists in the room with us now, Matt?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "MattAU05",
                                    "body": "And yeah, literally Russell Vought, the former President of the Center for Renewing America which said that advancing Christian nationalism was a goal of a second Trump Presidency. And he was instrumental in Project 2025 which, in part, seeks to advance Christianity through the presidency and through federal policy goals. You can’t possibly argue in good faith that isn’t “Christian nationalism.”\n\nAnd now he is the current Director of the OMB in the Trump admin. He isn’t the only one of course, but he is likely the most prominent with the most power. \n\nIt’s absolutely ridiculous to act like I’m making stuff up when it’s this out in the open. They aren’t even hiding it. They just won’t use the precise term.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "RandomGuy92x",
                                    "body": "Well, yeah, they're in the White House now. For example Trump created a new official White House Faith Office that will be led by a radical Christian extremist who has said \"to say no to President Trump is to say no to God\" and who believes Trump opponents are part of \"demonic confederacies\". Paula White, some crazy televangelist.  \n\nThat person will be paid by tax payer dollars. And you can bet that she will use that White House \"Faith Office\" to give away many more tax payer dollars to Christian organizations that are aligned with her crazy extremist version of Christianity. \n\nThat's just one example. But yeah, Trump is absolutely handing power and influence to Christian nationalists.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "DMBFFF",
                                    "body": "probably.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "MattAU05",
                                    "body": "Maybe that means you’re being unduly influenced by a single term just because some people you don’t like have used it. Vought as the Director of OMB alone supports what I’m saying. I don’t think Trump is a Christian (or even a theist), let alone a Christian nationalist. But he is absolutely handing policy making over to a lot of them, Vought (a significant part of Project 2025) being the most prominent. Trump doesn’t give a shit, of course, but these are the people supporting him and the people he is using. It’s not a conspiracy theory or something outlandish. It’s commenting actively happening, and frankly I’m not sure there’s a cogent argument to the contrary.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "A_WILD_SLUT_APPEARS",
                                    "body": "Damn you know you’re in deep when you are so nervous with your comment that you have to use weird, off-putting ASCII text to say a normally inoffensive word.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "HanThrowawaySolo",
                                            "body": "I'm about to scare this guy to death....\n\n**JEWS!**",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "IWantToChristmas",
            "body": "Insert trump saying he's the law",
            "score": 13,
            "replies": []
        },
        {
            "author": "deathnutz",
            "body": "I’ve seen Trump do more libertarian things than not. …it’s also a lot more transparent now than ever. Another plus.  I always said that if someone would do at least half of the things libertarians want to do, we’d be in good shape… I think Trump is doing that again; more so. He’s talking about abolishing income tax. You better get behind that if you’re posting in this sub.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Lt_Leroy",
            "body": "Two people who used their platform to enrich themselves at the expense of their followers? I love Milei, and I will forgive him for endorcing the crypto, but it's still a terrible look. Trump gets no benefit of the doubt, and I fully believe he knew he was just taking advantage of his followers.",
            "score": 36,
            "replies": [
                {
                    "author": "VisceralRage556",
                    "body": "Yah I wont forgive them both for that rug-pull they deserve to get blowback for it. But at this point in time they are our only chance in bring in the reins",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Numinae",
                            "body": "Wait, they rugpulled? ",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Status_Rip_7906",
                                    "body": "You familiar with coffeezilla. He’s like one of the biggest crypto and scam reporter on YouTube. He covered both the Milei and trump situations separately. I agree with Lt. Leroy. Trump knows way too much about the financial world to get any sympathy. As for Milei I can’t speak to his level of culpability.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Numinae",
                                            "body": "Hold on a sec though (and I'll admit I'm a bit ignorant about memecoins creation) but usually they're created with a large group that's supposed to hold coins and release them slowly (the actual backers / creators). The rugpull is if they break their agreement to hold them and pump and dump. I'm under the impression that happened with the Hawk Tua girl and other meme coins. While Trump is far from financially ignorant, I really doubt anyone outside of the crypto world really understands this shit. If Trump pump and dumped and sold his coins, then yeah that could be a rugpull but I'm not aware of that being the case... Did he hold his coins or sell them, or promise to hold the coins and sold them instead?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Status_Rip_7906",
                                                    "body": "I’d have to rewatch the video. Coffee does a good job breaking it down and me trying to explain it doesn’t do it justice. I’ll link the video in a little bit",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "prodezzargenta",
                            "body": ">I wont forgive them both for that rug-pull they deserve to get blowback for it.\n\nTo be fair, in the case of Argentina, Peronism had already rug-pulled the peso argentino to a 99,93% of what it was valued 20 years ago 😂",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "KeepGoing81321",
                            "body": "They are making crypto (bitcoin) look bad. It could set us back",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LudwigNeverMises",
                                    "body": "I don’t think the meme coin outweigh their pro crypto stances. \n\nThere have been thousand of failed alts, shit coins and meme coins already. \n\nTrump wanting to make the US the Bitcoin capital of the world is a big change from the government wanting to stop it.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "PacoBedejo",
                                    "body": "Bitcoin looks bad either way. It's too close to a CBDC.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dudeabiding420",
                    "body": "What are some alternatives to crypto as far as getting the government out of money?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PacoBedejo",
                            "body": "Gold, silver, and barter are rock solid. Anonymised crypto like Monero (XMR) is a good in-between.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "divinecomedian3",
                    "body": "Did Milei actually benefit from that?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "onearmedmonkey",
            "body": "America's best ally",
            "score": 3,
            "replies": []
        },
        {
            "author": "DMBFFF",
            "body": "We'll see how the age goes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Numinae",
            "body": "He should've brought an honorary Chainsaw statue for Trump too. ",
            "score": 4,
            "replies": []
        },
        {
            "author": "GunkSlinger",
            "body": "If you're a small government conservative who actually means it, then these are the guys for you. Let's see what Trump does with spending and if he understands what causes inflation.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Educational-Year3146",
            "body": "Seeing Trump do aggressively libertarian shit has been really weird. \n\nHe didn’t strike me as anything like Milei, but here we are.\n\nIt’s still leaving me thinking “what’s the catch?”",
            "score": 3,
            "replies": [
                {
                    "author": "PacoBedejo",
                    "body": "He isn't like Milei. But, let's not boo him while he's doing the right things, regardless his reason.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "hblok",
                    "body": "We already know and see what's the catch.\n\nHeavy handed authoritarian approach to everything he wants to get done or anything he doesn't like. Banning this and that, instead of leaving it up to individual choice. Censoring media, agencies, libraries.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Komprimus",
                    "body": ">aggressively libertarian shit\n\nLike what?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "jmorais00",
            "body": "I see 2 statists. One of them is not like the others though",
            "score": 3,
            "replies": []
        },
        {
            "author": "bananosecond",
            "body": "Trump is doing a few loud things about cutting government waste right now that y'all are excited amount but probably won't amount to much or be nearly as significant as all the ways he loves the presidency to be more authoritarian.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Revolutionary_Wall53",
            "body": "Yes, more money to Israel",
            "score": 1,
            "replies": []
        },
        {
            "author": "hikaru_ai",
            "body": "Boot licking politicians lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "3clipse09",
            "body": "[ Removed by Reddit ]",
            "score": 1,
            "replies": []
        },
        {
            "author": "william41017",
            "body": "An ancap rugger and a nationalist rugger. How great!\n\n\nImagine the shit coin they'll make!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Augusto2012",
            "body": "I see 2 ruggers",
            "score": -2,
            "replies": []
        },
        {
            "author": "lrc1710",
            "body": "2 shitcoin scammers together, nice.",
            "score": -1,
            "replies": []
        },
        {
            "author": "LordXenu12",
            "body": "New crypto scam incoming",
            "score": 0,
            "replies": []
        },
        {
            "author": "Zealousideal-Skin655",
            "body": "Two parasites.",
            "score": -11,
            "replies": []
        },
        {
            "author": "xx_deleted_x",
            "body": "the ONLY crossover everyone wanted/needed",
            "score": 0,
            "replies": []
        },
        {
            "author": "dustbro21",
            "body": "Two shitcoin rugpullers who fleeced their supporters?",
            "score": 0,
            "replies": []
        },
        {
            "author": "elcalrissian",
            "body": "Oh look, 2 statists who use their government position to be immune to their own attempts to pump and dump schemes to fleece their followers out of money.",
            "score": -39,
            "replies": [
                {
                    "author": "buffalo_pete",
                    "body": "I bet you voted for Chase Oliver.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "DMBFFF",
                            "body": "A vote for Oliver is probably no more wasted than Trump, especially in a non-swing state.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cowdawg10",
                    "body": "Calling Milei a statist is incredibly ignorant lmao. I won't disagree on Trump though",
                    "score": 22,
                    "replies": [
                        {
                            "author": "DMBFFF",
                            "body": "Milei is a statist, albeit perhaps a less malignant one.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "elcalrissian",
                            "body": "I implied that Milei, as President, has special immunity towards financial 'crimes' or unethical milking of people's money through schemes.\n\nThats the Statism that he's embracing.",
                            "score": -4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "xx_deleted_x",
            "body": "😍😍😍😍😍😍😍😍😍",
            "score": 0,
            "replies": []
        },
        {
            "author": "TurnThatTVOFF",
            "body": "Why the fuck would we want to partner with some insignificant tiny ass country with nothing to trade?",
            "score": -19,
            "replies": [
                {
                    "author": "ihiwszkpseb",
                    "body": "5th largest population in the western hemisphere (US, Brazil, Mexico, Columbia, Argentina).",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Undying4n42k1",
                    "body": "Values are more important than money and power.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "PacoBedejo",
                    "body": "It's not often you run across people around here who are geographically ignorant.\n\nI feel like this comment should be collected and studied...",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "kurtu5",
                    "body": "> tiny",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "DMBFFF",
                    "body": "The \"tiny ass\" country is bigger than Alaska and Texas combined, and has a GDP exceeding $600 billion.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Xeper616",
                    "body": "Lithium",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}