{
    "title": "Leftist circle jerk is so close to realizing they are the baddies",
    "author": "ganonred",
    "subreddit": "Anarcho_Capitalism",
    "rank": 165,
    "score": 96,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 50,
    "url": "https://www.reddit.com/gallery/1iw9o6g",
    "id": "1iw9o6g",
    "selftext": "",
    "comments": [
        {
            "author": "ganonred",
            "body": "Leftist and rightist authoritarian policies are what's led to low and inconsistent quality and pervasively high costs with lefties especially negatively influencing education, healthcare, and crime over the recent decades.",
            "score": 25,
            "replies": [
                {
                    "author": "mt_2",
                    "body": "Where does Singapore fit into your world view? Considering it is an \\*actual\\* authoritarian regime that has some of the best healthcare and education standards in the world. I'm not saying this is a good system, or even close to ideal, but isn't this proof that authoritarian policies aren't correlated with \"low and inconsistent quality\" of said services.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "EconGuy82",
                            "body": "Because the U.S. does a worse job of blending systems. Take healthcare. We’ve got a mix of market-based and government systems, and we end up with the worst of both worlds: high consumer prices and point of service combined with the inefficiency of regulation and partial socialization of the market.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "dave3218",
                                    "body": "Yeup.\n\nThe issue with the US Healthcare system is actually too many regulations and protection of current companies.\n\nCronyism I think is the term, a huge chunk of Corporate America wouldn’t survive without the government legislating competition out and setting enormous barriers for entry.\n\nAlso that damned book shared between insurance companies and hospitals that the hospitals use to set up their prices on, like the fact that ibuprofen pills can go as high as $20 for a single pill is absurd",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "EconGuy82",
                                            "body": "A colleague of mine shared a podcast a few years back that was talking about drug pricing in the U.S.  A guy who works in the industry discussed how these prices are basically fabrications that get set to allow insurance companies to brag about how much they’ve “saved” their customers and to allow hospitals to recoup costs for “uncompensated” care.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Singapore runs on a free-market economy, and since it’s a tiny country with limited resources, it has no choice but to stay sharp and competitive. That keeps the government on its toes, always looking for the best way forward. The same goes for any country leaders only really get moving when they feel the heat. But here’s the problem with statism: leaders who don’t feel the pressure get lazy. In resource-rich countries, they don’t see the warning signs, so corruption creeps in, nothing gets done, and the whole system starts circling the drain-classic socialism downfall. Singapore doesn’t have that luxury. If its leaders screw up, the consequences hit fast and hard, so they have to stay on top of their game.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "LibertyFive3000",
                                    "body": "Underrated point.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "codifier",
                            "body": "They're an outlier, the vast majority of authoritarian regimes have/had abysmal services",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "mt_2",
                                    "body": "But every country that outranks America for healthcare and education outcomes has a more regulated healthcare and education system? It's quite easy to argue these are more \"authoritarian\" systems than the US.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Mountain_Employee_11",
                                            "body": "just because something is easy to argue, it doesn’t mean the argument is good, or inclusive of all factors. in fact it’s usually the opposite",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "mt_2",
                                                    "body": "So a more regulated, more government controlled education system is less authoritarian? Make it make sense.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Mountain_Employee_11",
                                                            "body": "you are using a poor criteria to judge these things, probably intentionally",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "mt_2",
                                                                    "body": "Tell me more! The healthcare systems are more regulated, more subsidised, and more government-controlled in the majority of countries that rank above the US in healthcare outcomes. Tell me how these systems are less authoritarian.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Mountain_Employee_11",
                                                                            "body": "they… just aren’t more subsidized and controlled lmao.\n\nthd US medical system is one of the most tightly controlled in the world with some of the largest regulatory burdens.\n\nthe idea of the US free market healthcare system is a myth told to dumbasses",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "ryrythe3rd",
                                                                            "body": "The point is if you see a study ranking healthcare systems around the world, don’t trust it. Anyone making a study like that has a bias. So when Sweden is 4th and the US is 59th in healthcare quality, that means nothing.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mt_2",
                                                                                    "body": "These studies have transparent techniques so you can look at the data yourself and come to your own rankings, if you are schizo enough to think the data itself is wrong and there is an illuminati-like world order lying to you at all moments about healthcare outcomes in foreign countries then there is no point in having a discussion anyway.\n\nEducation outcomes are even harder to argue against as at that point you have to believe that global test results in areas like mathematics are simply faked with 0 suspicion from the people actually taking these tests.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Fluffy-Feeling4828",
                                                                                            "body": "Or you just question the use and standards of the tests. In *your* world view, a bad testing system doesn't exist...",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "mt_2",
                                                                                                    "body": "As I said, you can go out of your way to find transparent studies so you can judge methods yourself, after the 4th or 5th one where the only argument against it is \"well it must just be fake!\" I don't like how schizophrenic I feel.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Fluffy-Feeling4828",
                                                                                                            "body": "Burden of proof, you get to be the one to find the \"objective math test\".",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LibertyFive3000",
                            "body": "Both can be true. The authoritarian policies here have led to our bad outcome. Meanwhile Singapore remains a fascinating case study on a different set of authoritarian policies blended into a pretty unique hybrid system and applied in a very population dense and tiny city-state.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No-One9890",
                    "body": "Your correct. That's why all the countries that outback us are known for their harsh austerity...\nLol op, who reads posts to u? Since I rly doubt u manage to do it urself...",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SavageFractalGarden",
            "body": "I love it when leftists accidentally make a right wing point",
            "score": 5,
            "replies": []
        },
        {
            "author": "goldenbug",
            "body": "You can certainly question it, but it’s taboo to answer it.\n\nThe European descended population of the US is about 60%, and these “statistics\" encompass roughly 35-40% \"third world\" descended populations.  Yet they constantly compare some ridiculous continuously homogeneous country like Finland or Japan to the US.\n\nCompare the \"statistics\" of European descended Americans with Europeans and… uh oh, I just did a racism.\n\nNot to mention The US is a great experiment of freedom, liberty, and republican rule or law, which is why it’s so prosperous, but the things these comparative statistics control for are often moral or require personal self restraint and sacrifice.",
            "score": 5,
            "replies": []
        },
        {
            "author": "mt_2",
            "body": "Hard to understand your point here when the vast majority of countries that outrank America in these areas have much more tax-subsidised healthcare and education systems? Not saying that's a good thing but what exactly are you trying to say haha",
            "score": 9,
            "replies": [
                {
                    "author": "Foot_Positive",
                    "body": "The US is the worlds police and can keep shipping lanes open and cover a large percentage of NATO costs, which allows some of these countries to spend less on defense. They can in turn work less and use their tax revenue for social programs.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "mt_2",
                            "body": "The US has shown in recent years that it is happy to use its status as the worlds reserve currency to print and spend essentially infinite money. Money is not the issue here, whether you agree with US monetary policy or not. Plenty of these countries have a similar, if not higher defence spend as a percentage of GDP yet still have more social programs.\n\nAlso how is that relevant to \"leftists being so close to realising they are the baddies\"? Would it be so bad to spend less on defence because America is doing it all for you? I don't think so, and I imagine the citizens of these countries are plenty happy their money is going towards bettering their own people instead of superficial defence spending.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Foot_Positive",
                                    "body": "I don't disagree, think the populist side of both parties have begun to realize that the money might be better spent at home than to support the rest of the world. The US president appointed RFK and Tulsi, two lifelong democrats and presidential candidates, into the party to MAHA and reduce our involvement on foreign wars.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Silence_1999",
            "body": "That sub was so unhinged I couldn’t handle it in my feed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "Leftists will blame transphobia for this",
            "score": 2,
            "replies": []
        },
        {
            "author": "trisanachandler",
            "body": "I'm not an ancap, but I like the far left and far right because they both at least see the problem.  The people in the middle don't even see the problems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bubbly-Ad-1427",
            "body": "they’ll either find out what that says about leftism or forever be stuck wanting totalitarianism but not going to a place that is totalitarian",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zealousideal-Skin655",
            "body": "Maybe but they can’t hold a candle to Trump worshippers.",
            "score": -4,
            "replies": [
                {
                    "author": "livinglife_part2",
                    "body": "Trump worshippers aren't even on the same level as the zealots on the far left. They are single issue fanatics, whether it be their sexual identity or BLM or those that demanded unvaccinated people be locked into concentration camps, and that's just skimming the surface, barely.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Zealousideal-Skin655",
                            "body": "That’s complete hogwash. Trump worshippers literally stormed the capitol over a lie. Don’t be moronic. Trump could tell his sycophants to jump over a cliff and they would without hesitation.  They have zero autonomy.  \n\nVaccines actually work (e.g. small pox) Slavery and Jim Crow are real events. Trump has been a con man he’s entire life. Advocating for vaccines or black people has some foundation in reality. Swallowing Donald’s BS doesn’t.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "livinglife_part2",
                                    "body": "Slavery was a democratic thing, not a republican thing. Unless you are swallowing that silly nonsense that the left spits and let us not forget the \"mostly peaceful\" protests around America that caused billions of dollars in damages in cities by Antifa in their George Floyd protests that were somehow excempt from lock downs...\n\nJanuary sixth was stupid, but anyone with half a brain knew it was used by the left, such as Nancy Pelosi who declined extra security along with the capital police who just causally opened doors and let protesters into the buildings.\n\nThey needed that juice to squeeze the lemon for four years.\n\nI think you are another person in the wrong sub and should wander back to r/politics as well. Drink that kool-aid and keep believing your main stream news lies.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Zealousideal-Skin655",
                                            "body": "Are you dumb? Which party supports the confederacy now? Which party wants to honor confederate soldiers now? Which party reveres Robert E Lee now? \n\nUnless you’re swallowing the right propaganda that capitol rioters were just “patriots”. \n\nDid you know that [white supremacist] of the boogaloo bois (https://www.mprnews.org/story/2021/09/30/texas-man-24-admits-shooting-at-minneapolis-police-station-during-riot) pretended to be a part of the BLM and caused some of the [violence](https://www.nbcnews.com/news/amp/ncna1244562). The putting quotation marks around “peaceful protests” doesn’t change reality.  Bigots and right wing media were desperate to deny the impetus for the protesting. So they just dismissed them as violent. \n\nJanuary 6th wasn’t just “stupid”. That sounds like a MAGA zombie talk. Stupid is putting oj in your coffee instead of milk. Putting excrement on the walls of the capitol is barbarism.  \n\nI think your another person in the wrong sub you should wonder over to r/trumpisgod or r/Conservative\n\nTrump is the [chosen one](https://www.economist.com/united-states/2024/10/22/the-americans-who-think-trump-is-anointed-by-god).",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "livinglife_part2",
                                                    "body": "Seems you are what you say I am, but you do you.\n\nThe BLM, Antifa protests were the most damaging in American history, causing around 2 billion dollars in damages in cities to businesses run by normal Americans.\n\nJan 6th had one person shot in the back of the head by a fed and people waving flags and some other slightly dubious stuff going on but definitely not on the level you leftists imagine it being. \n\nBut now you cry that there is a dictator in office and the world is ending yet you probably haven't seen the sun since the election because you locked they/them selfs in your parents basement waiting for the world to end.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Zealousideal-Skin655",
                                                            "body": "\nDo you know how much economic damage has been done to African Americans from 1929 - 1969? Approximately **$8.5 trillion** (in 2020 dollars). This has done more to hurt America than any BLM riot.  \n\nMaybe you hate trans people. Perhaps you think we should take over Gaza. Perhaps you agree with Trump and you think Ukraine started the war. Maybe you’re wealthy and will enjoy trumps tax cuts. There may be things you genuinely like and admire about Trump, but you don’t have to worship him. You don’t have to minimize January 6th. You don’t have to perform fellatio for the guy.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "livinglife_part2",
                                                                    "body": "Sounds like you condone violence, which is something that ancaps don't agree with, which again means you are probably here just to create outrage to feed your own ego.\n\nI'm guessing the basement comment was a pretty accurate guess on my part.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Zealousideal-Skin655",
                                                                            "body": "Why would say that? \n\nSome \"ANCAPS\" praise Kyle Rittenhouse. \n\nStop calling yourself AnCAP. You're just another MAGA supporter.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "livinglife_part2",
                                                                                    "body": "I think you are just projecting your own leftist outrage, but you do you. \n\nJust another big government simp on a sub that doesn't cater to their emotions.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Zealousideal-Skin655",
                                                                                            "body": "Do you have anything original to say? I'm surprised you didn't call me a \"commie\" or a \"Marxist\"? \n\n  \nYou're just another poor bootlicker.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "livinglife_part2",
                                                                                                    "body": "That would be my comment to you. You have devolved into random name calling because you have no logical arguments.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Zealousideal-Skin655",
                                                                                                            "body": "You engage in ad hominem attacks and now whine about name-calling. Typical.\n\nTrump isn't a god. One can be critical of him from the right or the left.  \n\nI don't expect much from you, but at least understand that Trump isn't your daddy. You don't have to defend him all the time.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "livinglife_part2",
                                                                                                                    "body": "Never once mentioned Trump being my daddy, but it might be something you're into. \n\nIt's a sickness, and the only cure for you is more cowbell.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Zealousideal-Skin655",
                                                                                                                            "body": "You’re [girl](https://youtu.be/7j9-HGLm4dM?si=q82BemExvnUevqj0). \n\nIt is a [sickness](https://youtube.com/shorts/K0_l1vJ4CSU?si=j1TIzy36Cjb1KoDB).",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Solaire_of_Sunlight",
                                                                                    "body": "Rittenhouse acted in self-defense",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Zealousideal-Skin655",
                                                                                            "body": "It was pre-meditated. \n\nStop lying to yourself.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "codifier",
                                    "body": ">That’s complete hogwash\n\nProceeds to spout hogwash.  \n\nBold strategy, Cotton.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Zealousideal-Skin655",
                                            "body": "Another simpleton. \n\n1. Vaccines worked on small pox\n2. Slavery in America is real\n3. Jim Crow is real. \n4. Trump is a con man.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}