{
    "title": "I think Russia should be allowed to control the disputed region if and only if...",
    "author": "CauliflowerBig3133",
    "subreddit": "Anarcho_Capitalism",
    "rank": 185,
    "score": 0,
    "upvote_ratio": 0.17,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iww0hk/i_think_russia_should_be_allowed_to_control_the/",
    "id": "1iww0hk",
    "selftext": "I think Russia should be allowed to control disputed territories if they invest. \n\nThey should compete with other investors though. Americans, Chinese, Europeans, Arabs. Let people decide who the investors should be democratically once things calm down. \n\nThere are plenty of countries that want extra territories. China, USA, Israel, etc. \n\nSimilar solutions can be used in all other conflict regions. \n\nPalestine, Africa, Sudan, nigeria. \n\nHold a truce. \n\nDivide conflict areas into 20 regions. \n\nFind investors that \"colonize\" The area in exchange for shares with people living there. \n\nThe area are then run for profit. \n\nPeace and prosperity for everyone. \n\n1000 Prosperas. \n\nOh ya. People can shop around and move to nearby regions they like. Want capitalism go to capitalist regions. Want Shariah go to Shariah regions. Want wokism? Go to woke region. All those areas are nearby living side by side peacefully. Close but not too close for problems in one area spill to another. \n\nLet money talk first. When it fails we can go back to guns but why not give money a fair chance?\n\nIs this stable? Well the small regions won't attack the big ones. There goes excuses against big regions attacking the small regions. \n\nAlso if a region is controlled by UAE or USA, for example. Attack toward that region will demolish good relationship with UAE and USA. Not profitable. \n\nIf UAE govern a part of Gaza would Israel attack that region and losing their good relationship with UAE, one of the view Arab countries Israel befriend with? No. Will UAE launch October 7th? You kidding me. That's not their reputation.\n\nhttps://disruptive-horizons.com/p/is-dubai-better-than-prospera?utm_campaign=post&utm_medium=web",
    "comments": [
        {
            "author": "ExcitementBetter5485",
            "body": "Do you think strangers should kick down your front door, shoot you in the face and be allowed to live in your child's bedroom as long as they invest some money towards rent and utilities afterwards?",
            "score": 18,
            "replies": [
                {
                    "author": "I_Never_Use_Slash_S",
                    "body": "That’s the free market buddy. If you don’t like it go join a hippie commune",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CapeTownMassive",
            "body": "Oh, so a bootlicker?!\n\nYeh, I’m no statist. \n\nBut if anyone is gunna govern me- it’s my own people.",
            "score": 5,
            "replies": []
        },
        {
            "author": "theodorelogan0735",
            "body": "Allowed...by whom?",
            "score": 4,
            "replies": []
        },
        {
            "author": "MengerianMango",
            "body": ">If UAE govern a part of Gaza would Israel attack\n\nI mean, I don't think UAE's opinion will make any difference. This is a bad example precisely because Israel could give negative fucks what UAE thinks of them. The only country aligned with them is the US. They know that, and they're fine with it.\n\nSame basically applies with Russia. Everyone already hates them. They hated Russia almost as much before all this started, so reputation loss was basically 0 deterrent.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HesperianDragon",
            "body": "How about instead all the disputed regions become an ungoverned neutral zone where no government is allowed to act in.\n\nThe people living there get to stay but they don't have to pay taxes, swear fealty, or obey any government.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HODL_monk",
            "body": "Unfortunately what we want doesn't matter. Whomever has boots on the ground will hold that territory, and only a military industrial complex could afford the equipment and manpower to change the ownership, and no one here will be doing any of that !\n\nOf course that territory should be free to choose how to live, as should all the other land on Earth. If only there was a way to make this happen !",
            "score": 1,
            "replies": []
        },
        {
            "author": "lone_jackyl",
            "body": "I think it's funny when a post like this shows who the commies in this sub are. They all come running to defend Ukraine in mass",
            "score": -1,
            "replies": [
                {
                    "author": "DMBFFF",
                    "body": "Agreed: if you're pro-Ukraine, you're a commie.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "lone_jackyl",
                            "body": "And if your pro Russia you're a statist. To me in a real Anarchist Society if you have something I want then I take it and if you can't defend it then it's mine. It's just the way of the road bub",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DMBFFF",
                                    "body": "Agreed: might is right.\n\nBuying and selling is inferior to conquest.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}