{
    "title": "Help on research project regarding ancap",
    "author": "No-Alternative7997",
    "subreddit": "Anarcho_Capitalism",
    "rank": 157,
    "score": 0,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1ixghz2/help_on_research_project_regarding_ancap/",
    "id": "1ixghz2",
    "selftext": "I'm doing a research project on the following question: \"Is anarcho-capitalism a viable political system/form of society?\" I need at least 5 good sources to draw research/data from. Any help and directing would be greatly appreciated. Thank you",
    "comments": [
        {
            "author": "Leading_Air_3498",
            "body": "I can't help you with sources, because there's no objective source you could possibly use to answer what amounts to a subjective question.\n\nWhat does the question for example even mean by, \"viable political system?\" What does it mean by, \"viable form of society?\"\n\nWhat is \"viable\" is an opinion here.\n\nAnarcho-capitalism is a \"viable\" form of either of these things because anarcho-capitalism is fundamentally just the default state of human interaction and existence.\n\nImagine you just exist but commit to no actions. You're currently in a state of anarcho-capitalism. Now imagine you  engage in actions, but your actions have no impact on your fellow man. This is still a state of anarcho-capitalism. Now imagine you engage in actions of which impact your fellow man, but you do so consensually, where both parties in question are agreeing to an exchange. This is still anarcho-capitalism.\n\nThe only time you fall outside of anarcho-capitalism is when, for example, your neighbor threatened to use violence against you unless you gave them some of your food, if they violently attacked you to try to cause you harm or to kill you, if they attempted to steal your property, to enslave you, etc.\n\nBasically if people never initiate actions of which violate the will of others then the default made from that is anarcho-capitalism.",
            "score": 7,
            "replies": [
                {
                    "author": "SuperMarioMiner",
                    "body": ">...because anarcho-capitalism is fundamentally just the default state of human interaction and existence.\n\n\\^ 100% this\n\nhmmm....  \nactually if I think about it... maybe like 90%  \nthe other 10% is violence, cohesion and war",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Leading_Air_3498",
                            "body": "But then that 10% isn't anarcho-capitalism.\n\nAnarchy is just without monarchy. Anarchy is to monarchy as atheism is to theism. Theism is a belief in the divine, atheism is the non-belief. Monarchy is with rulers, anarchy is without rulers.\n\nCapitalism is just a state in which trade between parties is consensual. Honestly, anarcho-capitalism is a redundant set of grouped words, because anarchy or capitalism are both more or less the same thing. You can't have non-free trade without rulers, and you're not going to get free trade when you have rulers, because all rulers (even those beneath democratic systems) are going to place rules and regulations on that trade of which are not there to protect the innocent.\n\nNote that all laws are unjust laws if they are laws pertaining to victimless crimes. All positive rights for example create a victim, whereas no negative rights do.\n\nThe irony in much political discourse is that the majority of people all want the same things, but they've been so brainwashed by statism throughout their lives that they can't see that the communist wants the same things the fascist wants, and both could have it in a state of anarcho-capitalism.\n\nNobody wants what they themselves will for to be restricted or taken away. So allowing your fellow man to live their lives in peace so that you may live yours in peace, and only interacting by way of consent is the only true path to success in these political discourses, but very few people have a mindset that can grasp that.\n\nSocialists for example who want universal healthcare don't seem to put together that they can get it and all they have to do is group together consensually, pool their resources together, create medical systems that do this, and voilà, universal healthcare at no expense of anyone who doesn't want to partake in their endeavor.\n\nSo instead, they want a monopoly on the use of force to threaten people with violence unless they give them resources that they can then use (poorly) to create a system of universal healthcare that will most assuredly always result in people not getting the care they need, or like seems to be the state of Canada's healthcare system right now, trying to convince people to get euthanized because the ill are too heavy a burden on a system that without the proper incentives, is not an efficient system.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "upchuk13",
            "body": "Search Bryan Caplan, Michael Huemer, David Friedman, Murray Rothbard, and Peter Leeson. Then narrow it down by your desire for length, detail, etc. ",
            "score": 4,
            "replies": [
                {
                    "author": "No-Alternative7997",
                    "body": "Thanks",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MonadTran",
            "body": "Anarcho-capitalism is a viable system of ethics. You can quote the Bible (\"thou shalt not steal, thou shalt not murder\"), you can quote The Ethics of Liberty by Rothbard. You can quote your own experience on how you've managed to live your own life so far without murdering, assaulting, or robbing a single person.\n\n\nIf you insist on the consequentialist approach (\"but would the society as a whole work if nobody murders or steals\") you can read The Machinery of Freedom by David Friedman.",
            "score": 5,
            "replies": [
                {
                    "author": "No-Alternative7997",
                    "body": "Thank you",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "puukuur",
            "body": "\"Anarchy unbound\" by Peter T. Leeson. Analyzes historical and contemporary examples of anarchy and shows it works even under the most unfavorable conditions.",
            "score": 3,
            "replies": []
        },
        {
            "author": "URNONEXISTANTPP2",
            "body": "Use the logical arguments found in various ancap books. Unfortunately I am not very well read on the literature itself, but do consider reading some books like \"Road to Serfdom\" by  Friedrich von Hayek",
            "score": 2,
            "replies": [
                {
                    "author": "No-Alternative7997",
                    "body": "Thank you 🙏🙏",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SuperMarioMiner",
                            "body": "Hayek is quite statist even for normal Libertarians. Far away from Ancaps.  \nI mean... \"The Road to Serfdom\" is a very good book.  \nAnd his \"The Use of Knowledge in Society\" is amazing.  \nBut he's not an anarchist... not even a little bit.\n\nBooks recommended by MonadTran bellow are way better for your topic.  \nAnd in regards to \"practicality and realism\" of actually implementing ancapistan I would say Hoppe is the best of them all.  \nEven though I prefer Rothbard on pure economics topics....   \nHoppe takes an extra step in actually implementing it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kimura-Sensei",
            "body": "https://mises.org/power-market/republic-cospaia-anarchist-renaissance-city\n\nhttps://m.youtube.com/watch?v=phjtrHm_uzs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Derpballz",
            "body": "r/HowAnarchyWorks r/HobbesianMyth r/AlCaponeIsStatist r/AncapisProWorker r/AnarchyIsAncap where r/HowAnarchyWorks is the most crucial one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "frud",
            "body": "Why are there so many reddit accounts of the form word-word####?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Swimming-School-8678",
            "body": "A very good source would be using common sense and realising it is completely impossible utter absurdity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Middle-Yak4367",
            "body": "One resource I find really useful is David Friedman's explanation of what are rights. You can find the first publication of the idea in his website, the title of the paper is A Positive Account of Property Rights, if I am not mistaken. However, I would suggest getting the latest version (A Positive Account of Rights), in the third edition of Machinery of Freedom, because he refined his understanding of the idea over the years. \n\nFor viability in the sense of how to get from where we are now to a world in which there are ancap regions I would suggest checking out seasteading and expevolu.",
            "score": 1,
            "replies": []
        }
    ]
}