{
    "title": "What I’m so confused my god",
    "author": "3clipse09",
    "subreddit": "Anarcho_Capitalism",
    "rank": 159,
    "score": 0,
    "upvote_ratio": 0.45,
    "num_comments (reported by reddit)": 26,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1ixl05t/what_im_so_confused_my_god/",
    "id": "1ixl05t",
    "selftext": "I genuinely do not know what political alignment I am. I’m not a communist, and I’m definitely not a conservative, I’m very left, and I feel like the government should give more power to the people while also keeping order uhf high hhhfhfhhf this is so confusing ",
    "comments": [
        {
            "author": "jakedasnake1",
            "body": "If your definition of “power” in “power to the people” stops at “only power that I agree with”, then you are probably just a confused liberal.",
            "score": 22,
            "replies": []
        },
        {
            "author": "vvfella",
            "body": "It’s more than okay to figure out your beliefs before sticking yourself with a label. Keep reading differing viewpoints, decide what you hate the least, then see if any mode of thought matches that. You don’t need to force an ideology and can let it be confusing!",
            "score": 11,
            "replies": [
                {
                    "author": "3clipse09",
                    "body": "Thank you sobbing",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kimura-Sensei",
            "body": "How many people does it take (2? 4? 800…) to be able to do things as a group that an individual would be wrong (murder, theft etc.) in doing on their own?",
            "score": 9,
            "replies": [
                {
                    "author": "BobertGnarley",
                    "body": "Can one transfer privileges that they do not possess?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Kimura-Sensei",
                            "body": "Exactly",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hour-Statistician361",
            "body": "ordinary liberatarian",
            "score": 8,
            "replies": [
                {
                    "author": "3clipse09",
                    "body": "That’s what I’m thinking but I’m gonna look more into it",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Metrolinkvania",
            "body": "Probably a useless egalitarian.",
            "score": 8,
            "replies": [
                {
                    "author": "3clipse09",
                    "body": "I understand the beliefs, but an egalitarian government wouldn’t work, because not everyone is the same",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Ya_Boi_Konzon",
                            "body": "Fax",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "smore-phine",
                    "body": "I think it pays to have a healthy sense of empathy and see the potential in all humans. But it is easy to see that some people are just not equal in the realm of production, or even thought. While all humans (who display humanity) deserve dignity to some degree, we cannot ignore the simple fact that those unwilling to put in effort and work for themselves, their community, the world… are not equal to those who do. They are lesser.\n\nI say this with no hostility to the “leeches” of society. My hope is each and every one of them can receive the help that they as humans deserve. The real question is, how do we go about addressing these various leeches?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chr1st_1s_K1ng",
            "body": "I means you’re thinking for yourself so you’re already smarter than most people.",
            "score": 4,
            "replies": []
        },
        {
            "author": "CakeOnSight",
            "body": "What your feeling is normal friend. Its real weird out there lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "GunkSlinger",
            "body": "\\>the government should give more power to the people\n\n\"return\" is a much more accurate term.\n\nRead some Lysander Spooner, maybe?\n\n[http://praxeology.net/LS-NT-6.htm#no.6](http://praxeology.net/LS-NT-6.htm#no.6)",
            "score": 2,
            "replies": []
        },
        {
            "author": "loonygecko",
            "body": "So you are a person who thinks for themself and doesn't just pick a side and follow every tenet of it?  That's a good thing.  Be proud of yourself.  You don't have to fit in fully with any one group.  It's quite possible that the best solution might be a hybrid of different camps and it's also important to be able and willing to recognize when we turn out wrong on something and adjust opinions accordingly.   We also should not feel the need to go along with something just because others adjacent to us promote it.  Sigma!",
            "score": 3,
            "replies": []
        },
        {
            "author": "YazaoN7",
            "body": "Do some thinking (I know, shocker) and start ranking things in a scale of values. What do you value the most? Is it the collective good? Is it individual freedom? You can go down the list and eventually once you're done you'll figure out where you lie in the political spectrum. It's how I slowly went from a SocDem to here (realizing stuff like the individual is the ultimate minority, etc. First some Milton Freedman \"blue-pilled\" libertarian stuff and then now more recently getting into Hoppe).",
            "score": 1,
            "replies": []
        },
        {
            "author": "exec_liberty",
            "body": "Some kind of socialist",
            "score": 1,
            "replies": []
        },
        {
            "author": "libertyfo",
            "body": "I'm assuming you are not \"left\" as in more taxes and government \"services\", but more liberal like murdering women and children in endless wars is wrong, and government crack down on individuals doing a non-violent victim-less activity because some bozo in a suit called it a \"crime\", right?\n\n\nIf so, you are likely a classical liberal/progressive kind of, any way I haven't personally read this book but the author explains where he was and where he ended up and through the book explaines how \n\nhttps://libertarianinstitute.org/books/domestic-imperialism-nine-reasons-i-left-progressivism/",
            "score": 1,
            "replies": []
        },
        {
            "author": "sonickid101",
            "body": "Do you think the government should hurt people and take their stuff?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HairyTough4489",
            "body": "Can you really give power to the people while enforcing left-wing policy?",
            "score": 1,
            "replies": []
        },
        {
            "author": "rumblemcskurmish",
            "body": "Libertarians plot things not on a left-right spectrum, but on an authoritarian-personal liberty spectrum.\n\nThere's different levels of personal autonomy but it doesn't take far along that spectrum before you realize you're not a fit for the other two parties who are authoritarian, they just have different policies",
            "score": 1,
            "replies": []
        },
        {
            "author": "EconGuy82",
            "body": "Politics is fundamentally about the management of trade offs. You say you want “power to the people” (which I’m reading as freedom) and the government “keeping order.” Well, most of us would like freedom *and* order, efficiency, etc. Those are both good things, but there’s an inherent tension there. You can’t ensure order without infringing upon freedom; allowing freedom entails the possibility of chaos. \n\nSo you have to trade off freedom for order and vice versa. It’s where you fall on those sorts of trade offs that helps you to determine your ideology. So, for example, if you were to take the political compass test—which does oversimplify things but is still really useful—the vertical axis is going to deal with exactly that trade off, based on how you respond to different scenarios. \n\nOnce you know more about how you feel about these trade offs you can consider *why* and you can start to think about the underlying consistency of your positions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "austrolib",
            "body": "You should look into Objectivism. Read “Objectvism: The Philosophy of Ayn Rand” by Leonard Peikoff or watch some of his many lecture series on YouTube.\n\nIt advocates for free markets and personal liberties. Politically it’s similar to libertarianism or minarchism (completely free markets, governments only purpose is military, police, and a legal system to the protect property rights, enforce contracts, etc) but it’s all tied together and rooted in a comprehensive and wholistic philosophical system including metaphysics, epistemology, ethics, and politics. Despite its political similarities to libertarianism, Ayn Rand famously hated libertarians because without the philosophical basis, they end up mired in subjectivism, collectivism, and other anti-individualistic mentalities.\n\nHere’s an AI summary since I’m too lazy to type any more:\nObjectivism, the philosophy developed by Ayn Rand, is built on a specific metaphysical and epistemological foundation:\n\nMetaphysics (Reality)\n\nObjectivism is grounded in an objective reality, meaning:\n\t1.\tExistence Exists – Reality is independent of consciousness; things exist regardless of what anyone thinks, wishes, or believes.\n\t2.\tIdentity (A is A) – Everything that exists has a specific identity; things are what they are, governed by the Law of Identity.\n\t3.\tCausality – Entities act according to their nature, meaning cause and effect are inherent in reality.\n\nIn short, Objectivism rejects supernaturalism, subjectivism, and relativism, affirming that reality is absolute and knowable.\n\nEpistemology (Knowledge)\n\nObjectivism holds that reason is man’s only means of acquiring knowledge:\n\t1.\tReason and Logic – Knowledge is derived from sensory perception and conceptual abstraction, guided by logic.\n\t2.\tConcept Formation – Concepts are formed through a process of measurement omission, integrating particulars into universals.\n\t3.\tObjectivity – Truth is discovered through rational inquiry, not emotions, faith, or authority.\n\nRand opposed skepticism and mysticism, arguing that knowledge is possible and that certainty can be achieved through proper reasoning.\n\nObjectivism’s politics is a direct extension of its metaphysics and epistemology:\n\t1.\tMetaphysics → Individual Rights\n\t•\tSince reality is objective and independent of consciousness, no one has the right to force others to accept falsehoods or obey arbitrary authority.\n\t•\tHuman nature requires freedom to think, act, and pursue values; thus, individual rights—especially property rights—are the foundation of a proper political system.\n\t2.\tEpistemology → Capitalism\n\t•\tSince reason is man’s only means of survival, a political system must leave individuals free to think and act rationally.\n\t•\tA government’s role is to protect individual rights (life, liberty, property) from force and fraud, allowing people to interact voluntarily.\n\t•\tThis leads to laissez-faire capitalism, the only system that fully respects individual freedom and reason.\n\nIn short, Objectivism defends a limited government that protects rights but does not interfere in the economy or personal decisions. It rejects collectivism, statism, and all forms of coercion.",
            "score": 1,
            "replies": []
        }
    ]
}