{
    "title": "Saving that sweet money, and Elon admits it was just a ruse and won't be used",
    "author": "bluefootedpig",
    "subreddit": "Anarcho_Capitalism",
    "rank": 125,
    "score": 239,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 162,
    "url": "https://i.redd.it/ldn9g6tx4ble1.png",
    "id": "1ixy9im",
    "selftext": "",
    "comments": [
        {
            "author": "Mike__O",
            "body": "This is assuming that every minute spent at work is otherwise productive.  Anyone who has held any job ever in any sector knows that's not true.  Anyone who has held any government job knows that this is quadruple not true.\n\nIt's amazing how hard people are fighting to try and preserve a system that everyone, even the people defending it, know is grossly wasteful and largely unnecessary.",
            "score": 122,
            "replies": [
                {
                    "author": "denzien",
                    "body": "5, maybe 6 hours can be counted on for real productive work in any given day. Supposedly. I definitely have days where I'm productive for 3 or 11. Just depending on the circumstances and how many meetings there are or if my kid is being bullied at school.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Sweezy_McSqueezy",
                    "body": ">people defending it, know is grossly wasteful\n\nOne man's waste is another man's easy paycheck.\n\nOf course they're fighting it. What's so shocking to me (in a good way) is that they're losing.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "loonygecko",
                            "body": "One thing I have very much noticed in recent years is a much greater acceptance in the general population of poor work ethics.  I can post something that once was basic in society for instance that one should try to do a good job at work, and now in most places on reddit, that kind of statement would be downvoted to hell.   Instead there is glorification of dodging work, milking the system, getting away with the minimum, scamming more money for themselves, etc.  And as much as I understand that there are some work environments where the boss deserves all that, there are many others where the boss, not to mention coworkers,  do not deserve all that, yet people's sentiment does not seem to acknowledge the latter.  \n\nSo that's a long way to say, maybe part of it is attitudes have changed and govt is the haven for many of the more lazy workers.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Sweezy_McSqueezy",
                                    "body": ">once was basic in society\n\n>and now in most places on reddit\n\nI think this is the main issue here. I don't think society has changed that much, it's just that your measuring stick has changed. Reddit is a shithole filled with losers, and they justify themselves to each other. I think if you go outside and talk to normal people, you'll get normal responses. That's why redditors are so angry and fearful: they only find validation on this website, and the real world doesn't conform to it.\n\nThe kids are alright.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HKatzOnline",
                    "body": "Reddit scrolling time.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HeyLookitMe",
                    "body": "Working in-office is the least efficient way to work for the vast majority of desk jobs",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LagerHead",
            "body": "What's worse is they assume - wrongly - that this is an additional expense. They're already being paid to work there. They're getting paid that money whether or not this report is generated.",
            "score": 256,
            "replies": [
                {
                    "author": "Foot_Positive",
                    "body": "Actually is likely a net savings. That 10 mins spend replying to the email is 10 mins where they aren't subjecting the public to their onerous regulations or enforcement. \n\nIts likely much more than 10mins. They probably had a meeting(s) and bitched amongst each other for at least an hour before considering how to reply.",
                    "score": 129,
                    "replies": [
                        {
                            "author": "interstellar440",
                            "body": "If it eliminates 100,000 people who were just collecting checks doing nothing. It will save $5 billion dollars/year assuming the average salary is $50,000/year",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "DillonDockery",
                                    "body": "It eliminated zero people.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "bobroberts1954",
                                    "body": "What do you think happens to wages if you dump 100,000 workers into the private labor pool?",
                                    "score": -13,
                                    "replies": [
                                        {
                                            "author": "Mountain_Employee_11",
                                            "body": "they stagnate, but at a slower rate than the corresponding decrease of inflationary pressure created by those workers currently being worthless or net negative producers.\n\nso, less money, but money buys more goods, so likely still an increase in real wages.",
                                            "score": 27,
                                            "replies": [
                                                {
                                                    "author": "DirtieHarry",
                                                    "body": "Excellent response",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "bobroberts1954",
                                                    "body": "Maybe. Or maybe the owner class just gets their work done cheeper and pockets the money. Ofc that will trickle down like it always has.\n/s",
                                                    "score": -18,
                                                    "replies": [
                                                        {
                                                            "author": "Mountain_Employee_11",
                                                            "body": "quit pretending to understand economics if this is the depth of your imagination",
                                                            "score": 22,
                                                            "replies": [
                                                                {
                                                                    "author": "bobroberts1954",
                                                                    "body": "Such a sound argument, I am devastated.",
                                                                    "score": -15,
                                                                    "replies": [
                                                                        {
                                                                            "author": "UpbeatSpaceHop",
                                                                            "body": "Straight to logical fallacy every time. LMAO.",
                                                                            "score": 13,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "bobroberts1954",
                                                                                    "body": "And which is that?",
                                                                                    "score": -4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "loonygecko",
                                                            "body": "Historically and realistically, it will be some of both, an improved economy helps everyone.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "loonygecko",
                                            "body": "That's what happened in Argentina.  You need to improve the commercial environment a bit to help private industry have more jobs available.  With removal of some govt, some of that will probably naturally happen.  PLus the job market is not as tight now as it has been in the past so there is wiggle room.  Officially there is currently 8 million jobs unfilled so that's nothing compared to 100,000.  Also don't fire them all in the same millisecond, stagger the firings a bit. Unemployment benefit costs will probably go up for a while too but that's still less expensive than paying all those people and departments long term.  \n\nHOpefully the new jobs will yield more productivity vs their old job of just wasting tax payer money.  Lower taxes mean average people buy more which stimulates the economy.  Plus the US govt will soon become insolvent due to 36 trillion debt so we really have no choice now, the govt HAS TO be cut by 40% even if there are some negative side effects from it, because the alternative is much worse.  The pain will be far greater if we don't do it.  So even if every last other thing I mentioned goes wrong, we'd still have to do the cuts.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "LoneHelldiver",
                                            "body": "They learn to weld?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "bobroberts1954",
                                                    "body": "I didn't mean to them. To the labor pool.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "barbershreddeth",
                            "body": "the people who 'subject the public' to regulations are largely compliance officers at private businesses. Ironically, trying to deregulate by simply firing people and gutting agencies will create more compliance officers, more regulations at the state-level to fill the gap, and just general chaos & confusion.",
                            "score": -28,
                            "replies": [
                                {
                                    "author": "DeyCallMeWade",
                                    "body": "Even if that were true, regulation at a state level would be much more manageable than federal.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Forgotten-X-",
                                            "body": "How did you come to that conclusion.? Imagine the nightmare of trying to franchise to states with different regulations or national corporations having to change process depending on what state they are currently based in.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Ozarkafterdark",
                                                    "body": "That already exists.",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "International_Lie485",
                                                    "body": "Don't need to imagine, I do international business.\n\nIt's fine.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "Forgotten-X-",
                                                            "body": "I’m sure you’re the ceo of an international business with multiple locations in different states that have completely differing regulations on whatever product it is you build and sell…",
                                                            "score": -10,
                                                            "replies": [
                                                                {
                                                                    "author": "International_Lie485",
                                                                    "body": "I'm not the CEO, but I do international business.\n\nWhat happens if I send a factory in Mexico USD 300,000 and they don't deliver the goods?\n\nWhat if the factory sends me the goods, but I don't send them the USD 300,000?\n\nDo you know we make these trades without any protection, my government can't do shit in Mexico.",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "loonygecko",
                                                                            "body": "Yep, always a bit nerve racking sending money outside the USA for something, especially if it's a lot of money.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "loonygecko",
                                                                    "body": "I operate my own company and I can tell you that clusterfxck already exists in my industry with tons of vague laws that vary by state, the exact meaning of which is sometimes not even clear, that are also regularly changing.  For instance the constant drama of if alligator skin products are or are not legal to sell in California lately, it keeps changing and each state has their own laws.  Then to keep things spicy, selling venues have their own constantly changing regulations on stuff too, much of it due to pressure by the govt.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "loonygecko",
                                                    "body": "Actually trump is trying to standardize more things across states, like car emission standards, that will help businesses, not hurt them, but the govt already has plenty of workers for that job. I don't think you realize how much of govt is just people warming chairs.  Anyone that worked in govt will tell you a lot of their coworkers do very little work.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "barbershreddeth",
                                            "body": "yeah man, it's totally cheaper to comply with up to 50 different and conflicting regulatory regimes rather than one federal one.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Ozarkafterdark",
                                                    "body": "It's cheaper to comply with 50 different regulatory regimes than 50 different regulatory regimes plus the Federal Goverment.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "barbershreddeth",
                                                            "body": "you clearly don't understand how this works man lol. There are plenty of things that even California, New York, Maine, etc., look to the federal government to regulate. If the federal government ceases regulating them, you get a patchwork of different regulations across states, with the more liberal states instituting stricter regimes.\n\nalso, the lack of coordination means the regulations often work in total different ways, meaning you need lawyers in all these states to figure this shit out. I would know - that's my job! \n\nanother obvious reason industry prefers a clear federal regulation is that federal law can preempt state law. So your point about \"50 state regimes + a federal regime\" is straight up nonsense. This in the Constitution you slobbering rube.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "Ozarkafterdark",
                                                                    "body": "I work in environmental law. I know exactly what I'm talking about.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "loonygecko",
                                                                            "body": "LMAO, sounds like a nightmare regulation situation, those laws are constantly changing especially lately, constant court cases, constant confusion on interpretation, constant govt over reach and abuse, etc.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Ozarkafterdark",
                                                                                    "body": "It pretty much guarantees that work goes on forever because nothing ever actually gets cleaned up.",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "loonygecko",
                                                                    "body": ">you get a patchwork of different regulations across states, with the more liberal states instituting stricter regimes.\n\nYou don't seem to understand how much that already exists.  The feds in general do not prevent states from adding on additional rules to compliment the fed rules so that's what usually happens.  The fed rules are typically just a minimum standard and then all kinds of additional rules get tacked on at the state level.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DeyCallMeWade",
                                                    "body": "We already do that though. Even businesses already do that. The solution to dealing with a state that has conflicting regulations is to either not open shop there, comply with current regulations, or lobby for changes that would bring them more in line with states you currently operate in.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "barbershreddeth",
                                                            "body": "pretty much every industry association would rather have a clear federal law with a single compliance regime to work with.\n\ndo you think medical device manufacturers would rather deal with the FDA, or with 50 state versions of the FDA? the answer is obvious. The fact you're trying to argue otherwise is genuinely dumbfounding. Are you stupid?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "loonygecko",
                                                                    "body": "You don't get it, most states tack on a tons of regs beyond fed law already very much including things like medical devices.  You should see the clusterfxck of regs that California is constantly creating for everything like special car emissions and gas mileage standards.  \n\nAnother especially obnoxious one is a while back, Cali made it a law that you could be sued for anything you sell that later gets found to cause cancer even if it was not known that it was a cancerous agent at the time you sold it.  So maybe some element of the metal finish of some product 30 years from now is found to cause cancer, you are liable if you sold it 30 years earlier.   So if you walk into a hardware store, there'll often be signs saying products might cause cancer.  WHich ones?  Who the fxck knows, they are just covering their butt from liability.  Almost anything might cause cancer, there's so many signs on everything that none of it has any meaning and it's a total waste of time.  Because the way to avoid liability is if you include a cancer warning label.  And also many companies will not ship here because they don't want to have a separate package with a cancer warning just for Cali.  \n\nSo if feds removed their standards, the only diff we might see as businesses is that regulation might loosen up in a few states, which businesses would like.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "loonygecko",
                                    "body": "That will depend on the state and on the sentiment of their voters.  I'd also need to see your stats on most govt workers being compliance officers.  Those working at USAID were just giving away our money for mostly stupid shxt, and that's all they were doing. The USA will not miss them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tacocarteleventeen",
                    "body": "I guarantee you between the average week of brakes and staff meetings and holiday time and vacation time and sick time 50% of their week is nonproduction anyway before they watch Netflix in their underwear at home collecting pay",
                    "score": 36,
                    "replies": [
                        {
                            "author": "LagerHead",
                            "body": "I think you're being generous. 😏",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "loonygecko",
                            "body": "Yeah I used to see this girl at pickleball that was supposed to be working.  She was WFH and she'd bring her laptop but spent most of her time playing pickleball games and in between games, she'd do a tad of work on her laptop.  Pressure to work must have been minimal though as she never turned down an opportunity for a game.   I read somewhere that it's estimated the average WFH worker spends approx 4 hours of their work day not actually doing work.  One has to assume that is why WFH is so loved by so many workers who do it.  \n\nAnd it's not even like I don't understand.  I work for myself and it IS harder to work constantly when tons of temptations to goof off are all around and there's no one looking over your shoulder who'll notice if you are not working.  IMO a lot of this is human nature but probably down the line AI will track output more and WFH slacking will be more easily detected.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "No-One9890",
                            "body": "If u think employees r only productive 50% of their paid time, wait until you hear how little of elons time is productive",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "Occasional-Mermaid",
                                    "body": "Considering how much money he makes a minute, I’d say he’s productive when he’s taking a shit at this point. Doesn’t matter that he isn’t actively doing anything.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "No-One9890",
                                            "body": "What?\nSomeone bank account growing is not the same as productivity. In fact if his wealth is growing but he isn't working he's just a parasite",
                                            "score": -19,
                                            "replies": [
                                                {
                                                    "author": "Occasional-Mermaid",
                                                    "body": "A parasite doesn’t invest anything. That’s like saying restaurant owners or salon owners who charge other beauticians for booth rent in their buildings are parasites. Absolutely absurd. People receiving disability checks because they don’t like dealing with the public are parasites. If I invest money into something someone else is doing so they are ABLE to do whatever it is and it makes me a lot of money, I’m not a parasite. I actively helped ensure that whatever is being done got done *with my money.* If I do nothing at all and receive money for simply being alive, I’m a parasite on society.",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "No-One9890",
                                                            "body": "Every single example u gave is an example of a potential parasite. It depends on the amount of rent u extract and how well u keep up the property u maintain.\nI mean ur happy capitalist examples are basically just a description of feudalism lol",
                                                            "score": -19,
                                                            "replies": [
                                                                {
                                                                    "author": "Fluffy-Feeling4828",
                                                                    "body": "Ah, yes, feudalism. The system of inherited station.\n\nWhere is this like feudalism again? I'm not seeing a trade passed down for centuries now that I look again.",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "No-One9890",
                                                                            "body": "Not sure if the hereditary part is the important part. But using ownership of land to justify a right to what is produced on that land, absent any work to improve that land, is basically the structure serfdom was based on",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Fluffy-Feeling4828",
                                                                                    "body": "No, the basic structure serfdom was based on was the Roman state enforcing populations to work the same job generationally in the same place so they wouldn't keep flooding the city of Rome as Plebians looking for food, and causing deficits in important resources.",
                                                                                    "score": 7,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "DeyCallMeWade",
                                                                    "body": "Ahh yes. Because we aren’t on a Capitalist subreddit.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Occasional-Mermaid",
                                                                    "body": "Mentally ill take",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "International_Lie485",
                                    "body": "I don't own any Tesla stock, so I don't give a fuck how productive he is.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "LagerHead",
                                    "body": "Wait until you find out that the plural of anecdote is not data, especially when the anecdote is based completely off your feelings and nothing else.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "trufin2038",
                    "body": "Exactly. This post only proves one thing: there are waaay too many federal parasites. Number needs to get close to zero.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "No-One9890",
                    "body": "But that is time that could have been spent on real work",
                    "score": 2,
                    "replies": [
                        {
                            "author": "LagerHead",
                            "body": "Yeah, and if they weren't government employees they might be doing real work. As it is, that's time not spent fucking up my life.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "loonygecko",
                            "body": "The issue is that any govt worker knows that few govt workers actually do real work during their entire work hours.  For most of them, more likely this just cut into their Solitaire game or Amazon shopping time.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "GuessAccomplished959",
                            "body": "Real work? It's all BS to begin with, when they even work.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ifyouwant67",
            "body": "Watch a video where this lady got a fed job. She was allowed to work from home. The first day, she receives a list of tasks to complete. She completes those tasks and receives a call from her manager telling her that the task was to be completed over the span of a month, not 1 day.",
            "score": 39,
            "replies": [
                {
                    "author": "denzien",
                    "body": "Damn. I could definitely use a side hustle - what department was this?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "International_Lie485",
                            "body": "Too late, Elon's here now. Wait for the next election.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "golsol",
            "body": "I'm the federal building I work in they blacklisted Netflix on the building Wi-Fi because too many people were watching movies while at work. Blocking Netflix didn't magically give them all something to do. It just made them waste time in other ways. \n\nIf this leads to more layoffs of government leaches it's 17 million well spent.",
            "score": 16,
            "replies": []
        },
        {
            "author": "BIGJake111",
            "body": "This logic implies the employees would actually be working in the few minutes to send the email rather than dicking around on Reddit like you and I are both doing right now.",
            "score": 58,
            "replies": []
        },
        {
            "author": "jakedasnake1",
            "body": "When someone asks me to feel sorry for a federal employee who is being asked to actually work\n\nhttps://preview.redd.it/8uqn1psxable1.jpeg?width=660&format=pjpg&auto=webp&s=09ed53ce2b501a8e58274bded95f94fbe0715bc0",
            "score": 47,
            "replies": [
                {
                    "author": "Occasional-Mermaid",
                    "body": "That’s not even work tho",
                    "score": 4,
                    "replies": [
                        {
                            "author": "backtotheprimitive",
                            "body": "Telling your boss what you do is work. I do that all the time..",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Occasional-Mermaid",
                                    "body": "It just feels like busywork which is not work, it’s just something you gotta do to get money. I guess it just doesn’t take any effort so it doesn’t seem like work to me.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "kurtu5",
                                            "body": "> feels",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FreitasAlan",
            "body": "I’ll use this one when my boss asks me to report what I’m doing.",
            "score": 8,
            "replies": []
        },
        {
            "author": "milkom99",
            "body": "It's disgusting we have so many federal employees that every ten minutes $17m dollars is spent. Fire as many federal employees as possible.",
            "score": 7,
            "replies": []
        },
        {
            "author": "joker_with_a_g",
            "body": "The guy that wrote this thinks you need 10 minutes for a 5 point mail...",
            "score": 41,
            "replies": [
                {
                    "author": "EndSmugnorance",
                    "body": "It’s because they have to think really hard (or bullshit) about how *little* they’ve accomplished this week.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "bmcsmc",
                    "body": "Government worker time is different than regular worker time.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "P1xelEnthusiast",
                    "body": "I thought this too!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "JamesMattDillon",
            "body": "If someone cannot list 5 things that they did that week. Then they obviously shouldn't be working there",
            "score": 9,
            "replies": []
        },
        {
            "author": "Ed_Radley",
            "body": "This is obfuscating the fact that those 10 minutes have already been paid for regardless of what work they're supposed to be doing (and likely aren't due to parkinson's law).",
            "score": 5,
            "replies": []
        },
        {
            "author": "Classy_Mouse",
            "body": "OOP: you shouldn't give the government a 10 minute task. 10 minutes of government costs a lot  \n\nYeah, that's the point",
            "score": 5,
            "replies": []
        },
        {
            "author": "ronpaulclone",
            "body": "Government employees don’t even work so I’m sure taking 10 mins out of their day is only going to stop them from participating in a gay orgie chat group for a day.",
            "score": 11,
            "replies": [
                {
                    "author": "im_intj",
                    "body": "How about troops deployed overseas?",
                    "score": -4,
                    "replies": [
                        {
                            "author": "EconGuy82",
                            "body": "They’re definitely doing something. Would be nice if we could stop them from doing their work for 10 minutes.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "im_intj",
                                    "body": "I agree but the claim that everyone in government doing nothing is incorrect",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "EconGuy82",
                                            "body": "Yes, you’re right. Many are doing nothing. Others are actively doing harm.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "im_intj",
                                                    "body": "Yeah try flying with no air traffic control and let us know how that works out",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "EconGuy82",
                                                            "body": "I refuse to use public airports, actually. All air traffic control I deal with is private.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "im_intj",
                                                                    "body": "Since when is ATC a public entity?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "EconGuy82",
                                                                            "body": "Mine aren’t.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "International_Lie485",
                                            "body": "Nobody claimed that so take your straw somewhere else.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Jumanian",
                                                    "body": "Someone literally just did are you blind?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "International_Lie485",
                                                            "body": "Oh right, you were talking about the killing of women and children in Yemen and Libya.\n\nYeah, that's definitely an important job.\n\nWouldn't want brown children to attend school without US drone strikes.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Jumanian",
                                                                    "body": "Nice deflection and whataboutism",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "International_Lie485",
                                                                            "body": "I'm not deflecting, I'm agreeing with you.\n\nOur military is doing an important job bombing schools with children inside. \n\nWe don't want to disrupt their important work with a 10 minute e-mail.\n\nYour argument is so compelling I changed my view.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "kurtu5",
                                            "body": "> the claim that everyone in government doing nothing is incorrect\n\nwhose claim? or are you lying?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "International_Lie485",
                            "body": "I deployed in 2011 and would have no problem writing this E-mail.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "im_intj",
                                    "body": "So are you still in the military in 2025?",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "kurtu5",
                                            "body": "eefis",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ronpaulclone",
                            "body": "Well I think they can also send an email. 5 bullet points of what you did in a week ain’t that hard no matter what the job is. \n\nI don’t know exactly what troops do but maybe like this :\n\n\n5 things I did last week in the scope of my job: \n\n1: PT to prepare for combat if necessary \n2: practiced basic combat medical procedures \n3:  checked all of the equipment \n4: live fire training\n5: attended classified map and intel briefing\n\nEven if this is all not accurate I think you can bullet 5 things you did of value in any role that should exist.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "im_intj",
                                    "body": "Troops answer to a chain of command not Elon Musk. You cannot break chain of command to answer to someone else.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "loonygecko",
                                            "body": "It was ultimately an order from Trump who is at the top of the chain of command.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "im_intj",
                                                    "body": "It was never an order from Trump. Show me where he ordered any of this.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "loonygecko",
                                                            "body": "All indications are that Musk and Trump discuss and Trump's approval is obtained before major things are done.  Musk repeatedly says he has to check with Trump or only if Trump approves when asked about things that he has not spoken with Trump about yet.  Musk works for Trump and as long as Trump backs him then his orders are Trumps orders, that's how the chain of command works.  Also history shows Trump is not afraid to yank someone back with a violent slapdown the second he is not happy with them so this weird attempted narrative that Musk is somehow taking over from Trump is quite far fetched and weak since it does not even fit with the personalities in question.  I know you know this so maybe just quit with the feigned ignorance, it's not a good look and no one is falling for it here.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "kurtu5",
                                            "body": "They are being asked to obey Trump's appointee.  You know POTUS the top of all military chain of command?  Now you know.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "im_intj",
                                                    "body": "Show me where Trump told them to do this.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "kurtu5",
                                                            "body": "You know creating DOGE and appointing people to it to exercise his will.  As POTUS.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "im_intj",
                                                                    "body": "That doesn't mean they have the power to command the military. You really think Elon can just say hey guys we are going to war and they have to listen? Are you really this ignorant?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "kurtu5",
                                                                            "body": "> That doesn't mean they have the power to command the military.\n\nThey have the power delegated to them.   Thats all.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "im_intj",
                                                                                    "body": "That's not how that works but go on",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "kurtu5",
                                                                                            "body": "How does it?  \n\n\"Elon can just say hey guys we are going to war\"   Speaking of incredulity.   You really believe these are the powers delegated to Elon Musk?\n\nThat is how it works?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "im_intj",
                                                                                                    "body": "Clown comment",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "kurtu5",
                                                                                                            "body": "Well I shouldn't expect much from someone who thinks mbti is real.   So there is that.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ChoiceSignal5768",
                            "body": "They might have to take 10 min off killing innocent people then",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "International_Lie485",
                                    "body": "10 minutes without any women and children slaughtered.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-One9890",
            "body": "Nothing screams efficiency like a joke that distracts all govt employees.\nAlso, it's not a ruse unless it was intended to be one from the beginning. The fact that he realized it was stupid after the email was sent and is pretending he didn't mean it is just childish bullshit",
            "score": 10,
            "replies": [
                {
                    "author": "loonygecko",
                    "body": "I suspect there was too much noncompliance from workers and admin and possibly also interfering laws that made it not a workable plan.  If he did the same at say X, workers would have more respect for the tighter chain of command and more clear understanding and respect for his authority and power over them and would likely quickly comply.  \n\nWhat Musk and Trump are trying to do is to a large extent very new and the USA govt is massive.  They will not be able to just analyze everything they need to analyze with 100 people using just 100 human brains and attention spans.  I suspect they are trying to find ways to collect data to feed into AIs so that AI can help analyze the situation.  And lazy and defiant govt workers are of course motivated to block any such efforts.  It's a challenging problem to solve.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "No-One9890",
                            "body": "This is all fine, im not mocking what was done. I just don't like when ppl try something, then pretend they were kidding when it doesn't work. Own the mess up and move on",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "loonygecko",
                                    "body": "To be sure, Musk is sometimes very immature emotionally.  However my personal feeling is that the job needs to get done very very badly and I'm just glad someone is actually going to try to do it.  Also a lot of these techie guys have shxt social skills but they do excel at their techie work.  You can't always expect people to just be good and perfect at everything.   Musk seems to be the best that could be found that was WILLING TO STEP UP and also has so far managed to get along with Trump which also may be no small task and he apparently has the workers and the resources and enough basic knowledge to make progress.  Realistically we are lucky we even have this much.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "No-One9890",
                                            "body": "I don't rly see him as a tech guy tbh. He certainly hires a lot of engineers but I don't think he has any idea how his companies shit works.\nMusk is rly only acting out of self interest (pursuing his own corrupt profit motive by consolidating the govt rather than shrinking it). \nI think him and Trump r actively making the problem way worse",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "keeleon",
            "body": "Ok now extrapolate that to 8 hour days and maybe you'll see why some people think we might be spending too much on govt bureaucracy. The whole point of the email is that most of them were probably doing \"nothing\" instead for that same amount of money.",
            "score": 8,
            "replies": [
                {
                    "author": "dangered",
                    "body": "Imagine doing the math to find that we burn $17 million dollars every 10 minutes just to pay federal employees and somehow arriving at the conclusion that we shouldn’t try lowering that number.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "LoneHelldiver",
            "body": "That's about 2 million more Federal employees than we need is my thinking....",
            "score": 3,
            "replies": []
        },
        {
            "author": "Late_Entrepreneur_94",
            "body": "More like:\n\nOnly receive 1,1126,081 responses (half)\n\nJust saved the tax payer another $106 billion with a single email.",
            "score": 4,
            "replies": []
        },
        {
            "author": "mean--machine",
            "body": "Feds get paid $46 an hour plus pension, healthcare, TSP, and more..\n\nAnd they're up in arms about working 10 minutes extra a week",
            "score": 2,
            "replies": []
        },
        {
            "author": "lrc1710",
            "body": "That cost was sunk already, no extra losses",
            "score": 2,
            "replies": []
        },
        {
            "author": "BastiatF",
            "body": "Yet they don't frame the end of DEI training for government employees as saving taxpayer money, funny how that work",
            "score": 2,
            "replies": []
        },
        {
            "author": "OJ241",
            "body": "Pay once and be done with the waste in *hopeful* perpetuity",
            "score": 1,
            "replies": []
        },
        {
            "author": "ice_eater",
            "body": "So imagine how much we’re wasting when they do nothing all day beyond 10 min of email reply… GASP",
            "score": 1,
            "replies": []
        },
        {
            "author": "wmtismykryptonite",
            "body": "$45.99 per hour? Average? Does that include benefits?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Revolutionary-Cup954",
            "body": "Imagine sipping for govt employees",
            "score": 1,
            "replies": []
        },
        {
            "author": "MFrancisWrites",
            "body": "Fun exercise. Any hack can make some shit up for a dumb email, but those who are busy actually doing shit ain't gonna respond to some purely performative, virtue signaling email. Masterful gambit.",
            "score": -4,
            "replies": [
                {
                    "author": "loonygecko",
                    "body": "If you are actually good at doing work , you can slap that email out in minutes and it would be just one of many daily emails anyway, not a big deal.   It takes more time to complain about it on reddit than to actually just do the job.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "MFrancisWrites",
                            "body": "\"Let me stop my actually job to appease the ego of some fragile billionaire\" = peak efficency.\n\nLike anyone who thinks an email like this should have any merit or bearing probably thought 7th grade was hard. It's a joke that his simps think this is a real way to do anything, and funnier that \"anarchists\" are at his feet lapping it up.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "loonygecko",
                                    "body": "Your argument would be more salient if govt weren't already so full of stupid busy work that is useless but workers have to do it anyway, in fact that probably describes most of govt work in general.  This one time task is nothing in the overall scheme of things and I highly doubt anyone complaining actually truly cares about wasted time or they'd be up in arms about the other 100 things that govt workers waste their time on.  \n\nHowever I suspect Musk did intend for the email to be used as AI data but that the high level of noncompliance and admin foot dragging made him realize it won't be an effective tactic.   DOGE is tasked with sorting out 3 million fed employees and likely hopes to use AI to sort out basic functions of many small and large departments. However he's facing massive hate and noncompliance and tactics that might work great at his own companies might not work out so well for the fed workers.   To a large extent, DOGE is breaking new ground with new technologies and there will be a learning curve because there is no template to work off of.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "MFrancisWrites",
                                            "body": "You don't solve stupidity and inefficiency with more of both, kiddo. Stop worshiping billionaires. They're the main reason the US state is so worthless.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ihiwszkpseb",
            "body": "My first thought about the email was that it was a marketing gimmick. It would obviously go super viral, the federal employees and regime stenographer media would obviously freak out about it, which reinforces Joe six pack’s support of musk/trump/doge.",
            "score": -2,
            "replies": []
        },
        {
            "author": "GunkSlinger",
            "body": "Allow me to seriously consider this for a minute.\n\nhttps://preview.redd.it/nz9kasn1bcle1.png?width=846&format=png&auto=webp&s=8bf7d8957b57a45f1528c33ee80b0792218ef9e4",
            "score": 0,
            "replies": []
        },
        {
            "author": "rrzibot",
            "body": "If all government employees are fired today this will save about 2.8% of the spending. And this is the whole government. If all the international funding is stopped this is less than 1% of the spending.",
            "score": 0,
            "replies": [
                {
                    "author": "IntentionCritical505",
                    "body": "And?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "wmtismykryptonite",
                    "body": "Wages for the 2.4 million federal employees (sans USPS) at an average of $106,000/yr gives ~3.6% of a $7 trillion dollar budget.  Including benefits for current employees brings it to at least 6%.  This also doesn't include contract and grant employees.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "rrzibot",
                            "body": "So, according to these calculations having a government costs 6% of the budget. All their \"cost savings\" will probably amount to less than a point of a percent, not including the additional spendings.  Yeah every system has waste and they will find waste and will lie about it, like the lie about the condoms to talibans. They will do some good marketing. That's true. Will get 1000 projects that sound wateful and total 5B and will cut them. Cool. This is not doing anything except people talking about it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "wmtismykryptonite",
                                    "body": ">So, according to these calculations having a government costs 6% of the budget.\n\nThis assertion doesn't follow my comment.  I said it takes a least 6% of the federal budget to pay for direct federal employees.  It costs 100% of the federal budget to have the government we currently have.  There are over 9 million people that have jobs because of the federal government.\n\nI don't know what fraction of their statements are true or not, but in no way did I mean to say it takes 6% of the government budget to have a government.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "rrzibot",
                                            "body": "It actually does not cost 100% of the spending to have a government. That’s not how governments work. \n\nOk, let’s remove every employee of the government and replace it with something that is 0. \n\nAre we keeping Health insurance, social security, defense, debt, benefits for veterans, we are already at 80%. There are places that could reduce spending - like all the subsidies to oil companies for example that generate record profit, or companies run by musk, or trump or their buddies. The whole pharma sector. But this is not what they are after, they are after cheap shots of things they don’t understand and complete lies and made up claims. It’s like a game of broken phone. A health aid of a few millions that prevents all kinds of nasty epidemics turns out after a few exchanges to be 100M if condoms funding … and people are buying it. \n\nEvery system of this scale has waste. This waste and inefficiency could be remove and the waste that these guys are removing is completely insignificant. By their own accord they’ve remove 16B of waste. Cool. Until someone else does the calculations and it turns out that it will total about 2B. One of their claims is that they’ve removed an 8B government contract for the border and it might turn out that this is actually 8M.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LordXenu12",
            "body": "My employee would prefer I spend my time actually doing things to save money 🤷‍♂️",
            "score": -2,
            "replies": [
                {
                    "author": "IntentionCritical505",
                    "body": "Why weren't they doing that before January 20th?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "LordXenu12",
                            "body": "Doing what wasting time emailing Elon to massage his overinflated ego?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "IntentionCritical505",
                                    "body": "They're not short on time. This is to find fake people and root out the outright insubordinate,",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LordXenu12",
                                            "body": "If you wanna find fake people look at the head of doge. His half witted idea was shut down by his buddy directing the FBI because it’s fucking stupid and was entirely unenforceable. Elon had to pivot to save face after he got shut down\n\nHe’s not their boss. If someone that isn’t my boss asks me what I accomplished last week, email is getting deleted. Fuckin time waster. You can say they aren’t busy but apparently busier than Elon with his nonstop Twitter shit posting\n\nI’m all for cutting government spending, ESPECIALLY waste. Elon is just literally one of the last people I’d trust to be in charge",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "IntentionCritical505",
                                                    "body": "Seems more productive to go after the bloated bureaucracy than the guy who is taking $0 in salary. Not even sure what you're babbling about here.\n\nTrump is their boss. Trump appointed Musk to fix a broken system. Musk hired people to find it. They are, and the left is in a state of total panic, which is beautiful.\n\nYour boss would be a bad boss if he didn't fire you for such insubordination. \n\nThese people brag about how the sit in PJs all day and do nothing. These are the same people who cheered or my death after I lost my job due to the COVID mandates. They deserve zero sympathy.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "LordXenu12",
                                                            "body": "If you think Elon isn’t going to profit from slashing competitors and political dissidents I got some bridge coin to sell ya. I have 0 faith he’s actually targeting bloated anything, not sure why anyone would.   \n\nUh didn’t you get the memo? Trump says Elon has no authority (so he can protect Elon from legal ramifications through his established presidential immunity, but still\n\nMy boss would be a bad boss if she were Elon or trump, fortunately she’s competent and sees them as idiots. And she’s the director of procurement for a major corporation, it’s not like she doesn’t know saving money. \n\nWho are “these people” you’re referring to? Some unnamed specter musk bitched about in one of his 15 shit posts for the hour?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "IntentionCritical505",
                                                                    "body": ">If you think Elon isn’t going to profit from slashing competitors and political dissidents I got some bridge coin to sell ya.\n\nWhich competitors has he \"slashed\"? Be specific. And I think all funding for political agitation and propaganda should be cut, so yes. \n\n>Uh didn’t you get the memo? Trump says Elon has no authority (so he can protect Elon from legal ramifications through his established presidential immunity, but still\n\nThis is a weird conspiracy theory.\n\n>My boss would be a bad boss if she were Elon or trump, fortunately she’s competent and sees them as idiots. \n\nIf your boss ignores your insubordination she's a bad boss. Trump and Elon are doing a much-needed cleaning of house.\n\n>Who are “these people” you’re referring to? Some unnamed specter musk bitched about in one of his 15 shit posts for the hour?\n\nDemocrats and government workers.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "LordXenu12",
                                                                            "body": "NASA for one on competitor funding slashed. I like how you tell me to be specific while refusing to do so, which democrats and public workers sit in their PJs doing nothing but cheering for your death? If you wanna talk about “weird conspiracies”…\n\nTrump claiming Elon has no authority is a fact. Not a conspiracy. Not their boss. Not insubordination. Seems like you just want them to lick your favorite boot like you do 😉\n\nAgain, if you believe what trump and Elon are doing is about saving money for the average American citizen, I got some bridge coin to sell ya. Neither of them care about you, free markets, Liberty or anything but their own power and attention.\n\nhttps://preview.redd.it/5tcxq0prgjle1.jpeg?width=1125&format=pjpg&auto=webp&s=e3652b53da5e56f8659a668ca74ba6bebdc85d11",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "IntentionCritical505",
                                                                                    "body": ">NASA for one on competitor funding slashed.\n\nNASA isn't a competitor to SpaceX, they're one of the main clients.\n\n>I like how you tell me to be specific while refusing to do so, which democrats and public workers sit in their PJs doing nothing but cheering for your death?\n\nDo you not remember the COVID years?\n\n>Trump claiming Elon has no authority is a fact. Not a conspiracy. Not their boss. Not insubordination. Seems like you just want them to lick your favorite boot like you do 😉\n\nBut why do you think it matters? The authority for DOGE flows from a duly elected president, not Musk. \n\nAnd cutting a dangerously bloated government is bootlicking to the far left, lol.\n\n>Again, if you believe what trump and Elon are doing is about saving money for the average American citizen, I got some bridge coin to sell ya.\n\nI think they're doing it for the good of the country. Stopping destructive things is good!\n\n>Neither of them care about you, free markets, Liberty or anything but their own power and attention.\n\nI never said they did. Kind of a stupid argument because the alternative clearly did not. Trump got elected after four years of oppression by the Biden-Harris regency.\n\n><image>\n\nThe rich should have their taxes cut, they pay the majority of taxes.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "LordXenu12",
                                                                                            "body": "NASA awarding contracts to space x doesn’t mean they aren’t also competitors. \n\nTrump hired musk. Trump said musk has no authority. You have no ground to stand on, very blatantly not insubordination. Trump did not make the email request, and it was shut down by someone trump deemed has actual authority. I do not have any faith that Elon is significantly cutting any dangerous spending, and don’t understand why anyone would believe him. \n\nYes I remember the Covid years. Who specifically was sitting around in PJs doing nothing but wishing you’d die?\n\nStopping destructive things is great, start with the autocrats musk and trump \n\nI’m by no means defending biden, but at least status quo joe wasn’t an aspiring dictator (despite overstepping on Covid). \n\nSay what you want about rich tax cuts, are you in that category? Should yours go up? \n\nYou gonna clap when they start actually pushing for a 3rd trump term?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "IntentionCritical505",
                                                                                                    "body": ">NASA awarding contracts to space x doesn’t mean they aren’t also competitors. \n\nNASA doesn't even make rockets anymore. They're not competitors. SpaceX hauls their probes to space.\n\n>Trump hired musk. Trump said musk has no authority.\n\nMust isn't taking a salary so he was never hired. His authority is derived from the duly elected president, and his authority is derived from the will of the majority of the people.\n\n>Trump did not make the email request, and it was shut down by someone trump deemed has actual authority. I do not have any faith that Elon is significantly cutting any dangerous spending, and don’t understand why anyone would believe him. \n\nI believe him because he's been right about nearly everything else and he's currently in the process of cutting waste.\n\n>Yes I remember the Covid years. Who specifically was sitting around in PJs doing nothing but wishing you’d die?\n\nThe majority of the federal government.\n\n>Stopping destructive things is great, start with the autocrats musk and trump \n\nWe just voted to put them in power. There's no way and no reason to \"stop\" them. There's a way and a reason to cut bureaucratic waste.\n\n>I’m by no means defending biden, but at least status quo joe wasn’t an aspiring dictator (despite overstepping on Covid).\n\nThe people controlling Biden acted as dictators. Bro, do you have the memory of a mayfly?\n\n>Say what you want about rich tax cuts, are you in that category? Should yours go up?\n\nNope, I'm not rich. I think everyone should pay the same percentage of income in taxes and everyone's should go down as we cut spending.\n\n>You gonna clap when they start actually pushing for a 3rd trump term?\n\nHe never got a first term, so it would be appropriate.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "LordXenu12",
                                                                                                            "body": "You’re a lost cause cultist. NASA does in fact still compete with space X. Musk has no authority, per your cult leader. Elon hasn’t been right about shit and you have no evidence he’s really cutting significant waste. His tweets are not evidence.\n\nThe majority of the federal government was sitting around in PJs wishing death on you? Surely you can think of a specific example then \n\nThe biden administration doesn’t hold a candle to the autocratic power grabbing trump is doing. Biden sucked but didn’t centralize power further as trump is doing HARD. You’re just happy because you like this autocrat, it will bite you. 😯🐆 \n\nYou don’t think your taxes should go up. Trump does. 🤔 \n\nTrump absolutely got a first term ya cultist. Quit being an autocrat enabling simp and never pretend you care about the sanctity of the US constitution or any nonsense like that. You want to force your preferences on everyone else.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "IntentionCritical505",
                                                                                                                    "body": ">You’re a lost cause cultist\n\nRich coming from someone who can't provide a shred of evidence for his conspiracy theories. \n\n>NASA does in fact still compete with space X.\n\nSimply wrong.\n\n>Musk has no authority, per your cult leader. \n\nYes, Trump has authority. Elections have consequences. Maybe have a primary next time.\n\n>lon hasn’t been right about shit and you have no evidence he’s really cutting significant waste. His tweets are not evidence.\n\nThey have a website listing it. They cut the hell out of DEI programs and a bunch of money laundering. Were you stealing from us, too?\n\n>The majority of the federal government was sitting around in PJs wishing death on you? Surely you can think of a specific example then \n\nGaslight harder. Are you pretending to not remember the COVID years?\n\n>The biden administration doesn’t hold a candle to the autocratic power grabbing trump is doing. \n\nLOL wrong. Again, the COVID years.\n\n>Biden sucked but didn’t centralize power further as trump is doing HARD.\n\nHe forced 100 million innocent people to take an experimental drug so his son could buy more coke and hookers.\n\n>You don’t think your taxes should go up. Trump does. 🤔 \n\nAccording do you. Not according to reality.\n\n>Trump absolutely got a first term ya cultist.\n\nNah, they made up the Russian hoax and denied him his power.\n\n>Quit being an autocrat enabling simp and never pretend you care about the sanctity of the US constitution or any nonsense like that. You want to force your preferences on everyone else.\n\nYou guys made me wear a face diaper and forced an experimental drug in the arms of 100 million Americans while your politicians gallivanted around maskless, ignoring lockdowns. You fellate Nazis.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}