{
    "title": "Thoughts on how things are panning out with Elon with federal funds loss.",
    "author": "86HeardChef",
    "subreddit": "Anarcho_Capitalism",
    "rank": 148,
    "score": 0,
    "upvote_ratio": 0.35,
    "num_comments (reported by reddit)": 60,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iyc719/thoughts_on_how_things_are_panning_out_with_elon/",
    "id": "1iyc719",
    "selftext": "My daughter and son-in-law work for senior centers. Her one with about a 90% Medicare resident rate and him a VA senior resident clinic. Hers has announced closure due to federal funding freezing on Medicare in Arkansas. His is at risk.  They also have a child with Down Syndrome and the facility where their child receives his therapies have warned that they will likely be closing due to federal funding loss. \n\nI am trying to understand the anarcho-capitalist perspective on how these scenarios would pan out ideally. What are your thoughts? \n\nAlso note: if there is a better forum to ask this question, please let me know! TIA",
    "comments": [
        {
            "author": "XDingoX83",
            "body": "Unpopular comment: Why should my money to go paying for those people? I didn't make the kid with down syndrome and those people in the senior center why are their families not taking care of them? There is the issue, we off loaded the responsibility of taking care of individual responsibilities onto the government and then the government takes other people's money using force to pay for it. \n\nExplain to me how that is fair.",
            "score": 26,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "Well the people on Medicare paid into the system their entire lives through Medicare tax. Many also have ltc policies but that doesn’t cover all of the care. It’s supplementary. \n\nThe VA care have paid in, obviously. \n\nBut again, ideally how would these things be handled?",
                    "score": -11,
                    "replies": [
                        {
                            "author": "XDingoX83",
                            "body": "How would you handle your own family? Thats all that matters. If you are worried about how others are going to be taken care of you have every right to go out and volunteer, donate your own money and put in all your own resources to help. Stop saying how it will be handled. It will be handled by you. Stop expecting others to do things.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "86HeardChef",
                                    "body": "This is not about how I will handle my own family. I am asking, philosophically, how anarchocapitalists view the best societal outcome for these situations.",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "XDingoX83",
                                            "body": "We don't. What part of anarchy are you missing?",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "86HeardChef",
                                                    "body": "I’m curious, do most anarchocaps have children in your experience?",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "XDingoX83",
                                                            "body": "That does not matter.\n\nAre your children more important than me? Is that why you think it is okay to use force to steal money from me so you can pay for their education and health care?",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "86HeardChef",
                                                                    "body": "Not at all. It matters as I’m trying to understand mindsets and driving forces behind mindsets. So it matters from a purely curiosity perspective. That question seems to make you defensive. How interesting.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "XDingoX83",
                                                                            "body": "You are attempting to make arguments from pathos. The question does not matter one bit. If your kids or any ones kids are not more important than any one else then they have no right to someone else's money. So the argument for any form of taxation to pay for health care, schools etc etc are wrong. You need to justify why it is okay to take other people's money to pay for something you think is good.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "86HeardChef",
                                                                                    "body": "This is not a page about my political beliefs. It is a page about yours. So I am here to understand yours. You are defensive about yours and that’s ok. Nobody is going to force you to discuss them. I’m sorry I upset you so.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "XDingoX83",
                                                                                            "body": "You are coming from the assumption that medicaid is \"correct\" that is an appeal to tradition. I am saying, these things are just wrong. Period but you posed the question as if they, by nature of them existing, are a good. You are posing the question what we need to do about those things, you need to explain why we need them in the first place. We believe these things shouldn't exist period because they require theft of other people's property to exist. If you believe these things need to be accounted for you need to explain why the theft of people's property is justified.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "86HeardChef",
                                                                                                    "body": "I am not coming from that assumption. Perhaps you should check your assumptions at the door. I am simply hoping to hear your perspectives. No more no less. You’re incorrect about me.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "XDingoX83",
                                                                                                            "body": "You're entire OP was an argument from pathos. Look at these poor people about to lose their money. So the question came from bad faith. You tried to manipulate the question to guilt people into caveating their answer. Those scenarios play out just like I told you individuals should choose to help of their own free will. That's it. This entire thread was you moving goal posts and asking non-sequiturs about if I have kids.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "86HeardChef",
                                                                                                                    "body": "lol you are sure reading a lot into things with your emotions. It seems you are very insecure about your own beliefs and positions. I simply told you about the situation relayed exactly as it was given to me this evening. I am exceedingly interested and even leaning toward anarchocapitalism in my philosophies but am new to studying it and am learning all about the perspectives. \n\nI came in with absolutely no preconceived notions. Only the exact scenario in which I was presented. You seem to be jumping to a lot of conclusions, assumptions, and opinions about me and what I believe. I assure you. You are incorrect. Perhaps you should approach folks with more curiosity and less insecurity and defensiveness in the future.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "AgainstSlavers",
                                                                                                                            "body": "Why are you so insecure and defensive?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "86HeardChef",
                                                                                                                                    "body": "I’ve not been defensive for a moment. I’m not sure to what you’re referring, friend. Have you and I even had any interactions at all?",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "AgainstSlavers",
                                                                                                                                            "body": "You're extremely defensive throughout this thread.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "86HeardChef",
                                                                                                                                                    "body": "What an interesting projection you’ve made. I’ve thanked most everyone for their input and thoughts on this thread. You, however, have not contributed at all to the question but have only come in attacking. I wonder why you’ve chosen this tactic. Fascinating.",
                                                                                                                                                    "score": 0,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "AgainstSlavers",
                                                                                                                                                            "body": "No, it's just a fact.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "86HeardChef",
                                                                                                                                                                    "body": "Facts don’t involve your opinion, sir or ma’am. Did you have something to add to the question or are you just here to throw around your emotions?",
                                                                                                                                                                    "score": 0,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "AgainstSlavers",
                                                                                                                                                                            "body": "Have you added a single thing to this conversation?  I can't find one\n\n\nEdit: he blocked me. \n\nAd hominem hurts your case.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "86HeardChef",
                                                                                                                                                                                    "body": "Ok trolly troll. Off you go. I’m sure you have school starting soon. Don’t get in trouble for being on the internet from your mommy. \n\nI came here in good faith and have had several great interactions with folks here. I won’t be responding to your emotional trolling anymore. Byeeee",
                                                                                                                                                                                    "score": 0,
                                                                                                                                                                                    "replies": []
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "AgainstSlavers",
                                                                                            "body": "He's not upset. You're being manipulative, which is a shitty thing to be.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "86HeardChef",
                                                                                                    "body": "Do you speak for him? Are you friends?",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "None",
                                                                                                            "body": "[deleted]",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "86HeardChef",
                                                                                                                    "body": "Do you speak for him? Are you friends? \n\nI’ve not mentioned tweets once, nor do I think, has anyone else other than you just now. Perhaps you responded to the wrong comment?",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "AgainstSlavers",
                                                                                                                            "body": "Sorry wrong comment",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "SmallOrganization80",
                                                                            "body": "You’ve gotten an answer a few times and seem unhappy with it, but asking more questions isn’t likely to change the result.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "86HeardChef",
                                                                                    "body": "I, in fact, have thanked folks for their perspectives and haven’t argued at all. I find it interesting you think I haven’t liked the response. Why do you think that’s the case?",
                                                                                    "score": -1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "eico3",
                                            "body": "I think you got your answer above, you just didn’t like it. \n\nTaking care of your elderly family or your disabled kids is not my responsibility. If we were friends would I help? yep. But all that should be required of the two is us is that you take care of your family unit and I take care of mine. You are more than welcome to donate your time and money to do more, but I shouldn’t demand it of you not you of me. \n\nIt literally IS about how you handle your own family. Individual responsibility is a major pillar of the philosophy.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "86HeardChef",
                                                    "body": "Thanks for helping me understand your point of view better",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Late_Entrepreneur_94",
                            "body": "So shouldn't the fact people have paid into a system their entire lives and will not receive the benefits they were promised be indicative that its a terrible system?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "86HeardChef",
                                    "body": "If you say so.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Late_To_Parties",
                            "body": "It would be handled by people voluntarily deciding how to invest for their future and contribute to charity. The current mainstream systems don't give people the choice of contribution or what to invest in.\n\n The government stole your money, sorry about that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Countryrootsdb",
            "body": "There is no Medicare freeze\n\nYour daughter and son in law could get a new job. Or they could find a new employer. Healthcare will never die. There’s no reason the state should offer health services. Just as your “kids” provide for their “sick” child, other families can provide for their family members. Without anyone’s taxes. \n\nIf you can’t afford it, thank the state for overtaxing you, restricting economic growth, destroying the credibility of the healthcare system, pushing unhealthy foods and products on you that ultimately take money and years from you, drowning you in inflation, burdening you with restrictive zoning, and the plethora of other problems they have dropped on you and your families. \n\nThe problem isn’t that federal funding for healthcare is going away. It’s that the government has mismanaged all the funding in the past. There never should have been such a poorly mismanaged system like the VA. You are asking what happens when funds are cut. I suggest asking why those funds never worked in the first place.",
            "score": 9,
            "replies": []
        },
        {
            "author": "DumpyDoggy",
            "body": "There is no Medicare funding freeze. Your family are likely lefties who are lying to you.",
            "score": 13,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "My family voted for Trump and are hard core conservative republicans. You’re incorrect. Do answer the question of what would be your ideal way to handle this scenario\n\nEdit to add: we are in deeply red states that did not expand Medicare and Medicaid and are cutting services",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Metrolinkvania",
            "body": "Ideally people's money would be worth more who actually work and they would be able to help and give charity to the people who they choose instead of being obligated to pay into a system where their money is spent on things they don't want and people that don't appreciate them.",
            "score": 4,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "Gotcha. So a merit sort of system?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Metrolinkvania",
                            "body": "Kind of a winner decides system. The left would argue that merit would mean inheritance is not fair, but I would argue that providing for your lineage is part of the game otherwise why have kids? The system must have a game as does nature or it will create sterility and the games rules should be to reward the best.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "86HeardChef",
                                    "body": "Makes sense. Thanks for your input",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ExcitementBetter5485",
            "body": "> I am trying to understand the anarcho-capitalist perspective on how these scenarios would pan out ideally.\n\nIdeally you would pay into a voluntary system and receive those benefits that are owed or else you would sue. This is how you can have the same care without relying on theft.",
            "score": 2,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "Thank you for your input.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tolkien-Faithful",
            "body": "From that 'scenario' it would be - no taxes so neither would exist anymore. Their existence would be replaced by privately owned centres or charities, where taxpayers would not be forced to pay for services that have nothing to do with them.",
            "score": 2,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "Gotcha. Thank you for your input",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "seniordumpo",
            "body": "The government giveth and the government taketh away.  The ancap scenario would be you have kept all that money instead of paying into the system all those many years and you can afford to pay for that yourself.  Or you go live with your family.",
            "score": 2,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "Thanks for your perspective",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kendoka-x",
            "body": "The happy ancap answer is: The government has crowded out private forms of caring for those (and created the need for VA in the first place) which would be more efficient at getting those needs met all the while making everything more costly.  The process of transitioning to those better models would be difficult under the best of circumstances (Young popular monarch who can run that transition unopposed over a decade or two).  Trump and Elon are doing this in a very contentious environment and may only have 2 years before they lose their ability to act.  As a result they have to get as much done as fast as possible and let the pieces fall as they may.\n\nThe harsh ancap answer is: Those people have no right to my money.",
            "score": 2,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "Thanks for both perspectives. They’re very helpful",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "vvfella",
            "body": "I think you’ve gotten a lot of thought out responses that I don’t have much to add to, but I also want to chime in that despite feeling cuts are necessary to right the wrongs of taxation, that doesn’t mean that many of us aren’t also able to be sympathetic/empathetic that these changes can be scary and affect people. \n\nI wish you and your family the best and hope that the future holds more freedoms for us all.",
            "score": 2,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "Thanks so much! I appreciate all of the thoughtful responses. It gives me a lot of great answers to help my daughter process with a different perspective. Thanks for your well wishes!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "orwll",
            "body": "There is no freeze on Medicare spending, so the ancap perspective on this is that you should tell the truth instead of making up fake stories.",
            "score": 2,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "There are freezes in states that have not expanded. I am very much telling the truth and relaying the scenario as it was given to me exactly. It would be good faith of you to assume the best in others, in the future",
                    "score": 1,
                    "replies": [
                        {
                            "author": "orwll",
                            "body": "Do you mean Medicaid? There is no such thing as \"Medicare expansion.\"\n\nMedicare and Medicaid are two different programs.\n\nAlso, Arkansas IS a Medicaid expansion state.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "86HeardChef",
                                    "body": "Yes. I, of course, mean Medicaid. And yes I know they are different programs. \nThe Medicaid expansions in states have a direct effect on the senior centers that have high Medicare/medicaid resident ratios",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ncdad1",
            "body": "The US preference has shifted from helping the poor to helping the billionaires.",
            "score": 1,
            "replies": [
                {
                    "author": "86HeardChef",
                    "body": "I would like us all to shift to helping ourselves and one another. I fear this shock and awe method is not the way to do it",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ncdad1",
                            "body": "The right way is to research, have a discussion, and make smart decisions, but I am afraid we are not capable of doing that, so deleting everything and starting over may be our only way forward.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "86HeardChef",
                                    "body": "A fair thought. Thanks for your input",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ncdad1",
                                            "body": "So, if your daughter and SIL lose their jobs and house and have to come live with you, will the family still support Trump?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kiornis1",
            "body": "This is what's happening:\n\n>The NRx alternative is to, first, ‘Retire All Government Employees’ (RAGE) in order to ‘reboot’ the economy (Musk’s new DOGE seems to be partially modelled on this), and, second, replace democratic institutions with a CEO (or even a Monarch). The resulting ‘GovCorp’ - a society run as a business - can then be regulated not via the ‘voice’ of its citizenry - there will be no democracy - but via their ability to ‘exit’ as consumers in a free market for governance. \n\n>\n>The corporate structures of GovCorps are to be embedded within Yarvin’s Patchwork model, which envisions the world divided into small, autonomous territories or ‘patches,’ each governed independently as a quasi-sovereign city-state. Under this system, each patch operates as a self-contained entity with its own policies, laws and societal norms. Governance within each patch is offered as a service, with citizens acting more as customers than as members of a community. Yarvin argues that this model creates a form of competition among patches, where territories vie to attract residents by providing desirable policies or services. Rather than engaging in the democratic process to influence governance, individuals express their preferences through a consumer-like choice: they can ‘exit’ a patch if they disagree with its policies and seek a more compatible governance model elsewhere. This transactional approach to governance reduces the citizen-government relationship to one of mere loyalty, devoid of democratic accountability. In Yarvin's view, democracy is supplanted by a form of corporate-style authoritarianism that diminishes the role of public participation.\n\n>\n>Peter Thiel’s backing of J.D. Vance signifies NRx ideology’s entry into mainstream politics, promoting a model where elite control and corporate efficiency undermine democratic norms.\n\nhttps://www.platformspace.net/home/nrx-a-brief-guide-for-the-perplexed\n\nhttps://www.forbes.com/sites/antoniopequenoiv/2024/07/16/jd-vance-and-peter-thiel-what-to-know-about-the-relationship-between-trumps-vp-pick-and-the-billionaire/\n\nhttps://en.wikipedia.org/wiki/Dark_Enlightenment",
            "score": 0,
            "replies": []
        }
    ]
}