{
    "title": "guys don't hate on me, can't we just be friends? 😭😂🤡😛💕💋🤷‍♀️",
    "author": "Western_Solid2133",
    "subreddit": "Anarcho_Capitalism",
    "rank": 124,
    "score": 0,
    "upvote_ratio": 0.2,
    "num_comments (reported by reddit)": 10,
    "url": "https://i.redd.it/rackty387qle1.jpeg",
    "id": "1izmx3r",
    "selftext": "",
    "comments": [
        {
            "author": "not_slaw_kid",
            "body": "https://preview.redd.it/w7vx98h48qle1.jpeg?width=1125&format=pjpg&auto=webp&s=a5c7bff32db26a0ca4f98a11e2b492fea3f9c75c",
            "score": 11,
            "replies": []
        },
        {
            "author": "Ok_Ebb_5201",
            "body": "If it was another elite and you replaced ‘You’ with ‘Leftie’ you get so many upvotes from the republicans in this sub.  But it depends on what reactions you like wanking it to.",
            "score": 2,
            "replies": []
        },
        {
            "author": "angelking14",
            "body": "Ancaps love Elon cause he's reducing the government but fail to see him transfering all the power to himself",
            "score": 3,
            "replies": [
                {
                    "author": "AnonymousUser132",
                    "body": "Name the last person to effectively combat government waste and reduce the size of government.  \n\nNo bureaucrat is perfect, but do not let the pursuit of perfection stand in the way of improvement.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "angelking14",
                            "body": "You realize that he's only doing what he's doing under the guise of \"combatting government waste and reducing the size of government\" but that's not his true goal right?  \n\nHis goal is to increase his personal power.  How come none of his companies contracts are getting affected by all the cuts.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "AnonymousUser132",
                                    "body": "I understand that corruption in government is standard practice. What I am looking at is net gain.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "angelking14",
                                            "body": "Well for Elon his net gain will be astronomical.  For the average person?  If it's a positive, it'll be simply by accident.  Likely it'll be negative.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AnonymousUser132",
                                                    "body": "Well it is trendy to hate Elon, but he exposed and stopped the US government from funding terrorists; at least in some part.  You can focus on the negatives or even hate him for there being a double standard, by some clear positives have already come from this experiment.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Metrolinkvania",
            "body": "Thumbs down, comment on thumbing down, thumb down any response, move on.",
            "score": 1,
            "replies": []
        }
    ]
}