{
    "title": "Should We Celebrate the Demise of USAID and NED?",
    "author": "AbolishtheDraft",
    "subreddit": "Anarcho_Capitalism",
    "rank": 90,
    "score": 39,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 27,
    "url": "https://original.antiwar.com/scott/2025/02/23/should-we-celebrate-the-demise-of-usaid-and-ned/",
    "id": "1izt7y5",
    "selftext": "",
    "comments": [
        {
            "author": "SkillGuilty355",
            "body": "Yes, even if you think that type of soft power is good.\n\nBecause it’s not.",
            "score": 20,
            "replies": [
                {
                    "author": "vvfella",
                    "body": "Agreed. “Soft power” is still state power",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "ClimbRockSand",
            "body": "USAID and NED were not doing charity.  There is no charity to fill, as none was done.  Robbing people is the opposite of charity.",
            "score": 40,
            "replies": []
        },
        {
            "author": "GurlNxtDore",
            "body": "Bribing people to behave is a short-term strategy that fails in the long run…AND should be viewed as soft imperialism.",
            "score": 10,
            "replies": []
        },
        {
            "author": "LoneHelldiver",
            "body": "Yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -6,
            "replies": [
                {
                    "author": "ClimbRockSand",
                    "body": "For decades, USAID and NED have presented themselves as wearing a white hat, helping other countries become more democratic and enlightened. However, much of the real work of the agencies was to foment dissent and at times, overthrow governments that do not comply with Washington’s dictates.\n\nUSAID and NED fund media outlets that repeat Washington’s propaganda, support political opposition factions that want to align more with the White House, and bolster NGOs that facilitate regime changes.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "vvfella",
                            "body": "Not sure why you’re quoting the article I have just read and agreed with to me?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ClimbRockSand",
                                    "body": "not sure why you think extortion rackets are charity?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "vvfella",
                                            "body": "What? I never called this charity? These are not charity because the funds were stolen from taxpayers and not freely given. I am hopeful that charity, that would be freely given, can fill any gaps created by the righteous shuttering of the funding source.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ClimbRockSand",
                                                    "body": "fair enough, but i have no reason to believe there hasn't been plenty of charity not associated with government.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "vvfella",
                                                            "body": "Yes, and I want private charity to take over where there is legitimate need that was previously being filled by the US government",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "ClimbRockSand",
                                                                    "body": "there is nothing to take over",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "vvfella",
                                                                            "body": "We disagree. For example, there were thousands of people receiving their antiretroviral medications through funding from a USAID program. Those people still need HIV meds. I feel for them for losing access, even though I agree with removing this source of funding, so I am hopeful private forces can help bridge gaps in care.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ClimbRockSand",
                                                                                    "body": "yeah, my organization already covered all that.  they're getting meds.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "vvfella",
                                                                                            "body": "?",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "AgainstSlavers",
                                                                                    "body": "Why would you believe that propaganda?",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "vvfella",
                                                                                            "body": "I know doctors who have worked for the program and I’ve known medical students and global health students who rotated abroad at USAID funded clinics.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "AgainstSlavers",
                                                                                                    "body": "Pretty easy thing to make up.",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "AgainstSlavers",
                                                                                                    "body": "Why aren't you donating everything you own to get hiv meds to more people?  Perhaps there's a limit to everyone's resources, and no matter what happens, some people will go without hiv meds.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "vvfella",
                                                                                                            "body": "I’m not sure why you have a problem with me saying I hope people don’t suffer while supporting the ending of a bloated and problematic system. If you oppose private charity, that’s your prerogative, but a weird hill to die on in an ancap sub.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "AgainstSlavers",
                                                                                                                    "body": "Hopes and prayers is a boring self serving topic.  Obviously I'm even more in favor of charity than you are, as i do it myself.  \"Private charity\" is redundant, as there is no such thing as \"public charity.\"",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "vvfella",
                                                                                                                            "body": "Not sure why you don’t think I participate in charity or why you seem to be so hung up on my attempts to be clear with wording despite clearly agreeing with me that USAID ending is a good thing.  I feel you are just trying to be argumentative at this point so I’m going to stop replying. Have a good one!",
                                                                                                                            "score": 0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ExcitementBetter5485",
                    "body": "The money is still there, so can congress just fund new programs? If so, I can't imagine it would take very long, especially given the level of concern that they have shown over the matter.\n\nEither way, I too hope private charity can fill in the gaps where possible. It's great for the cause and it would be positive publicity for any private businesses/individuals who help.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ClimbRockSand",
                            "body": "For decades, USAID and NED have presented themselves as wearing a white hat, helping other countries become more democratic and enlightened. However, much of the real work of the agencies was to foment dissent and at times, overthrow governments that do not comply with Washington’s dictates.\n\nUSAID and NED fund media outlets that repeat Washington’s propaganda, support political opposition factions that want to align more with the White House, and bolster NGOs that facilitate regime changes.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ExcitementBetter5485",
                                    "body": "All the more reason for private charity to help anyone who needs help, if only to prove that the state is not necessary so that these programs won't be taken advantage of or used for statist goals. JFK had a speech about the true goals of USAID that essentially stated what you just said.\n\nEdit: apparently there are statists here who actually support USAID and they are downvoting my comment. Can they explain why on earth they would ever support USAID??",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ClimbRockSand",
                                            "body": "USAID is the opposite of charity.  Private charity already exists.  It's always been proven that the state is not necessary.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ExcitementBetter5485",
                                                    "body": "I agree. I'm not sure if you think that my comments indicated anything different, I hope not.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}