{
    "title": "Censorship is one of their weapons.",
    "author": "RonaldoLibertad",
    "subreddit": "Anarcho_Capitalism",
    "rank": 78,
    "score": 136,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 48,
    "url": "https://www.reddit.com/gallery/1j0depu",
    "id": "1j0depu",
    "selftext": "",
    "comments": [
        {
            "author": "turboninja3011",
            "body": "Wonder what rule exactly was violated? \n\nLike, speaking your mind? \n\nLeftism is a tyranny.",
            "score": 38,
            "replies": [
                {
                    "author": "RonaldoLibertad",
                    "body": "They said I violated Rule 1, which I clearly didn't.\n\nhttps://preview.redd.it/xrc14p3mbxle1.png?width=720&format=png&auto=webp&s=e8b3bafbcbd664b97dcaa8b6a65282437ba20c68",
                    "score": 32,
                    "replies": [
                        {
                            "author": "DeathHopper",
                            "body": "They're masters of mental gymnastics. Not conforming to their narrative is uncivil.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "Zealousideal-Skin655",
                                    "body": "https://preview.redd.it/pn23f06aa0me1.jpeg?width=1170&format=pjpg&auto=webp&s=f3ad7298fdc514dc0a1696cc2e181f80570f3f00\n\nOne could say the same thing about conservatives.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DVHeld",
                            "body": "Ah, the classic catch-all",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AgainstSlavers",
                    "body": "If they ever respond, it is incoherent.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "KrispyCuckak",
                    "body": "Wrongthink",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Zealousideal-Skin655",
                    "body": "https://preview.redd.it/60jz97x3a0me1.jpeg?width=1170&format=pjpg&auto=webp&s=d51c94276b27cc2c1e9cb53564f5c04d2fda9f0d\n\nOne could say the same thing about Conservatism.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "itsmechaboi",
                            "body": "Why not post the actual link instead of a screenshot? Peak reddit behavior.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Zealousideal-Skin655",
                                    "body": "It’s a 2 sec. [Google search](https://www.npr.org/2025/02/26/nx-s1-5308628/trump-white-house-press-access-voa). Don’t be lazy.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "turboninja3011",
                            "body": "Yes, the “leaders” are trash on both sides (the government being the government), but I d say the “followers” are little less tyrannical on the right.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Actual-Jaguar-550",
            "body": "The lefties in Colorado are ruining the state",
            "score": 8,
            "replies": [
                {
                    "author": "balorg",
                    "body": "And they are going after our firearms too. The Colorado GOP is a joke too....",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Actual-Jaguar-550",
                            "body": "Yeah, we are in desperate need of libertarians in Colorado.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kurtu5",
                    "body": "> are \n\nare?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Will-Forget-Password",
            "body": "Hello, You have been permanently banned from participating in Libertarian because you broke this community's rules. You won't be able to post or comment, but you can still view and subscribe to it.\n\nIf you have a question regarding your ban, you can contact the moderator team by replying to this message.\n\nHello, You have been permanently banned from participating in GoldandBlack because you broke this community's rules. You won't be able to post or comment, but you can still view and subscribe to it.\n\nIf you have a question regarding your ban, you can contact the moderator team by replying to this message.\n\nHello, You have been permanently banned from participating in conservatives because your comment violates this community's rules. You won't be able to post or comment, but you can still view and subscribe to it.\n\nNote from the moderators:\n\n>You have been banned or breaking the following rule(s) 5 5) Liberal Talking Points",
            "score": 6,
            "replies": [
                {
                    "author": "Official_Gameoholics",
                    "body": "G&B doesn't have a rule 5.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Will-Forget-Password",
                            "body": "I literally copy and pasted everything. \n\nMaybe you are confused because the first two subs did not even provide a reason for permanently banning me.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Official_Gameoholics",
                                    "body": "Ah, you were talking about r/conservatives.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RonaldoLibertad",
                    "body": "And what did you do to break the rule?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Will-Forget-Password",
                            "body": "You have been banned or breaking the following rule(s) 5 5) Liberal Talking Points",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ripyurballsoff",
            "body": "Censorship is one of their weapons… It’s a private sub and they can run it as shitty as they want to. They probably took one look at your comment history and knew you’d end up saying some horrendous shit eventually. But saying they should get replaced with AI is stupid, and of course going to upset people who live in Colorado. “Fuck your job and replace it with a program that can’t draw hands.”",
            "score": 3,
            "replies": [
                {
                    "author": "RonaldoLibertad",
                    "body": "Just as stupid as saying men who shovel dirt for a living should be replaced with a bulldozer. How horrendous.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ripyurballsoff",
                            "body": "First of all, ai sucks right now. And it takes one person to drive a bulldozer. We just made the shovel better. Having ai supervise those roles right now would be stupid.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RonaldoLibertad",
                                    "body": "The government needs thousands of weather forecasters? That's what's stupid.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RonaldoLibertad",
            "body": "Those first two subs don't have that rule. The third one does, and it shouldn't surprise you. Conservativism isn't libertarianism.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ahent",
            "body": "Well, there is some testing already on AI prediction models and they are more accurate than the Current ones. I believe the European AI model was 20% more accurate and the Google deep mind AI was also more accurate. Here is an article about Google Deep Mind. \n\nhttps://www.axios.com/2024/12/04/google-ai-weather-model-more-reliable",
            "score": 2,
            "replies": [
                {
                    "author": "RonaldoLibertad",
                    "body": "Does the federal government need thousands of weather forecasters? I don't think so.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ahent",
                            "body": "I don't think so either. I am a trained weather spotter (we get no compensation just some training and a way of notifying NWS about events) and I follow a couple weather related subReddits and they are losing their minds. It's tornado season soon how are we going to survive? Stuff like that. I've been in my local NWS/NOAA office and it has a handful of people in there with a LOT of computer stuff. I live in the northern part of Tornado Alley, in fact, our state got the most tornadoes last season (one hit my house and property). I'm not worried.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Pristine_Tension8399",
                            "body": "NOAA does far more than weather forecasts. Tide tables, nautical charts, fisheries management, marine protected areas, water levels, hydrodynamic modeling, collecting baseline climate data, etc.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RonaldoLibertad",
                                    "body": "All things that can and are provided by the private sector.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "whoooocaaarreees",
            "body": "Let me guess. You’ve already been banned from r/Denver too for far less.",
            "score": 2,
            "replies": []
        },
        {
            "author": "museabear",
            "body": "It's a great solution though. Do they like AI or don't they? They don't mind when it's compelling children to commit suicide or pretending to be Jesus, but automating the government is where they draw the line!",
            "score": 2,
            "replies": []
        },
        {
            "author": "VitalMaTThews",
            "body": "lol at this point I can count the subreddits I haven’t been banned from",
            "score": 2,
            "replies": [
                {
                    "author": "RonaldoLibertad",
                    "body": "Same, honestly",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "the_turdy_south",
            "body": "Omg your rights were violated on a privately owned platform! Can you believe they are enforcing property rights?!",
            "score": 2,
            "replies": [
                {
                    "author": "Intelligent-End7336",
                    "body": "Enforcing property rights isn’t the issue, it’s making up the rules as they go. If they had a clear, listed rule and they broke it, fair enough. But when they retroactively decide what’s allowed with easily abused vague rules, it’s not enforcement, it’s arbitrary control. That’s the difference.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "the_turdy_south",
                            "body": "Reddit’s rules are set up for them to make up the rules as they go. You agreed to these terms by using the platform.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "cH3x",
                            "body": "That's liberty. That's ownership.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Zealousideal-Skin655",
                            "body": "That’s capitalism.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RonaldoLibertad",
                    "body": "Did I say my rights were violated?\n\nNow that I think about it, maybe my \"rights\" according to the user agreement were violated.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "the_turdy_south",
                            "body": "Whatever happened you agreed to the terms",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RonaldoLibertad",
                                    "body": "Okay. And the mods violated the user agreement.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "the_turdy_south",
                                            "body": "Oooh who polices the police on Reddit? Cause it a huge deal and all",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "RonaldoLibertad",
                                                    "body": "The mods make up the rules as they go along, and you seem to be cool with it, apparently. This is how reddit became known as a leftist platform.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "the_turdy_south",
                                                            "body": "It’s fun seeing you get so upset about moderating on redddit. Expecting a private platform to have consistent principles is exemplary of how you don’t understand ancapism. Also, twitter isn’t a leftist platform and they are consistently changing rules and silencing people. You’re showing your judgement and principles are inconsistent.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "RonaldoLibertad",
                                                                    "body": "Hahahaha!! So reddit is like Ancapistan? What a great argument you have there.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "the_turdy_south",
                                                                            "body": "Yeah I def didn’t say that lol",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}