{
    "title": "Need some help understanding the Ukraine situation",
    "author": "757packerfan",
    "subreddit": "Anarcho_Capitalism",
    "rank": 77,
    "score": 58,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 169,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1j0nqoa/need_some_help_understanding_the_ukraine_situation/",
    "id": "1j0nqoa",
    "selftext": "I don't dare ask this question in another sub as I will get down voted and probably banned. But I'm honestly ignorant and curious.\n\nIf Russia invading and taking over Ukraine is so bad, that all the Democrats say are founding Trump over it, then why aren't European countries doing more? I know they send supplies and stuff, but if Ukraine is just the first domino, as they imply, why aren't those other domino countries sending their actual militaries to help fight?\n\nI totally understand I'm completely ignorant on this subject, so please go easy on me ",
    "comments": [
        {
            "author": "mechanab",
            "body": "There is no “understanding” it at this stage because we don’t know what’s going on behind the scenes. Anything is just speculation.",
            "score": 62,
            "replies": [
                {
                    "author": "WagglesMolokai",
                    "body": "Correct. I believe large amounts of American money went through Ukraine to get laundered. To whom, though? Call me a fucking conspiracy theorist, I dont care!",
                    "score": 26,
                    "replies": [
                        {
                            "author": "harry_lawson",
                            "body": "Since when is it a conspiracy theory that war can be used to launder money",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Uzi4U2",
                                    "body": "Smedley Butler has entered the chat.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "syrymmu",
                            "body": "The large amount of American 'money' is sent in form of ammunition that was about to be decomissioned anyway",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Futanari-Farmer",
            "body": "Because, realistically, Ukraine is hardly part of any domino, in the worst case scenario, after Ukraine, Russia will fuck around with Georgia due to historical and hegemonic reasons, not because OTAN is expanding, and that is easily proven because Estonia and other countries that neighbour Russia really close are already part of NATO.\n\nWith that being said, if European countries start sending soldiers to fight Russia, that's does nothing but increase the chances of escalating the war.\n\nAgain, aside from what you hear in Reddit, there's no domino, Russia won't touch Estonia (or any NATO member) anytime soon.",
            "score": 55,
            "replies": [
                {
                    "author": "AgainstSlavers",
                    "body": "> that is easily proven because Estonia and other countries that neighbour Russia really close are already part of NATO\n\nHow is that proof of anything when nearly everyone in Russia was not happy about any NATO expansion?  \n\n“I am referring to the expansion of the NATO to the east, moving its military infrastructure closer to Russian borders. It is well known that for 30 years we have persistently and patiently tried to reach an agreement with the leading NATO countries on the principles of equal and inviolable security in Europe. In response to our proposals, we constantly faced either cynical deception and lies, or attempts to pressure and blackmail, while NATO, despite all our protests and concerns, continued to steadily expand. The war machine is moving and, I repeat, it is coming close to our borders.”\n\n~ putin February 2022",
                    "score": 9,
                    "replies": [
                        {
                            "author": "jmmgo",
                            "body": "Do you think Putin would declare the actual reasons for invading the public? That's like believing in US propaganda in 2003 when they invaded Iraq.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Ok-Section-7172",
                                    "body": "I saw Putin only once say \"because I'm trying to restore our borders, these are our territories and we will get them back\". Any other time his explanation was just circular crap.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "AgainstSlavers",
                                    "body": "Do you believe Osama bin Laden’s statement on the 9/11 attacks?  Your choice is to believe putin or believe the enemies of putin who also have no reason to tell you the truth.\n\nEdit to below:\n\nBecause the alternative is believing the obvious BS of \"they hate us for our freedoms.\"  He said he did it because the US bombed the shit out of the middle east.  That makes sense.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Away_Note",
                                            "body": "I have heard answers to this false dichotomy before. Bin Laden has much less incentive to lie than nations who are trying to justify their actions to their people and the international community.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "Bin laden was recruiting too, idiot",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "kiaryp",
                                            "body": "Why would you believe Bin Laden?",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "jmmgo",
                                            "body": "The fact that you wish to believe a jihadist tells that you have really no respect for western values or culture.",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "ClimbRockSand",
                                                    "body": "\"Know thine enemy.\"\n\n\"Keep your friends close and your enemies closer.\"\n\nBoth old western adages for good reason.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "jmmgo",
                                                            "body": "Add this too: Nothing good comes from the East.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "ClimbRockSand",
                                                                    "body": "Never heard that one.\n\nThe russians have been invaded from the west multiple times in the past 200 years, sustaining extreme loss of life (in the tens of millions in ww2 alone).  They have just as much reason to be worried about conflict as we do.\n\nedit: I don't know if you blocked me or what, but my reply won't go through.  The current russians overthrew the communists.  Europe has invaded russia multiple times.  Most communist literature came from Germany.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jmmgo",
                                                                            "body": "Do you really believe Europe or the US would ever invade Russia? It's not possible, not with their strength.\n\nRussia gave the world communism. They are responsible for most of the violent deaths in the world in the past 200 years.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ClimbRockSand",
                                                                                    "body": "most communist literature came from germany.  europe has invaded russia multiple times in the past 200 years.  that's the point.  current russians are the ones who overthrew the communists relatively peacefully; we should not forget that.",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "ClimbRockSand",
                                                                                    "body": "Most communist literature came from germany.  Europe has invaded Russia multiple times; that's the point.  The current russians are the ones who overthrew the communists relatively peacefully.",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "ClimbRockSand",
                                                                                    "body": "The current russians overthrew the communists. Europe has invaded russia multiple times. Most communist literature came from Germany.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "jmmgo",
                                                                                            "body": ">The current russians overthrew the communists.\n\nStalin is literally a national hero in Russia and Putin has colled the Soviet collapse a mistake.\n\n>Europe has invaded russia multiple times.\n\nGermany has accepted its former sins. Russia has never done so.\n\n>Most communist literature came from Germany.\n\nNot true. All Soviet literature is communist.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ClimbRockSand",
                                                                                                    "body": "https://www.brainyquote.com/quotes/vladimir_putin_452527\n\nWhoever does not miss the Soviet Union has no heart. Whoever wants it back has no brain.\n\nVladimir Putin\n\nRussia threw off the chains of communism.\n\nOf course all communist literature is communist, idiot.  Russia is not Soviet, idiot.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ya_Boi_Konzon",
                    "body": "Yeah, no way Russia is becoming some sort of hegemon outside of Slavic countries. They would have absolutely no legitimacy, it would be an administrative nightmare.\n\nFor reference let's take a couple European countries for example. Germany alone has more than double Russia's economy. Just Germany and France have a greater population than Russia. Yeah it ain't happening.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "fk_censors",
                    "body": "Russia has also expressed its interest in invading Moldova, which is right after Ukraine. Putin's incentive is huge, because it would be a very large PR victory for Russia's population (especially since Moldova's president is pro Western and educated in the US, and Moldova has replaced some Soviet era symbols like Lenin statues with crosses and religious shrines, a big affront to the Russians), with minimal risk (Moldova's army is non-existent). The problem is that the majority population in Moldova is Romanian speaking, and many (most?) Moldovans are dual citizens, also having citizenship in neighboring Romania. And Romania, a NATO member, cannot stand by if Russia invades Moldova (it is forced to protect its citizens, the last few times Russia invaded that region it led to literal genocides). That means WW3. That is why Russia and the US are so invested now in getting a Russian puppet in power in Romania, since it doesn't really matter who's in power in Moldova (it doesn't have a real army). But Romania is thwarting the Kremlin plans due to its very anti Russian pro Western fairly Christian population.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ok-Section-7172",
                            "body": "That's exactly right. This is exactly what Putin has said as well.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Secretsfrombeyond79",
                            "body": "I love how the Republicans here are downvoting you because Putin being anything but an Angel doesn't fit their idiotic narrative.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "turboninja3011",
                    "body": "That s not accurate at all. Baltic countries and even Poland are very much a targets",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Away_Note",
                            "body": "Russia couldn’t even take Kyiv. What hope does he have take a much more organized and well-trained army in Poland?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Ok-Section-7172",
                                    "body": "Ukraine is stronger than the other eastern European nations. We keep getting told that Ukraine is weak, it is not.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Futanari-Farmer",
                            "body": "If so, what do you infer is the reasoning for Russia to invade these countries?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "turboninja3011",
                                    "body": "What is the reason to invade Ukraine? \n\nThose territories were once part of the USSR for … reason? So that same reason - whatever it was - may apply again \n\nIt s very hard to reason about what s going on in crazy dictator’s head",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Futanari-Farmer",
                                            "body": "You're skipping over how important Ukraine is for Russia historically and culturally.\n\nThe thing is, Ukraine and Russia have a special relationship that doesn't really apply to the other neighbouring countries you predict Russia would invade.\n\nWith that being said, there's always a reasoning for everyone's actions, simply calling it craziness doesn't explain anything.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Jester388",
                                                    "body": "Yes it's the same relationship that Britain had with India, that the Dutch had with Indonesia, that Spain had with Mexico.\n\nI really don't give a fuck what is important to Russia and neither should you.\n\nPutin isn't crazy or stupid, but he isn't reasonable either.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "mm0nst3rr",
                                                            "body": "More like England and Scotland if the UK would dissolve.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AgainstSlavers",
                                            "body": "“I am referring to the expansion of the NATO to the east, moving its military infrastructure closer to Russian borders. It is well known that for 30 years we have persistently and patiently tried to reach an agreement with the leading NATO countries on the principles of equal and inviolable security in Europe. In response to our proposals, we constantly faced either cynical deception and lies, or attempts to pressure and blackmail, while NATO, despite all our protests and concerns, continued to steadily expand. The war machine is moving and, I repeat, it is coming close to our borders.”",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Last_Patriarch",
                                            "body": "You're contradicting yourself. \n\nSo yes, before recent times it was part of Russia. Hence the \"logic\". If the countries you refer to weren't once part of Russia, then that fear is irrational.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "Away_Note",
                                            "body": "You forgot the 2014 coup funded by the CIA that helped to overthrow a democratically elected pro-Russian leader and replace him with a pro-Western administration.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "jmmgo",
                                    "body": "Russian imperialism. They were part of the empire and the Soviet block before, and Putin wants to restore the old borders. There are also a lot of ethnic Russians living in the baltics because of soviet population replacement.\n\nFundamentally it's about the nature of Russia and Russians. It's in their blood to pillage and rape their neighbors.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "CSDkeeper",
                                            "body": ">It's in their blood to pillage and rape their neighbors.\n\nYou are a complete misanthrope. Is it in your blood I wonder...???",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "jmmgo",
                                                    "body": "No, I am just stating a fact about Russian culture. They have never experienced any liberties or a free society, they have longed for authoritarianism for generations.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "CSDkeeper",
                                                            "body": "These kind of \"facts\", historically, are found in Dark Age mentality and Red Scared... Both are one and the same. Word liberties are hallow coming from you.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BarkleEngine",
            "body": "Without the United States entering the war it is not possible for Ukraine to defeat Russia. And if the United States enters the war, WW3 is likely and every young redditor male between 16 and 25 would be the cannon fodder. To me this is not a good deal.",
            "score": 30,
            "replies": [
                {
                    "author": "Regretsblastype",
                    "body": "My 18 year old just came to tell me the news of this. My only son. He’s pretty stressed about this.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "brewbase",
                            "body": "Tell him to buy a wig and dress. Just in case.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Regretsblastype",
                                    "body": "If I didn’t share custody with their dad I could have moved us out of the country by now. Life is complicated.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "brewbase",
                                            "body": "I sympathize.  Not sure where you could move that is less complicated. All the places I am sure would not be pulled in to a Europe/Russia war come with their own complications.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WagglesMolokai",
                            "body": "This is what I have learned... Fastest way to becoming a peacenik - have a teenage son",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Stuhl",
                                    "body": "Look at the average age of soldiers in Russia and Ukraine. High chance you're going with him into the trenches.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Regretsblastype",
                                    "body": "Didn’t take that. Just hate that it’s happening.\n\nEdit to say my first and second child are 11 years apart. It has nothing to do with the gender of any of my children. It has everything to do with how the government eye the gender of my children. My youngest is a female and declares she won’t be safe someday either. I know and I’m sorry. I get why my brother chose not to have kids. It’s hard.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TheSov",
                            "body": "wars are no longer fought that way, u know those \"ukranian\" drones? they are made by raytheon.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fk_censors",
                    "body": "Ukraine doesn't have to defeat Russia, it just has to hold out enough until the Russians give up. That's how many smaller nations survive. And Europe has promised to help Ukraine do just that.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "sadson215",
                            "body": "Russia isn't going to give up because this is an existential threat to Putin.  Putin has Saddam level control over Russia.  \n\nAs for the people they haven't progressed much from their old ways in much of russia. Many people outside of the cities in the countryside have their own animals and grow their own food.  Their heat is from wood.   Simply put they don't give a fuck.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "Kiev was the capital of Russia. Many Russians have family in Ukraine and vice versa. Western meddling in Ukraine is very unpopular in all of russia. This is not a putin issue. If putin weren't doing what he is doing, he would be overthrown by Russians and replaced with someone who would do what he's doing. This is like if NATO collapsed and then the Warsaw Pact threatened to take Mexico and bombed Americans living in Mexico for 10 years. The US would invade Mexico and threaten nuclear war. This is easy to understand geopolitics. People are pretending not to understand for political reasons.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Stuhl",
                                            "body": "> Mexico \n\nWhen people make these comparisons, they always go for Mexico, Canada or Cuba as neighbors of the US. But the correct comparison would be Dixieland, New England or California.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "I suppose you could make that argument, but Ukraine hasn't been a part of the current russian government until recently.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "jmmgo",
                                            "body": "It's not really western meddling, though. The whole modern history of Russia consists of autocratic dictators invading their neighbors. It's not surprising that their neighbors seek western support. Nobody took Poland or the Baltics from Russia. They gained their independence and sought for the west.\n\nRussians obviously are the worst victims of their own doing. Unfortunately they cannot help it, they destroy and rape everything they lay their hands on.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "jdmart402",
                                                    "body": "100% western meddling. Ukraine was a western puppet state, a tool for us to annoy Russia. Ukraine and Russia would be bros had we not driven a wedge between them.    The whole modern history consists of US meddling.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "jmmgo",
                                                            "body": "Have you ever heard of the Holomodor? That's what awaits Ukrainians under Russian control.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "jdmart402",
                                                                    "body": "The old \"we must kill eachother to avoid death\" platitude. It's not gonna happen. Russia and Ukraine had healthy relationship before we fucked it up 2014, that's what this war is about.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jmmgo",
                                                                            "body": "Haha, no. It's foolish to think that the US is the root cause for Ukrainians to seek closer relations with the EU or the west. The core reason is better economic opportunities with European cooperation. Ukraine was simply following the rest of the Eastern block countries, having witnessed the success of free market economics in action.\n\nNo sane person would want anything to do with Russia or Russians. They have no respect for personal liberties, they long for authoritarian rulers. It's really sad how much suffering Russians have caused and will cause in the future.\n\nIt's pretty telling that you even entertain the idea that it's a good policy to have a healthy relationship with an authoritarian state such as Russia.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "jdmart402",
                                                                                    "body": "If what you're saying is true we wouldn't have pumped over 5 billion dollars into Ukraine around 2014 and ousted their democratically elected official, who we hated because he had good relations with Russia. Lol im sure the \"success\" of the eastern bloc countries is worth becoming mortal enemies with your powerful neighbor over...Having good relations with an authoritian state is much better than being a hollowed out puppet state being sacrificed in a proxy war.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "jmmgo",
                                                                                            "body": "Who's \"we\"? And Poland, for example, is hardly a puppet state.\n\nAnd yes, it has been worth it. Liberty is the way. Sad that you disagree.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "This is pure dehumanizing tripe.  Ethnic hatred will not help you understand geopolitics. The fact is that the US government would do the same thing if NATO had dissolved in 1990 and the Warsaw Pact threatened to take Mexico and then began supporting the Mexican government in bombing Americans living in Mexico. That is the mirror image of what happened in Ukraine.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "jmmgo",
                                                            "body": "You talk a lot about geopolitics but refuse to understand the actual geopolitics of Eastern Europe. It's 100% rational geopolitics for the Baltics, Poland, Scandinavia and Ukraine to seek western support because they neighbor Russia, and Russia has a history with autocratic leaders invading their neighbors. That's actually realpolitik from their perspective.\n\nI am simply stating the fact that imperialism, wars of aggression and systematic plunder and rape as a measure of war is part of the Russian culture through their state. Russians are also victims of this, they have never had a regime that even somewhat resembles the freedoms and liberties people enjoy in the west.\n\nYour whole Mexico analogy is a complete failure. There simply would have been no reason for Mexico to seek support from the Warsaw pact.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AgainstSlavers",
                                                                    "body": "You refuse to understand how analogy works. If the Warsaw Pact behaved like nato by continuing to expand when its reason for existence had died, then it would seek to control Mexico to bleed America dry, which has been the stated goal of nato since the fall of the USSR.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Secretsfrombeyond79",
                                    "body": "> Russia isn't going to give up because this is an existential threat to Putin. Putin has Saddam level control over Russia.\n\nRussia doesn't need to give up, they only need to loose enough manpower and infrastructure to cripple their economy for the next 50 years. And at this point if the war ends now they are gonna end up recouping their losses pretty quickly. Literally all the money already spend in ukraine is gonna be a waste.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sadson215",
                                            "body": "It's war.  It is the definition of waste",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Secretsfrombeyond79",
                                                    "body": "Screwing over the second power of the Bricks, which are a bunch of socialist dictatorships spreading their influence around the world, hardly counts as a waste.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Shamalow",
                    "body": "Let me correct that\nBy definition, of course it would be easier with the us. But they are not completely needed for victory. Really depends of the others allies of Ukraine. But reading your comment I'm not even sure you know Ukraine has other allies...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tarriffic",
            "body": "The best way to frame this, is the money pipeline. As long as money comes from some distance source, flows through your hands and you get a small percentage of it, and then goes out to a cause that is being made popular through the media, then we're all making money and we maintain the status quo. \n\nFor 5 years, the money source has been the USA. It flows through everybody's hands, everybody gets their little piece of it, and that's why the war has continued without end. \n\nDamn, somebody upset the apple cart. America's not footing the bill anymore. Who wants to step up and provide billions upon billions of dollars? Remember, we are Europe and we're on the take, so we're not going to step up and pay for it out of our pockets.\n\nCall this Vietnam 2.0.   In Vietnam, they had a great money pipeline set up, and everyone was making money hand over fist, except for that one pesky little detail. The body bags had Americans in them. That was the great undoing, that turned Americans against the war. Otherwise, we'd still be fighting it. \n\nUkraine is Vietnam 2.0, the improved edition. It's a great money pipeline, but new and improved. It's not Americans in the body bags, it's ukrainians. Now all the Americans don't mind an endless war, because it's not our people in the body bags. \n\n\"Fer Freedumb !\"",
            "score": 36,
            "replies": [
                {
                    "author": "Shamalow",
                    "body": "Us has given less donation compared to it's gdp than many other nations. Even not in relative, the sum given by europe isn't that far from the us aid.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "AgainstSlavers",
                    "body": "Americans don't care about freedom anymore. \"Fur democrazy! With a dictator in ukraine\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cH3x",
            "body": "That's a lot of \"ifs.\"\n\nI believe the anarcho capitalist point of view is, individuals who support Ukraine should be free to support Ukraine, those who support Russia should be free to support Russia, and those who don't care should be free to support neither. One's State should not be able to tax citizens to entangle them in support of one side or the other.",
            "score": 14,
            "replies": [
                {
                    "author": "fk_censors",
                    "body": "Shouldn't anarcho capitalists not support either, as both countries are run by governments (albeit one is the lesser evil, the less statist of the two)?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Ladzilla",
                            "body": "Not necessarily.\n\nOne could live in an anarcho society and still decide to give money to another centralised society if they wish.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "AgainstSlavers",
                            "body": "Which do you think is less statist?",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "fk_censors",
                                    "body": "Culturally, Ukraine by far. Ukrainians have some glimmer of European values and respect for individual rights, whereas Russians value a big, violent daddy. Again, I'm talking about cultural values. And when I say European values, I'm aware that they are not ideal from a libertarian point of view, but they're light years ahead of Russian values.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "AgainstSlavers",
                                            "body": "That's your opinion, and it's wrong. Ukraine suspended elections, and putin was just reelected.",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "MurosMaroz",
                                                    "body": "XDdd totally not rigged",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "AgainstSlavers",
                                                            "body": "Xdddddd ukraine most corrupt country in Europe",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "eddypc07",
                                                                    "body": "After Russia, Belarus and Moldavia, maybe",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AgainstSlavers",
                                                                            "body": "Welcome to Ukraine, the most corrupt nation in Europe\n\nhttps://www.theguardian.com/news/2015/feb/04/welcome-to-the-most-corrupt-nation-in-europe-ukraine",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "PacoBedejo",
                                    "body": "Neither. Both are enslaving men into the meat grinder. Fuck them both.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "AgainstSlavers",
                                            "body": "Agreed, but you're in a thread where ukraine is celebrated",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dirty-Dan24",
            "body": "“The war isn’t meant to be won, it is meant to be continuous.”",
            "score": 14,
            "replies": [
                {
                    "author": "fk_censors",
                    "body": "While you may find this quote clever, I'm not sure how it applies to this scenario.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "Heil_S8N",
                            "body": "the whole military-industrial complex is having a field day remodernising militaries with new systems as said militaries throw out their obsolete old hardware in a package to ukraine. look at raytheon and rheinmetall stocks\n\nat the same time, the western world is gaining invaluable knowledge about modern warfare and how wars are fought in the 21st century, of which so far we've had no other example of",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Dirty-Dan24",
                            "body": "NATO isn’t serious in its fight for Ukraine because it is a money laundering scam. If we really wanted to fend off Russia we could, but the war is literally not meant to be won. How does that quote not apply?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "fk_censors",
                                    "body": "There were leaked conversations from Biden and his cabinet. They were saying that they would help Ukraine as much as possible, but not too much because they didn't want nuclear war. This sounds pretty logical. So the goal doesn't seem to be to prolong the war for the sake of prolonging the war, but rather for helping Ukraine fend the Russians for as long as possible but without crossing some red line that can lead to nuclear war. The war is not meant to be won, but it's meant to wear out the Russians until they find some other hobby (just like what Vietnam, Afghanistan, or the original 13 British colonies did).",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Dirty-Dan24",
                                            "body": "Because politicians always tell the truth!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "fk_censors",
                                                    "body": "These were leaked conversations so they weren't held with the media in mind. I'm just saying this was the logical approach. Europe is becoming more aggressive towards Russia but the historical antagonism is real over there. Russia was a scourge to the continent.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Dirty-Dan24",
                                                            "body": "People like Ron Paul have been predicting war with Russia since 2014. If they really wanted peace they could’ve started negotiations years ago, long before the actual war started. This issue didn’t just spring out of nowhere when Russia invaded.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "fk_censors",
                                                                    "body": "By that logic, the US should have negotiated from a position of strength with Russia. Not the groveling that the current administration is doing. Unless the current administration also wants the war to continue forever. You can't stop Russia by groveling and giving in, its history 101.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Dirty-Dan24",
                                                                            "body": "Of course the current administration wants war forever. Every administration does. That’s why we’ve been at war the majority of our history.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "fk_censors",
                                                                                    "body": "Are you sure the Trump administration really wants it? My gut feeling is that Trump thinks the bear will play nice if he talks sweetly to it, offers it honey, and tickles its balls. That's because Trump does not understand bear behavior.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Dirty-Dan24",
                                                                                            "body": "I don’t even think “The Trump administration” is in power, or any other administration for that matter. They’re all puppets run by the MIC and financial elite, who of course have a vested interest in perpetual war.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "adelie42",
            "body": "The only book I know that puts the entire situation into proper context with verifiable sources is Provoked by Scott Horton. Daryl Cooper is another good one of you want a Podcast to listen to. There's a lot of history.\n\nYou don't need to accept their views, but they know their history.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Couch_Philosopher",
            "body": "The non-conspiracy answer is that countries with nukes never want to have direct conflict with other countries with nukes. If Europe sends boots on the ground and Russia starts killing Europeans whose countries have nukes, there is pressure from those countries to retaliate and escalate, and vice versa with Russia against those nuclearized European nations. You'd be starting another chain of escalation dominoes that can fast track towards nuclear war, and everyone is scared of that. \n\nUkraine is being used as a meat shield for Europe so that they don't have to begin a scary possibly nuclear war with the aggressive Russians. And Europe is sending money and aid to Ukraine to aid them in the war. I would argue not enough and that aid should be upped if they want Ukraine to sufficiently defend itself, but that is the situation, everyone wants the benefit of Ukraine protecting them from Russia but nobody wants to pay for it, kind of a Prisoners dilemma situation where Europe was happy to let the US foot the bill and reap the rewards themselves while spending far less. \n\nNow that Trump is revealing himself to be unwilling to aid Ukraine anymore, Europe will have to step up and increase their support, which is what will happen if Ukraine doesn't accept the horrible deal that Trump is 'offering'.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Alternative-Dream-61",
            "body": "I think there is some legitimate concern that escalating too far will cause Putin to tap into their nuclear arsenal.  Aside from that, any weapons that they send them will potentially end up in Russian hands for reverse engineering, and if they gave Ukraine enough aid to win you'd then have a heavily armed Ukraine that just won a war and is battle hardened.\n\nThere's also the theory that they want this to last as long as possible.  It's an excellent test location for new weapons and tactics for what will work on a modern battlefield.",
            "score": 18,
            "replies": [
                {
                    "author": "lone_jackyl",
                    "body": "We could give Ukraine everything they need but they still don't have the man power to use it.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Ladzilla",
                    "body": "Correct, I believe they asked for F35s but the Americans wouldn't send them.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wrathofsteel",
            "body": "It's a proxy between the US and Russia, the US being the biggest military deterrence in nato. Europe is more reluctant to get directly involved since help from the US would involve trans-Atlantic mobilization. Also, Russia has roughly the same number of nukes as the US.",
            "score": 3,
            "replies": []
        },
        {
            "author": "lone_jackyl",
            "body": "Europe isn't doing more because they've been dependent on daddy usa since ww2. Europe needs to step up and do it all to protect themselves",
            "score": 9,
            "replies": [
                {
                    "author": "fk_censors",
                    "body": "Europe is doing quite a lot. A few neighboring countries like Poland and Romania took in millions of Ukrainian refugees - that costs quite a lot of money! Plus they are really helping (quietly) with all the logistics and weapons shipments into Ukraine. Europe doesn't have a big military because the Americans imposed this after WW2 - Europeans would behave and would give up any ambition on the world stage, and Americans would cover their security. Now the Americans are changing their tune, and it looks like the Pax Americana will collapse into a multi-polar world. I hope everyone enjoyed the peace and prosperity while it lasted.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "lone_jackyl",
                            "body": "You really don't understand how international trade works do you. Peace and prosperity will continue. Ukraine needs to realize they aren't going to win. They aren't ever getting that land back. And if they want help they are going to have to come off something. Nothing is ever free.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "fk_censors",
                                    "body": "It's not about the land. If Ukraine stops, Russia has more potential to regroup and finish it off in the near future. And Ukrainians (like most Europeans) know first hand what happens if they get overrun by Russians. Ukraine doesn't need to win. It just needs to hold off enough like Vietnam, Afghanistan, or the 13 British colonies in the Americas. I'm sure Zelinsky would be happy to give a lot to the US in return for genuine security guarantees, but the US is balking at that.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "lone_jackyl",
                                            "body": "They don't have the man power to hold out that long.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "AgainstSlavers",
                                            "body": "If you care that much, then go fight in ukraine. If you don't care that much, then i don't care about your opinion.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "unintegegratedshadow",
                    "body": "They won’t because despite their screaming they all still buy Russian oil. Getting more involved directly is too much of a risk for their energy needs.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "lone_jackyl",
                            "body": "That's their problem not ours",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "loonygecko",
            "body": "A lot of people feel the real reason that the war was pushed by the west was as a proxy war to damage Russia and that Putin probably does not intend to invade the entire west in the first place.   The current Russia is NOT the same as the Soviet Union, there is no reason to assume it will act the same any more than one should assume Germany will still try to invade a bunch of countries because it did in WWII. \n\nYou also should understand the history that happened before Russia invaded.  Ukraine since it was created after the Soviet Union breakup has always had a Russian ethnic east side that speaks Russian and a more western centric anti Russian west side.  Tensions built between the two sides over time. The entire Ukraine is a country cobbled together with territories that were never a single country in the past, it does not have a cohesive single culture.  The east with it's Russian speaking people wanted friendly relations with Russia and access to low cost energy supplies and the benefits of the Russian market place. The west wanted to cut off Russia no matter the cost. Blocking Russian energy badly hurt the economy of the east which was poor already but the west did not care.  The east had a continually degrading economic situation.  At the same time, there was a constant battle between Russia and the EU/USA to control the leadership of Ukraine.  Finally the USA/EU won that manipulation, and there is good evidence the USA used some terrorist tactics to force out the previous leadership. \n\nThe new EU centric leadership started inacting anti Russian rules like banning and altering Russian street names in the east and making decisions that badly hurt the economy in the east. Eventually the eastern regions demanded to break away from Ukraine and become a separate independent territory.  Civil war broke out.  The west would not let the east go and the west had all the tech and EU backing and was winning. Then Russia helped the east.  Eventually a peace deal was made that said if the east voted to leave, they should be allowed to leave. The east did vote to leave but the west claimed it was a corrupted election and still didn't let them leave. \n\nIT was complicated by known Nazi fighters from the west (Azov batallion etc) refusing to stop fighting the east separatists even when western leaders told them to stop.  These fighters were the main fighting force of the west and still have a lot of power even now, they would make decisions independently and that complicated any attempts at peace.  It is believed Zelensky still fears these factions, and these factions have threatened his death if Zelensky defied them.  So there was almost like a 3 way civil war at this point in Ukraine with both USA/EU and Russia also meddling.  \n\nFor 8 years, western Ukraine bombed Eastern regions of their own country, with the eastern regions insisting they should be independent now by the previous treaty and demanding to be left alone and trying to keep the west from taking back their  territory using support from Russia. Russia demanded the previous treaty be honored but the west said nope and made counter accusations against Russia meddling. \n\nEventually Russia decided to just go into the ethnic Russian territories and take control and end the fighting.  THe USA and Eu then jumped in on the other side, hence the Ukraine war you now have.   Why did the EU not do more? I think some of the EU countries are not fully convinced Russia wants anything more than the rest Russian speaking territories that are already fairly pro Russian.  Some of the others were likely happy to let the USA pay for it since Biden volunteered.  The Eu and now also the USA are kinda screwed now as we already sent Ukraine close to all of our stock of ammo and shells and we are slow to make more since we do not have good manufacturing, unlike Russia.  \n\nAnd the EU economies are sinking like breaks of lead due to no longer having access to low cost Russian energy and already spending a lot of money on Ukraine. Frankly the UE does NOT have the money our resources now to do what the USA was doing, even the USA does not have it really, all that money we sent was borrowed money put on 'credit card' and added to our national debt.  Now our military is also heavily degraded.  Plus Ukraine is losing the war badly despite all the west's best efforts.  It's a money pit that can't be won. Also we risk WWIII if we try to fight Russia directly, they have nukes after all and if you invade them directly, they would probably use them before letting the west conquer Russia. \n\nIf you don't conquer Russian, it can possibly fight forever in Ukraine so there's IMO no winning in Ukraine at this point.  The west had hoped to destroy Russia with sanctions and a proxy war but the Russian economy is surprisingly doing fine, Russia built huge trade agreements with our enemies and also China, and Russia has built many manufacturing facilities to support any war efforts, so the western plans failed pretty badly and some feel the west should cut their losses and stop throwing good money after bad. \n\nSo my question is, why would the EU even want to continue supporting the war?  Some Eu countries just want out of spending money they don't have on a losing war when their own economies are struggling, while others seem convinced Russia wants to invade all of Europe and so they want to continue, so there's internal disagreement in the EU as well.",
            "score": 7,
            "replies": [
                {
                    "author": "fk_censors",
                    "body": "You made some good points, especially regarding the background (even if you downplayed Russia's more severe involvement, like poisoning a presidential candidate, or shooting down a civilian airplane, which the West never went as far as doing). However, the fear of Russia in that part of the world is justified, since Ukraine is not the only country which was invaded by Russia since the breakup of the Soviet Union. Russia used the same simplistic rhetoric (the supposed desire to protect ethnic minorities) to invade Moldova (where they still have troops!) and Georgia. They have kept funding separatist groups in many neighboring countries, like in Kazakhstan, fomented ethnic strife between Armenia and Azerbaijan, etc. These hotspots created by the Russians are basically an entry point into all of those former republics for Russian troops. Russian authorities also make repeated threats against the Christian European countries nearby (Poland, the Baltics , Romania) which serve as an antidote to Russia's bankrupt economic model. If these countries keep on thriving and Russia stagnates, Russians may eventually find out and ask themselves what their leadership is doing wrong. The Russians are itching for a fight, and their economic model is disastrous - leaving their leadership with only one option of appeasing their impoverished and oppressed population: conquest and oppression of new regions.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AgainstSlavers",
                            "body": "> The Russians are itching for a fight, and their economic model is disastrous\n\nProof?  US has invaded far more places in the past 35 years than Russia has.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "fk_censors",
                                    "body": "Whataboutism. Whatever America has done does not change the economic model of Russia. Which has basically been a war economy since the Bolshevik revolution, they cannot really produce anything else worthwhile other than raw resources.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "AgainstSlavers",
                                            "body": "It's pertinent. You're ignoring the fact that current Russia is not USSR. There is no evidence it's a \"war economy\" whatever that is, and hydrocarbons and uranium are useful to the world. US has invaded many more countries recently, but you're not concerned about that. You're a hypocrite.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "fk_censors",
                                                    "body": "You make no sense. I've criticized America for its actions when the subject was America. Now I'm criticizing Russia (its leadership is the same as the USSR's, a bunch of KGB assholes).",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "loonygecko",
                                            "body": "Lets see your evidence that Russia had a war economy before 2022?  Russia's main exports were indeed energy sources and development of LNG and they made a lot of money from those, you trying to minimize that is silly.  Energy is one of the most important and useful products in the world and many EU countries are now totally effed due to their refusal of Russian sources.  Meanwhile Russia is mostly self sufficient with well developed manufacturing, in house food production, and of course energy sources, not to mention they have diligently avoided carrying much debt, they have one of the lowest debts in the world even after the sanctions and the war.  We should be taking notes on how to properly manage an economy.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "loonygecko",
                            "body": ">(even if you downplayed Russia's more severe involvement, like poisoning a presidential candidate, or shooting down a civilian airplane, which the West never went as far as doing)\n\nThere's a LOT of shxt that west did too, which I also skipped.  The idea that the USA govt acts like they are all innocent is ludicrous.  As for invading countries and supporting terrorists, the USA does it just as much, in fact we do it more. We created Al Queda, we funded and supported Saddam Husein, now we are backing sharia law Islamic terrorists in Syria, and how many countries did we coup?  For instance we couped the democratically elected leader of Iran in 1953 simply because he wanted to investigate western oil companies operating in his country.  https://en.wikipedia.org/wiki/1953\\_Iranian\\_coup\\_d'%C3%A9tat#:\\~:text=The%201953%20Iranian%20coup%20d,19%20August%201953,%20with%20the  So yeah, maybe we should be looking in the mirror, when it comes to countries in existence now doing evil things, the USA wins hands down and a huge chunk of current world problems are rooted in our own meddling and evil actions.  We need to stop.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "> A lot of people feel the real reason that the war was pushed by the west\n\nHow do they reconcile that with the fact that Russia started the war?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "loonygecko",
                            "body": "Because there was an 8 year civil war against Russians in eastern Ukraine before Russia even invaded and by many accounts it is likely that the USA couped out an existing freely elected Ukrainian president in order to install their pro western puppet.  So there were precipitating events that lead up to the full invasion, that was an escalation of war, not the actual start of it.  Plus the west has since repeatedly touted the war as a great way to damage Russia through a proxy war and it's quite likely that a peace agreement between Putin and Zelensky was worked out very early in the war but the west sent Blair to scuttle it, thus it is likely the west wanted the war and did things to make it more likely.  \n\nI'm actually surprised personally that Russia came out with the winning end of this stick, I was certainly not betting on them doing this well back when this started.  So i can see why the USA at the time thought this was a good plan, I mean historically the USA does not care if a lot of people die as long as the USA gets what it wants.  By knocking Russia out of the EU energy markets, they now are forced to pay premium rates for imported USA energy, so the energy market here did benefit but the USA people won't see much of that benefit sadly.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BidSmall186",
            "body": "There is no happy ending for Ukraine. The fighting either stops now and they get a bad deal and likely lose territory or the keep fighting and many more Ukrainians and Russians will die and they will still get a bad deal and lose territory while the US and European powers shower them with weapons and funding that maybe they can’t fully afford to give up. Another alternative is America and Europe send troops and then you have nuclear armed nations engaged in direct combat…WW3. \n\nRussia has the upper hand, no one wants WW3, and Russia has the numbers and seems willing to sacrifice large numbers of them to advance their cause. Ukraine has fought valiantly, more so than anyone expected, but their fate was sealed the moment that the invasion started and everyone is still coming to terms with that reality.",
            "score": 4,
            "replies": []
        },
        {
            "author": "pebble666",
            "body": "It's not trump wanting to do less necessarily, it's him blaming Ukraine on the war for being invaded. It's him \"negotiating\" with Putin without letting Ukraine have a voice. It's vance asking if he's even said thank you when he did that day. Including aid bills Vance voted against and trump opposed.\n\nIt's also not about sending actual militaries as that would be joining the war, it's sending financial aid and military aid. The latter the usual has done in huge amounts due to the large stockpile of old equipment the us has.\n\nThe master negotiator, who pulled the same dumb shit with the Taliban, spent two hours talking to Putin and immediately flips to ridiculous Russian propaganda, like questioning if they even invaded.\n\nThen, the hive mind maga supporters have mostly jumped on these talking points and flipped views on topics over night.\n\nhttps://preview.redd.it/e7eg9hlh25me1.jpeg?width=1080&format=pjpg&auto=webp&s=832998055b32ac74d9380ab1ab3a6b69e0078c0a\n\nedit to add analysis of us vs europe total aid, done and planned: [https://youtu.be/w0B4eE8q2ug?si=GxKw2dpYo5DZ5NK\\_](https://youtu.be/w0B4eE8q2ug?si=GxKw2dpYo5DZ5NK_)",
            "score": 2,
            "replies": []
        },
        {
            "author": "welcomeToAncapistan",
            "body": ">then why aren't European countries doing more?\n\nMost of them barely have a military. Many of the more \"sensible\" ones, which is to say the ones that border Russia and so would be next, have to balance help for Ukraine with keeping their own armies in fighting shape. All of that in addition to the fact that the US economy is larger than the entire EU combined.\n\n>why aren't those other domino countries sending their actual militaries to help fight?\n\nBecause right now their homes, power plants, factories etc. aren't being hit with missiles - and if they did send their armies to fight that's exactly what would happen.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fk_censors",
            "body": "European countries did quite a lot for Ukraine. For example, Poland, Romania, even dirt poor Moldova took in millions of refugees and housed and fed them, and set up Ukrainian language schools for their children.",
            "score": 2,
            "replies": [
                {
                    "author": "PacoBedejo",
                    "body": "They did a lot for the PEOPLE who were able to flee Ukraine's and Russia's evils.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mm0nst3rr",
                    "body": "That is actually opposite to helping them win the war.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ultrafisk",
            "body": "Russia and their aggression is an existential threat to us living close to their boarders. And while the russian military is seen as weak and incompetent after their invasion of Ukraine Russia is still a nuclear power, direct military intervention in the war is simply seen as too risky.",
            "score": 3,
            "replies": []
        },
        {
            "author": "bobby_zamora",
            "body": "Well Europe has given more money than the US, and almost all European countries have upped their defense spending, so they are doing more...",
            "score": 5,
            "replies": [
                {
                    "author": "757packerfan",
                    "body": "I know they have given money, I'm specifically asking why they aren't doing more than money. Like actually sending their army if they are so afraid of Russia taking a Ukraine.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "bobby_zamora",
                            "body": "The US was quite against this due to the possibility of escalating the war. I think with them dropping support, this is a real possibility ",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "kanaka_maalea",
                            "body": "They have no real defense forces to provide.  They have grown dependent upon the US to defend them as a trade off for going along with our Oil and Opium wars.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AgainstSlavers",
                    "body": "Proof?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bobby_zamora",
                            "body": "https://www.bbc.com/news/articles/crew8y7pwd5o",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "The BBC has a long history of lying. Why do you expect me to trust a known propaganda operation?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "bobby_zamora",
                                            "body": "You are beyond help.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "You are a propaganda puppet.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "bobby_zamora",
                                                            "body": "https://www.ifw-kiel.de/publications/news/ukraine-support-tracker-europe-clearly-overtakes-us-with-total-commitments-now-twice-as-large/\n\n\nAnother source if you want, but claiming the BBC is propaganda is not arguing in good faith.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "AgainstSlavers",
                                                                    "body": "It's British state TV. You can't be that stupid, can you?\n\nThe link even says commitments. That's empty promises from known lying governments.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Shamalow",
                            "body": "I think his point is in financial aid in us and eu seems pretty much alike. https://www.statista.com/chart/28489/ukrainian-military-humanitarian-and-financial-aid-donors/\n\nBut take a good look at that chart, if you wanna include aid from eu you have to consider \"europe institutions\" + each eu country individually. \n\nSo if we take all the number the total aid between eu and us is similar, little bit more from the us though. https://www.usnews.com/news/best-countries/articles/these-countries-have-committed-the-most-aid-to-ukraine\n\nAs for \"commited aid\" which by definition ukraine hasn't received yet. Eu promised much more than us. But true, promises are only promises.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "So you basically admitted he's wrong.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Shamalow",
                                            "body": "Dunno I didn't make the initial claim.\n\nBut sure buddy you're right and you won the reddit game bravo!",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "Yes you know. Thank you for wasting your time.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Southernboiiiiii",
                    "body": "don't tell them the truth, the don't wanna hear it",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beneficial_Slide_424",
            "body": "Most EU countries don't have a big army and are not prepared to fight. In the region one of the biggest / experienced army belongs to Turkey, as they constantly face threats. If EU switched to focus on military production / building bigger armies, it could take years until they are ready. Currently they depend on US/NATO for their security, and can't risk war with Russia alone. Thats how I read it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Substantial_Cable_51",
            "body": "Fear of escalation, but I am willing to bet after yesterday's debacle we will see the European nations begin to step up further.     3 years into this war the Russian war machine is in pretty bad shape already.     A year ago they were having to get shells from north korea...    their Soviet stockpiles are non existent now.     Now is the time to support Ukraine.   Not a popular opinion in this sub for some mind numbing reasoning.",
            "score": 2,
            "replies": [
                {
                    "author": "CakeOnSight",
                    "body": "prove anything you said",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Substantial_Cable_51",
                            "body": "Go to any of the Ukrainian war subreddits, or combat footage or non credible defense.    It's blatantly obvious.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CakeOnSight",
                                    "body": "Reddit isn't proof",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "crankbird",
            "body": "Because the EU for the most part, and Germany in particular let its defence industrial base wither. US policy helped here because it was in the US’s interests to keep Europe and others dependent on US supply chains for weapons, but a lot also goes to an unwillingness to maintain the 2% of GDP everyone agreed to, (and then for the most part reneged on) going to maintaining the flow of orders that keeps the factories and skills open and efficient. \n\nIn 2022 average Across the EU was 1.2%, it’s now just under 2% but it takes 10+ years to build up the kinds of expertise needed unless you start borrowing from industry that produces useful / consumer goods. This is particularly challenging when you’ve sent  your industrial (eg factories that make stuff) base to China and replaced it with post-industrial activities like finance, marketing and “professional services” that thrive on creating and maintaining bureaucracies.\n\nCompare that to the USA at about 3.4% of GDP or Russia at around 5 - 7% or even Australia at a little over 2%\n\nAt the other end of the scale are free riders like Ireland at 0.3% \n\nNone of the EU countries have deep stockpiles of weapons because what’s happening in Ukraine was never ever meant to happen ever again, it was unthinkable. Now they have to rebuild their stockpiles because Russia invading them is now no longer unthinkable. \n\nThe US does have surprisingly large stockpiles of stuff, but even then they are running concerningly low on things like 155mm artillery shells. A lot of that stuff which was nearing the end of its shelf life got sent to Ukraine on lend-lease, but even though the chances of anyone invading the US is unthinkable, it’s seems we now live in an era where the unthinkable is turning into a daily occurrence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "morabund",
            "body": "I guess I have a different opinion than most i've read on this thread.\n\nThey believe what they're saying, but at the same time they're expecting someone else to pay the cost.\n\nIt's like welfare. The u.s. has paid the cost of european security for so long that none of the european nations have the stomach to do it themselves. So they try to pay for it as a unified block. But because the eu is a flawed and bureaucratic organization, the aid ends up being complicated and too little. \n\nFrance, britain, germany, etc.. each have more than enough resources to support ukraine to the point that they push the russians out. It's just that none of them will do it unilaterally unless the rest of the continent join the effort.\n\n\nIn short it's kind of like the tragedy of the commons or the bystander effect. No one country is taking responsibility unilaterally so they all sit around waiting for someone else to fix the situation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConsiderationOk7699",
            "body": "This is the big R if your lot uber liberal you get down voted and banned",
            "score": 1,
            "replies": []
        },
        {
            "author": "American_Streamer",
            "body": "European countries are heavily supporting Ukraine, but they are not sending their own troops directly into combat because that would risk a full-scale war between NATO and Russia, which they fear could escalate into a nuclear conflict. NATO’s collective defense agreement (Article 5) only applies to member states, meaning that NATO countries are not obligated to send troops to defend Ukraine. They do, however, provide weapons, training, intelligence and financial aid. If European or NATO countries sent their troops into Ukraine, Russia could justify retaliating against those countries directly, potentially turning the conflict into a World War III scenario. Instead, the West has chosen to arm Ukraine so it can defend itself.\n\nGermany, UK, France, Poland and others have sent tanks, air defense systems, ammunition and other military hardware. The U.S. and European countries have given Ukraine intelligence and long-range missile systems. Training of Ukrainian soldiers happens in NATO countries like Germany and the UK. Economic and humanitarian aid to keep Ukraine's economy and infrastructure functioning.\n\nThe idea that Ukraine is the \"first domino\" means that if Russia is not stopped, it could attack other nearby nations, particularly Moldova, the Baltics (Estonia, Latvia, Lithuania), or even Poland. However, unlike Ukraine, these nations (excluding Moldova, which still cooperates with NATO through the Partnership for Peace (PfP) program) are NATO members, so an attack on them would trigger a direct military response from NATO.\n\nCountries like Poland, the Baltics and Finland have massively increased defense spending, boosted their military forces and strengthened NATO deployments near Russia. These countries are not ignoring the threat - they are preparing to defend themselves if needed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vsovietov",
            "body": "well, first of all, it should be noted that there are no ‘countries’, only specific people act in this world, and in their own interests. especially governments. as a Ukrainian, I can say that this war is completely meaningless if you analyse it by the standards of two hundred years ago. in today's world, seizing territory does not bring any profit, trade is many orders of magnitude cheaper and much less risky than war, not to mention other aspects. \n\nso far we can see that the war is being used to destroy the rights of the population in russia and Ukraine, increase tax pressure and reshape the political landscape in Europe, and i think the Democratic Party has laundered some money by keeping Ukraine from winning and scaring everyone about world war 3. so we can conclude that this particular war is just a political machination of the left. \n\nPutin and his regime are absolutely dependent on Europe, they literally exist on the money the EU pays them for oil and gas, in return the leftist EU politicians get a controlled mad dog in the person of Putin, which makes it easier to convince the electorate to accept higher taxation and the elimination of freedoms.\n\nand yes, get the dominoes out of your head.\n\nP.S. I'm Ukrainian",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThinkySushi",
            "body": "Hey it is hard to understand this war at all without really understanding why Russia really started this war.  \n\nHere, Real Life Lore did a fantastic video Becky when the war first started which outlined the key economic and geopolitical reasons behind it.  \n\nTake a look.  It is really good and easy watching. \n\nhttps://youtu.be/If61baWF4GE?si=juvHdAc-4y8NgDRt",
            "score": 1,
            "replies": []
        },
        {
            "author": "turboninja3011",
            "body": "Europe is legitimately poor compared to US and they have ton of problems. \n\nBut yeah they ll do more in a pinch. \n\nAlso, US supporting Ukraine is as much about a message as it is about a physical weapons. \n\nPutin can give EU a *very* hard time. He can’t give a very hard time to EU and US combined",
            "score": 1,
            "replies": []
        },
        {
            "author": "golsol",
            "body": "I was deployed to Afghanistan with Soldiers from several different European armies. The reality is they just aren't very good at warfare and their equipment is pretty poorly maintained and mediocre. They tried pretty hard but they just more often proved a liability than an asset. The Czechs and Polish were the only exceptions I remember. The bulgarians, romanians, Lithuanians, French, Germans, Italians were all completely useless. \n\nI've heard the Brits are pretty good but we never worked with them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yadius",
            "body": "The Europeans don't have the money to remilitarise. They are already bankrupt. Socialism always ends in failure.\n\nThe decision to provoke Russia into war over Ukraine was an unholy alliance between the English & American neocons, and the European technocratic socialists.  The original plan was to quickly cause an economic and government collapse in Russia using sanctions, and then grab the rights over Russian energy resources as a form of 'war reparations'. \n\nThe neocons would have gotten their war and global dominance, and the European socialists would get the resources to prob up their failing economies.\n\nMy prediction is that West European economic collapse will now accelerate. Watch the Euro drop below parity and then keep dropping over the coming weeks.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ok-Section-7172",
            "body": "We are not being told everything in our media, so keep that in mind. Europe combined has sent more than the US. I keep interacting with German coworkers and their first quest always seems to be, why do people in the US know so little. It's like you don't have books or news. \n\n  \nNow on international message boards they are saying the same.",
            "score": 0,
            "replies": []
        },
        {
            "author": "jmmgo",
            "body": "Europe is poorer and lacks military power. They have fucked around and are now finding out.",
            "score": 0,
            "replies": []
        },
        {
            "author": "CSDkeeper",
            "body": "The West got in the country, found the most despicable of the population, and gave them money and weapons. The rest became pro-Russian terrorists because Ukrainian constitution doesn't allow the use of army inside the country. So the new Mujaheddin were born. The \"Freedom fighters: ideologically motivated\" edition. \n\nSo Russia with a huge Russian population in Ukraine reacted.\n\nFor the West, Ukraine is just the means to the end. Nothing to do with \"democracy\" or \"human rights\", just business as usual.",
            "score": 0,
            "replies": []
        },
        {
            "author": "kiaryp",
            "body": "Europe has sent quite a bit of money. The issue is that Europe hasn't had maintained a sufficiently large military for a while.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ChoiceSignal5768",
            "body": "Russia has no interest in world domination. Ukraine and russia are basically the same thing so russia just wants it back in their borders. The wests involvement is purely political. The west and russia dont like each other because of cultural differences so if russia wants ukraine then the west doesnt want them to have it, thats really the only reason why the US has funded ukraine in the war. Like you pointed out the rest of europe isnt worried about russia which is why they havent sent much money to ukraine.\n\nAs an ancap how I see the situation is it doesnt matter whether ukraine is called russia or not. This is not a war about freedom, its about defending democracy which is just the tyranny of the majority. It makes no difference whether ukraine remains its own state or becomes a part of russia. What does matter is that as long as the war continues people are dying and money is being wasted on weapons. Ukraine is not innocent in this situation, they force young men to fight and die for this hopeless and pointless war. All they have to do to stop the bloodshed is wave the white flag and call themselves russia. But zylensky doesnt want to do that because then he goes back to being a nobody and stops getting billions from the US. Sure russia shouldnt have invaded but it would have been over in a few days with very few casualties if it wasnt for the US sending them endless weapons to keep fighting.",
            "score": -6,
            "replies": []
        }
    ]
}