{
    "title": "Okay which one of you fuckers hurt their feefees?",
    "author": "odinsbois",
    "subreddit": "Anarcho_Capitalism",
    "rank": 63,
    "score": 94,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 36,
    "url": "https://i.redd.it/bux8r3sx46me1.jpeg",
    "id": "1j1dsbj",
    "selftext": "",
    "comments": [
        {
            "author": "lone_jackyl",
            "body": "Start reporting these subs. I was just banned from r/news and you better believe I'll be looking for people threatening violence and reporting them. After so many reports reddit bans the subs. Fuck these commies.",
            "score": 61,
            "replies": [
                {
                    "author": "HKatzOnline",
                    "body": "Reddit won't do squat against them because it's (D)ifferent.",
                    "score": 43,
                    "replies": [
                        {
                            "author": "lone_jackyl",
                            "body": "Recently white people Twitter was banned for 72 hours. Reddit doesn't like violence regardless the side",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "According_Gazelle472",
                                    "body": "They need to be shut down completely!I was banned from that sub for commenting on the Bible once .",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "kurtu5",
                                    "body": "72 hours!  How horrible.  How will they ever recover?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kurtu5",
                    "body": "> . After so many reports reddit \n\nlooks into you",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 25,
            "replies": [
                {
                    "author": "According_Gazelle472",
                    "body": "I posted lol on the work reform sub and was instabanned !I only joined the night before and made one post!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "kurtu5",
                    "body": "> I didn't even realize that reddit allowed that kind of banning,\n\nI don't think they actually do.  But what you gonna do about it?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "BrizerorBrian",
                    "body": "In reply to what?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DRKMSTR",
            "body": "I've been banned from most major subreddits. \n\nI was also a top poster in Adviceanimals before this happened. \n\n  \nCovid turned most of this website authoritarian.",
            "score": 24,
            "replies": [
                {
                    "author": "Choraxis",
                    "body": "It was well before Covid. Orange Man broke their brains in 2016 and they've never recovered.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "tacocarteleventeen",
            "body": "Okay now I’m joining.  Pretty sure I’m banned from that sub already.",
            "score": 16,
            "replies": [
                {
                    "author": "According_Gazelle472",
                    "body": "Lol",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Numinae",
            "body": "\"We don't care about nuanced or specifics. If you want to be unbanned, delete all comments on subreddits we consider wrongthink. Then _beg_ for readmission!!!\"\n\n\nNo thanks. How about you go fuck yourself?",
            "score": 15,
            "replies": []
        },
        {
            "author": "JamesMattDillon",
            "body": "Could not have been me. I was already banned from there for bejnf a part of No New Normal",
            "score": 10,
            "replies": [
                {
                    "author": "venetsafatse",
                    "body": "I was banned for lockdownskepticism. Same idea.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "AlienDelarge",
                    "body": "I lost track of which ones I'm banned from for that heinous crime.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Boxatr0n",
            "body": "Haha I’ve been banned for simply being a member of other subs",
            "score": 6,
            "replies": [
                {
                    "author": "According_Gazelle472",
                    "body": "Lol,me too!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KingRexxi",
                    "body": "This just happened to me for the first time today. I got banned from r/interestingasfuck for being a member of some other sub. No idea what sub. And it triggered from me commenting something very reasonable and not at all controversial on a post. So fucking weird.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Boxatr0n",
                            "body": "I was very confused at first cause I commented on something that had ZERO things to do with politics and I got banned for politics lol",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LectureAdditional971",
            "body": "Anybody who isn't an emotionally labile socialist is automatically counted as MAGA.",
            "score": 6,
            "replies": []
        },
        {
            "author": "telcodan",
            "body": "Fun fact, if you respond by calling them fascists, they block you from messaging the mods as well.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Business-Self-3412",
            "body": "If you aren’t banned from r/pics do you even Reddit?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Shloopy_Dooperson",
            "body": "Just block ban bots. They shouldn't be a thing anyway they violate the TOS.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Secretsfrombeyond79",
            "body": "Ups, my bad, I called them bunch of political fanatics once.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mike__O",
            "body": "These idiots pull shit like this, then get shocked when they get blindsided by how the election turned out.\n\nWhether you agree with conservatives or not, they generally don't pull shit like this",
            "score": 10,
            "replies": []
        },
        {
            "author": "Vegetaman916",
            "body": "Pretty sure it was me.",
            "score": 3,
            "replies": [
                {
                    "author": "odinsbois",
                    "body": "![gif](giphy|SG12JTxGAUR5NR1250)",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Banned_in_CA",
            "body": "I will never not call out fascist censors like this.\n\nI lost an almost 15 year old account because of it.\n\nReddit is dead; the body just isn't cold yet.",
            "score": 3,
            "replies": []
        },
        {
            "author": "lucascsnunes",
            "body": "That’s a trophy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ut3jaw",
            "body": "I've been bouncing in and out of being banned from pics since I joined reddit.",
            "score": 2,
            "replies": []
        },
        {
            "author": "rolandofghent",
            "body": "Why would a platform restrict you from using the platform because you used the platform?  \n\nThis is a dumb business model.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wookieman222",
            "body": "Anytime I get those I just think, \"man another sub full of assholes\" and know its just a BS sub I don't wanna be in anyways. Cause i mean if that's how you handle things then your not interested in being honest and having actual thought of discourse. you just wanna hear what you want and live in a bubble.",
            "score": 4,
            "replies": []
        }
    ]
}