{
    "title": "Wonder why that is",
    "author": "FaithlessnessSpare15",
    "subreddit": "Anarcho_Capitalism",
    "rank": 47,
    "score": 560,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 35,
    "url": "https://i.redd.it/hhg79v16dbme1.jpeg",
    "id": "1j1wm41",
    "selftext": "",
    "comments": [
        {
            "author": "bspecific",
            "body": "Raising the debt ceiling and blowing up the deficit might be worth a distraction too.",
            "score": 11,
            "replies": []
        },
        {
            "author": "BendOverGrandpa",
            "body": "It was the most performative bullshit that I've ever seen.\n\n\"I have the files on my desk!\"\n\n1 week later...\n\n\"I will release these files to DC Draino, Libs of Tik tok and Jack Posobiec! End wokeness baby!\"\n\nReleases same files as 8 years ago but with MORE censorship.\n\n\"It's the FBI's fault! I give them one day!\"\n\nKash Patel: \"Uuurr FBI go brrr....\"\n\nHGere we are 4 days later. You mean to tell me someone who is AG had the files for a week, made fucking binders and didnt realize that wasn't all the data? The fucking binders said PHASE 1 on them so she at least knew there was more data right?\n\nAlso, the binders said right on them \"The most transparent administration in history\"\n\nWhen the government is printing you a binder of blacked out bullshit from 8 years ago that's calling itself the most transparent government in history and is only releasing it through curated right wing grifters... that's a HUGE FUCKING RED FLAG.\n\nWhat a disgrace. Anyone who believed these people are fucking idiots.",
            "score": 21,
            "replies": [
                {
                    "author": "RacinRandy83x",
                    "body": "To be fair, Patel is working remotely which we all know means he isn’t actually working right?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "denimdan1776",
                    "body": "You forgot the part where the literally Rick Rolled us on a Gov website",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CakeOnSight",
                    "body": "the photo op makes no sense. was that shit just empty lol?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BendOverGrandpa",
                            "body": "It was Epstein's phonebook which has been all over the internet for a decade, but with the numbers censored out. So it was literally redacted info that is available all over the internet already.\n\nAnd it also had court documents that were already released that were just as redacted as the court documents that were released.\n\nBut it had a nice cover page that told everyone how transparent they were.\n\nIf it wasn't so fucking sad and if it wasnt about a rapist traficker, it'd be hilarious.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kurtu5",
                    "body": "> What a disgrace.\n\nDisgrace of what?   The state?  Ha!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BendOverGrandpa",
                            "body": "It was one of the biggest \"virtue signalling do nothing and blame others\" event in the history of US politics. A great example of a shitty state actors, shitty politicians and shitty justice system.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "kurtu5",
                                    "body": "> virtue signalling ***do nothing*** and blame others\n\nBy something, you mean war!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BendOverGrandpa",
                                            "body": "The fuck are you talking about?\n\nWe're talking about the Epstein \"file drop\" debacle. Deflection orders detected.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Secure_One_3885",
                                                    "body": "That person will do all sorts of acrobatic feats if it means defending republicans and their actions. Every single time, without fail.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "kurtu5",
                                                            "body": "I am an ancap.  You must be a democrat.  They see everything as black or white.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Secure_One_3885",
                                                                    "body": "Uh huh.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "kurtu5",
                                                                            "body": "Is it untrue?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Secure_One_3885",
                                                                                    "body": "If you're asking if I'm a democrat, the answer is no, and your statement is untrue.\n\nIf you're asking if you're an ancap, the answer is no, and your statement is untrue.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "kurtu5",
                                                                                            "body": "So I am to believe your two statements when one is clearly false?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "BendOverGrandpa",
                                                                                                    "body": "It's funny how easy it is to read what you type in a Russian accent.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "kurtu5",
                                                                                                            "body": "Talk about \"invested\", now you are stalking my comments and make no arguments, just a ton o ad hom.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "BendOverGrandpa",
                                                                                                                    "body": "No, not stalking, you're just posting bullshit in every single Ukraine thread so it's easy to spot with a giant red RES moscow tag next to your name.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "kurtu5",
                                                                                                                            "body": "Again, ad hom.  Make an argument.  And not, \"you said water is good!  Hitler drank water!  You are a NAZI\"",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "BendOverGrandpa",
                                                                                                                                    "body": "I'll ad hom as much as I want shill, free fucking speech in the USA and all right?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "kurtu5",
                                                                                                                                            "body": "Ok, be stupid.  Fair enough.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        },
                                                                                                                        {
                                                                                                                            "author": "kurtu5",
                                                                                                                            "body": "> red RES moscow tag next to your name.\n\nSo in 11 days you clocked me as a kremlin agent.   I worked hard for 18 year and then sold out in 2022.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "BendOverGrandpa",
                                                                                                                                    "body": "Sounds about right, as the Million Dollar Man used to say \"everyone has a price\".\n\nThe saddest part, you're probably actually doing this for free because you're a contrarian that thinks he's so fucking smart.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "kurtu5",
                                                                                                                                            "body": "Make an argument.  What is incorrect?\n\nSo far.  Your wins - \"He said something against zelinski, russia is against zelinski too, he is with russia\"\n\nThats it so far for you.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "kurtu5",
                                                    "body": "> The fuck are you talking about?\n> \n> \n\n\"It\"\n\nYou were unclear as to what \"it\" was and then you got mad because of that.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "angelking14",
            "body": "They haven't censored our all the Republicans names yet.",
            "score": 22,
            "replies": []
        },
        {
            "author": "RacinRandy83x",
            "body": "If there was a list of people Epstein trafficked kids to, it feels like it would have been a really easy investigation to follow those people until they find a new contact. \n\nSo it either doesn’t exist, or it’s already been buried and never coming to light unless a whistleblower gets their hands on it.\n\nEither way, I think the whole Epstein list is just meant to be a distraction when necessary and an easy way to slander someone your side doesn’t agree with.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tichy",
            "body": "I've heard the theory that it gives good leverage over some important people.",
            "score": 2,
            "replies": [
                {
                    "author": "CakeOnSight",
                    "body": "Fuck spy craft, fuck the cia, fuck influencing foreign governments. Release it all. We fucking paid for it, it's our information",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Tichy",
                            "body": "I agree it would probably be best to just release it all.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mnatheist",
            "body": "Or vice versa.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Double_Education_690",
            "body": "Ah yes the one that is getting scrubbed to hell and back to make sure the political leaders arnt in it?",
            "score": 1,
            "replies": []
        }
    ]
}