{
    "title": "Why are corporations legally obligated to maximize shareholder value?",
    "author": "Faintly-Painterly",
    "subreddit": "Anarcho_Capitalism",
    "rank": 53,
    "score": 25,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1j286ao/why_are_corporations_legally_obligated_to/",
    "id": "1j286ao",
    "selftext": "What's the actual motivation behind this? This is obviously something that markets will sort out on their own.  Why make laws stipulating it?",
    "comments": [
        {
            "author": "db8db4",
            "body": "Basically, it is to have legal recourse in case the company raises a bunch of money from investors and wastes it all on hookers and blow.\n\nIt you borrow money, you have to pay it back with interest. If you raise the money, you need to maximize share value.",
            "score": 70,
            "replies": [
                {
                    "author": "Ghost_Turd",
                    "body": "There's nothing evil or dystopian about this arrangement, either, it's how investment is done, and how you get more investors in the future.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "Faintly-Painterly",
                    "body": "Why does that need to be its own law though? That just sounds like regular old fraud to me",
                    "score": 11,
                    "replies": [
                        {
                            "author": "db8db4",
                            "body": "Don't get me started on the redundancy of laws...",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "MaineHippo83",
                            "body": "There can be a lot of bad management that isn't fraud.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "harry_lawson",
                                    "body": "Right but as an investor you sponsor management??? So if management fails then it's also the responsibility of the investor?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TheAzureMage",
                            "body": "It isn't its own law because it is regular old fraud, yes. \n\nLearning law through media/word of mouth is dodgy as hell.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "johnnyringo1985",
                            "body": "Imagine a public utility company deciding to using a bunch of money to boost electric grid reliability from 99.8% to 99.9% without raising rates. It would probably be super costly because of diminishing returns and wouldn’t impact shareholder value. No fraud, but not beneficial to shareholders.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "whater39",
                                    "body": "Except that the value of the electric grid went up, making the assets worth more, so there is value to the shareholders",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "johnnyringo1985",
                                            "body": "That’s not how the value of utilities is calculated for investing since most costs get passed back to rate-payers (but this situation would not).",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Faintly-Painterly",
                                    "body": "I just don't see why you need laws to prevent that. If the investors don't like the way a company operates they can just not invest. No one is forcing anyone to do anything.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "firl21",
                                            "body": "It's very simple.\n\nShareholders are owners. The company has to operate in the best interest of the owners.\n\nLook up the history of Joint stock companies. For the ownership to have value leadership is expected to operate in the best interest of the owners.\n\nThe TLDR is what is stopping you from telling your friend to invest in a company with you. You put money in, and they just fritter it away on stupid stuff without expanding the business. \n\n  \nthey got a nice few paychecks and you got nothing.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "harry_lawson",
                                                    "body": "You literally just described the inherent risk of a capitalist system... Laws to protect against this is state interference in the free market",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "firl21",
                                                            "body": "Laws can be enforced and made via a self regulating organization. \nThere is no requirement for a govt to exsist in that sense.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "harry_lawson",
                                                                    "body": "Hmmm, but that wouldn't be law? That would be setting contractual conditions. Only the state can set laws.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "firl21",
                                                                            "body": "Finra is a SRO and exsosts to regulate the stock market. It's non governmental.\n\nLaws in the abstract sense do not require the state.   People would naturally choose to operate /invest in sro compliant orgs. There is no net benefit for inveators to invest in nok compliant companies. This in this sense govt would be inevitable in some extent.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "harry_lawson",
                                                                                    "body": "Why are you abstracting? What is the definition of a law? Why use the word law when what you actually want to say is contractual obligation?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ChoiceSignal5768",
                    "body": "You dont have to do anything. If you borrow money and dont pay it back, dont expect anyone to lend to you again in the future. If you get people to invest in your company and then you dont prioritize their share value, dont be surprised when they sell their shares. And from the investors point of view, don't give your money to sketchy companies in the future.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ryrythe3rd",
                    "body": "The problem is who’s to say a certain use of the money is “in the interest of the shareholders” or not? Isn’t that a very grey line?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "db8db4",
                            "body": "That's why you have quarterly results, voting and reporting requirements. If shareholders don't believe that the company is maximizing their value, they can sue. Then courts listen to arguments and decide.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "alurbase",
                            "body": "The shareholders themselves via the board of trustees are actually the ones that set this agenda. It’s not some sort of hard legal language on what specifically counts are seeking profit. After all when you build a factory or acquire another company, you lose value and won’t see a return until later.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "johnnyringo1985",
                            "body": "Not all that grey. There’s plenty you can argue is in shareholders’ interest. Likewise, there’s plenty I can argue is outside the shareholders’ interest. While there is some gray area in between those, it is not in anyone’s interest to argue about or litigate it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MaineHippo83",
                    "body": "investors aren't always the same as shareholders. you are mixing a bunch of stakeholders in your response. Shareholders haven't lent money nor is money raised from them. \n\nThey bought a piece of the company, when you own shares, you own a sliver of the company.  \n\nFor shareholders the reason they have to maximize the value or be good stewards is because all these people owning slivers have no real voting power and its to protect them from the majority shareholder just embezzling the money or being completely risky with their money.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "db8db4",
                            "body": "There are primary and secondary share markets.\n\nPrimary market is when you buy shares directly from the company, company receives cash, raises money.\n\nSecondary market is when you buy shares from another share holder. The company does not receive cash, but the share you receive transfers voting and legal rights associated with that share. Existence of secondary market is not relevant.\n\nAnyone who holds shares is both a shareholder and an investor, whether the company received cash for the transaction or not.\n\nSince any sensible company would not give away its voting power to random people, the main recourse for small investors is legal pathways.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "adelie42",
                    "body": "And it is only for publicity traded corporations when you invest through the exchange. The trade off is if they lose it all, they owe you nothing. How would you prefer to get your idea funded?\n\nNothing is stopping anybody from loaning or borrowing on different terms, but both sides love the gamble.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shawaii",
            "body": "It's implicit when buying stock in a company that the company's duty is to maximize the shareholder's value.  If not, company management can just pay themselves even greater amounts, offsetting all profit, or make deals that benifit their family and friends but not the company.  \n\nThe Dodge Brothers sued Ford over this and that finding became case law.  In theory, market forces would work this out to a happy medium, but many incestors don't have the luxury to diversify and be patient.",
            "score": 13,
            "replies": []
        },
        {
            "author": "WagonBurning",
            "body": "Dodge versus Henry Ford",
            "score": 6,
            "replies": []
        },
        {
            "author": "Numinae",
            "body": "Because of Dodge v Ford.",
            "score": 6,
            "replies": []
        },
        {
            "author": "trav1829",
            "body": "That’s a good question- I’ve always heard it referred to as a fiduciary responsibility- but that’s an ethical thing not a legal thing - so now I’m curious",
            "score": 3,
            "replies": [
                {
                    "author": "db8db4",
                    "body": "Fiduciary is a legal requirement.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "luckybuck2088",
            "body": "Because ford lost a law suit to dodge and it became the rule",
            "score": 5,
            "replies": []
        },
        {
            "author": "Metrolinkvania",
            "body": "They aren't, see any legal case that allows for long-term goals to be considered and shareholder value and the widespread implementation of DEI policy.",
            "score": 7,
            "replies": []
        },
        {
            "author": "DumpyDoggy",
            "body": "It’s an implied contract term based on what is surmised to be the reasonable expectations of the parties.",
            "score": 2,
            "replies": []
        },
        {
            "author": "EGarrett",
            "body": "Because shareholders won't give you money otherwise. And they're perfectly within their rights to require you to sign an agreement saying you will do everything within reason to give them maximum return on their investment before they give it to you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "whoooocaaarreees",
            "body": "Dodge brothers v ford motor is an interesting case study to start from.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SlashingLennart",
            "body": "Maybe to regulate intentional mismanagement through bribery of corporate insiders in order for the investors (who are in on it) to make risk-free profit by shorting on said corporations.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rhenthalin",
            "body": "There was a case in the US between the Dodge brothers and Ford. They, as sharehders, felt they had a right to the excess profit in the form of a special dividend vs what Ford wants to do to re-invest in the business. They were also gearing up to go out on their own and wanted to block a factory Ford was going to build",
            "score": 1,
            "replies": []
        },
        {
            "author": "International_Lie485",
            "body": "My theory: \n\nThe reason they made the law is to give trust to small investors that want to put a little bit of savings in the stock market.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vulturo",
            "body": "It’s to avoid owners from siphoning off money for private use.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Driftmichael01",
            "body": "Look into dodge v ford",
            "score": 1,
            "replies": []
        },
        {
            "author": "me_too_999",
            "body": "The biggest shareholder is usually the CEO.\n\nHe has a vested interest in boosting the value of the shares he owns.",
            "score": 0,
            "replies": [
                {
                    "author": "Faintly-Painterly",
                    "body": "Yeah no shit, so why is it a law?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "me_too_999",
                            "body": "Is it an actual federal code?\n\nDo we have the citation number?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Faintly-Painterly",
                                    "body": "I think it's just case law with precedent set by Dodge V Ford and later eBay V Craigslist",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheAzureMage",
            "body": "Oh god, more \"fiduciary duty.\" The libertarian understanding of this is freaking miserable. \n\nIt's not a law, generally speaking. Very, very specific industries may have a law now, but where they exist, they are relatively new, and mostly legally untested. \n\nThe concept instead refers to precedent in common law. Basically always, it is a concept described in conjunction with another crime. IE, you have a duty to use the corporate assets for corporate stuff, not to pilfer into your own pocket. So, it'll come up when describing embezzlement or the like. \n\nObviously, theft is wrong, and stealing from shareholders or defrauding them is a NAP violation. The concept that one should avoid that is reasonable and pretty obvious. \n\nFiduciary duty does NOT mean that a CEO is constrained to only do one thing. There are many, many potential strategies that have a reasonable honest business approach, and selecting strategies is the business of, well, business. Not judges.",
            "score": 0,
            "replies": []
        }
    ]
}