{
    "title": "Freeist state?",
    "author": "QueasyInspector5767",
    "subreddit": "Anarcho_Capitalism",
    "rank": 29,
    "score": 6,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1j3dgj5/freeist_state/",
    "id": "1j3dgj5",
    "selftext": "What's the best state to live in \nfor ancaps and why?",
    "comments": [
        {
            "author": "LoopyPro",
            "body": "AK, NH, SD, NV, TN, FL",
            "score": 7,
            "replies": []
        },
        {
            "author": "Standard_Nose4969",
            "body": "i will assume that by \"in\" you mean \"under\", and that answer is determined by the persons own values.\n\n  \n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n  \nits slovakia, cuz my presence makes the state tolerable",
            "score": 2,
            "replies": [
                {
                    "author": "Friedrich_der_Klein",
                    "body": "Same, slovakia #1",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Darmin",
            "body": "New Hampshire is pretty great. \n\n\nHB 1178 2022 \nThis bill prohibits the state of New Hampshire, a political subdivision of this state, or any person acting under the color of state, county, or municipal law from using any personnel or financial resources to enforce, administer, or cooperate with any law, act, rule, order, or regulation of the United States Government or Executive Order of the President of the United States that is inconsistent with any law of this state regarding the regulation of firearms, ammunition, magazines or the ammunition feeding devices, firearm components, firearms supplies, or knives.\n\n\nThey do have a high property tax, but if you're the bottom 20% earner than it's like 15th place for lowest tax burden. If you're any other bracket it's like top 2 or 3 for overall tax burden. \n\n\nProperty tax is really the only tax. They do vehicle registration and inspection. But they're pushing a bill to remove the inspection. Hb649. There's some hotel tax and hot meal tax, or done in tax. I can't recall it's specifics. \n\n\nThey also passed a law recently that said it's up to whoever owns the shitter to decide the gender trans thing on usage. And it's up to each individual school(or school district, can't recall)\n\n\nThey also have the \"education freedom account\" where some of your money will follow the child if you take them somewhere other than public school. It's like 3-5k per kid. Which is about a years worth of property tax in a lot of areas here. \n\n\nEdit, forgot to mention the freestate project and YAL(young Americans for liberty)\n\n\nBoth have heavy presence in NH and push for less government. Look em up!",
            "score": 1,
            "replies": [
                {
                    "author": "Vikka_Titanium",
                    "body": "The property tax and vehicle inspections make that a no go for me.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Darmin",
                            "body": "Yeah property tax is lame, but it's nice that I contribute less taxes in this state than I do almost any other. \n\n\nI just don't get my vehicle inspected, but I shouldn't have to do it anyways. ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Vikka_Titanium",
                                    "body": "Many taxes can be cheated or avoided, property tax is tough in that regard. \n\nYou can avoid inspections?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Darmin",
                                            "body": "That's perfectly fair. \n\n\nI gotta find some loop holes. Texas use to (still could) have a law about a set number of cows and you're able to define it as farm land and get like half off your property taxes. But they also had other sources of taxes. \n\n\nI think NH is really strict on loop holes cause it's their only revenue. \n\n\n\n\nEdit\nSorry I got distracted and sent the comment before I meant too. \n\n\nYeah I just don't do it. It's illegal. But supporting the system and giving justification of the inspection by participating in it is immoral. \n\n\nPretty sure if you register your vehicle as a farm truck you can get out of it. I don't know the stipulations around how to qualify for that. I have a farm truck, but it's not registered and it's running out of state expired plates. \n\n\nI actually was going to do the legal thing, but the town is pretty small and the town clerk/DMV is only open 2 days a week each for half a day. There's something there about shit government workers, but she's literally everything, and I'm pretty sure she doesn't get paid to do any of it. The town has like 1300 people. ",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "QueasyInspector5767",
                                            "body": "What taxes can be cheated?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "03263",
                                    "body": "Homeowners insurance is very low fwiw\n\nAnd car insurance",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "1998marcom",
                            "body": "Unpopular opinion: in ancapistan the one tax you might still pay, albeit as a \"property protection and insurance\", is the one on immovable properties (or physical properties more broadly). Ofc you could just defend yourself on your own, but some might chose to pay an insurance for that. The same cannot be said, for example, about income taxes: what would you be insuring? Income? That's called investing, at most. Sales tax? At most the paypal commission...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "Would be better if the first paragraph ended right before \"regarding\".",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vikka_Titanium",
            "body": "Free means different things to different people.",
            "score": 1,
            "replies": [
                {
                    "author": "QueasyInspector5767",
                    "body": "Low taxes, gun rights and just goverment leaving you alone",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Vikka_Titanium",
                            "body": "Well, let me give an example. The state I'm in most wouldn't consider very free. However the government is so incompetent that their laws don't really matter much.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "QueasyInspector5767",
                                    "body": "Don't keep me hanging",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ApathyofUSA",
            "body": "Hard",
            "score": 1,
            "replies": []
        }
    ]
}