{
    "title": "Collapse of Middle Class, Competency/Skill A Hallmark of MMT Policies",
    "author": "PsychologyPure7824",
    "subreddit": "Anarcho_Capitalism",
    "rank": 18,
    "score": 1,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1j4ceew/collapse_of_middle_class_competencyskill_a/",
    "id": "1j4ceew",
    "selftext": "I tend to think the MMT people are correct in a descriptive sense in that their theory of economics pretty accurately describes how our current economic system actually works. It's not just the Fed printing money, which the Fed doesn't literally do, but it's also the entire shadow banking system and the way major institutional banks collude with the government to control prices and money supply.\n\nWe know for instance how central BlackRock is. It operates as an effective, illegal sovereign wealth fund of the US deep state. However, we also know that BlackRock and its predecessors have been using AI since the 1990s to exercise monopoly style control over markets, coordinated buying and selling, to maintain value of asset prices in their portfolio.\n\nIn this sense, our economy is entirely fake. It's a set of infrastructure and skills, mostly holdover from 1975-1995 that were sufficiently advanced and efficient that they could produce real wealth at negligible capital costs. For example, I bet you that if you go to the store and buy some Oreos, that they're made on the same machinery they would have been made on in 1980. The capital costs of this have to be long since paid off.\n\nAs a result, the effective MMT economy doesn't actually structure around real capital costs, investment trade-offs. It just rent seeks on a 1995 economy, then directs the surplus that creates into a middle layer of profitable efficiency gains. Followed by a top layer of ultra-high-return investments, most of which are overfunded.\n\nIn other words, the real economy structured by real capitalism up until 1995 produced the infrastructure, skills, training, family structure, social trust that the MMT economy operates on. Meanwhile, the MMT economy will invest into tech, computers, and things. But all these ever do is cut costs. You're not really taking all this massive surplus labor gained by digitizing the office, and then retraining those people into a brand new, entrepreneurially discovered sector that can exist because of a liberating effect of technology. You're not multiplying value. You're not doubling down on economic progress. All you're doing is cutting costs, and then just sort of hanging people out to dry.\n\nThis has put a greater and greater burden on the actually competent, and it's getting to the point where quality control is failing. Meanwhile, among the actually competent there's room for organization and rebellion, an impetus to reform the system. So they then take all this surplus labor and create \"DEI\" to socially and politically crowd out the economically competent from engaging in entrepreneurial reform.\n\nA perfect example is people from India getting H1B visas and then just handed out hundreds of thousands of dollars in the US and UK to start business. Even if you had the money, you'd be unlikely to compete with the sort of free advantages these people are given. This has to be interpreted as a system feature meant to keep you from building capital and economic power.\n\nFinally, after the cost-cutting efficiency layer of investment, MMT economics dumps capital into all these stupid hype tech fields. While social media does produce value in terms of more effective advertising through data collection, it can't produce THAT much value. No, it's more that capital is cashing in on the high-risk, high-return sectors in order to maintain control over them, and in the process back higher asset price levels.\n\nIn a sense MMT economics are working. For instance, tech salaries are going up, salaries across the board are going up. The prices of many goods are stable, translating to real economic gains. However, price of living is skyrocketing, and availability of the types of positions that are seeing salary increases is shrinking.\n\nThis is the actual problem with MMT. It's not that it produces raw inflation, it has means to prevent runaway money supply. Instead, you pump more currency into the system in order to maintain the monopoly control needed to manage price levels (asset price fixing through market manipulation, overpriced high-return tech so no one else can buy in). The result of this, the real pain, is that the middle of the market loses all price sensitivity.\n\nLet me give a couple concrete examples. 35 year old dude is laid off in tech, moves with parents, considers getting a job at the local grocery store. That store's wage will not pay his rent, nor could he afford to personally shop there. When he does get a \"real job\" again, the savings from working in that store would correspond to maybe a quarter of his annual salary. It's just not worth doing that work. You could probably even do some actuarial work on stress and life expectancy and prove it's actually more costly to get that job.\n\nThe thing is, this supermarket job is part of the 1995 rent-seeking, vestigial economy. As asset price levels and housing costs have risen, the market has no fucking clue how to fit the 1995 economic structure into the new one. So it just... doesn't. Meanwhile, BlackRock's AI is probably saying that you can pay store associates six figures in select wealthy neighborhoods, so long as wages stay low everywhere else. Without disrupting the MMT economy that is.\n\nWe also see this in video game development which is suffering a collapse. The main issue is that MMT economics requires these games to be $1 billion mega games like GTA online. If they can't perform on the high-return premise, better to not fund them at all or else the MMT economic structure will break. Plus with salary inflation, and cost of living, studios can't afford to actually pay their staff anymore, and publishers can't afford game that are mildly profitable. I also think some of these shitty movies and DEI games are MMT based destruction of capital. I think it's a kind of reverse money laundering where they pay exorbitant costs for ostensible mega projects, but in reality the real costs to produce the garbage final products were as cheapskate and cost cutting as you can get. Look at Amazon's Lord of the Rings show. Supposedly a $1 billion show, but it's as if they had interns do the writing since they wanted to save money.\n\nThis kind of buffoonery is what I think is the real hallmark of the economy we're in. They can't disrupt the 1995 rent-seeking real economic structure, so they can't actually start paying people better or improving how things work. On the other hand, the system only works if they maintain monopoly control over asset price levels, so they have to overinflate some things. In the end, they're just eroding the 1995 structure.\n\nI predict that there will be no \"economic\" crash from all this. It's going to be a multifaceted, social collapse. People refusing to come into work, not being able to find anyone to do certain jobs. Stressing people with austerity, homelessness and starvation. Destruction of culture and a total loss of any sense of what the social contract is. A little violence will spill over the floodgates and then it will be a free-for-all until not enough are left to keep killing.",
    "comments": [
        {
            "author": "Intelligent-End7336",
            "body": "I see it in my own town. We're trying to stay alive, but it’s just turning into a tourist trap now. Nothing new is being built, just repackaged versions of what used to work, sold to outsiders passing through. The heart of it feels gone. Like the state itself, it's all about extracting the last bits of value from what people built decades ago, hoping no one notices the foundation's crumbling.\n\nBut I think that's exactly the moment when the next story begins. When you can finally see the old game running out of steam, that's when it’s time to start spreading something better. Not the usual promises of a new system to patch the holes, but the reminder that freedom and choice are what made any of this possible in the first place.\n\nWhen the old structures fall away, there’s space to build again, this time without asking permission.",
            "score": 1,
            "replies": [
                {
                    "author": "PsychologyPure7824",
                    "body": "I think the problem is that a lot of people's \"wealth\" are claim tickets to the MMT trough, and they won't be willing to admit their 401k values are not property, and they need to let go of that. My point is, they won't let go. Anyone with means or stakes in the system will cling to the bitter end, which sadly includes most successful people even libertarians. The problem is America has promoted a rotten managerial culture for over a century. \"Gotta make a living\". No, no you don't have to sell your soul to get ahead in the system. \n\nI think we get confused because the premises of capitalism are rooted in principles and values which it ends up destroying through managerialism, and we can't identify the line where property and markets becomes totalitarian narcissism. We can point to the extremes like pure local voluntaryism and Stalinist industrialism, and central banking is heavily on the Stalinist side of the line. But still, we operated in the 20th century as if we lived in a free market, but did we? Well, I think we sort of did. A very very rigged free market, but after 1995? Nah. This isn't capitalism.\n\nPeople on our side who have \"wealth\" need to admit that first of all, but we also have to reexamine whether certain modes of wealth are actually legitimate under libertarianism. I mean, without a government police force and national debt, how would you accumulate the kinds of wealth people do? These land developers and resort owners in Alabama fund the Mises Institute, but like, bro, you would not be rich in an ancap society. You'd have to pay mercs to violate NAP to enforce some sort of monetary order that preserves your denominated wealth status.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Intelligent-End7336",
                            "body": "Yeah, I don't disagree that a lot of people are riding high on state-backed wealth without admitting it, but I think it's a mistake to assume that all wealth accumulation is illegitimate or parasitic.\n\nOf course people cling to what they've earned or inherited, it's survival. It's providing for family. That doesn't automatically make it corrupt. The real issue is whether the wealth came through voluntary exchange or through state-backed coercion.\n\nAnd I'm not sure I follow the idea that you'd need mercs breaking NAP to protect wealth in an ancap system. If the wealth was earned without force, and defense is voluntary and consensual, then you're just protecting property, not oppressing anyone.\n\nTo me, the problem isn't wealth existing, it's the systems that freeze it in place and force everyone else to participate in propping it up. Without the state, wealth wouldn't be artificially sustained, but it wouldn't be evil either.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PsychologyPure7824",
                                    "body": "So, money is society agreeing on a commonly realize denominated value for everything by the adoption and use of some medium.\n\nWith money, you can have capital, which is surplus being reserved to create future value. \n\nWealth is the accumulation of capital in order to have market power. This power is meant to correspond to effective use of surplus to improve economic efficiency in the future. However, it can also be used to manipulate denominated value. Money as a medium is a two way street, and capital is having power over money.\n\nAs wealth accumulates, people can start extracting rents, taking value that was naturally accruing to most people and hoarding it. The socialists are right about how this is basically just a scam.\n\nThe trick is that the market can vote on whether the power associate with wealth is being used well or not. If capital owners produce returns and invest wisely, the newly created value accrues to everyone more than the share they gave up to the capital owner in the first place.\n\nWealth can overaccumulate, where it's reinvested in repression rather than economic gains. In a free market for money, if wealth is overaccumulating, people will start using other denominations. This was a central dynamic in the bimetallism debates of the 19th century. Bankers were manipulating when the market crashed, taking advantage of natural features of the industrial business cycle, to always be in an advantage in accumulating gold. They accumulate more market power than the value they created with that power, and people wanted to switch to silver.\n\nI have a suspicion that without a politically enforced national debt or something like that, there's actually no way to accumulate private wealth to engage in industrial capitalism. This is related to the competitive nature of the business cycle and the need to over invest to discover the proper size of an industrial sector relative to the wider market structure.\n\nWhat it really boils down to is that entrepreneurial profits only occur when you are creating and growing new sectors, and otherwise most economic goods and services become semi-commoditized as you get diminishing marginal returns on best practice innovation. That one phase of growth, maybe a 5-15 year period, that's all the surplus wealth a sector will ever produce, before that economic activity is structured into the wider economy. That surplus has to be reinvested into growth in other areas. It can't be hoarded as wealth, otherwise it's not actual value created, but simply market power that charges rents. It's like socialism, it's a redistribution of value. It's theft.\n\nWhat I imagine is required for capitalism to work without political enforcement is that investment will just have to be a cooperative activity with distributed benefits. Cooperative investing falls into the trap of someone has to manage it, and presto now you've given someone power, and so the iron law of bureaucracy kicks in. Private wealth at least keeps power objective in clean dollars and cents fashion. Still, I do think the natural market solution to engage in industrial capitalism is local cooperative pooling of surplus to generate capital. I think you can structure it using principles of property law and govern it with economic forces. \n\nWhen you do things for a common benefit, there's a \"what of the least of us\" effect that leads to ideological calls for total equity. On the other hand, many corporations today know how to structure business cooperation in a competitive environment.\n\nThe can be an ethos of keeping the town clean, neat, helping people if they're miserable and homeless, but otherwise letting people keep their own share of gains and reward disproportionately based on good investment choices. Traitors who accept more pay and leave town will be looked down on. I mean, American urban culture is entirely grounded on hedonistic, narcissistic traitors seeking rewards. And look how that's going for people.\n\nCooperation can be voluntary and driven by market forces, but I think it's the only way to have capitalism without political enforcement.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Creative-Leading7167",
            "body": "MMT might be decently descriptive if you only listen to the priests of that religion. If you listen to the laypeople, it is very obviously wrong. You need only ask one question. What would happen if all the debt were paid off?\n\nIn reality M2 would shrink down to the size of M0, the total number of dollar bills. But any MMT lay person will insist that the dollar would cease to exist.",
            "score": 1,
            "replies": [
                {
                    "author": "PsychologyPure7824",
                    "body": "I think the way they describe MMT is incorrect. For instance, it's not taxation that takes heat out of the market, it's BlackRock's fucking algorithm combined with Thiel's Palantir realizing that fat fucking Americans will pay $20 for their Big Mac meal that they used to pay $7 for thinking the deal was worth the poor quality. So they overcharge for things they have data showing they can at least temporarily overcharge for, and suck liquidity from the market that way.\n\nBitcoin might be another way.\n\nThey're doing the MMT dynamic. The one guy described it as getting a token to ride the subway. The \"subway system\" is the 1995 economy and its structures (wage structure, logistics/supply structure, types of job positions, corporate structures, even down to the fucking advertising cycle and outdated cultural meme like \"I'm so manly I can fix a carburetor\" which don't exist anymore). They cost cut (band-aid patch in repairs and improvements) on that to generate the surplus needed to maintain monopoly control of price structures so that the MMT process isn't disrupted nor the 1995 economy.\n\nThat's how I see it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PsychologyPure7824",
                    "body": "If the debt were paid off, housing and asset value would collapse (that's where it's stored). Either through asset price deflation, or if the debt is paid by money printing, through inflating prices overall.\n\nWith a collapse in asset values, a wash of organization that engage in economic activity would crash. The way we do business would become unaffordable, and entirely new practices would need to be developed.\n\nIf you take the federal government alone, including contractors and any business that benefits from subsidies or tacit subsidies (tax credits, even local schools receiving federal funds, etc.), that's well over half of the modern \"economy\". We don't have a real economy.\n\nThe M2 has the effect in terms of game theory over market power and manipulation of prices, of structuring the market so all these organizations can exist and pay people enough relative to other organizations in a competitive labor market, so on and so forth.\n\nThis is huge complaint I have about libertarians. \"The market will fix it\" yeah \"spit and duck tape and hope will fix it\". Sure, it will but there are details. And America is not a free market economy, just because we aren't the USSR, we're not a free market. Your stupid tech job or wherever any of you work, that's not a free market job. You don't have skills, necessarily, that translate to value creation in an actually value sensitive economy. You've be taught in a game that's structured by M2, and learned skills that give you advantage in that game.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Creative-Leading7167",
                            "body": "I agree with everything you've said here, but I'm missing how relevant it is to my claim. If debts were completely paid off, yes housing would crash and many industries would be in massive upheaval. But does the dollar cease to exist? And if it does cease to exist is it because the volatility pushed people into an alternative, or is it because \"debts and money are like matter and anti matter; they obliterate each other when the debt is paid off\", which is obviously ridiculous.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}