{
    "title": "Bye America: A practical guide for patriotic Canadians",
    "author": "ZARFTRUCK",
    "subreddit": "canada",
    "rank": 1,
    "score": 1961,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 393,
    "url": "https://www.reddit.com/r/canada/comments/1ifx562/bye_america_a_practical_guide_for_patriotic/",
    "id": "1ifx562",
    "selftext": "Hello r/canada\n\nLong-time reader, first-time poster.\n\nWith Trump arbitrarily imposing tariffs on Canadian products and services, apparently as a starting point of a bigger economic war and possible annexation of Canada, now is the time for Canadians to stand together against his aggression. This post is meant to be practical, actionable ideas for all Canadians to resist Trump’s tariffs. Let's send the message to Trump: if you don't want to do business with Canada, you have no business here at all.\n\nThis is also a starting point. It’s unlikely that anyone will be able to do all of these things, all of the time, but the more people who do them, and the more of them we do, the bigger the impact will be. Many of the suggested Canadian alternatives are not present in every province. Please add your feedback and other ideas in the comments, and I will try to update the post.\n\nUpdate: Thanks for all the comments! Have modified the list to correct and update it. A couple of useful websites flagged by other users.\n\n* [madeinca.ca](http://madeinca.ca)\n* [european-alternatives.eu](https://european-alternatives.eu)\n\n# Don’t shop at American-owned stores.\n\nNot all of the alternatives are Canadian-owned; they are simply not American. You can also just shop local, as many Canadians own non-chain businesses providing these goods and services\n\n**Retail and consumer goods**\n\n* Amazon → depends what you’re buying, but there are always alternatives\n* Walmart → Loblaws, Metro, Canadian Tire, Co-op (in the west)\n* Costco → Federated Co-op, Bulk Barn (you might disagree with this; Costco is standing up to Trump, and sells many Canadian products in its stores)\n* Home Depot -> Home Hardware, Rona\n* Nike → Lululemon, Roots, Nobis, Canada Goose, Aritzia\n* Levi’s → Naked & Famous\n\n**Food and beverage**\n\n* McDonald’s, Wendy’s, KFC, Five Guys → Harvey's, A&W Canada, Burger’s Priest, Hero Certified Burgers, Mary Brown's (chicken)\n* Starbucks → Tim Hortons (though now Brazilian-owned), Second Cup, Bridgehead, Country Style, Coffee Time, Deville\n* KFC, Popeyes → your local ma and pa chicken place\n* Subway → Mr. Sub\n* Krispy Kreme → Beavertails\n* Chipotle → Freshii\n* Taco Bell → Mucho Burrito, Bar Burrito\n* Domino’s, Little Caesar’s → Pizza Pizza, Pizza Nova\n* Dairy Queen → Chapman’s Ice Cream, Laura Secord, Kawartha Dairy\n* Denny’s, IHOP → Sunset Grill, Humpty’s or Cora’s\n* Applebee’s, Chili’s → Montana’s, Kelsey’s\n* Olive Garden → East Side Mario’s\n* Buffalo Wild Wings → St. Louis Bar & Grill\n* Outback Steakhouse, Texas Roadhouse, Ruth’s Chris → The Keg, Chop, Hy’s\n* P.F. Chang’s → Manchu Wok or Congee Queen\n\n# Don’t buy American goods.\n\nThis will be difficult, because so many of our day-to-day consumer products are owned by American companies. That said, the big Canadian grocery and drug store chains have their own-brand “generic” versions of most of these American products, which are probably cheaper than the brand-name versions. When in doubt, check the label.\n\n* Procter & Gamble (Tide, Gillette, Pampers, etc.) → Attitude, Green Beaver\n* Johnson & Johnson (Tylenol, Band-Aid, Aveeno, etc.) → Life Brand (Shoppers Drug Mart), Jamieson Vitamins, Rexall\n* Colgate-Palmolive (Colgate toothpaste, Irish Spring, Softsoap, etc.) → Green Beaver\n* Unilever (Dove, Hellmann’s, etc.) → Canadian soap makers, President’s Choice Mayo\n* Coca-Cola (includes Dasani, Powerade, etc.) → PC Cola, Clearly Canadian\n* PepsiCo (includes Lay’s, Gatorade, Quaker, Tropicana, etc.) → Kiju, Nature’s Path\n* Kraft Heinz (Kraft Dinner, Philadelphia Cream Cheese, etc.) → Lactalis (Black Diamond, Cracker Barrel), PC Mac & Cheese\n* Campbell’s Soup → Habitant (by Loblaws), Baxters\n* Hershey’s (Reese’s, Twizzlers, etc.) → Nestlé (Switzerland), Canadian chocolate makers (Purdy’s, Laura Secord)\n* Mars (M&M’s, Snickers, etc.) → Cadbury, Canadian brands like Ganong\n* Mondelez (Oreo, Ritz, Triscuit, etc.) → Dare, local bakeries\n* General Mills (Cheerios, Nature Valley, etc.) → Nature’s Path (Canadian), Love Grown\n\nWorth noting (thanks commenter!) that [Well.ca](http://Well.ca) allows you filter for Canadian products\n\n# Use Canadian transportation\n\n* **Gas:** Esso, Chevron, and Shell →  Petro-Canada, Husky, Irving\n* **Rides:**  Uber and Lyft → Use local taxi services (e.g., Beck Taxi, TappCar) or transit\n\n# Don’t buy American services.\n\nHard to avoid some of these, but not impossible.\n\n* Netflix, Disney+, Hulu, Paramount+ → Crave, CBC Gem, CBC Kids, BritBox, Mubi\n* Hollywood (Warner Bros, Universal, etc.) → try some Canadian cinema like TIFF films or the Banff Mountain Films\n* Google Drive, Dropbox → [Sync.com](http://Sync.com), Proton Drive (Swiss)\n* Twitter/X (stay away, since it’s owned by Elon Musk) → Bluesky, Mastodon\n* Electronic Arts (video games) → Ubisoft Montreal\n\n# Don’t buy American cars, or at least buy a car made in Canada.\n\nIt’s obviously impossible to buy a car without any American parts. But, if you’re buying new, at least support Canadian auto workers.\n\nNon-American cars made in Canada:\n\n* Honda CR-V\n* Toyota RAV4\n* Lexus RX\n\nForeign car companies to consider — but check if their cars are assembled in the US:\n\n* Honda & Toyota – Strong presence in Canada (CR-V, RAV4, and Lexus RX are built in Ontario).\n* Mazda, Subaru, Nissan (includes Infiniti), Hyundai (includes Genesis), Kia – Mostly Japanese or Korean, no American ownership.\n* Volkswagen, BMW, Mercedes-Benz, Volvo – European and not American-owned.\n\nAmerican cars assembled in Canada:\n\n* Chrysler 300\n* Dodge Charger, Dodge Challenger\n* Ford Edge, Lincoln Nautilus\n* Ram 1500\n* Ford Superduty\n* Chevrolet Silverado\n* GMC Sierra\n\nAmerican car brands to avoid (no manufacturing presence in Canada), other than the models assembled in Canada that are listed above:\n\n* Tesla - Obviously stay away from these, given Elon Musk’s role enabling Trump. Consider Polestar, Hyundai, Nissan, Volkswagen or Kia instead if looking to go electric\n* Ford\n* Chevrolet\n* GMC\n* Buick\n* Cadillac\n* Dodge\n* Jeep\n* Ram\n\n# Don’t go to America, but be friendly and welcoming to Americans\n\n* **Cancel any vacations in the United States.** There are plenty of things to see and do in Canada. Honestly, our dollar is likely to tank anyway, so American vacations are going to become more expensive\n* **Sell American properties.** Get your money out while you still can. If it’s not Trump, then climate change will certainly destroy the value of properties in places that Canadians love to flock, including Florida, Palm Springs, and Arizona. (If extreme weather doesn’t destroy your property, the inability to get insurance certainly will reduce the property’s resale value!)\n* **Invite American friends and acquaintances to visit Canada.** Tourism is one Canadian export that Trump cannot put tariffs on. Foreign visitors spend their money in our country.\n* **Welcome visiting Americans with open arms.** Talk to them about how important Canada’s relationship with America is, and the importance of resisting Trump\n* **Send Canadian goods to American friends and relatives as gifts**\n\n# Travel elsewhere\n\nFly on Canadian airlines\n\n* Air Canada\n* WestJet\n* Porter\n* Flair\n* Air Transat\n* Sunwing\n\nAvoid American airlines:\n\n* Delta\n* American Airlines\n* United\n* Southwest\n* JetBlue\n* Alaska\n* Hawaiian\n* Spirit\n* Frontier\n* Allegiant\n\n# What else?",
    "comments": [
        {
            "author": "ManofManyTalentz",
            "body": "Hi everyone - we took a while to reflect on this one, and decided it was so well done and with a positive, active intent that it was worthwhile posting here. \n\nWe remain committed to our sub's rules - please no full hatred and avoid generalizations. Ultimately we do need to come out the other side of this able to work with our neighbours, friends, and loved ones from the south, although there's no clarity on how long this will go on.\n\nBut Canadians have a strong history of kindness and togetherness, until someone takes advantage of that kindness. Then we plan, and act smartly and conclusively. This is that.\n\nEdit: also a reminder that these are the products that Canada is creating tariffs for (the prior topic from r/canada)\n\n[https://www.reddit.com/r/canada/comments/1ig1z2h/list\\_of\\_products\\_from\\_the\\_united\\_states\\_subject/](https://www.reddit.com/r/canada/comments/1ig1z2h/list_of_products_from_the_united_states_subject/)\n\n...and a sister sub, [https://www.reddit.com/r/buycanadian](https://www.reddit.com/r/buycanadian)\n\nEdit 2: Mes amis Quebecoise, please feel free to add QC companies. Let's give Canada Post some steady work. There's plenty of maple syrup to flow around!\n\nEdit 3: there was a temporary agreement between our PM and the USA - a 30 day pause is in effect for any tariffs, the same as with Mexico-USA. Since this is technically not over and might happen again in March, we will keep this list as an announcement for some time still, since attitudes have already shifted as reality sets in. Stay kind out there, but we have now seen that everyone has limits.\n\nEdit 4: Do you influence purchasing and logistics for a Canadian company? You can have some win-win discussions,  check this out: [https://www.reddit.com/r/BuyCanadian/comments/1ih2crf/with\\_one\\_conversation\\_at\\_work\\_i\\_moved\\_half\\_a/](https://www.reddit.com/r/BuyCanadian/comments/1ih2crf/with_one_conversation_at_work_i_moved_half_a/)\n\nAlso a giant shout-out to [www.simons.ca](http://www.simons.ca) for amazingly styled  Canadian clothes, and [www.twitter.com/dieworkwear](http://www.twitter.com/dieworkwear) for amazingly detailed style.\n\n4 March Edit 5: We are re-unlocking this thread due to the [new tariffs that have gone into play](https://www.reddit.com/r/canada/comments/1j3emnc/trudeau_announces_canadas_response_to_trump_trade/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "score": 1,
            "replies": [
                {
                    "author": "ZeLenpai",
                    "body": "Merci d'avoir posé la question. I'd love to see our Quebec services there!   [https://ici.tou.tv](https://ici.tou.tv/), [https://video.telequebec.tv/](https://video.telequebec.tv/), [https://www.noovo.ca/](https://www.noovo.ca/) !",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "StellaTermogen",
                    "body": "Brilliant list with a minor typo in this sentence (note the missing \"to\"): \"Worth noting (thanks commenter!) that [Well.ca](http://well.ca/) allows you **to** filter for Canadian products\"  \n(-> I think the sentence also deserves a period at the end. ;)\n\nAnother sentence that might benefit from a little polishing is:  \n\"If it’s not Trump, then climate change will certainly destroy the value of properties in places that (where?) Canadians love to flock (to), including Florida, Palm Springs, and Arizona.\"",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ManofManyTalentz",
                    "body": "Hi - please post this against OP so they see it - otherwise it's just me, and it's not my post.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "StellaTermogen",
                    "body": "Ah, my apologies! Given the OP's intro (\"Long-time reader, first-time poster\") yet having a 0 comment karma but 455 post karma rating, I was confused and thought it was a kind of MOD account.  \nAnyway, will do as you suggest...",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ManofManyTalentz",
                    "body": "No worries - thanks for re-commenting! Have a good week!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "StellaTermogen",
                    "body": "Same to you!  \nAlthough it is hard to imagine that the week can get any better after reading that \n\n# \"President Trump suggested on Tuesday that the United States take over Gaza and that all Palestinians there — some two million people — should leave\" -> so he can[ \"turn Gaza into ‘the Riviera of the Middle East.’](https://www.nytimes.com/live/2025/02/04/us/trump-administration-rfk-jr-gabbard/trump-netanyahu-meeting-israel-gaza#trump-netanyahu-meeting-israel-gaza)\"\n\n\\*thigh-slap\\*",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ManofManyTalentz",
                    "body": "Lord love a duck",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Master_Engineering25",
            "body": "A very easy way to boycott streaming services/hollywood: Raise the black flag! 🦜⚔️☠️",
            "score": 107,
            "replies": [
                {
                    "author": "Express-Doctor-1367",
                    "body": "Libraries are a great source of movies. Yes it's a little bit of hassle and requires organisation's worth it",
                    "score": 43,
                    "replies": [
                        {
                            "author": "corpserella",
                            "body": "For real, check your local library. Lots of libraries offer virtual accounts so you don't need to go in person just to use their digital content. Most (if not all?) Canadian public libraries are free to join as long as you are a resident of the city in question. Some will even let you join if you work or go to school in that city. Some libraries are a part of consortia, which means you often get access to the ebooks, e-audiobooks, and other digital collections from neighbouring systems. You are also fully able to hold multiple public library accounts if you have residences in multiple cities, or if you live in one but work/attend school in another. Libraries also tend not to police account sharing, so if you don't use your local library's digital content, feel free to let a friend or family member use it in your stead. Libraries will even sign up babies for cards, if you're looking to nab extra borrows!",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "ninetyninewyverns",
                                    "body": "I love local libraries. They foster such a sense of community and they house a lot of readily available, useful information. They are one of my favourite places in any town or city honestly. Libraries are underrated. Signed, a bookworm lol",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Azure_Omishka",
                    "body": "Ahoy Matey! It's a pirates life for me!",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "oopsydazys",
                    "body": "Pirate? I would never. I just have a large collection of totally definitely legally acquired stuff on my Plex server.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "ToolTimeT",
                    "body": "Maybe not boycotting the people who are on your side in america would be a better direction?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Handsome_AndGentle",
                    "body": "Red Runway: Chaos - [https://youtu.be/xJ2Zg8JqfAk](https://youtu.be/xJ2Zg8JqfAk)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "max420",
                    "body": "My Jolly Roger is raised.  Let’s goooo!  My gigabit fiber is ready to go.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CourseCorrections",
                    "body": "These are all great but shouldn't we take a lesson from Ukraine and get our own nuclear weapons?  That's probably why Trump thinks we are weak and can be pushed around. \n\nThis is not yet my opinion however I would really really like to know why this idea is wrong.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Saarubobo",
            "body": "\"Tourism is one Canadian export that Trump cannot put tariffs on\" -- hell yeah dude. As an utterly exhausted American living just south of the border, I've been feeling just awful. You've inspired me to spend the weekend in beautiful Canada at Canadian hotels buying Canadian goods. Not that I've ever needed much motivation to do that.",
            "score": 63,
            "replies": [
                {
                    "author": "downrightwhelmed",
                    "body": "Thanks brother. If you feel compelled, please consider contacting your elected representative to say you want them to do something about Trump’s trade war, and that you don’t want to annex Canada. \n\nI wish those weren’t the stakes but it looks like what he’s gearing up for.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Saarubobo",
                            "body": "Oh I have, trust me. You have no idea (or maybe you do) how crazy we all feel. Feels like all our campaign donations and protests and all that effort has had zero effect.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "accforme",
            "body": "I agree fully with Chapman's. Unlike some other Canadian companies whose practice are questionable, like Loblaw, or their politics is a bit questionable, they have been very beneficial to their community and kind to their staff.",
            "score": 119,
            "replies": [
                {
                    "author": "kiradnotes",
                    "body": "Also call them USA instead of America, which is the historic name of the whole continent formed by many countries.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "ManofManyTalentz",
                            "body": "I support this! This is the standard in Spanish and Portuguese",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "youvelookedbetter",
                            "body": "We call them U.S. in all official documents.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "chytrak",
                            "body": "America, appropriately named after a charlatan",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "urghey69420",
                    "body": "Can I still at least have Ben and Jerry's? Pretty sure they're vehemently opposed to the Trump admin.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Mad-Mad-Mad-Mad-Mike",
                    "body": "Also, their Sorbet ice cream is fucking delicious",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Themeloncalling",
            "body": "ULine is a Trump mega-donor. Stock your office and warehouse elsewhere.",
            "score": 51,
            "replies": [
                {
                    "author": "Upset-Tangerine7457",
                    "body": "Grand & Toy baby. My entire office is moving there so nice to order online like a big business.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NotAtAllExciting",
            "body": "I’m going to disagree on Costco only because they do, at least in Edmonton, seem to carry a lot of fresh and frozen Canadian food and they treat their staff better than Sobeys/Safeway is treating their Alberta staff right now.",
            "score": 82,
            "replies": [
                {
                    "author": "Nikiaf",
                    "body": "Costco isn't one that's worth giving up, especially in the middle of a cost of living crisis. Plus, they're one of the only companies that have stood up to the trump regime's insane policies, and they do actually stock a lot of Canadian-sourced products. *What* you buy is far more important than where you buy it.",
                    "score": 67,
                    "replies": [
                        {
                            "author": "jtbc",
                            "body": "Agreed. As long as they continue to stand up against the roll back of DEI initiatives (which they are getting sued for not doing, LOL) and treat their workers fairly, I'll keep shopping there.\n\nI'm creating a white list of US companies that I can continue to support due their demonstration of Canadian values. Right now, that list consists of Costco. \n\nI am thinking of putting Microsoft on there, as well, since Gates just called out Musk for being a complete idiot internationally, and has given many boatloads of money to good causes.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "aarkling",
                                    "body": "Gates isn't really involved with Microsoft anymore. In fact I think he actually sold all of his Microsoft stock years ago.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "sluttytinkerbells",
                                    "body": "Man why would you ever support Microsoft?  They've been responsible for [a lot of shitty things.](https://en.wikipedia.org/wiki/Criticism_of_Microsoft)\n\nAll of these big tech companies are garbage,  MS just *seems* better because they aren't so huge as they were before.\n\nIf they had the power that they had in the 90s they would absolutely be exerting it on all our lives.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "jtbc",
                                            "body": "Gates also got a personality transplant somewhere along the way, but I get he doesn't run them anymore.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "staunch_character",
                    "body": "They’ve been consistently good employers for decades. Costco deserves a pass IMO.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "macnbloo",
                    "body": "Costco's generally source a lot of products locally I find",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jats82",
            "body": "madeinca.ca",
            "score": 31,
            "replies": [
                {
                    "author": "MBILC",
                    "body": "[https://madeincanadadirectory.ca/](https://madeincanadadirectory.ca/)",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Ecoste",
                    "body": "That website definitely could use a little upgrade",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "deskamess",
            "body": "This is actually a pretty good list. I will not be doing the Walmart to Loblaws shift any time soon (cost reasons).  \n  \nNow we can count on Canadian companies to not price gouge us, right? I don't think they are as patriotic as we think given their recent behaviour. Gouging Canadians is second nature to them.",
            "score": 32,
            "replies": []
        },
        {
            "author": "_hominin",
            "body": "Even better: shop CANADIAN LOCAL SMALL BUSINESSES. Remember that the Canadian oligopolies have not done much to help Canadians either.\n\nand don't forget you can still buy international, just not US-made or -owned! Korean beauty companies are superior to US-owned beauty/skin care companies.",
            "score": 31,
            "replies": [
                {
                    "author": "ACupofHojicha",
                    "body": "out of curiosity for brands owned by Korean American immigrants (like Peach & Lily) that are made/developed in South Korea and imported to the US, do you count them as Korean-owned (since the founders are Korean immigrants) or US-owned (since the companies are based in the US)?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "_hominin",
                    "body": "Walmart sells products that may have been manufactured elsewhere (e.g. China) but it is still a US company. So I would still consider Peach & Lily a US-owned company and would buy my Korean products from another distributor.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "bossington89",
            "body": "How am I the first comment on this post. I'll be bookmarking this post to refer back to until Agent Orange is out of office.",
            "score": 137,
            "replies": [
                {
                    "author": "None",
                    "body": "Forever. Can't trust a country that oscillates between stable crony capitalists and moronic fascists.",
                    "score": 66,
                    "replies": [
                        {
                            "author": "Nitramite",
                            "body": "The last time Trump was here, the Iran leader, during the scrapping of the Iran Nuclear deal, said something like: \"Why would we do any treaties with the US when a next administration can just rip it up\".\n\nThe message was clear for me, and proven again just now. The US would need to change drastically for me to trust them ever again.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "harpgrace",
                                    "body": "That is the whole reason for BRICS' existence - because none of the countries in that alliance can trust the US ever again.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jloganr",
            "body": "stop watching/listening/following  podcasts and influencers that gave Trump a platform on their channel/podcast. \n\nJoe Rogan,\n\n\"Six Feet Under\" with wrestler Mark Calaway\n\n\"Flagrant\" with comedian Andrew Schulz\n\nBarstool Sports’ \"Bussin with the Boys\" with former NFL football players Will Compton and Taylor Lewan\n\n\"This Past Weekend\" with Theo Von\n\nAdin Ross — a streamer who was banned from Twitch for offensive comments\n\n\"Lex Fridman Podcast\"\n\n\"Full Send Podcast\" with the Nelk Boys\n\n\"The Dan Bongino Show\"\n\n\"PBD Podcast\" with Patrick Bet-David\n\n\"Impaulsive\" with Logan Paul\n\n\"All in Podcast\" with Chamath Palihapitiya, Jason Calacanis, David Sacks and David Friedberg\n\n\"Shawn Ryan Show\"",
            "score": 25,
            "replies": [
                {
                    "author": "ArcticRhombus",
                    "body": "Yes. You nailed all the worst of the worst.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Embarrassed_Sail_379",
            "body": "Princess Auto is another entirely Canadian owned brand and can supplement some of things you would find at home depot, Lowe's, etc.",
            "score": 44,
            "replies": [
                {
                    "author": "Brilliant-Slice-2049",
                    "body": "Princess Auto is Fantastic",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "marcohcanada",
                    "body": "Lowe's already left Canada and Rona replaced their stores with Rona+ stores.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "YaCANADAbitch",
                            "body": "This is one of those gray areas where I'm not totally sure what's Canadian or not. But I'm not sure Rona is Canadian anymore.\n\nhttps://globalnews.ca/news/9251295/lowes-rona-selling-private-equity-firm/\n\n\"Lowe’s Companies, Inc. is selling its Canadian retail business to New York-based private equity firm Sycamore Partners for US$400 million plus a performance-based deferred consideration.\"\n\n\"The deal, expected to close in early 2023, will establish Lowe’s Canada and RONA as a standalone, Quebec-headquartered company\"\n\nSo owned by an American equity firm but headquartered in Quebec.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "razorblade705_",
            "body": "I just would like to say that this can’t viably be an all-or-nothing situation. Not everyone will be able to abide by everything in this post, all the time. \n\nBut, do as much as you can. Every little bit helps!",
            "score": 23,
            "replies": [
                {
                    "author": "downrightwhelmed",
                    "body": "\nSpot on",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "ElJamoquio",
            "body": "As an American - Thanks.  And sorry.",
            "score": 22,
            "replies": [
                {
                    "author": "-Boourns-",
                    "body": "I echo this and fully support my good neighbors to the north.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "coasterbill",
                    "body": "Same. Also, we’re the ones saying “sorry” to the Canadians now. That must be weird for them.\n\nAlso, we booked a summer trip in Canada after seeing the news yesterday. I don’t care if these tariffs happen or not, I hate that this is how we’re treating the people of Canada and want to go there and spend money there.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Madreese",
                            "body": "To be honest, based on all the vitriol here on this subreddit, I'm a little scared to visit Canada. I do not support trump or this administration, but I keep reading about how much Canadians hate Americans now and it's a little off-putting. I absolutely would not feel welcome based on what I read here.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LetterheadLopsided26",
                                    "body": "IF any Canadian hassled you, there would be ten more of us to defend you. Come and enjoy!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "slevin07rocket",
                                    "body": "You’re fine. There’s plenty of Americans visiting at all times, we border you. Just no maga hats, or positive talk of trump. No one can look at you and tell you’re American. Slap a Canada flag on your car if you want.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Madreese",
                                            "body": "Haha! I don't spend time with people that wear maga hats. ;)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LongevitySpinach",
                    "body": "I am so very sorry. Canada does not deserve this.   \nWe deserve to be boycotted by the entire free world.   \n  \nOur best hope here in the US is a hard crash of the economy to wake up the morons who voted for this.   \nUnfortunately, the entire world economy will be hurt.   \n19 months til mid-terms.   \n  \nI'm buying as close to nothing as I can and shorting Tesla, Amazon, McDonalds & Home Depot.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "European lurking here. This is great. Here is an additional resources for European based technology alternatives: https://european-alternatives.eu/",
            "score": 50,
            "replies": [
                {
                    "author": "Winter_Criticism_236",
                    "body": "Love this list! Any Netflix like companies in Europe?\n\nNeed Canadian Tech list",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MutedMeaning5317",
            "body": "In western Canada, please shop at your local Co-op when you can. \n\nIt really doesn't get more local for food, fuel and building supplies (where available). \n\nThey are also a large AG supplier owned by (and for) farmers.",
            "score": 81,
            "replies": [
                {
                    "author": "slashthepowder",
                    "body": "Yes 100% also home hardware is Canadian vs Home Depot",
                    "score": 28,
                    "replies": [
                        {
                            "author": "CalligrapherMost5328",
                            "body": "And Rona hasn't been Canadian owned since 2016 after lowe's gave up on it, they sold to a NY investment firm in  2023",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Foreign_Tourist308",
                    "body": "Not just farmers.  Anyone can be an owner.  Buy a membership, and you become one of the owners.  But yes, shop Co-op if you have one in your community.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MutedMeaning5317",
                            "body": "Agreed. I was speaking more to the AG side of Co-op, but you are correct. I am an 'owner'.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ninetyninewyverns",
                    "body": "I love co-op. They have gas, convenience stores, grocery stores, lumber, ag supplies.. really anything u need (to an extent).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hipnerd",
            "body": "California native here. I fully support this. \n\nTrump won by 1.5% of the popular vote. But the fact that anyone voted for him is embarrassing. Even if you agree with his abhorrent politics -- and I don't -- every time I listen to the man I am struck by how absolutely stupid, egotistical and mean he is. \n\nI used to think that Hitler must have been a brilliant speaker. How else could he have gotten all those people to follow him? \n\nNow, I realize that in order to get some people to follow you, all you need to do is tell them that it's okay to be the worst version of themselves. Be racist. Be xenophobic. Be misogynistic. \n\nInstead of inspiring us to be the best version of ourselves, Trump tells us it's okay to be awful. \n\nI miss Obama so much.",
            "score": 15,
            "replies": []
        },
        {
            "author": "oddspellingofPhreid",
            "body": ">KFC, Popeyes → your local ma and pa chicken place\n\nMary Brown's",
            "score": 54,
            "replies": [
                {
                    "author": "Gold_Lengthiness3061",
                    "body": "A and W as well",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Amaruq93",
                            "body": "Your A&Ws are just bloody fantastic. When last I visited, their burgers were terrific. The way the cheese and onions were melted onto the beef. *chef's kiss*",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bwr0ft1t0k",
                    "body": "Best legs in town",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "HammyMugats",
            "body": "The key is not who “owns” the companies but rather where products are produced.  \n\nKilling American companies that are operating here and employing Canadians isn’t net positive because people are employed by them.  \n\nIf we can force Walmart to stock more Canadian brands and let the US products rot on the shelf, that has the most impact.   It supports both workers and rewards Canadian producers.",
            "score": 14,
            "replies": []
        },
        {
            "author": "nikobruchev",
            "body": "You should double check alot of these. Mondelez owns Cadbury, Keurig Dr Pepper owns Canada Dry, etc.\n\nLots of American ownership still in your list.",
            "score": 32,
            "replies": [
                {
                    "author": "JiveBunny",
                    "body": "Unilever is Anglo-Dutch.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Wattthehack",
                    "body": "Old Dutch is owned by Pepsi-co",
                    "score": 10,
                    "replies": [
                        {
                            "author": "FuckFuckittyFuck",
                            "body": "Old Dutch is American owned but not by PepsiCo.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Wattthehack",
                                    "body": "Sorry, you are correct. Too many corrections today. It is owned by Humpty Dumpty.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "knifefarty",
                            "body": "how is this upvoted lol, completely incorrect.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "staunch_character",
                            "body": "Nooooo! My sister lives in Seattle now & I always bring her Old Dutch chips when I visit because she can’t find them down there. Was sure they were Canadian!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Wattthehack",
                                    "body": "They started in Minnesota and opened a plant in Winnipeg in the 50s. They were bought out almost 20 years ago. https://en.m.wikipedia.org/wiki/Old_Dutch_Foods",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Rin_sparrow",
            "body": "Lululemon is Canadian but the company is problematic. https://www.cbc.ca/news/business/lululemon-greenwashing-investigation-competition-bureau-1.7194913 \n\n\nAlso Chip Wilson is a dick",
            "score": 44,
            "replies": [
                {
                    "author": "TheZara",
                    "body": "Lolë is an alternative based in Montreal https://www.lolelife.com/",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "manonaca",
                    "body": "Bare activewear is a good alternative. Indigenous owned!",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Rin_sparrow",
                            "body": "Thank you for the recommendation!!",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Various_Shape_3286",
            "body": "When canceling netflux, remember that it's still available until the end of your billing period, which might give you lots of time to download everything in your queue.",
            "score": 12,
            "replies": [
                {
                    "author": "ATR2400",
                    "body": "And if you absolutely MUST continue to watch your shows, always remember there are… alteratives 🏴",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "MBILC",
                    "body": "Once your account is closed you can not access the downloaded content either.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Ill_Excuse_1263",
                            "body": "Keep your laptop wifi turned off until you've watched it all so it doesn't try to log in and clear the queue",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GN-004Nadleeh",
            "body": "Here is my list for Small and Medium size business to start breaking away from USA big tech. This will cheaper too! As its either free or doesn't require reoccurring licenses or even BOTH! Just need the technical know how. Put money back into internal IT employees.\n\n\\- Windows/MACOS -\n\nZorin OS, Designed explicitly to replicate the Windows interface. Offers a \"Windows-like\" desktop layout option.\n\nZorin OS includes a macOS desktop layout option during setup, complete with a dock and top bar.\n\nZorin OS runs on Linux so you avoid all the viruses that target Windows Machines. \n\n\\- Broadcom VMWare and Microsoft HyperV -\n\nProxmox Free opensource hypervisor to run your virtual machines/servers by guys in Austria\n\n\\- Dell laptops -\n\nEurocom Ontario-based High-performance, customizable laptops for enterprise, gaming, and industrial use.\n\nLenovo (China), Acer (Taiwan), ASUS (Taiwan)\n\n\\- Exchange/Gmail -\n\nProton Mail (Switzerland), Tutanota (Germany), Mailfence (Belgium)\n\n\\- GSuite and Microsoft 365 -\n\nLibreOffice in the cloud; pairs with Nextcloud (Canadian) for a full suite.\n\n\\- Firewalls -\n\nCombine Fortinet (Canadian) with Free Opensouce pfSense/OPNsense software for cost-effective edge security. No more expensive reoccurring license fees!\n\n\\- Switches -\n\nMikroTik (Latvia)\n\nCost-effective, enterprise-grade switches (e.g., CRS series) with RouterOS.\n\n\\- Wifi Access Points (APs) -  \nOmada Enterprise AP (Which is TP-Link, which are made in China)",
            "score": 11,
            "replies": [
                {
                    "author": "marmiearmy",
                    "body": "This should be stickied to raise awareness",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Cyclonis123",
                    "body": "we need chips made outside America, Intel, amd, Nvidia etc all America.  I can't see a path out of this in the near future.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "manonaca",
            "body": "Skip the Dishes instead of Uber Eats",
            "score": 41,
            "replies": [
                {
                    "author": "IMAWNIT",
                    "body": "Been doing that for ages since they offer way better deals.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Clock-2779",
            "body": "I’m American and I support you guys",
            "score": 10,
            "replies": [
                {
                    "author": "downrightwhelmed",
                    "body": "We can’t impact your elected representatives. Please consider contacting them and voicing your displeasure. Annexing your neighbour/ally should be off the table.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "will_dormer",
            "body": "I have shared this on r/Denmark . I will take inspiration from this",
            "score": 10,
            "replies": []
        },
        {
            "author": "radiomonkey21",
            "body": "Good resource but don’t be fooled, these tariffs aren’t arbitrary. It’s step one in an attempt to annex Canada.",
            "score": 33,
            "replies": []
        },
        {
            "author": "omicronomega",
            "body": "For east coasters Irving gas stations are Canadian.",
            "score": 8,
            "replies": []
        },
        {
            "author": "DarkAres02",
            "body": "I'd just like to add that Nestle is pretty evil so I wouldn't choose them as a positive replacement.\n  \nAnyways any suggestions for peanut butter? I eat Kraft right now",
            "score": 8,
            "replies": [
                {
                    "author": "Two_wheels_2112",
                    "body": "I believe the Kraft PB is made in Canada. The peanuts are imported, but you won't find any non-imported peanuts because they don't grow in our climate. \n\nIf you don't want to support Kraft, I suspect most store brands are probably made in Canada, too. Maybe by Kraft, but at least they'd be getting less of your money.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "IvarForkbeardII",
                            "body": "https://picardpeanuts.com/about-us/",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Two_wheels_2112",
                                    "body": "Yes, I've since learned about Picard. News to me! Unfortunately, their peanut butter is made with canola oil for some reason.\n\n\nI get the impression they also import peanuts, but maybe \"Virginia\" is just the species? ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "_hominin",
                    "body": "maybe the generic store brand?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "zshaan6493",
                    "body": "Go to Bulk Barn and make your own?\nThey have machines to grind butter peanut, almond, etc.\n\nThey also have country of Origin on all products. I don't remember where the peanuts come from though.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "IvarForkbeardII",
                    "body": "https://picardpeanuts.com/about-us/",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "The-Ghost316",
            "body": "* KFC, Popeyes → your local ma and pa chicken place\n\nMary Brown's Chicken - 100% Canadian own and its really good.",
            "score": 23,
            "replies": [
                {
                    "author": "IReuseWords",
                    "body": "Their taters are soo good!!!!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "volvo is chinese owned, but nice list!",
            "score": 7,
            "replies": []
        },
        {
            "author": "sl3ndii",
            "body": "Unfortunately Ubisoft is going down the toilet… so that will definitely become a harder sell to Canadians.",
            "score": 6,
            "replies": [
                {
                    "author": "marcohcanada",
                    "body": "When I saw Ubisoft Montreal I was thinking back to the good ol' days when they made the 1st Splinter Cell and Chaos Theory. It's really sad to see how far they've fallen.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "borntobebald1",
                            "body": "I still find that their smaller games tend to be better. I still really liked the last Prince of Persia game that came out last year. On the bright side, the video game market is big and geographically diverse that it is fairly easy to avoid US games.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Row3886",
            "body": "In Quebec - instead of Dairy Queen go for Chocolats Favoris",
            "score": 7,
            "replies": [
                {
                    "author": "zshaan6493",
                    "body": "D spot dessert is Canadian too.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 6,
            "replies": [
                {
                    "author": "Jayco424",
                    "body": "Yeah canceled all my Amazon stuff and my subscription when he quashed the Post's endorsement of Harris. In hindsight it's not surprising that a billionaire is in favor of corporatism and oligarchy, but a lot of Americans, my self including thought he was at least left leaning. Keep the boycotts up, it's the only way these people will learn, it has to hurt them, particularly in their pocket book for the lesson to stick.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Jayco424",
                                    "body": "I'm all for it you guys need to protect yourselves. Canada, Latin and South America, the EU and Commonwealth, Japan and South Korea, all of you need to boycott American goods as much as possible, and establish closer ties including militarily, a law signed by Biden prevents Trump from pulling America from NATO on his own but he has a Republican congress to do his bidding now. As myself and the rest of liberal America, I don't want to say it's too late for us, but it might well be ... either way we're not going down with out a fight we'll keep carrying on best we can resisting all the while. ",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MortalSmile8631",
            "body": "Don't forget the patriotic Canadian dogs too.\n\nPetsmart, Petco →Global Pet Foods, Ren's Pet, Petvalu\n\nKong, West Paw, Sodapup →Messy Mutts (for their toys to stuff raw food into)",
            "score": 8,
            "replies": []
        },
        {
            "author": "Otherwise_Birthday_8",
            "body": "If you can afford to do so, your local farmers markets, businesses and craft markets are even better.  Often times, you're interacting directly with the owners, who benefit directly from your business.  It's the best way to build community and we need that more than ever now.",
            "score": 13,
            "replies": []
        },
        {
            "author": "ElectricalDevice9653",
            "body": "Another European lurking here. Tried to find what Canadian goods I can buy in my supermarket but can only find maple syrup ( which I buy anyway) and maple syrup cookies. But boy are there a lot of U. S brands for me to boycott!",
            "score": 7,
            "replies": [
                {
                    "author": "slevin07rocket",
                    "body": "I think europe blocks our beef due to regulation differences (growth hormone). So unfortunately, probably not much supermarket wise outside maple syrup. Perhaps McCain (fries and other good), but I don’t know breakdown of European division and current ownership. \n\nIf you drink alcohol, I’ve seen Europeans post Canadian purchases. Moosehead beer (guessing online order), crown royal or jp wisers for liquor.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RaspberryBirdCat",
            "body": "Canada actually has a thriving video game industry, although there's a lot of foreign ownership.  \n\nUbisoft Montreal (Assassin's Creed, Tom Clancy Rainbow Six, Far Cry) is the largest video game studio in the world; they're a subsidiary of Ubisoft (France).  \n\nBioWare (SW:TOR, KOTOR, Mass Effect, DragonAge) is in Edmonton, although they're owned by EA now.  \n\nEA Vancouver (FIFA, NHL, UFC) is actually EA's largest studio.  \n\nEidos Montreal (Deux Ex) is now owned by Square Enix of Japan.  \n\nRelic Entertainment (Warhammer: 40000, Age of Empires IV) is independent, in Vancouver.  \n\nIronclad (Sins of a Solar Empire) is independent, in Burnaby.  \n\nExtremely OK Games (Celeste) is independent, in Vancouver.  \n\nHinterland (The Long Dark) is independent, in Vancouver.  \n\nSabotage (Sea of Stars) is independent, in Quebec City.  \n\nBig Blue Bubble (My Singing Monsters) is independent, in London, Ontario.  \n\nBehaviour Interactive (Dead by Daylight) is independent, in Montreal.  \n\nStudio MDHR (Cuphead) is independent, in Oakville.  \n\nHB Studios (PGA Tour 2K) is owned by American firm 2K, located in Lunenburg.  \n\nKlei Entertainment (Don't Starve) is owned by Chinese firm Tencent, located in Vancouver.  \n\nNext Level Games (Luigi's Mansion 3, Mario Strikers) is owned by Nintendo, located in Vancouver.  \n\nPhoenix Labs (FaeFarm) was independent, but announced in January 2025 that they were letting go of their development team after acquisition by an American firm.  \n\nHothead Games (Penny Arcade) went bankrupt in December 2024.  \n\nThere's a lot of Canadian talent in gaming that is worthy of your support.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Sunflower6876",
            "body": "Minnesotan here- I wanted to say thank you for having a backbone. Know that there are people in the US, like me, who didn't want this and didn't vote for this. \n\nThis is frankly embarrassing that we are throwing a good friendship in the trash over petty self-interests, but alas, here we are on the weirdest and darkest timeline. \n\nI've been to Canada twice and absolutely loved it... hoping one day to make it to Montreal.  Thank you for being such friendly and welcoming neighbors... I'm hoping that one day, maybe, that things will right themselves and good will conquer evil. \n\n\n-Your friend to the south.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Secret-Dimension-734",
            "body": "I'm a brit, over in the UK but have saved this anyway and will be doing my best to buy Canadian in solidarity and boycott anything American.\n\nGood luck Canada, the world is on your side in this",
            "score": 5,
            "replies": []
        },
        {
            "author": "drae-",
            "body": "Galen weston is suddenly /r/Canada's best friend. 🙄",
            "score": 29,
            "replies": [
                {
                    "author": "Musclecar123",
                    "body": "I’m still firmly in the F that guy camp, but there are bigger things at play.\n\nWe’ve switched to groceries at a local Independent grocer. The meat is butcher quality at prices I haven’t seen since the mid 00’s. ",
                    "score": 33,
                    "replies": []
                },
                {
                    "author": "ManofManyTalentz",
                    "body": "Now most PC products are made in USA. Read the labels out there!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "drae-",
                            "body": "Life brand products are literally referenced in the op.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "morenewsat11",
                            "body": "Agree. I switched from PC Mayonnaise to Hellman mayonnaise because of this. Hellman is made in Canada with Canadian products. Labels make a difference when supporting Canadian farmers and Canadian factory workers.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gigglingtin",
                    "body": "It is so vital right now to ask ourselves who or what is the ultimate enemy that we want to defeat. As fucked as Trump and his tech bros are, the reason why they are doing this is for personal financial gain. While it is true we are facing a trade war between nations, the bigger war we are facing globally is a class war.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "drae-",
                            "body": "It is so vital right now to ask ourselves: is my post relevant to the comment I'm replying to?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GreyMatter22",
            "body": "* Nike → Lululemon, Roots, Nobis, Canada Goose, Artizia, lots more \n* KFC, Popeyes → Mary Browns, along with other spots",
            "score": 6,
            "replies": [
                {
                    "author": "Evening_Air9257",
                    "body": "Roots is no longer Canadian unfortunately - got bought by a US investment firm. ",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "giggledip",
            "body": "For fried chicken, MARY BROWN’S! Founded in St John’s in 1969!!!",
            "score": 4,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "It's much, much better quality food anyways",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brilliant-Slice-2049",
            "body": "A couple of Local brands for clothing:\n\n\\- Peace Collective (A lot of sports references - From Toronto)\n\n\\- Province of Canada (Great sweatsuits and shirts btw! - From Toronto)\n\n\\- North Standard Trading Post (This brand is small and owned by a local family - From Toronto)\n\n\\- Vessi (They are very very good shoes - From Vancouver)\n\nAll three are very good quality! Been buying them for years.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Moonspindrift",
            "body": "American here, hoping it's okay to post my support for you guys. I live in a state that is hugely popular with Canadian snowbirds, and I have made many good friends among the regulars who show up in my neighborhood year after year. I can hardly look them in the eyes right now. I am so deeply ashamed my country re-elected this clown, and that the harm he does is already being felt beyond our borders..",
            "score": 4,
            "replies": [
                {
                    "author": "downrightwhelmed",
                    "body": "We appreciate the support. Please consider contacting your elected representatives. Even if you’re from a deep blue state. We need people to stand up for this allyship.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "OrganicRedditor",
            "body": "Dennys is owned by Gaglardi, so Canadian??  Also Kicking Horse coffee is great and from Canada!",
            "score": 5,
            "replies": []
        },
        {
            "author": "SnackSauce",
            "body": "I was looking at some of my labels yesterday and came across French's Mustard. Big Canadian maple leaf logo on it. Figured it was made in Canada. Decided to look closer and noticed it actually said \"Made with 100% Canadian mustard seeds\". I thought it was weird it said that vs made in Canada. I looked at the back label, and sure enough it says \"Imported by \\_\\_\\_\\_\\_\\_\" 'whatever company' out of Ontario.\n\nI am blown away by that. Our mustard seeds are exported to the USA so the mustard can be made, where we then import it back into Canada to sell. That is madness. I know that happens in some other industries (like auto), but there is NO reason we can't produce our own mustard here, especially consider we grow so many mustard seeds. I know there are smaller companies that do, but not at the scale that French's or Heinz does. I've been buying French's for almost a decade because I thought they were Canadian (because of the maple leaf logo), but nope. American company, and not made in Canada.",
            "score": 5,
            "replies": []
        },
        {
            "author": "StridingForSanity",
            "body": "Dear Canada, please see the insanity happening in the US as a warning. Elect smart, rational, level-headed leaders. Fight misinformation. Cut back on social media. Don't buy into the conspiracy theories. Shut off the FoxNews. If you have friends and family who are going that direction hold an intervention. We are seriously in trouble. I'm embarrassed to be American today. But Canada please keep your beautiful country as it is so we have a place to escape to!",
            "score": 6,
            "replies": []
        },
        {
            "author": "nikolain777",
            "body": "Don't buy Apple Devices, move to Samsung or other Android devices",
            "score": 27,
            "replies": [
                {
                    "author": "None",
                    "body": "Google owned device",
                    "score": 6,
                    "replies": [
                        {
                            "author": "xylopyrography",
                            "body": "Google doesn't make anything when you buy a Samsung phone. If anything they are paying Samsung money to keep Chrome, Maps, etc. prominently in their OS.\n\nBuying an Apple phone means Apple makes basically half of that in profit directly.\n\nBoth companies make a lot from their app stores as well, so that would be the thing to avoid for current devices.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "TadUGhostal",
                                    "body": "Don’t use the Play Store is a really hard thing to do in 2025. Even if you don’t buy apps, data is still being collected on you. For phones and computers, it’s going to be really hard to totally bypass the USA for a lot of folks.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Macleod7373",
                                            "body": "Check out r/degoogle for other methods to get away from the Goog",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "xylopyrography",
                                            "body": "Yeah, if you want to move away from that you have to make sacrifices.\n\nBut you could consider GrapheneOS.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "TadUGhostal",
                                                    "body": "It might be more practical for most people to try to:\n\nRepair vs replace a damaged device\n\nBuy used locally\n\nHold onto an older device for longer than you normally would\n\nAvoid as many app purchases as possible\n\nFind a non-US app you need if possible",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "xylopyrography",
                                                            "body": "Yeah, like if you don't want to switch off iOS, just pick up a used iPhone. \n\nPhones have gotten so boring that any phone these days is fine and if you take care of it might make it 5-6 years.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "IReuseWords",
                                                    "body": "Lots of FOSS apps for Android out there too. And if you have technical skills you could even self host apps for your own cloud.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Darex2094",
            "body": "Looks like with a French language exam I may (assuming I do well) be Express Entry eligible.\n\nThe US is burning down around me and the citizens are just sitting around and watching it happen in real time, doing nothing to prevent or stop it.\n\nThe idea of moving to a new country is scary, but I need to protect my family. Hopefully relations between the US and Canada don't grind to a halt so bad that immigrating over will nolonger be an option...",
            "score": 4,
            "replies": []
        },
        {
            "author": "Routine-Agile",
            "body": "as a american I would say, Ingore companies owned by people the billionares for as long as possible. Fuck amazon and twitter, facebook, instrgram and anything those fucks touch. \n\nIt is going to suck where I am for a while, and proud to see a country start to stand together when it is important. It makes me sad its not happening enough where I am.",
            "score": 5,
            "replies": [
                {
                    "author": "Didact67",
                    "body": "The whole world would probably be a better place if we just rejected social media. It sows division under the guise of bringing us together.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "EvacuationRelocation",
                    "body": "I disagree - what people should be doing is opening accounts on X and uploading lots of big videos of nothing, again and again and again. Flood the site with TBs of nonsense data to store and process, hour after hour.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "4X-Citement",
            "body": "Odd question:\n\nAre there Canadian companies making non-reusable maxi pads?\n\nWe found \n\nhttps://easyperiod.ca/collections/products\n\nand ordered some but I can't seem to find any alternatives?",
            "score": 4,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Extremely important question here for our Canadians who have menses! Any info would be great.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MoarRowr",
            "body": "Spotify (Sweden) or Deezer (France) can be used in lieu of Apple Music or Tidal!",
            "score": 3,
            "replies": []
        },
        {
            "author": "StridingForSanity",
            "body": "What advice do you have for sane Americans? In this situation many of us feel more empathetic to Canadians in this issue because we, too, are being targeted by Trump. His Border Czar has promised to \"bring hell\" to Boston--an American city. What kind of federal spokesperson promises to \"bring hell\" to a city in his own country??? We feel your pain Canada.",
            "score": 5,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Call all your representatives that you vote for, twice a week. But honestly act, for your own (but also our) future.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "slevin07rocket",
                    "body": "Travel to Canada and help our economy if you can afford it. Hard boycott maga items like Tesla, ‘buying’ ufc ppv’s or attending their events. Targeted boycotts work the best.\n\nEncourage others you know to travel to Canada. Maybe buy canadian, maple syrup, beer (moosehead), whisky (crown royal, jp wiser) if you drink and can find it. Join a protest near you.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "doublepitstochesty69",
            "body": "As an American, I applaud our neighbors to the north and am deeply sorry for the major pain in the ass our country has been / will be forever. The majority of us stand with you and are cheering you on. 🫶",
            "score": 4,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Thanks but the sentiment continues to be - please do something for yourselves.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "doublepitstochesty69",
                            "body": "Hmm, sorry if that’s how my message came across, but not how I meant it in the slightest.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "future4cast",
                                    "body": "I think the message is—thank you. Americans need to find ways to push back on their corrupt government, for their own sake, and for those being attacked.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "doublepitstochesty69",
                                            "body": "Yep, completely agree. Hoping to catch some protests this week but there has shockingly been none near me to my knowledge. Weather is starting to heat up this week though so I feel like it will be popping off soon enough.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheRealBadVlad",
            "body": "Swamp German here. Was planning on going on going to USA on holiday in summer. We’re looking now at going to Canada.",
            "score": 4,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Highly recommend either PEI or Quebec, depending on what kind of holiday you were after!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "sudo_su_88",
            "body": "As an American from Washington state, I am so deeply embarrassed and sorry to our neighbors up north. Our state vote overwhelmingly blue -- and was the only state that went MORE blue than the rest for the country in the last election. I have visited Banff and just love it up north. We fear for our lives as queers in Seattle area.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Cory123125",
            "body": "It cant be overstated how much PP cannot be allowed to win.",
            "score": 7,
            "replies": []
        },
        {
            "author": "ShakingMyHead42",
            "body": "This is a very valuable post. A couple of corrections, if I may:\n\nShell is a Dutch company, not American.\n\nRona bought Lowes and I believe it's Canadian.\n\n  \nCorrect me if I'm wrong. :)",
            "score": 13,
            "replies": [
                {
                    "author": "Foreign_Tourist308",
                    "body": "Lowe's bought Rona.  Then, later, they sold it to a New York private equity firm called Sycamore Partners.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "ShakingMyHead42",
                            "body": "TIL! Okay, Rona remains on my banned list. The Lowe's in my neighbourhood got renamed to a Rona recently, so I concluded that the sale was in the reverse direction.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "_hominin",
                    "body": "Canadian Tire is the way to go, their Triangle Rewards program has also improved so earn those cash back points!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "RaspberryBirdCat",
                    "body": "Shell is actually British now, although that is a relatively recent move, having been a co-op British/Dutch company for most of its history.\n\nShell Canada was previously somewhat independent, with 78% ownership by its parent, but in 2007 it was bought out by Shell.  Shell Canada is now controlled by Shell Energy North America, headquartered in Houston; although Shell North America is wholly owned by its parent.\n\nThere may be some Americanism in there but I'd be confident enough to declare it a British company, not an American one.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "uppy-puppy",
            "body": "Beauty products would be a great thing to include in this list! Places to shop, brands to buy, etc.",
            "score": 7,
            "replies": [
                {
                    "author": "None",
                    "body": "Well.ca has a filter for Canadian products - has pharmacy & groceries too, this'll be my Amazon replacement!",
                    "score": 13,
                    "replies": [
                        {
                            "author": "uppy-puppy",
                            "body": "Thank you!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "_hominin",
                    "body": "Korean beauty companies are superior to US-owned beauty/skin care companies. Lots of online sites that delivery to Canada! The Ordinary is also Canadian made",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Brilliant-Slice-2049",
                    "body": "Rare Beauty is a American brand but when I was looking them up it looks like they make their stuff in Italy and Korea.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "SplashOfCanada",
            "body": "Pretty sure all GM Sierra/Silverado trucks are built in Indiana",
            "score": 3,
            "replies": []
        },
        {
            "author": "brianagh",
            "body": "Anybody have a good suggestion for Canadian version of Pepsi? Everything seems Coca Cola centred.",
            "score": 3,
            "replies": [
                {
                    "author": "ithium",
                    "body": "Coca-Cola is fine, it's american owned but Coca Cola Canada produces everything in canada for the canadian market.. some of the \"boycutts\" are stupid. Mcdonalds is american but has an entire canadian division that is seperate from the US offices and they source most if not all from Canada farms.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "jtbc",
                            "body": "I am on the fence about McD's. Their profits still flow south and (like Coca Cola) they are such a symbol of the United States, that I am OK with shifting my burger habit to A&W.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Two_wheels_2112",
                            "body": "Yeah, I wouldn't go out of my way to avoid Coke or Pepsi products. They are all bottled in Canada.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "knifefarty",
                            "body": "it’s not even american owned, coca cola canada is completely canadian owned and operated, it just licenses the brand",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "brianagh",
                            "body": "Well this is great to know, cause there’s no way my mom is ditching her pepsi LOL",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Qwertyuser466",
            "body": "For the outdoor types, Arc'teryx is based in north Van with a factory there, although its parent company is Finnish.\nSome good Quebec brands too, Chlorophylle for example.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HowieFeltersnitz",
            "body": "Chuck's Roadhouse is Canadian if I recall correctly. A decent alternative to The Keg if you're hoping to save a bit of money.",
            "score": 3,
            "replies": [
                {
                    "author": "ir_da_dirthara",
                    "body": "The Keg is a Canadian owned chain. ",
                    "score": 3,
                    "replies": [
                        {
                            "author": "HowieFeltersnitz",
                            "body": "Yes I know. I meant an alternative price point.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Two_wheels_2112",
                    "body": "Likewise Mr Mikes.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brilliant-Slice-2049",
            "body": "This may sound obvious but buying used cars will help the auto sector at least a little bit. They vehicles are already in the country and get passed around between provinces and cities. And we have a large inventory. If the tariffs stand new cars that pass through the us border for assembly can be subject to multiple tariffs (we'll have to see but theoretically). One car passes between the three countries 8 times before its complete. The price of buying new will skyrocket. This will impact manufacturers but dealers as well. So support Canadian auto businesses by buying used.",
            "score": 3,
            "replies": [
                {
                    "author": "Canaduck1",
                    "body": "Every car I've ever purchased was manufactured in Japan. I appreciate how many people the auto sector employs, but North American cars suck in comparison.\n\n(I am aware that some Japanese vehicles are made in North American plants, such as the Honda plant in Alliston, ON. Mine weren't. Every vehicle I've wanted was manufactured overseas, not in the plants here.)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "xkmackx",
            "body": "Some of these aren't correct. Just a couple from skimming. Shell is Dutch/British. Roots is not Canadian.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MagicGamerLettuce",
            "body": "Even now with the tariff pause we canadians need to vote with our dollar this way. It was brazen and reckless how he handled this, we have to remind him of that.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ShoulderCrazy996",
            "body": "This was a great wake up call to avoid USA crap for me. Will be making the switch permanently no matter the outcome of this dementia ridden bullshit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Weekly_Technology467",
            "body": "Canadian tire is an option to shop for house items, vehicle maintenance parts and also gas",
            "score": 3,
            "replies": []
        },
        {
            "author": "borntobebald1",
            "body": "what are some comic book publishers/writers/authors?",
            "score": 3,
            "replies": []
        },
        {
            "author": "andreilled",
            "body": "Could someone add pet food Made in Canada?  Thanks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Calm_Ad5457",
            "body": "American here, in a throw away account. I am so sorry about all this. I don't know where else to post this, but I have to say it.\n\nI live in what is essentially now a red state, used to flip around a lot. I fully endorse your sentiment at my own expense. We have worked with government in Canada for decades now. We love all the friends we have made in your country.\n\nI used to travel a lot to do trainings. It was an exceptionally eye opening experience for me about just how wonderful your country is - and the people in it. Sometimes I would recount my adventures and hear that I have seen more of Canada than most Canadians. From Iqaluit and Yellowknife and Whitehorse to all the provincial capitals and major cities.\n\nI think my first note is that - you don't need to come to the US for vacations. The idea that you do come here has, honestly, always been silly to me. You have unending beauty up there.\n\nIf we lose our chance to work with you - for you - because of who was elected down here, it will be devastating to me. Not only does it truly risk this business itself - it does very much so - but also because this tariff nonsense is a total betrayal of the things we have truly built together. Things that I have a lot of pride in, and things that some of you may use every day.\n\nOur customers are truly now my friends. Friends in every province and territory. I know I won't lose them as friends, but I will lose our constant contact. Real, sincere tears will be shed.\n\nBut even with that in mind. Even at the risk of our business. At the risk of my friendships. PLEASE do these things even if the tariffs don't materialize.\n\nAnd to the point of being kind to Americans - I do recommend it. It may not be apparent, but the Dear Leader didn't even suggest tariffs on Canada until after the election. It was not in the platform, and was at least not openly discussed. While I am a left-leaning centrist (in the context of US politics, that makes me a far left radical down here), and never even thought of voting for Trump, some that I know are even regretting their vote over this and other things.",
            "score": 3,
            "replies": []
        },
        {
            "author": "who-waht",
            "body": "RONA is now owned by a NYC based company.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Unusual_Concept_4882",
            "body": "I wish I was an X/Twitter user so that I could become an ex-X/Twitter user….",
            "score": 3,
            "replies": []
        },
        {
            "author": "Meinkw",
            "body": "Muskoka Bear Wear for sweatpants and tops",
            "score": 3,
            "replies": []
        },
        {
            "author": "Old_Assumption_888",
            "body": "What about American-owned newspapers like the Postmedia chain (National Post, Calgary Herald, Edmonton Journal, Ottawa Citizen, Vancouver Sun, etc.?",
            "score": 3,
            "replies": []
        },
        {
            "author": "virtualExplorer126",
            "body": "I feel like if there’s any Canadian alternatives to Uber and Amazon etc. right now they would be so supportive 😭😭😭. I’m so eager to switch… \n\nCanadian software engineers/developers where are y’all we need you!!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "FluffyTailSociety",
            "body": "McMunn and Yates is a hardware store that is canadian. [https://mcmunnandyates.com/about-us?srsltid=AfmBOopgUi3wHHY\\_7wdATav68LlcS9\\_h2zz5\\_bSDnX9ucfzm28gb9FF5](https://mcmunnandyates.com/about-us?srsltid=AfmBOopgUi3wHHY_7wdATav68LlcS9_h2zz5_bSDnX9ucfzm28gb9FF5)",
            "score": 3,
            "replies": []
        },
        {
            "author": "dogeatingbanana",
            "body": "American in Florida here and I applaud all of you. Please keep us who didn't support this Orange Menace in your thoughts. ❤️",
            "score": 3,
            "replies": []
        },
        {
            "author": "SpellNo5699",
            "body": "As an American I'm going to be crossing the border at some point a long with a few friends to spend some dollars in Canada.  I refuse to support this current oligarchy any more than I have to.",
            "score": 3,
            "replies": []
        },
        {
            "author": "CenturyBreak",
            "body": "What's the alternative for tech like iPhone, Dell computer and Microsoft suite?",
            "score": 3,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Nothing directly in Canada or Mexico, but consider ASUS or Samsung, ASUS, and if possible open office but that depends on your needs.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Francis_Soyer",
            "body": "I am moving our fabrication facilities and cybersecurity hq from the US to the Greater Sudbury Area this spring. I assure all of our Canadian friends that the brain-drain is significant right now.\n\nfwiw: there are massive protests (all peaceful so far) going on across the entire US, and our (state) media isn't covering any of it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "hyperforms9988",
            "body": "We ought to show some more love to our Canadian musicians too.  That's a very easy and probably \"free\" way to support our own (most people are on subscriptions and don't outright buy music, so the concept of \"free\" is a bit strange)... and frankly I think for a lot of people, it would take them on a journey of discovery of music they've been missing out on if you're somebody that listens generally to what's popular and little else.\n\nJust to throw one out there... for metalheads out there that vibe with music from bands like Mastodon and Opeth, try giving Anciients a go if you haven't heard them yet.  If you like technical death metal, you've probably heard of Archspire by now, but if not, get on that.",
            "score": 3,
            "replies": [
                {
                    "author": "Mananers",
                    "body": "Unleash The Archers is my favourite ... Pop-Melodic-Epic-Power-Metal band, and they're from Vancouver! (I'm bad at typing metal, i've only come back to the genre in the last few years). Just to add to your list. \n\nSecond Anciients as well!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "hyperforms9988",
                            "body": "If you're into tech/progressive death at all, I hope this band goes on to release an album and do big things because good lord is this solid for how tiny the view count is:  https://www.youtube.com/watch?v=RYcuE1YyJ4E\n\nIt was a random recommendation on Youtube that couldn't possibly be more perfect of a match for me outside of not having cleans.  I love bands that have both cleans and growls.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "phatdaddy29",
            "body": "when you cancel netflix and other subscriptions, write: tariffs, oligarchs, and fascism in the comment section.",
            "score": 5,
            "replies": []
        },
        {
            "author": "SuspicousEggSmell",
            "body": "support the list, but for anyone into gaming, I recommend supporting Indie first and foremost. A lot of major publishers treat their employees and consumers terribly, and indie artists of any kind can always use the boost, but especially with looming economic threats",
            "score": 3,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Can you add some recs? Makes it much more useful.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SuspicousEggSmell",
                            "body": "sure [https://canadiangamedevs.com/](https://canadiangamedevs.com/) this site is just has studios based in Canada. Some of those will be larger and bought by bigger publishers, including American ones, but honestly the best way to deal with that is checking what individual games were published under. A lot of these studios are smaller Indie studios though, and the list is broken down by province. They also have section advertising Indie games specifically (again, publishing is a different matter, but a smaller american studio that grants more artistic freedom and less shitty working and consumer policies is better than a triple A studio in line with the rapidly forming oligarchy down south)\n\nBalatro is an Indie game that was developed in Saskatchewan, and published by a UK publisher\n\nKun’tewiktuk: A Mi’kmaw Adventure is an upcoming game being developed and I think published by the same company based in Cape Breton \n\nTunic was developed in Canada but published by the American Finji\n\nCuphead was developed and published by MDHR which is Canadian\n\nBehavior Interactive is a larger studio (I think they call themselves Indie, you could probably debate how much they belong on this list but I’ll put them here anyway) and is the studio behind dead by daylight. DBD has multiple publishers but none of them are American to my knowledge. DBD does however have US licensed characters, and in game transactions. It’s not from what I’ve seen stuff that I’d consider predatory (from what I can tell, the non licensed stuff which makes up the bulk of the content is all available for the in game and real world currency, and not for a ton of in game currency either) so again, may be a studio people disagree as being suitable for this list\n\nthere’s also the world outside of Canadian and USamerican gaming\n\nAustralia has Team Cherry which developed and published Hollow Knight and is currently working on. the sequel\n\nTaiwan has Red Candle Games which developed and published Nine Sols, Detention, and Devotion\n\nI also don’t want say people shouldn’t buy from larger studios and publishers at all, there’s nuance especially as with gaming a lot of things are done internationally (even if you get a game from a canadian studio and publisher, there’s also what distributors you have available and if switch distributors is a realistic option). However Ubisoft specifically has been criticized for a variety of worker abused (particularly towards its female employees) and some of the anti consumer practices. So I’d personally say we should look to other studios besides them to support (though I think gaming and other creative industries will be a little bit weirder for lists like these and might deserve their own conservation)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Askng-fr-a-frnd",
            "body": "I would also suggest shopping at second-hand stores if you can’t find Canadian alternatives to American products.",
            "score": 2,
            "replies": []
        },
        {
            "author": "csbgal",
            "body": "What about insurance companies, any of them US-owned?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Alert-Meaning6611",
            "body": "Hi all! Does anyone know of a non-american equivalent to dr. Pepper, i am hopelessly addicted to the stuff and need to find a replacement stat lol",
            "score": 2,
            "replies": [
                {
                    "author": "Impressive_Weakness3",
                    "body": "This may be a stretch but the closest alternative you can try is Brio...which is also Canadian owned according to Wikipedia",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "MBILC",
                    "body": "A&W ?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "marcohcanada",
                    "body": "At least it's a platform designed to protest against Musk-bought Twitter.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "borntobebald1",
                    "body": "Obviously we can't completely cut off 100%. \n\nThere is a better advantage to leverage certain media apps to benefit the cause than to avoid. I believe Reddit is partly owned by a US company, but not using it would dampen the messaging, organization and more people would be confused on what products to avoid. \n\nThe use of Bsky can reach more people that would be sympathetic to the cause. The use of Twitter will benefit those that are counter and wouldn't get that much out of it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "confidently-paranoid",
            "body": "Thanks, this is helpful 🤘",
            "score": 2,
            "replies": []
        },
        {
            "author": "Apart-Newspaper-3635",
            "body": "Thank you this is very helpful. 🇨🇦",
            "score": 2,
            "replies": []
        },
        {
            "author": "ravensviewca",
            "body": "My Triscuit crackers (Mondelez) are labelled as Imported by Mondelez. They do have a number of Canadian plants though. I texted them and their reply was that if does NOT say Imported by then the entire product was made in Canada, and that Made in Canada labelling was not mandatory. I suggested they add it. \n\nTheir products (via Wiki) [https://en.wikipedia.org/wiki/List\\_of\\_Mondelez\\_International\\_brands](https://en.wikipedia.org/wiki/List_of_Mondelez_International_brands)",
            "score": 2,
            "replies": []
        },
        {
            "author": "MBILC",
            "body": "Can also work to add sites to:  \n[https://madeincanadadirectory.ca/](https://madeincanadadirectory.ca/)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pebble-Curious",
            "body": "Rona is no more Canadian. LOWE'S acquired it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "cindoc75",
            "body": "Great list - thanks!",
            "score": 2,
            "replies": []
        },
        {
            "author": "BlueTree35",
            "body": "Nissan titan and Toyota tundra are both made in the states. If you want a half ton truck, you really have no easy options",
            "score": 2,
            "replies": [
                {
                    "author": "downrightwhelmed",
                    "body": "Import a hilux baby 🛻",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Karthanon",
            "body": "AFAIK Mitsubishi's are built in Japan. They *used* to have a US assembly plant, but I believe it got shut down 6 years or so ago.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bott",
            "body": "From [Wikipedia](https://en.wikipedia.org/wiki/Unilever):\n\n**Unilever PLC** is a British [multinational](https://en.wikipedia.org/wiki/Multinational_corporation) [fast-moving consumer goods](https://en.wikipedia.org/wiki/Fast-moving_consumer_goods) company founded on 2 September 1929 following the [merger](https://en.wikipedia.org/wiki/Mergers_and_acquisitions) of British soap maker [Lever Brothers](https://en.wikipedia.org/wiki/Lever_Brothers) and Dutch margarine producer [Margarine Unie](https://en.wikipedia.org/wiki/Margarine_Unie). It is headquartered in [London](https://en.wikipedia.org/wiki/London), [England](https://en.wikipedia.org/wiki/England).",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cubicon-13",
            "body": "While Rona is no longer owned by Lowe's, it is owned by a US private equity company.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ExtremeFlourStacking",
            "body": "Yeah, I'm gonna still shop at Costco.",
            "score": 2,
            "replies": [
                {
                    "author": "downrightwhelmed",
                    "body": "It’s way more important that you buy Canadian items than shop at Canadian-owned store. There are a lot of Canadian options at Costco.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "coffeejn",
            "body": "I'll continue buying at Costco but I will be scrutinising the country of origin for items.  I already know some of my cereals will be on the banned list of items while some of the current offering of fruit/veggies are coming from Mexico or other countries than the US.  If it means I go without for certain products, not an issue I'll just buy something else.\n\nI am a bit annoyed with some of the labelling, a lot says imported by without the country of origin; ie Trident gum is imported by a Canadian company but might come from the USA.  They definitely don't make it easy to tell which country it's made in, might change by flavour.",
            "score": 2,
            "replies": []
        },
        {
            "author": "purple_yam_i_am",
            "body": "Genuine curiosity: what are your thoughts on Apple? Obviously American, and donated a large sum to the inauguration. On the flip side, they have stood by their DEI (Diversity, Equity & Inclusion) policy, despite Trump eliminating DEI programs and many major companies following suit to his order.\n\nFor that reason, I feel okay supporting Apple, since I am deep into their ecosystem. Having said that, I’m still trying to do my part in supporting Canada and buying anything local/Canadian/non-American, and have already unsubscribed to major video streaming services.",
            "score": 2,
            "replies": [
                {
                    "author": "ArcticRhombus",
                    "body": "Apple are far from the worst of the worst. I am working on getting away from Google and Amazon as bigger priority.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "LadyBexie",
            "body": "Something not on this list that I just came to think about - pet food. It'll be a tricky one, as a lot of 'Canadian' brands have recently been bought out by American parent companies. \n\nAnother piece to consider is quality; my cats eat a specialised diet, one that can't just sub in a other brand. The brand they do eat is almost 100%  produced in the USA, with a fair few Canadian-sourced ingredients. \n\nWith tariffs looming I'm picking up a few extra bags/cans. Even if the facilities keep operating they may have trouble getting quality ingredients, and if retaliatory tariffs happen we may have trouble importing whatever the finished product is. \n\nSo, for those of you who can, look into made-in-Canada pet food - ask your vet, do some research. PetValu and other boutique pet retailers are probably a good place to start. For those of you who can't - maybe grab some extra now, just in case supply/quality is impacted. \n\nI'm perfectly willing to alter my buying habits for myself and accept less suitable alternatives for some things, but I can't - and won't - sacrifice the health of my pets with unsuitable alternatives. It's just a huge industry and not a category I've seen a lot of talk around yet.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ricky_Sirroi",
            "body": "I urge Canadians to sign this petition:\n\n[https://chng.it/ZcGspX2tCG](https://chng.it/ZcGspX2tCG)\n\nIt is requesting Hydro Quebec to block electricity during the super bowl game.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nor_the_now",
            "body": "This is probably a dumb question. I noticed a product (blueberries) at Costco said something like: Product of Peru, Distributed by USA. Is it wise to find alternatives to these types of products as well? I assume that we are still supporting the US when we purchase these...",
            "score": 2,
            "replies": [
                {
                    "author": "TriflingHotDogVendor",
                    "body": "You went to Costco, what did you expect?  They buy in Peru, they berries take a brief stop in the US at their global distribution center, then come to Canada.\n\nCostco is easily one of the least problematic US companies, though.  They pay their people well and general exhibit non psychotic behaviors.  Unlike, say, Amazon.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "StellaTermogen",
            "body": "Brilliant list with a minor typo in this sentence (note the missing \"to\"): \"Worth noting (thanks commenter!) that [Well.ca](http://well.ca/) allows you **to** filter for Canadian products\"  \n(-> I think the sentence also deserves a period at the end. ;)\n\nAnother sentence that might benefit from a little polishing is:  \n\"If it’s not Trump, then climate change will certainly destroy the value of properties in places that (where?) Canadians love to flock (to), including Florida, Palm Springs, and Arizona.\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "Khal_flatlander",
            "body": "Isn't Smitty's restaurant also Canadian?",
            "score": 2,
            "replies": []
        },
        {
            "author": "DENelson83",
            "body": "Hulu does not even exist in Canada.  It never did.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Canaduck1",
            "body": "Lowes (American) owns Rona.",
            "score": 2,
            "replies": []
        },
        {
            "author": "max420",
            "body": "Your suggestions regarding streaming services is pretty easy to do.  Just pirate. \n\nDownload all the TV shows and movies you want.  Go nuts.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Then-Barber9352",
            "body": ">**Welcome visiting Americans with open arms.** Talk to them about how important Canada’s relationship with America is, and the importance of resisting Trump\n\nYou have not visited r/ politics, or r/ in the news, or any one of a huge number of subs because liberals WANT you to keep the tariffs on until Republican Congress is begging on it's knees for you to buy from us and the CEOs of the corporations in their state are screaming at them to impeach Trump and force him out and threatening them with no funds.  \n\nYou won't get any of our money though because we are going broke.  But I would be happy if that gets Trump out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zealousideal-Bad7529",
            "body": "Super helpful, thanks!",
            "score": 2,
            "replies": []
        },
        {
            "author": "ODoyleRulesYourShit",
            "body": "PF Chang's -> literally anywhere else, this is Canada why would anyone even consider eating at PF Chang's on a normal day?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mandatory_Fun_2469",
            "body": "If I could add, you might also consider being patriotic in your investments. Short the shit out of American big tech companies, Tesla, DJT, and any crypto/bitcoin mining companies (fuck their “strategic reserve” bullshit). If things keep going like they have in the last week or so, this will make you a shit ton of money. Then use the profits to invest in Canadian companies, especially natural resource companies which are already very undervalued (especially oil).",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hasbrodini",
            "body": "What's the plan to combat China Tariffs?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Available_Music9369",
            "body": "Use debit or cash. Mastercard and Visa cost the merchant more in fees plus they are US owned.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Plaintalks",
            "body": "What would you like to do to this guy??\n\nhttps://www.newsweek.com/kevin-oleary-celebrates-donald-trump-win-1981120",
            "score": 2,
            "replies": []
        },
        {
            "author": "Loxicity",
            "body": "I want to support Canada by potentially travelling there and spending my money there from America.\n\nBased on the vibes going on, would I be in danger from some idiot doming me at a bar due to being American?",
            "score": 2,
            "replies": [
                {
                    "author": "slevin07rocket",
                    "body": "No, you’re safe. Just no maga hat or saying anything positive about trump,tariffs, 51st state.\n\nThrow a Canadian flag in or on your car if it’ll make you more at ease.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Key-Map-9218",
            "body": "Panago and Pizza Delight are two other Canadian pizza places I know of, Pizza Delight is in the Maritimes, and The Soap Company makes soaps and they're based from Nova Scotia and they ship, and Phillip Adam makes really nice shampoo and conditioner (I especially like the orange vanilla scented) and they're in Vancouver and they also ship and Eclair Lips (New Brunswisk), and Moody Bee (British Columbia) make lip balm ",
            "score": 2,
            "replies": []
        },
        {
            "author": "HolySuffering",
            "body": "Sorry if this has already been asked but I'm an American in America. My fiance is Canadian in Canada. I'd like to support Canadian owned or manufactured companies. Do you happen to know the best way to do that from the south?",
            "score": 2,
            "replies": [
                {
                    "author": "slevin07rocket",
                    "body": "Ordering Canadian items online. In store,I’m not sure what you have access to. Mostly I see posts about maple syrup, moosehead beer, crown royal or jp wisers whisky. Perhaps McCain foods (fries and other stuff). Kicking horse coffee?\n\nAnd the obvious, travel up when you can. Forget American travel, boycott Tesla cars and other maga related business.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HolySuffering",
                            "body": "I was just up last month. Super enjoyed my visit and very much looking forward to going back and spending money. I live in a Southern town and the amount of folks riled up warms my heart. Just about everyone I know has called our state reps telling them to cut the shit.\n\nAlways trying to buy Canadian when I can but this far south I haven't seen even Canadian syrup. I saw Calmato and thought I could get that but it's from Pennsylvania...\n\nHow about buying from American companies that employ Canadians in Canada? Example: Fireball Whisky is from Kentucky but they distill in Canada",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "slevin07rocket",
                            "body": "Not sure, probably just better off spending extra in Canada when you’re up here, rather then forcing a purchase back home. At home, if you can’t buy Canadian you can support mexico or europe also.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "OneSmallCheeseBall",
            "body": "National Film Board of Canada has lots of great (and lots of weird) films to watch for free. [NFB.org](http://NFB.org)",
            "score": 2,
            "replies": []
        },
        {
            "author": "KindOfAnUnchillGuy",
            "body": "I am an American visiting Canada. Thank you for receiving me :)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Barlakopofai",
            "body": "It's funny seeing \"Your local ma and pa chicken place\" for KFC because Québec has like 3 or 4 separate chain restaurants specifically for chicken",
            "score": 2,
            "replies": []
        },
        {
            "author": "ghosttnotfound",
            "body": "American here that lurks on this sub. I back yall 100 percent on this. Go Canada <3",
            "score": 2,
            "replies": []
        },
        {
            "author": "Deeppurp",
            "body": ">Electronic Arts (video games) → Ubisoft Montreal\n\nEA has Canadian studios.\n\nUbisoft is owned and ran by a family headed up by an individual undergoing criminal (or civil) suit for alleged sexual assault in the workplace.\n\nThis line is probably best left at \"Purchase games developed by Canadian studios from the large conglomerates\". Moneys going out of the country but at least it keeps these studios running in Canada employed.\n\nAlso wheres the line in don't buy American goods, vs Dont buy from american companies that are produced in Canada and employ Canadian workers?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Killhamski",
            "body": "I think Pita Pit is safe?\n\nNot really subs, but could be a replacement for subway.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SSSl1k",
            "body": "I was with you until \n\n> Air Canada\n\nIn all seriousness, great list, but I'll always look for any alternative that isn't Air Canada, they are terrible.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jrc127",
            "body": "Pennsylvanian here.  Frankly, most Americans I know are scratching their heads about Trump's turn on Canada. He's a conman and is using this to divert attention from his dismantling of our Republci.  Stay strong against Trumpism, Canada.  Every day Americans are still your friends.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Bwr0ft1t0k",
            "body": "Dog food\nDry: Orijen or ACANA\nWet: Acana, Boreal, Canadian Naturals\n\nDairy: Look for products with the Blue Cow logo, which means they’re made with 100 per cent with Canadian milk and ingredients. ​\nEggs: Savör; Ferme Avicole Laviolette; Burnbrae Farms; ​\nMeat and seafood: Sunday Farms; Great Canadian Meat Company; ​\nSnacks and pantry items: Hippie Snacks; Uncle Bob’s popcorn; Cheezies; Quaker Oats Harvest Crunch; Royal Nuts; Hickory Sticks; Dainty, the Rice Company; Kozlik’s Canadian Mustard; French’s ketchup; ​\nFruits and vegetables: GoodLeaf Farms; Harvest Fresh (VegPak Produce); Sunset​\nCoffee and tea: Zavida Coffee Roasters; Club Coffee; Kicking Horse Coffee; DavidsTea\n\nHome supplies \nToilet paper, paper towels and facial tissue: Royale; Cashmere and Scotties (Kruger)​\nAluminum foil: Alcan;​\nGarbage bags: Glad (The Clorox Company of Canada); ​\nCleaning products: The Unscented Company; Nature Clean; Eco-Max; Mighty Wipes (Canada Wipes)",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 3,
            "replies": []
        },
        {
            "author": "SnooPredictions9871",
            "body": "How about don’t visit Reddit?  It’s American owned.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "This is great. There are Canadian companies I haven't heard of, that I will now look for.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "i think regarding clothing there are better alternatives to lululemon etc who just produce in bangladesh and cia",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Plan_988",
            "body": "Following",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Wait what happened with roots?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KnownGenius",
            "body": "Following",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anxious-Nebula8955",
            "body": "Imaginary man made line is exactly what trump has been calling the border as he tries to justify annexation. What a weird coincidence.",
            "score": 1,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Oh God. Thanks for bringing this up, I'll edit my post.\n\n  \nSorry and really - thanks. Had no idea and will sharpen the message.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ManofManyTalentz",
                    "body": "There- hope that's better. Thanks again.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Anxious-Nebula8955",
                            "body": "You're a legend. Vive la Canada.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok_Instruction8143",
            "body": "Excellent list!",
            "score": 1,
            "replies": []
        },
        {
            "author": "curlygirl97",
            "body": "Just a heads up - Lynx ceased operations as of February 2024",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Tacobell 😢",
            "score": 1,
            "replies": [
                {
                    "author": "Vadgers",
                    "body": "Taco Time is Canadian! Although I think it's mostly in the west",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "attaboy000",
            "body": "Duer as another Levi's alternative.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1969bigguy",
            "body": "very good work thanks",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Assumption_888",
            "body": "Avalon Dairy or Island Dairy in the west",
            "score": 1,
            "replies": []
        },
        {
            "author": "Substantial-Plane-69",
            "body": "KFC and Popeyes alternative (if available where you live) is Marry Brown's Chicken!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "TicTacTac0",
            "body": "I recommend Qobuz over Spotify and Apple music.\n\n\nIt lets you use an app to transfer all your playlists, so the switch isn't a headache at all. Better sound quality than Spotify too. Doesn't have podcasts though.\n\n\nIf you're big on podcasts, most have their own sites, so you can avoid the American apps that host most of them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrandieBassen",
            "body": ".",
            "score": 1,
            "replies": []
        },
        {
            "author": "Derekdiesearly",
            "body": "Rona is owned by Lowes",
            "score": 2,
            "replies": []
        },
        {
            "author": "stntdad",
            "body": "This post literally sums up everything I love about Canada!\n\nThank you for being you!!\n\nOn a separate note, anyone know of a nice apartment or house for rent?  Preferably in an r adjacent to larger city, but\nI’m down to hang out in Sudbury with Shoresy if need be. I may need to jet out of here quickly if shit gets any more insane. \n\nLove you guys!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "cabutoyammay",
            "body": "White Spot Pirate Pak!",
            "score": 1,
            "replies": []
        },
        {
            "author": "IamPaneer",
            "body": "I have a mustang! i love it! but now i also don't it. i really do love the car.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bwr0ft1t0k",
            "body": "[article: your-shopping-list-buy-canada-bye-america](https://www.theglobeandmail.com/investing/personal-finance/article-your-shopping-list-buy-canada-bye-america/)",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "jimtk",
            "body": "Sincere question because I find it difficult for some products to know who I am buying from.\n\nExample: I love Wild Turkey 101 bourbon. It's made in the US from US materials, but all profits go to the Campari group, an Italian company who owns the Wild Turkey distillery. Why would I want an Italian company of 4 000 employees to suffer because of the chief clown in the US? On the other hand, well, it's made in the US.  What's your take on it?",
            "score": 1,
            "replies": [
                {
                    "author": "PM_ME_CARL_WINSLOW",
                    "body": "The Campari group won't suffer because you didn't buy Wild Turkey.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "patis_matamis",
            "body": "I'm trying to remember when the last time I bought a Canadian product",
            "score": 1,
            "replies": []
        },
        {
            "author": "yea-umm-no",
            "body": "Roots isn't canadian owned anymore.   \nhaven't' been since 2015. Owned by Searchlight Capital, and majority holder. \n\n[https://en.wikipedia.org/wiki/Roots\\_Canada#Today](https://en.wikipedia.org/wiki/Roots_Canada#Today)",
            "score": 1,
            "replies": []
        },
        {
            "author": "lawl7980",
            "body": "Roots is American-owned now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hudsonmane",
            "body": "Amazon: NO! Even if Canadian product, find it elsewhere. (Tougher in some regions I know, with the extra trouble if you can avoid. Remember bezos was a front row attendee at the orange dump’s inauguration ceremony. They are lousy employers, donated to orange, closed 7 Quebec warehouses when the union was proposed.)\n\nRona over Home Depot? NO! HAS BEEN BOUGHT BY AN american CO. Home Hardware and CDN Tire still Canadian. \n\nVITAMINS &SUPPLEMENTS:\nThere are lots of Canadian companies in this sphere. For anyone boycotting Loblaw/SDM, look at seller Vitamart from Oakville. Prices lowest I could find for specific items. Great return policy. Kirkland from Costco. \nBAR SOAP:\nGoat’s milk soap Caprina from Quebec. They have an unscented version I would prefer (not available at Costco)\n\nCadbury is owned by Mondelez, NOT a Canadian company. \n\nNature’s Path is a Canadian company, however CHECK THE LABEL! Many products made in america.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LandscapeLittle53",
            "body": "For the cars assembled in Canada you left out the Pacifica and Voyager, they’re assembled in Windsor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot-Sauce-P-Hole",
            "body": "As an American, next time Trump tries to bully your leaders, I think they should reply by telling Trump to shut his fucking face, calling him an uncle fucker, and a boner biting bastard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HaltheMan",
            "body": "Stop using Amazon? Good luck!",
            "score": 1,
            "replies": [
                {
                    "author": "PM_Your_Best_Ideas",
                    "body": "I used to be an amazon junkie, I've only bought one thing in the past 6 months. It can be done, and it's easy to do with the right motivation.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HaltheMan",
                            "body": "It can be done, but it's a beast, and some people live off of it. I don't see any boycott working on Amazon. If sales went down by a considerable degree, I could see Amazon laughing because they know people will be back and buying more then ever.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PM_Your_Best_Ideas",
                                    "body": "About 90% of Canadians won't support American if the annexation talk by trump escalates, there are alternatives to amazon. American Boycott is already starting in Canada. I agree that some may still shop and be discreet about it, but many will choose an alternative. Trump is going to make the rest of the world rich.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HaltheMan",
                                            "body": "Will that not also hurt the Canadians employed by Amazon? I would imagine that would impact a ton of workers.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "HaltheMan",
                                            "body": "Will that not also hurt the Canadians employed by Amazon? I would imagine that would impact a ton of workers.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PM_Your_Best_Ideas",
                                                    "body": "Yes, it will. It is going to effect so much more than just jobs with amazon. Canada will resist Annexation by any means necessary. We don't want this trade war but we will do it if need be.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AllTheRoadRunning",
            "body": "American coming here in peace. A few notes to consider re: the car companies on the list:\n\n* BMW SUVs are manufactured in South Carolina\n\n* Volkswagen (not sure which models) are manufactured in Tennessee\n\n* Nissan trucks are manufactured in Tennessee\n\n* Hyundai (and perhaps KIA, not sure) have a massive plant in Alabama\n\n* Mercedes SUVs (are these still popular?) are manufactured in Alabama\n\n* Toyota has an engine plant in Alabama\n\nThese are all the ones I remember first hand; I'm sure there are some I've left out. Keep pushing back!",
            "score": 1,
            "replies": []
        },
        {
            "author": "relightit",
            "body": "consider /r/LocalTourism instead of spending on polluting jet fuel to go in another country.\n\nthere is a lot to discover at home.  People should look into using their vacation time  to do a citizen science little \"quest\" with the kids \nhttps://science.gc.ca/site/science/en/citizen-science-portal",
            "score": 1,
            "replies": []
        },
        {
            "author": "relightit",
            "body": "there should be a canadian alternative to all the online services where you are the content maker, \"you are the product\". reddit. youtube. facebook.  i guess bluesky is an ok alternative to twitter.   the new AI services (you can install variations on your own computer). \n\n\nwe need   safe search engines, social networks, content platforms that won't use our profiles try to manipulate us  to live the way that is useful to them. there should be a nationalized version of those things. we do it for tv, radio so why not.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrF5",
            "body": "This is amazing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Trailsya",
            "body": "Unilever is Anglo-Dutch",
            "score": 1,
            "replies": []
        },
        {
            "author": "idislikeyou0",
            "body": "i think the main issue here is that most movies/tv and video games are american made\n\nkinda hard to circumvent that, especially if you want to play AAA games",
            "score": 1,
            "replies": []
        },
        {
            "author": "Existing_Scallion_28",
            "body": "American here - I support you all doing this for your country. Please know that everyone I know despises Trump and that he some how has brainwashed  \\~50% of the country but that leaves 170 million of us who are scared, feeling helpless, and absolutely despise this administration. We are trying to gather for our own boycotts here for companies that support him but it is so hard. Let's not divide completely, because this is how he came into power in the first place. I commend the boycotts, but please don't generalize all Americans as evil.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strong_Possible_6856",
            "body": "Personally, I believe the focus should be to \"Buy Canadian\" rather than \"Boycott American.\" Buying Canadian is the positive way to help ourselves. We achieve nothing by redirecting our hard-earned money away from the US ... other than to vent our anger. The true need is to help ourselves, and then thank Ms Trump for uniting this great country.\n\nBoycotting American companies operating in Canada makes even less sense to me because it's **Canadians** who work in those companies; Canadians who'd lose their jobs if you succeed in forcing their employers to pack up and move back south. Canada is just 5-10% of the market for Walmart, Costco, etc., but it's 100% of the livelihood of their Canadian employees. (This remark is not about me. I'm retired with no kids in the workforce.)",
            "score": 1,
            "replies": []
        },
        {
            "author": "dasoberirishman",
            "body": "Fairly certain the Chrysler Pacific is built in Windsor, ON.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OpinionTC",
            "body": "Why is Costco in Ontario still selling US beer and wine?  Is it just LCBO who took it off shelves?",
            "score": 1,
            "replies": []
        },
        {
            "author": "EfficiencyJunior7848",
            "body": "My family uses Amazon.ca a lot, I even have a business account with Amazon, it's a tough one to boycott, and some of the sellers are Canadian. \n\n\nWe can drop Netflix easily, and Spotify is Swedish, so we can keep that service going.\n\n\nNever imagined we'd be in such a rediculous position. I knew Trump was unhinged, but this is worse than imagined, he's trying to turn us against each other, and also take over the USA as a dictator. Trump is a bumbling fool, but he has slightly smarter sinister people guiding him, and as bumbling and incoherent as he may be, he is deadly serious about his crazy plans to take over as a dictator, and expand the USA taking over sovereign states as if it's a game of Risk.\n\n\nTrump is a 19th century backwards thinker, who needs to be targeted the most, including his enablers such as Elon. It's easy to not buy a Tesla, and avoid traveling to the USA, hit them where it hurts the most.\n\n\nCanada needs to fix its own set of problems, such as getting rid of inter-provincial trade barriers, fixing a taxation mess that represses investments in Canada, and places unneeded high burdens on businesses, including very high taxation on those who succeed the most, which is extremely demotivating. The taxation and business climate here in Canada, is so bad many of us leave for the USA, and despite Trump, I may still happen unless there's enough changed made here. \n\n\nAt least Carney is promising some change, and unlike Trudeau or PP, he knows what it's like to have a job, manage your own finances, and earn an income, but we're looking at decades of built up crap to fix, and that takes a lot of time and political will to desl with, ie, not much improvements are likely to happen any time soon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Good post but honestly the vast majority of Canadian's cant avoid all these products. Like half the stuff we own is American. Better to target certain products specifically than post guides on how to boycott literally everything every Canadian uses on a daily basis.",
            "score": 1,
            "replies": [
                {
                    "author": "PizzaWhale114",
                    "body": "He posted a comprehensive list of ways to boycott united states' products so you we can pick and chose which work best for each one of us, personally. He mentions multiple times that it's unlikely most will be able to boycott everything on this list.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ithium",
                    "body": "people are also boycotting everything american owned but a lot of the stuff on this list is produced in canada by a canadian division of the main company...",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Didact67",
            "body": "As an American, I’d take Timmies over any of our coffee places any day. I guess there are some in the states, but not near me.",
            "score": 1,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Tim's is the worst Brazilian coffee chain in the world. Has not been Canadian for decades.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SleepyOrange007",
            "body": "What do you think will happen to Canadians who work at these businesses if we boycott them?",
            "score": 1,
            "replies": [
                {
                    "author": "No_Yogurtcloset_6008",
                    "body": "What happens to workers & consumers on both sides of the border if there is a trade war?   These are opening salvos only.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fat_Money15",
            "body": "As an American, if I were to focus on buying Canadian, what beer would I purchase? Labatt, something else? I have a distributor near my home with a fairly large selection of international brews.",
            "score": 1,
            "replies": [
                {
                    "author": "Fidget11",
                    "body": "Depends on what kind of beer you like. Labatt is a huge brand name but there are a ton of interesting smaller breweries. \n\nLook for the place things are made and pick ones that show Canadian locations.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ruffvoyaging",
            "body": "Other streaming services (in addition to CBC Gem and Crave): BritBox and Mubi\n\nFor Anime: Anime-Planet. There are probably also some Japanese-owned anime sites that you can get to work but I haven't looked into it yet.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Wonderful_Hedgehog",
            "body": "Well done",
            "score": 0,
            "replies": []
        },
        {
            "author": "disraeli73",
            "body": "Great list!",
            "score": 0,
            "replies": []
        },
        {
            "author": "eddieesks",
            "body": "This is great but it’s incredibly wishful thinking to to think that people will go out of their way any more than changing their Facebook profile picture.",
            "score": -3,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "Pick a lane, guy",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "burnabycoyote",
            "body": "Innumerable Canadian investors own shares in US companies, and thus draw income from the labour of American workers, as do the Canadian Pension Plan and many union pension funds. A tit for tat attack on US companies will lead to Canada cutting off its nose to spite its face. \n\nCanadian tariffs may suit our govt (\"more free money from taxpayers\"), but won't do the US any harm.\n\nLet Trump impose his tariffs, and live with the resulting inflation and productivity loss. He will soon find out about the problems caused by tariffs.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Additional-Copy-7683",
            "body": "Well, let's just hope they don't pull their military from helping us should it be needed. Canada doesn't invest in military like they do. But, at least we have Tim Horton's!",
            "score": 0,
            "replies": []
        },
        {
            "author": "cutchemist42",
            "body": "Theres also a pretty good football league located in 9 cities enjoying hundreds of Canadians.",
            "score": 0,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "There are 8 teams in the Canadian premier football  league!\n\nhttps://canpl.ca/club-rosters/",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CranberryEven6758",
            "body": "Don't use Reddit, use https://Lemmy.ca",
            "score": 0,
            "replies": []
        },
        {
            "author": "onlyremainingname",
            "body": "My preference will be made in Canada first, but I won't be boycotting anything made elsewhere if it is better, nor will a lot of people. I don't think we will see millions of Canadians giving up their google or apple phones, windows or mac based computers, an array of US electronics or not watch American movies/TV or stop listening to American music or stop using American social media sites like the one we are on now. On the surface level, there are small changes people can make at things like the grocery store (as shown in the list above), but it is underneath an ocean of goods and services that are made or with some connection to the US that most, if not all of us utilize or come into contact with in some form in daily life. We do need the US for a lot of things, even if it is hard to admit it in these moments. It is a good time to seriously look at and discuss long term vision that can be made to add greater ties with other nations for trade, but these things don't happen overnight.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ArtUseful9084",
            "body": "this has the same energy as the steam group for boycotting Modern Warfare 2 in 2009\n\n\nevery canadian male who probably likes video  games and has strong opinions is still gonna buy GTA VI \n\n\nstill gonna drink american beer because most domestics reek and taste of piss and are generally drank by fullblown alcoholics\n\n\nam i supposed to sell my american car all of the sudden because some orange retard is imposing tariffs? how am i supposed to get to work then?\n\n\ni should automatically write off seeing my american friends because of the orange man? it's the actions of one fucking moron, why are writing off the ENTIRE country lmao? \n\n\nalso if you have a case of labatt blue in your house it automatically makes the place reek of cat piss, canadian classics, stale beer, and the hopes and dreams of a broken divorcee (ironworkers or pipefitters drink this)\n\n\nalso if we get invaded you fuckin voted for this 3 times lmao, i'm certain knowing you were \"on the right side of history\" will bring my generation great comfort as we end up on liveleak in a civil war gore compilation with kendrick lamar or 100 gecs blasting lmao",
            "score": 0,
            "replies": []
        },
        {
            "author": "Vintage_Anger_991",
            "body": "Highland Farms. Coffee Time.",
            "score": -1,
            "replies": []
        }
    ]
}