{
    "title": "This is why Canada has plenty of eggs — and the U.S. doesn't",
    "author": "ManofManyTalentz",
    "subreddit": "canada",
    "rank": 12,
    "score": 2708,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 421,
    "url": "https://www.npr.org/2025/03/18/nx-s1-5330454/egg-shortages-record-prices-usda-canada",
    "id": "1je2xy0",
    "selftext": "",
    "comments": [
        {
            "author": "one--eyed--pirate",
            "body": "As a broiler chicken producer in Ontario I can say it goes way beyond just the size of our farms. Although, not as prevalent as in the states we also have large industrial size farms. \n\nSupply management doesn't just control the supply output it is highly regulated. For broilers if we have over 1% mortality in 24hrs we must report it to the CFO (Chicken Farmers of Ontario) and have a vet out. If AI is confirmed then they set up a 3km & 10km control zone with strict rules & testing for all flocks within these zones. We also have AI insurance through the CFO, so if we are affected, the financial impact is mitigated, which also reduces the likelihood of farmers ignoring issues in the early stages. \n\nEvery 2 years we need to have our barns audited by CFO. They are very serious about ensuring bird netting & other controls are in place. \n\nAlso, our biosecurity is just much higher than theirs. We have strict biosecurity we need to follow, including barn specific clothing & boots. An article I read out of the states said they could mitigate spread between barns by changing clothes & boots between barns but it was too costly to implement. I read that a month ago, and I'm still stocked that they are just going into barns one after the other with the same boots. AI is spread primarily through the fecal oral route so changing boots should be priority #1.",
            "score": 1,
            "replies": [
                {
                    "author": "ceribaen",
                    "body": "Not changing boots is crazy.\n\n\nI know someone who audits barns, first thing they did when starting that job was buy two pair of safety boots. Which I believe was covered under benefits. So always a minimum of a day sitting idle before they enter a new barn.\n\n\n\nVisit one barn a day at most.\n\n\nHas booty covers available as well. And as far as I know, suits up when visiting barns, and I believe at least the larger ones have shower facilties? \n\n\nAnd this protocol isn't even chicken specific here. \n\n\nWhy they wouldn't have basic biosecurity protocols in the US is absolutely flabbergasting.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Embarrassed_Quit_450",
                            "body": ">Why they wouldn't have basic biosecurity protocols in the US is absolutely flabbergasting.\n\nBecause regulations = communism over there.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ok-Structure-8985",
                                    "body": "Are you even a free country if you can’t broadly deregulate industries and make people suffer as a result?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Memory_Less",
                                            "body": "Thanks for your positioning it made me laugh.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ok-Structure-8985",
                                                    "body": "Happy to be of service 🫡",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "EirHc",
                                            "body": "Free to make some mother fucking money for trust fund babies by any means necessary.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "luvinbc",
                                    "body": "And its just getting worse with looser regulations in america",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "KelIthra",
                                            "body": "Yeah their food supply is going to tank hard. They don't even take proper care of their fields. Which is concerning since once their supply tanks because of this, they are going to look at their neighbours even more aggressively.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Gin_OClock",
                                                    "body": "Their grain and corn is going to fall to systemic infections. They'll hit a Dust Bowl before too long",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "clawsoon",
                                    "body": "Back when the NDP was the CCF, my Alberta grandma referred to them as the \"Communist Chicken Farmers\".\n\nWho knew that communist chicken farmers would be saving our eggs today?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "WhyAreYouAllHere",
                                            "body": "People who imagine the other complexly? People who can see the myriad of ways systems interact with each other? People who understand that smaller returns over a longer period of time are better than the feast/famine approach?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "EirHc",
                                            "body": "> \"Communist Chicken Farmers\"\n\nSpeaking of the CCF, as an 80s baby, I remember when I was little looking at old American World maps where they colored the areas of the world in red wherever there was communism, and Saskatchewan would be colored in red. Pretty sure those maps were made during the reign of the CCF party, hahaha",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "clawsoon",
                                                    "body": "That would be an amazing map to track down.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DM_ME_UR_BOOTYPICS",
                                    "body": "Wearing multiple pairs of boots covered by an HSA = the jackboots of the politburo apparently",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Agreeable-Sir-8167",
                                    "body": "US citizen here. Can confirm. Regulation = \"treading on muh freedumbs\"\n\nA lot of us are trying though. This system has been rigged for generations.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Rochellerochelle69",
                            "body": "My sister used to do agriculture reporting and had to fully shower and decontaminate and change into a fresh “barn suit” everytime she went to visit farms in Canada. Disease control is taken so seriously, as it should be.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FourthLvlSpicyMeme",
                                    "body": "Well I for one am bloody glad for it. The USA scares the crap out of me lately and it ain't just the annexation talk. It's the removal of all safety standards, firing skilled people because they're not white men etc too. \n\nI'm not going to whine about having to read my products to buy Canadian because I'm so damn petty I'm enjoying it tbh. I also enjoy seeing the people in the same aisle watch me go \"ugh usa\" put it back on the shelf and grab a different brand, cuz they can generally read the context and save themselves time that way. I like efficiency, what can I say?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "grenamier",
                                    "body": "An ISO9001 auditor told us once about the time she audited a farm with multiple barns and she had to audit each barn. She had to shower and change before each and every single one. Her skin took a while to recover after that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LeatherMine",
                                            "body": "If you’re an iso 9001 auditor, life is good if only your skin bothers you.\n\nWouldn’t want to do that work… well… ever. Hopefully they paid well.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "KJBenson",
                            "body": "America couldn’t even agree to wear masks during a pandemic. You think they’re going to understand the benefits of changing shoes between locations?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CoffeBrain",
                                    "body": "This reminds me how Americans walk around their house with shoes on.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "KJBenson",
                                            "body": "It’s not all Americans. And I’ve even been to some Canadian houses where they ask me to keep shoes on.\n\nHowever, it is ALWAYS the dirtiest houses I’ve ever been in.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "KittyKenollie",
                            "body": "Sorry, I know this is a dumb question, but is the rule to change of your boots between barns as simple as you just stop cross contamination from one barn to the next?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ceribaen",
                                    "body": "Yeah. \n\n\nNot my field, so no idea the \"half-life\" or whatever term it is for how long a virus can live on a surface and be viable still. But the longer you go the less chance for cross-contamination. \n\n\nThe car even goes through the wash and mats vacuumed after every farm visit.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "maleconrat",
                                            "body": "Even the dairy barn at the Experimental Farm museum in Ottawa has a big disinfecting mat you need to cross over as a visitor. Or as Republicans would say, the mat of tyranny.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Bella_AntiMatter",
                                                    "body": "Rly? How have i never noticed it? Neat!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Beautiful_Shine_8494",
                            "body": "I saw a news report that said the US did have more biosecurity protocols in the past but they were rolled back by the first Trump administration.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "addyftw1",
                            "body": "It's because our corporations and are regulators have a revolving door.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Frostsorrow",
                            "body": "If safety boots are require employers are generally required to either provide them or reimburse for them.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Tiger-Budget",
                            "body": "Got to tour a Tyson Chicken Processing Plant in Arkansas! Wonka Factory up front, but seeing my fil in the maintenance dept. servicing stuff in the back 🫣",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Neutral-President",
                    "body": "Thank you for your hard work and for explaining this to us common folk. This is also the first time I can think of that I have seen “AI” as a short form for Avian Influenza.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FourthLvlSpicyMeme",
                            "body": "OHHHH Avian Influenza! I was a bit puzzled how they were using AI to do all this lol.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "withoutlebels120",
                                    "body": "I was thinking \"Active Infection\" but you learn something new everyday.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Neutral-President",
                                            "body": "It could be that too. Context is everything.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Throw-a-Ru",
                                                    "body": "Pretty soon they'll be using AI to screen for an AI of AI.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DaveWoodX",
                            "body": "Same. Though I kind of like the idea of 3km and 10km control zones around anywhere the other AI is detected!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SalientSazon",
                            "body": "I'm gonna start using biosecurity wrong I can just feel it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "milkrun112",
                                    "body": "To be pedantic, biosecurity refers to protecting your facility against outside human threats, like making sure your pathogens are locked and inventoried so they can't be stolen by a malicious actor. Preventing avian influenza from spreading between farms is an example of biosafety.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ibraaah",
                            "body": "Also an acronym for Artificial Insemination, don't you love animal agriculture!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Upstairs_Yak_9034",
                    "body": "Well said. As a veterinarian that has worked in both countries I can confidently say that our food animal veterinary rules are much more iron clad and regulated than the USA. I would never wish for an open market here like the US has. The farmers lose, the animals lose, and the consumer loses. The slightly higher prices we pay for poultry and dairy are worth it. \nIronically, Trump has already fired a massive amount of public health veterinarians and federal vets that were researching AI in spite of this ongoing outbreak as part of the DOGE fiasco. They also started cancelling CDC reporting and info sessions for vets regarding testing and current AI epidemiology stats, which is also insane. So I don’t feel bad that they’re in a bind for eggs now, he brought so much of this onto himself.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Oldfarts2024",
                            "body": "To be fair, the problem predates Trump, he just made things worse.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ditto_is_Lit",
                                    "body": "TBF taking a 'chainsaw to bureaucracy' does have consequences. Deregulation, alternative medicine, alongside controlling the narrative by outlawing the free press will lead to a dystopian nightmare reality like Russia or DPRK. \n\nCanadians are somewhat galvanized by a better standard of education but conservatives try their best with every breath to achieve the same result by parroting everything Trump and his cult of personality says. The difference between Kim Jong Un and Trump are quickly blurring lines by the day/hour and it's not even remotely hyperbolic in the slightest to state that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Oldfarts2024",
                                            "body": "I hope the Americans suffer, like the Russians and North Koreans suffer under their leadership.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ditto_is_Lit",
                                                    "body": "I don't, the assholes who allowed it to happen sure, but there's +300 million people who never asked for any of this. \n\nI know that tensions are high just don't lose sight that there's real people, some actual great people still within those borders. This should stand as a great reminder for the rest of the free world that yes your vote counts, and do your civic duty to speak truth to power.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Infra-red",
                                                            "body": "Unfortunately, it will likely take the suffering of many of them to motivate them to do something about it.\n\nThe number of times I've seen someone who \"didn't vote for Trump\" declare that they can't risk what they have is a bit disturbing.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Ditto_is_Lit",
                                                                    "body": "Yes the way the media has devolved the water is so murky nobody knows which way is up unless they're digging deep for the truth in alternative media outlets. The left have not done themselves any favors with allowing fox back on the air after the dominion lawsuits and never pushing back with a vengeance. Two weeks after J6 they moved on an thought, great well that's over with now let's just pretend like it never happened...",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ProfessionalAge4324",
                                    "body": "To be fair 🎶",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "twizzjewink",
                            "body": "Yet complain nobody is buying American meat products overseas",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "rayui",
                                    "body": "Haha yeah. Over here in the UK, there were the usual idiot politicians trumpeting livestock deals with the States. \n\nThe British public's reaction to chlorinated chicken was just utter fucking disbelief. We had Salmonella in the 90s in the UK and fixed it with better farming practices. These practices are enforced because every fresh product that is sold in shops has the name of the farm it came from on it, and that is tracked along the whole route the food takes to get to you.\n\nSo you know what you're getting. And the producer knows they're fucked if they don't follow good practices.\n\nThere have been instances of fraud (horse lasagna) and those involved got jail terms. The traceability of British meat was key to these arrests.\n\nIn contrast, in the US, bad meat is made good for sale with chemicals. 20% of it contains antibiotic resistant e-coli. Grim.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "notabigmelvillecrowd",
                                            "body": "The meat in the UK was *so* good, I really miss it.  And the fish markets.  My local butcher and fish monger in Hackney was magnitudes better than the most expensive \"gourmet\" purveyors in Canada.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "a_f_s-29",
                                                    "body": "It’s definitely what I miss most when I go to Canada. Meat, fish, chocolate and cheese. Why the hell is good cheese so bloody expensive in Canada?? I understand why the dairy industry is protected but I wish we’d managed to get that trade deal off the ground that would let the UK import good cheese for decent prices. Leave the milk and the basics to Canadian dairy farmers, fine, but for god’s sake let the people have real cheddar",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "notabigmelvillecrowd",
                                                            "body": "I live in Quebec now, the cheese is fucking amazing, great imports and local, good prices, raw milk cheeses, the lot.  But back in BC, yeah, it was grim pickins.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LeatherMine",
                                            "body": "How can you talk about UK farming without talking about mad cow, covering it up, silencing critics and continuing to sell and export tainted beef??\n\nhttps://www.theguardian.com/tv-and-radio/2019/jul/11/mad-cow-disease-the-great-british-beef-scandal-review-is-it-really-gone-for-good",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "rayui",
                                                    "body": "This is obviously bait. If you know about the BSE scandal, you'll know what happened to the entire industry as a result, and you'll know that BSE has not been a problem in the UK for over twenty years. For those that don't know, however...\n\nBSE is a neurological wasting disease that crossed from cattle into humans, where it is known as CJD. It was a massive scandal and affected a great many people, not just those who died horribly. There was understandable public outrage.\n\nNew farming practices, monitoring and testing programmes were introduced. Not just in cattle, but sheep and goats, also. Strict rules were introduced for feed, shelter, identification and monitoring, containment, and so on. Millions of cows were burned. The economic impact of dealing with the problem has been estimated at £11bn.\n\nHowever, British livestock is now amazingly well cared for. We have some of the strongest livestock welfare laws in the world. There is complete traceability of animal carcasses. Between 1997 and 2003 CJD infection rates went from 37,000 pa to 900. It's currently below the European average rate of infection. It's something I think the UK can be incredibly proud of.\n\nFor anyone that's interested, here's the UK government website covering animal welfare https://www.gov.uk/guidance/animal-welfare",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "missed_a_mean_or",
                            "body": "This jibes with the vibe that the US is in full retreat from both science and common sense.  Perhaps the two always go together.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Chaotic_Dreamer_2672",
                            "body": "Just like with COVID, they seem to believe that the problem goes away when you stop testing and managing it.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "KittyKenollie",
                            "body": "> The farmers lose, the animals lose, and the consumer loses.\n\nOkay, genuine question, who wins in this scenario? The government for not have to employ people to enforce these rules? I assume someone is making money from this?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Upstairs_Yak_9034",
                                    "body": "Yes, the government would benefit as there is less oversight. It also reduces trade barriers which can be a headache during trade negotiations (Canada’s quota systems have always been a huge sticking point for the USA and New Zealand who want access to our dairy and poultry markets). \n\nThe consumer also technically “wins” as these food products become cheaper at the grocery store in a free market setting. That said, food quality/safety and animal welfare is often sacrificed due to lack of oversight and less incentive on the farmer’s end. \n\nThe biggest winners in a free market are the larger corps and capitalists that have the ability to weather the storm of market volatility. The average family farmer cannot afford to operate at a loss for very long if the market is oversupplied with milk/eggs/meat and the prices tank. This is why the USA agriculture sector is basically owned entirely by Tyson and Cargill at this point. And their lobbyists will make sure the US government never takes away the current system.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "maleconrat",
                                    "body": "I think it's out of touch billionaires looking purely at the, likely minor, cost savings. A lot things they're doing make more sense if you consider the leaders are all so isolatingly rich and delusional that having to follow any rules at all is probably the worst thing they have dealt with from government.\n\nI also think it's possible they're trying to crash the economy to swoop in and have their clique buy up as much as possible. It's weird because they're terrified of revolution (at least a socialist one) but are speed running the conditions that historically lead to them.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "KittyKenollie",
                                            "body": "oh god, I forget that there is always a corporate overload or billionaire in the mix.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "staunch_character",
                            "body": "He basically fired everyone at the USDA. The new woman is doing her best, but she’s just way over her head. \n\nHer initial response was to vaccinate all the chickens.\n\nSounds good as a headline. But the vaccine is ~$1 per dose. You have to catch & inject each chicken - one by one.\n\nThe sheer amount of workers needed to do this would be ridiculously time consuming & expensive.\n\nThe lifetime of these chickens (layers) is only 18 months.\n\nPlus because the vaccine is a traditional one it will still show up on flu tests. None of those birds are being exported anywhere.\n\nShe walked it back very quickly after actually talking to farmers, so at least he’s got someone in charge who is willing to learn. But I’m very glad to not be eating any US products.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Tree-farmer2",
                            "body": "My only gripe about our regulations is that it has become very difficult for small farmers to access antibiotics. It's cruel.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Zestyclose_Rush_6823",
                                    "body": "Really? We have a small farm and find it appropriately essy to access antibiotics. We have a good relationship with our farm vet and depending on the problem we can phone consult to get an Rx or he'll have us haul in or he'll drive out if its a more serious concern. Same way i get my human antibiotics.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Tree-farmer2",
                                            "body": "Our vet insists we bring the animal in to be seen and, when it's a bottle fed lamb, the cost of that exceeds what we're going to make on the animal.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DerGrifter",
                    "body": "Broilers in Alberta here. Canada's 'on farm food safety program' (OFFSAP) and 'animal care program' (ACP) have 100% compliance nationally. Two programs that hold our farmers to the highest biosecurity and animal welfare standards out there. Very proud of our industry and the consumers that demand nothing less.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SkinnyJohnSilver",
                    "body": "Thanks for posting some real first hand information. I find it helpful to know about these important differences.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ManofManyTalentz",
                    "body": "I'll second /u/Neutral-President and say thanks for the great insight - as you said the actions in place above are part of the supply management portfolio. \nThanks for feeding us!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thejackerrr",
                    "body": "Your work is delicious and feeds my family! Thank you very much for this information.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CoffeBrain",
                    "body": "It makes me so happy and proud to know how much care you and other producers put to keep our food safe. Thank you!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "asoap",
                    "body": "For anyone wondering WTF a broiler chicken is:  \n\n>Breed broiler is any chicken (Gallus gallus domesticus) that is bred and raised specifically for meat production  \n[https://en.wikipedia.org/wiki/Broiler](https://en.wikipedia.org/wiki/Broiler)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Character_Comb_3439",
                    "body": "Magnificent comment.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MartyCat4432",
                    "body": "The Canadian system has trained those operators to be smarter. I’m not calling the Americans stupid but our system has checks and balances that a smart well trained operator would plan for. The Canadian operator is consistently the owner and his family. The Americans have bigger barns requiring more capital and more reliance on foreign workers. It’s these foreign workers who know the rules of hygiene better than their corporate offices",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sagervai",
                    "body": "Thank you for making us food!\n\n\nI'm curious, do you have access to avian flu poultry vaccines? I heard they're vaccinating ducks in France.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DerGrifter",
                            "body": "There is a lot of trepidation about implementing AI vaccines in North America because it would exclude our products from some international markets. Much discussion in the industry about this topic.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "one--eyed--pirate",
                            "body": "Not yet. But they are coming.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "g1ug",
                    "body": "US loves De-Regulations!\n\nAnd once some of these US corporates achieve huge market share, they will cry to Regulate It! (to prevent others to join/grow).\n\nSide note: our family prefers Canada/European products because they are highly regulated with higher standard.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "derpycheetah",
                    "body": "They elected Trump, twice. Intelligence is right behind health care in that country.\n\nThank you for all the eggs 🫶",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SophieCatNekochan",
                    "body": "Thanks for this. Very informative. Sounds like you have all around better practices than we do.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Effective-Bend-5677",
                    "body": "Thank you for everything you do. I have nothing but the utmost respect for our farmers in Canada.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bandissent",
                    "body": "What's it like to be a chicken farmer who both understands disease control and believes diseases are real? \n\n\nAsking for our friends down south 🤣",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ProvenAxiom81",
                    "body": "Eggcellent explanation, thank you",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "monimonti",
                    "body": "So its not the farm size, but its that Canadian controls that are helping with keeping out Avian Flu.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Memory_Less",
                    "body": "I have heard a little about how our standards are higher, but appreciate you describing in some detail. It’s helpful both for my knowledge and discussing with the uninformed.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheBillyIles",
                    "body": "Attn Redditors! If you read anything about this, it should be this post by u/one--eyed--pirate",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Purple_oyster",
                    "body": "This sounds like an illegal trade barrier, Trump should put extra tariffs in response! /s just in case…",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "kidl33t",
                    "body": "Excellent post, thank you.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RobertGA23",
                    "body": "Imagine stating it is too expensive to change your boots, then having to cull millions of chickens because of said decision.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tempstem5",
                    "body": "All I'm hearing is government and regulations are important, and what makes us the most European non-European country",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tastybeer",
                    "body": "As a lover of delicious, nutritious and bio-safe chicken I thank you for your service!!!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "kilawolf",
                    "body": "But deregulation is what we need!!!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Why_No_Doughnuts",
                    "body": "It is almost like having a functioning regulatory framework has a protective affect on the market as a whole.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "_qqqq",
                    "body": "This was interesting, thank you for sharing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sylbug",
                    "body": "That’s wild. Imagine killing a million bird rather than just changing your boots on occasion. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "josh-ig",
                    "body": "I remember growing up in the UK during the foot and mouth outbreak anywhere remotely rural or related to farming you had trays you had to walk through to disinfect the bottom of your shoes. This was for the general public, the farms I’m sure were much more vigilant. Changing + disinfecting boots should be a given.\n\nUnfortunately is similar to the way some people treated COVID too. Canada did much better than the US in that regard. A lot of it comes down to attitude towards common good.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "InformalLemon5837",
                    "body": "Just wanted to say thanks for caring about the health of our food and taking the time to do it right.  Farmers don't get recognized for doing the right thing but everyone will call them out when they don't.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ceribaen",
                    "body": "I will say though, one issue I wonder we might run into is that all of the parent stock/heritage/whatever the word is we get for eggs for any purposes coles from the US.\n\nIf AI gets bad enough, and they need to restart flocks in the US or we lose access to those breeders due to trade war reasons - what happens to our supply of baby chickens to do everything else with.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "adonns2_0",
                            "body": "I also work in the chicken industry and run a breeder farm for laying hens.  This guys personal experience might be true and I’m not arguing with him but for me personally the reason we haven’t had as much problems as the states is just the fact that our barns are smaller and much much farther apart than theirs.   The company I work for is owned by the same company that owns the largest producers of laying hens and breeding hens in North America and they are based in the US and frankly they put our biosecurity to shame.  It’s not even close they take it way more seriously and have way more guidelines in place than when we were owned by a local Canadian guy.  Obviously that’s corporate and I can’t speak to individual farms, but it just kind of seems like we’re taking a leg out of the states here for popularity on Reddit.  \n\nThe US really has had way more Avian flu than we have had and the reasons are more similar to the article than some sort of Canadian genius and work ethic.  BC has also been hit hard by avian flu and it’s likely because there’s are larger and closer together.  Also more birds on the coasts likely carrying the flu.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "glucoseintolerant",
                    "body": "question, could doing a decimation spray and wash of the boots work also?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "one--eyed--pirate",
                            "body": "No. Simply put you can't sterilize shit. \n\nYou'd have to get every little bit of organic matter stuck in the groves of the sole of the boot before attempting any kind of decontamination. Then you'd have to soak them for at least 15 min in whatever disinfectant you are using. \n\nChanging boots & coveralls is not only more practical it's also more effective. We also wash both boots & coveralls between each flock.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "glucoseintolerant",
                                    "body": "thanks for the info!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sittingshotgun",
                    "body": "Boots are too costly!?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Heliosvector",
                    "body": "Couldn't workers just clean the boots when going between warehouses? I remember in Ireland when foot and mouth was all the rage, everywhere had antiseptic soaked sponge mats to walk on to help stop spread the disease. Could workers take it to the next level and say have water jet cleaning stations that spray the boots clean?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zealousideal-Help594",
                    "body": "Really? I mean, how hard or costly would it be to just have a box of those little blue boot covers at the entrance?\n\nThanks for your post. It's interesting to read about and good to learn new stuff.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Used_Raccoon6789",
                    "body": "It's crazy to me that they don't have some sort of boot wash system. I work in a food processing plant. Clothes and boots must stay at the plant. Additionally every area has a boot wash system in place making it so boot soles are disinfected several times a day.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "one--eyed--pirate",
                            "body": "The problem at the farm level is that you are walking through the litter which is moist & loves to stick in the groves of boots. You'd have to remove every tiny piece of organic matter because you can't sterilize manure. \n\nMuch more effective & practical to have barn specific boots.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lika3",
                    "body": "Insane for the boots. It’s the same thing if I say I don’t wash my hands in-between rooms in a hospital. Priority number 1 indeed.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sevenofnineftw",
                    "body": "How expensive could changing boots possibly be? Boots are what, $150 on the high end? Can you disinfect them with bleach? All of this that could potentially save your entire flock, I don’t even know what that could cost vs just changing your clothes between barns. You would know more than I do about this, but seems like such a simple cost benefit equation",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LindsayOG",
                    "body": "I was a rural ISP and many farmers wanted internet at their barns. It’s crazy the biosecurity at these places. I was quite vigilant on following them.  I was in some state of the art Ontario chicken barns. 100,000 yellow chickens running around is pretty cute though!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MaPoutine",
                    "body": "Wow this is really interesting, that's for posting this insight into your world!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Infamous-Driver12",
                    "body": "This right here!! Thank you farmers",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "UnionGuyCanada",
                    "body": "Thank you. The daily articles attacking supply.management make it out to be a scam to enrich a few, when it is actually a carefully controlled system to ensure safe and constant food supply.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GianniBeGood",
                    "body": "American here - a large portion of my countrymen fought over wearing medical masks during a global pandemic, doubt the efficacy of vaccines and just ignore scientific consensus on myriad other issues including climate change. You think they're gonna change their boots and britches just to help fight avian flu? C'mon now.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Careless_and_weird-1",
                    "body": "Differet boots for different barns is considered expensive? I would say that it's cheap. Are those boots really so special?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "joemamma2",
                    "body": "Thank you for sharing. As a related point, I believe that we take health, safety and cleanliness of our facilities far more seriously",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Anonplox",
                    "body": "Just wanna say thanks for being a farmer and feeding us all.\n\nMuch love.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Icy_Respect_9077",
                    "body": "H5N1 has also been spreading in US dairy barns. Reporting was extremely lax, even before Trump. Testing is weak and cows are being continually moved between farms, so it's hard to know how serious the problem is. Most serious, animal-human transmission has been verified in several cases.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "azraels_ghost",
                    "body": "It’s almost as though having rules, policies and agencies staffed with people to oversee it all is a good idea.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "buttfarts7",
                    "body": "We know how to do things properly basically and so we get better results.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mrizzerdly",
                    "body": "Too expensive to have more than one pair of boots to prevent infections? Wtf cheap ass bastards \"muh prophets!\".",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "a_f_s-29",
                    "body": "Saying it’s too costly to implement is crazy. It’s just clothes. Sounds a lot cheaper than losing a whole flock",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "coffeejn",
                    "body": "At this point, change the boots AND clean them at entry and exit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "anacondra",
                    "body": "So what you're saying is we should let the Americans control more of our food chain. We should exchange that oversight for RFK Jr.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Bronchopped",
                    "body": "People have no idea.\n\n\n\n\nThere is only one reason why. Our cold weather gives bird flu a very short window. With little over all impact.\n\n\nIn the states most of the layers are in warm climates. Bird flu destroyed them\n\n\nThis is the only reason. Everyone is grasping at straws looking to blame someone...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ManofManyTalentz",
            "body": "As happen way too often, the most important point is at the very very end of the piece:\n\n\n\nSo, what has kept Canadian egg farmers relatively small? Von Massow points to Canada's supply management system, which guarantees even small farmers enough income to stay in business.\n\n\"There is less incentive to grow because I can make money at this size,\" he says. \"There's still an incentive to be efficient. But there's not a requirement to get as big.\"\n\nTo keep its small farms viable, Canada also restricts imports of farm products like eggs and dairy from the U.S., which is one source of friction in the current trade war.",
            "score": 1034,
            "replies": [
                {
                    "author": "Independent-Emu-575",
                    "body": "When conservatives rail against the “tyranny” of supply management, they conveniently overlook this very real cost. \n\nCanada needs to take control of essential industries like food and energy to ensure our eggs don’t end up all in one big foreign basket.",
                    "score": 601,
                    "replies": [
                        {
                            "author": "GraveDiggingCynic",
                            "body": "Well, let's be perfectly clear that every time supply management comes up in Conservative leadership campaigns, the candidate that swears on a Bible that supply management isn't going anywhere wins. Some Conservatives may hate supply management, but those who run for leadership campaigns pretty much lose (in no small part because of Quebec). \n\nI had quite a debate with a poster either here or on the Canada politics sub a month or so ago in which they demanded we kill supply management and open up completely to cheap American agricultural products, and that supply management was an assault on Canadian consumers with overpriced products. Wonder where that poster is now...\n\nAs to the Americans, the fact that they're running around Europe begging for eggs, even as they mount tariffs, is one of the more delightful ironies of Trump's idiocy.",
                            "score": 291,
                            "replies": [
                                {
                                    "author": "Robbobot89",
                                    "body": "You can say a lot about Quebec but they make sure our country keeps some of its more European minded traditions. I kinda like those guys.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "bookwizard82",
                                    "body": "Every damn farmer I know votes PC  it would be wild for them to vote for a party that undoes the very thing that keeps them running.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SomeInvestigator3573",
                                            "body": "A lot of Republican farmers voted for Trump and are now seeing the consequences.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "TransBrandi",
                                                    "body": "For all of the things that Trump campaigned on that we can point to (that the farmers should have seen coming), \"bankrupting small farms so that large private equity firms and corporations can buy them up turning them all into modern-day share-croppers\" isn't one of them. Even if the farmers saw Trump talking about tariffs, I'm sure they tried to logic to themselves that it wouldn't make sense for Trump to hurt them as they are the backbone of America's food security.\n\nTalking about how this all might be a plan to consolidate wealth into the hands of the few really _does_ sound like we're getting into conspiracy theory territory, but it's one of the only ways that a lot of this starts to make any sense.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Big_Primrose",
                                                            "body": "American here. Yes, they should have seen it coming. It was outlined loud and clear in the Project 2025 document that was released. Bankrupt the little guy so private equity can scoop up the assets for pennies on the dollar. Transfer as much wealth as possible from regular Americans to the wealthy and gut the middle class. Dismantle agencies and regulations that protect regular Americans and cripple public education. This has been the Republicans’ policy for the last 45+ years.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "maleconrat",
                                                                    "body": "So was the whole hating socialism thing really just because the GOP knew they were dismantling Capitalism all along and wanted to make sure it was Feudalism that was lined up to take its place?\n\nI look at what Trump and Musk are doing and frankly they seem like deep down they would find free market capitalism \"woke\", and dread the lower classes having the political power they wielded at the US' economic peak. They already are influenced by Yarvin who sees democracy as wrong because he can't stand that the people don't vote to subjugate themselves enough...\n\nBrutal to see either way, hope you all can put a stop to these oligarch freaks before they do more damage to your country and the world.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TransBrandi",
                                                                            "body": "They believe in \"free market capitalism\" just as much as they truly believe in \"small government vs. large government.\" It's all about what gets them the most at the moment. They are not truly loyal to any of those ideologies.\n\nFor example, you can find companies that were *built* on government protections (e.g. phone companies) today crying about the \"free market\" when regulations forcing them to open up their lines are pointed at them. They weren't crying about the \"free market\" when they were given a government-granted monopoly.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "slampandemonium",
                                                    "body": "It's crazy that they didn't realize that all those food programs for children, the elderly and the poor are farm subsidies. Decades old programs keeping them afloat and they never put two and two together",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Upset-Tangerine7457",
                                                    "body": "They saw them last time too. They never learn.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "tempest_",
                                                    "body": "They wont see the consequences for a bit.\n\nFor arable farmers they bought their fertilizer and inputs inputs last year so they wont feel that till later this year when they go to reapply (if they choose to). Also depending on the farmer China hasnt yet clamped down on soy beans, or the farmer signed contracts to deliver last years crop before Trump got in.\n\nDespite Trumps bullshit it still takes time for these things to work their way through the supply chain.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "SomeInvestigator3573",
                                                            "body": "https://www.reuters.com/world/us/usda-freezes-farmer-funding-some-programs-conservation-contracts-2025-02-08/\nIt seems like some support programs are already being affected",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "RangerNS",
                                                    "body": "Well, they are being *affected* by the consequences.\n\nThem *seeing* it, and *being aware* of the straight line, one hop, cause & affect is a different question.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "CT-96",
                                                    "body": "Bourbon producers learned their lesson pretty quickly.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "MrDenly",
                                                    "body": "They seen it before, nothing changed.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Ok_Tradition_3382",
                                            "body": "I grew up on one of the top ranked dairy operations in the Ottawa valley and they remain extremely loyal liberal voters (to a fault). So it isn’t all farmers!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bookwizard82",
                                                    "body": "That’s rare.  I’m in SDG.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Ok_Tradition_3382",
                                                            "body": "I have no idea what voting demographics among farmers would like. Won’t even pretend! I would be curious to see what distinctions there would be between beef/dairy and cash crop. We always joked that the beef boys were a little slow so I would hypothesize they would vote conservative. Haha",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Jkj864781",
                                            "body": "Let the leopards eat their faces (metaphorically of course)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Intelligent_Read_697",
                                    "body": "I find that most conservative voters care about the price and quantity but never quality...maybe that explains their love for American vehicles",
                                    "score": 113,
                                    "replies": [
                                        {
                                            "author": "zombie-yellow11",
                                            "body": "As a mechanic, I find it insane that people still give 100k$+ to Ford and Chrysler for overpriced pick up trucks that completely fall apart after 50k kilometers lol let's not get started on Jeep and GM cars either...\n\nIt sure pays my bills tho haha",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Intelligent_Read_697",
                                                    "body": "It’s literally one of the many reasons why there is a trade war going on lol….these American companies had to retreat from everywhere in the world even before EVs were a thing due to how crap they are and now I doubt these companies will survive in the US without the tariffs on Chinese cars lol",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Zeebraforce",
                                                            "body": "New age capitalism: strong arm buyers to buy your product instead of making something consumers want",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "snf",
                                                                    "body": "Not sure if you meant that as sarcasm or hyperbole, but Trump has claimed that it's [illegal to boycott Tesla](https://www.yahoo.com/news/trump-said-boycotting-tesla-illegal-201240898.html), so...",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Zeebraforce",
                                                                            "body": "Hyperbole\n\nBut then again given how crazy Trump is, it's not really that exaggerated",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Hautamaki",
                                                            "body": "The only reason they survived this long is because of NAFTA. Without being able to freely take advantage of Canada and Mexico's comparative advantages in energy and labour costs, American automakers would have been dead by the early 2000s. That's the whole reason they signed that deal in the first place; literally no other way could American automakers compete with Asia and Europe.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "linkass",
                                                    "body": "> I find it insane that people still give 100k$+ to Ford and Chrysler for overpriced pick up trucks\n\nIts not like there is a huge amount of choices in the truck market even less so if you need a 3/4 or 1 ton",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Decipher",
                                                            "body": "Pretty sure they’re mostly referring to mall crawlers, brodozers, and pavement princesses.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "yyc_mongrel",
                                                    "body": "umm.... what?  \n\nNone of my Ford trucks have 'fallen apart' at 50,000km.  I still have a 1991 F250 with original drivetrain as a plow truck.  Had a 2002 with 300k+ km, had a 2015 with 180k km, have a 2017 with only 66k km but is still fine.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "zombie-yellow11",
                                                            "body": "Newer F-150s are pieces of shit. Driveshaft center bearings, ball joints, electrical gremlins, etc... Older F-150s with the Triton engines are also pieces of shit but for different reasons, mainly the engine being a turd. Your 1991 Ford is bulletproof because it's from another era, back when stuff was made for work lol",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "maleconrat",
                                                                    "body": "Do you know if the new electric f150 is at least any better than the Tesla Cyber-repeat-it's-a-truck-enough-times-and-hopefully-people-believe-it-and-don't-try-towing-anything?\n\nElectric trucks with actual truck functionality would be really cool IMO but I have no idea if we're there yet and am not all that confident in a new Ford attempt.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "yyc_mongrel",
                                                                    "body": "> Newer F-150s are pieces of shit. Driveshaft center bearings, ball joints, electrical gremlins, etc... \n\nNot a single one of which has been a problem on either of my more modern F150's.   Funny you didn't mention cam phasers which is a well known problem on the 3.5.\n\nI've been a long time Toyota fan.  Still have a couple.  But the value just isn't there anymore and given how many Tacos and Tundras have been bought-back or had engine replacements, the track record just isn't there.\n\nSome people just need a full size truck and there just aren't a lot of non-domestic choices.  We won't even mention Nissan.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "CT-96",
                                                            "body": "I'd keep that '91 far, far away from Quebec if I were you. The salt we use on the roads ate through my mom's '91 Grand Cherokee within a year of moving here.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Monarch_Elizabeth",
                                                    "body": "Should have kept it in Windsor. We had the big 3 here making cars, trucks, vans and minivans. But was cheaper to build south of the border and to have parts shipped in from China.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "stephenBB81",
                                                    "body": "I have sadly been giving my Money to Ford because I really hate how Honda and Toyota drive. \n\nThat said, my 2017 Ford Explorer has 305,000km on it,  With maybe $5000 in outside of warranty work.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Todrunk2funk",
                                                            "body": "2009 F150 with 250,000kms and only a few minor fixes.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Jaambie",
                                            "body": "I find that in Alberta, most conservative voters don’t even care one way or another what is going on, they just vote conservative for the sake of voting conservative.  Even when the last conservative government is full of corruption and screws the province over.  But this time they have a new name!  Surely they’ll be different than the last 50-years of the same shit!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "BallBearingBill",
                                                    "body": "That's the power of demonizing the other side. Cons know they don't need to win on policy. They can win on hate and lies. If the libs want to get votes they need to run less on hope and more on the con playbook. They need to dig into the desires of people and play on them. You can't bring a feather to a knife fight.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "boredinthegta",
                                                            "body": "Agreed, that's why Liberals and NDP call anyone who doesn't like their wage suppressing, house bubble inflating migration policies racist rather than standing on the merits of their policy.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SerGT3",
                                    "body": "WHY WONT YOU GIVE US EGGS? THEY ARE STARVING US. CANT YOU SEE WE NEED HELP? \n\n*The next second*\n\nWe don't need you...",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ExtendedDeadline",
                                    "body": "> Wonder where that poster is now...\n\nProbably still in Russia operating their bots, like they were a month ago :(.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ExtraGlutens",
                                    "body": "How do you equate dropping supply management (price fixing) with adopting American health and safety regulations? And how do you square that with a 245% tariff on British cheeses?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GraveDiggingCynic",
                                            "body": "Did you even read the article? The American system encourages chicken farms with hundreds of thousands of chickens in a facility, meaning a flu outbreak can take out a large proportion of production. One of the side effects of supply management is that it makes smaller operations viable, and the bonus of smaller operations is outbreaks are more limited.\n\nAs to price fixing, well how is the billions of dollars of US agro subsidies not price fixing? I'm not sure why supply management gets all this ire, and no one is condemning US subsidies?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ExtraGlutens",
                                                    "body": "We've lost ~90% of our farms under supply management, you think consolidation isn't happening here too? Again, there's nothing preventing the Americans from adopting our health and safety regs, it has nothing to do with supply management.\n\nI would also argue that subsidies are far less regressive than high prices, because not all Americans pay the same taxes, but we're all getting screwed on 6$ hard butter here.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "GraveDiggingCynic",
                                                            "body": "Well, except for driving up the debt pretty massively. Supply management largely pays for itself, subsidies in the US become part of the overall year over year deficits.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ExtraGlutens",
                                                                    "body": "Oh *now* Canadians are worried about the debt? How quaint.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GraveDiggingCynic",
                                                                            "body": "???\n\nI don't what the complaint here is. The supply management system is largely self-contained, whereas the US agricultural and livestock subsidies are built on borrowing. Your point feels a lot like a non sequitur.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ExtraGlutens",
                                                                                    "body": "> whereas the US agricultural and livestock subsidies are built on borrowing.\n\nMost government spending is borrowed money, you're muddying the issue, *poorly*.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "GraveDiggingCynic",
                                                                                            "body": "I'm not muddying the issue, you did. You favored subsidies, which means they have to be paid by the government. You're the one that declared the superiority of a subsidy system, which, in reality, is what supply management is, it's just that supply management is a large internalized economic system.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "physicaldiscs",
                                    "body": ">Well, let's be perfectly clear that every time supply management comes up in Conservative leadership campaigns, the candidate that swears on a Bible that supply management isn't going anywhere wins.\n\nSupply management is the sacred Canadian cow. No one is actually willing to touch it, so when people are screaming that other team will get rid of it they are just straight up lying.\n\nWhich is funny in this case because it was the Liberal government who actually opened us up to some dairy imports in the last NAFTA renogatiation.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "bbcomment",
                                    "body": "I hate that the prices in Canada are higher 100% of the time, despite our salaries being lower, but in this one instance every 10 years there is a good reason to justify it\nI rather have cheaper eggs and milk to be honest or have SOME competition to stop fleecing Canadian customers",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GraveDiggingCynic",
                                            "body": "Let's imagine a scenario in which we had dispensed with supply management during the negotiations over USMCA. We're seven years on, the Canadian dairy and egg industry has been overwhelmed by cheap US goods, domestic supplies are either dwindling or have been integrated into the US market, and enough time has passed that smaller chicken farms have probably all gone bust and large facilities with hundreds of thousands of chickens are increasingly the norm.\n\nThen the flu virus spreads, and these huge facilities have to be basically be completely culled. Now suddenly we're paying even more for eggs than the US is.\n\nThere's a price to such a system, that encourages consolidation, poor regulations and a huge hidden stream of subsidies to farmers.\n\nI'll take supply management. A stable supply, even if more expensive, is infinitely better than the system they have south of the border.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "cummer_420",
                                            "body": "Deregulation in this case means far less competition. Every bit of farmland would be bought up by private equity just like in the States, and staffed with exploitative below-rate migrant labour.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "huge_clock",
                                    "body": "Sure supply management looks great in a specific commodity (eggs) when your neighbour is dealing with a rare onslaught of avian flu, but you pay for it multiple times over when times are good and you are paying the normal higher prices.\n\nNational security arguments stand though, but prior to T2 Trump wasn’t really raised. And if it’s so important why is the USA are sole supplier of heavy military equipment?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "spidereater",
                                            "body": "Food security is the main reason for supply management. If we weren’t so close to such a big market it wouldn’t be as much of an issue.\n\nThere are benefits for small farmers and for quality. It leaves some room for regulations to ensure food safety. There is some cost, but over all it is worth it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "huge_clock",
                                                    "body": "What is the evidence that such a policy results in higher quality food?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Neighbuor07",
                                            "body": "I bought a dozen free-range omega three eggs for $4.49 a few days ago. I am definitely in support of egg management practices now.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "sherrybobbinsbort",
                                            "body": "Travel to the U.S., milk is generally not cheaper there when factoring in exchange rates.  And obviously we have the whole ordeal with eggs. \nHonestly with the U.S. threatening our sovereignty do we want to depend on them for food also?  \n\nThe supply management system has a few benefits that often get overlooked. \nIt keeps  little more profit in the hands of farmers vs processors.   In the U.S. the egg and chicken farmers are basically contract growers for large corps (Tyson) who are vertically integrated and make the money while the farmer makes enough to survive.  This leads to lack of profit on the farm, build the cheapest barns you can find that then have low biosecirity standards and voila!  Avian flu runs rampant. \n\nAnother benefit is the economic spinoff.  \nThere would be very little or no dairy or poultry in maritimes or prairies.  The cost of production is quite a bit higher than Ontario.  Every one of those farmers has a vet, accountant, equipment dealer etc.    We would have the majority of livestock production in Ontario.  \n\nThe reason the farmers in the U.S. have the ability to make cheaper milk and eggs is that Ag in the U.S. is heavily subsidized by the govt.  So the grain is artificially cheap that feeds the livestock in addition to the dairy revenue programs that pay them when prices are low.   In these cases whether you consume these products or not as a taxpayer you are funding the dairy and egg farmers.   In Canada if you don’t eat eggs you aren’t paying the farmer. \n\nSo yes if you want so the more like the U.S. and creative a bigger divide between the rich and poor, depend and a country that is threatening us for our food supply, have crappier bio security, and also start having to send income equalization payments to our friends in the maritimes then yes start to dismantle supply management.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "red_planet_smasher",
                                            "body": "\\> but you pay for it multiple times over when times are good and you are paying the normal higher prices.\n\nYour argument omits the point your sibling comment from an hour before made about quality. We may be paying more, but we're also getting something better. And that's not to mention the obvious benefits of better food security and support for more people rather than a few mega corporations.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "astrangeone88",
                                                    "body": "Lol.  Seriously.  I'm a second generation Canadian and hearing all the horror stories about American dairy farms?  No thank you.  We have tighter food regulations than you do.\n\nBut your cereal and junk food is amazing (looks at box of Carmella Crunch)....",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GraveDiggingCynic",
                                            "body": "In other words, supply management works.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "huge_clock",
                                                    "body": "It works as intended, but there are trade-offs to the policy.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "GraveDiggingCynic",
                                                            "body": "That is the nature of policy. The US system, with its huge agricultural subsidies and intense concentration of livestock production, and lower overall standards has been about delivering cheap goods, not merely for an American market, but also to dump (ask a lot of developing nations how American agricultural subsidies have undermined domestic production). It's possible that Trump may disrupt those subsidies, they are certainly in DOGE's sights, but boy, that will be an interesting, of the Republicans lose the farmers, there's a good many pretty solid Republican voters who either vote Dem or just stay home.\n\nAt any rate, Canadian agricultural policies were developed in no small part to create a stable supply; it's the classic project management problem: you can have it quick, you can have it cheap or you can have it good - pick two, and Canada has, in various forms since the Depression, favored agricultural policies that create a stable supply, with some sacrifice made in tending to put prices higher.\n\nFor me, supply management is an example of \"perfection is the enemy of the good.\" In the Canadian context, it has been a successful policy. Maybe more market-based policies, with the right regulation, might do better, but as it stands, supply management seems a reasonable compromise that by and large delivers what is intended. If only many other policies were that successful.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "relaxin_chillaxin",
                                            "body": "Bullshitm supply management keeps costs low and stable. While the prices of other things have gone up, milk and eggs stay the same.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "cunnyhopper",
                                            "body": "> you pay for it multiple times over when times are good and you are paying the normal higher prices.\n\nAh, the classic anti-supply management argument that relies on selective accounting.\n\nIt's like advocating against railings on balconies because they obstruct your view a little while ignoring what happens when someone falls off.\n\nIt's easy to account for the full cost of a commodity when times are good and the supply is secured. But when times are bad, you are dead. Normal accounting can't assign a \"cost\" to that. Normal accounting just ignores it. Consequently, there is no way to make a proper cost comparison between managed and unmanaged supply. Ideas like \"higher\" or \"lower\" prices are undefined in this context.\n\nTricking people into taking existential risks by scaring them with bullshit like \"you are paying normal higher prices\" deserves significant and sub-rule breaking pushback.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "huge_clock",
                                                    "body": "I am not “tricking” anyone. Any policy will have tradeoffs and it’s important to acknowledge supply management is not a free lunch. Policies that limit competition/supply will have the effect of reducing supply and thus increasing prices (Ceretus parabis).\n\nYou can think of supply management as an insurance policy against destabilizing factors of production. Such an insurance policy carries a cost. Whether or not such a policy is “worth it” depends on factors such as the elasticity of such goods and the availability of readily substitutable goods, which I am not positioned to comment on.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "cunnyhopper",
                                                            "body": "You're just using different words to make the same argument.\n\nIt's not an insurance policy. Insurance implies that whatever is lost can be replaced. You can't replace a food supply.\n\nThere is no sense in discussing whether the \"policy\" is \"worth it\" any more than you can discuss comparative \"cost\" or \"price\". There is no metric for making comparisons.\n\nWe know what happens in a system with unmanaged supply. We have historical evidence. There is no way to assign a price to that.\n\nThe \"higher cost\" angle is a tired bullshit argument. We've heard it before.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "huge_clock",
                                                                    "body": "I can provide comparative costs for a comparable good (milk) also subject to SM: https://www.numbeo.com/cost-of-living/country_price_rankings?itemId=8",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cunnyhopper",
                                                                            "body": "Do you know what selective accounting means?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "huge_clock",
                                                                                    "body": "Perhaps you can set the record with your own figures.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "cunnyhopper",
                                                                                            "body": "How will providing numbers explain why the numbers don't mean anything?\n\n*Managed supply* is more resilient to systemic collapse than *unmanaged*. When you compare the costs of *managed supply* with *unmanaged*, the risk of collapse has to be accounted for on the *unmanaged* side but there is no way to quantify that kind of risk because it is existential. The \"cost\" of losing your food supply is essentially infinite.\n\nSince it's not a value that can be quantified easily, it generally gets ignored. That is selective accounting. If you're not doing an even account of costs then your comparison is invalid.\n\nThat's why bringing up the idea that *managed supply* costs more than *unmanaged* is a dishonest argument. You have to leave out critical information in order to make the comparison work.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "kindanormle",
                            "body": "Here's the thing. Supply Management means that our egg prices are, under normal circumstances, higher than in the USA. The cost savings of American-style factory farming, coupled with rampant monopolization/corporatization, are why they have ended up with the situation they have. As weird as it is to say this, Canada has less monopolization in the farming sector. Some would say we have a monopolized distribution sector though, because of Supply Management.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ahuramazdobbs19",
                                    "body": "Yeah.\n\nCanada’s system is basically “yeah, it might be a little more expensive, but it means supply shock doesn’t swing the pendulum the other way”.\n\nSo when there’s no problems, your eggs are $3 dollars a dozen.  But also when there are problems, your eggs are still $3 a dozen.  Maybe $3.50.\n\nWhereas the US system has been “get them cheaper by any means necessary”.  So when things are good, eggs are like $1 a dozen.  But when the system fucks up, it fucks up hard, and the dozen is $7.50 now.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LeatherMine",
                                            "body": "> So when there’s no problems, your eggs are $3 dollars a dozen. But also when there are problems, your eggs are still $3 a dozen.\n\nIf you actually have problems, there won’t be enough to meet demand at $3 per dozen.\n\nCan’t erase Econ 101.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "cummer_420",
                                                    "body": "The problem with Econ 101 is that you have to move past introductory concepts at some point. It's a snappy comeback but real economics are complex and nuanced. Policies like supply management and health regulations can significantly reduce and mitigate the chances of something going wrong to the point of substantially changing the price.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "LeatherMine",
                                                            "body": "Real economists get nauseated by supply management",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "cummer_420",
                                                                    "body": "Real economists are not a monolith lmao",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "InACoolDryPlace",
                            "body": "\"The People's Republic of Walmart\" is an interesting comparison between supply and economic management under capitalism vs communism, and IMO does a good job arguing why we view one \"central planning\" as ineffective and the other as status quo.\n\nThe (neo)liberal track we've been on for the better part of a century essentially views regulated markets as a technology to deliver efficiencies under private ownership. Take the emissions market (carbon tax) or even the wholesale energy market, where decisions that impact the market are driven by independent regulatory bodies and system operators (engineers), but markets are regulated within this to offset the cost of public ownership and associated liabilities of the facilities. So as a socialist, when arguing for increased public ownership over our utilities like telecom, raw materials, etc, I'm willing to concede that what specifically should be owned by who/what is a more difficult topic than whether we have the technology to manage our economy. \n\nCanada is also a good example of a capitalist social democracy with a mixed economy, and while we don't enjoy public ownership of our raw materials, there is a class of people who effectively \"own\" assets of companies which extract raw materials in the form of pension funds. \n\nThis is all to say the \"tyranny\" people view of supply management is one that politics exploits and many people have strong opinions about, but decoupled from politics the material exchange of goods/services currently utilizes central planning on a scale that even the most totalitarian communist regimes would be envious of.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Redshiftxi",
                            "body": "I talked to someone that used to farm chickens in Ontario last year. I can't remember if it was 300 or 500 chickens, but once passed that threshold, the amount of money to paid out to the governing body made it unfeasible. He kept it 1 under. \n\nI personally have only 20 layers and broilers.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "exoriare",
                                    "body": "You can buy egg quota from the governing body? I thought it was like every other quota management where you have to buy it from another farmer?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mypersonnalreader",
                            "body": "> When conservatives rail against the “tyranny” of supply management, they conveniently overlook this very real cost.\n> \n> \n\nPlus, if they were consistent with their professed ideals, they'd realize that supply management protects the \"small farmers\" and \"family businesses\" from big corps.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "shaihalud69",
                            "body": "A proper fiscal conservative should be BFFs with supply management. But let’s face it, that’s not what a modern conservative is.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Own_Elephant8899",
                            "body": "Bear in mind though that animal products and byproducts (which include eggs, consist more of luxury than essential food items, sitting somewhere between alcohol (total luxury) and fruits, vegetables, grains, legumes, nuts, etc. (basic necessities for life).",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "maleconrat",
                            "body": "Yeah, I think there may well be better ways we could do it, but the whole thing is a matter of maintaining sovereignty by maintaining the ability to produce our own food at quantity.\n\nThe problem with the US is they both worship the free market AND internalized the whole \"greed is good\" mentality. Letting those two things coexist is a recipe for people gaming the market until it is no longer free, incentivizing carelessness and killing innovation.\n\nMore and more I think social market economies and mixed economies in general are more 'free' in the ways that matter. Would way rather deal with our regulations and interventionism than eat garbage food and go broke from the doctor visits while the government makes it illegal to shit talk Tesla",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "maleconrat",
                            "body": "Yeah, I think there may well be better ways we could do it, but the whole thing is a matter of maintaining sovereignty by maintaining the ability to produce our own food at quantity.\n\nThe problem with the US is they both worship the free market AND internalized the whole \"greed is good\" mentality. Letting those two things coexist is a recipe for people gaming the market until it is no longer free, incentivizing carelessness and killing innovation.\n\nMore and more I think social market economies and mixed economies in general are more 'free' in the ways that matter. Would way rather deal with our regulations and interventionism than eat garbage food and go broke from the doctor visits while the government makes it illegal to shit talk Tesla",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "kilawolf",
                            "body": "Not just supply management but also \"regulations\"...everyone's loves complaining about useless regulations that cut into profits till a crisis happens and we realize why we had it in the first place...",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Equivalent_Age_5599",
                            "body": "I don't understand this fetish for government enforced oligopoly. \n\nMore competition = lower prices, period and end stop. Lots of countries have great prices and don't have the Americans shortages without supply management. Its a sore point in every free trade agreement we have made. \n\nStop looking at the dumpster fire down south to justify the shit from our own system.",
                            "score": -42,
                            "replies": [
                                {
                                    "author": "YeetCompleet",
                                    "body": "Enforced oligarchy of... Small farms? Allowing more bigger competition = more big fish eating the small fish, and thus having the expected effect of causing less competition. Our system is proven to keep small family farms competitive without being overrun by corporate farms, full stop.",
                                    "score": 35,
                                    "replies": []
                                },
                                {
                                    "author": "Rad_Mum",
                                    "body": "But it isn't about lower prices .  It's about food sustainability and ensuring that those who produce our food can fair out a living at it, so they will continue to do so. \n\nYou bring up Europe , but they do not live beside capitalism like the USofA that will subsidize their farmers and gladly dump their overproduction  on Canada, reducing the prices and lowering quality and hurt Canadian farmers. \n\nWe support our farms' front end, the Americans support backend . \n\nWe limit production to our needs in Canada, Americans used to buy surplus and turn it into products for distribution.\n\nGovernment Cheese, and powdered eggs.  \n\nThis became expensive for the US as farms would increase production and get the US government payouts . But they can't stop, so next, dump it in other countries, and making us dependant on them for food. This is and should be a hard no as Canadians.",
                                    "score": 33,
                                    "replies": []
                                },
                                {
                                    "author": "veerKg_CSS_Geologist",
                                    "body": "Our system is fine though, better than fine. If Canada wants a domestic egg and diary industry it’s going to need supply management. Let’s not forget the US system of massive farms is also an oligopoly.",
                                    "score": 44,
                                    "replies": [
                                        {
                                            "author": "Legitimate-Type4387",
                                            "body": "No sir, those mega farms all owned by 2-3 giant vertically integrated agribusinesses are the epitome of competition. Their only motivation is to deliver the lowest cost to consumers. /s",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MickKeithCharlieRon",
                                                    "body": "Their only motivation is to deliver lowest cost to consumers?  You must not be very well acquainted with American mega businesses.  Their top priority is maximizing profit and shareholder returns.  Period.  Any means justify that end.  They are soulless money machines.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Legitimate-Type4387",
                                                            "body": "Sarcasm tag missed?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LostInQCWilderness",
                                    "body": "Did you learn that in second grade or third grade and never bother to expound on it?\n\nYes, in extremely basic theory, in a perfectly fair and just system, or in smaller pockets (eg small nations), that is accurate. In reality, you're talking out of your ass and this is a perfect example of the issues. I'm assuming you didn't bother reading the article, because it literally details the issue with a free market that becomes abused by big money interests.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "MyGruffaloCrumble",
                                    "body": "Fucking the wheat board in the ass was Harper’s swan song, and screwed our farmers pretty hard for a long time.  Don’t believe the American hype about our system, listen to our farmers.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "MartyCat4432",
                                            "body": "Don’t forget that the wheat board also organized the orderly movement of grain to port. We know this is true because of the bullshit that happened in the winters after Ritz broke up the wheat board. Aldo watch these grain buyers   After the wheat board was dismantled these snakes were too happy to delete “act of GOD” escape clauses from futures contracts. This forced many farmers in the drought to try and snap up other farmers grain to fill their contract",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GraveDiggingCynic",
                                    "body": "Stable food supply is probably the single most important responsibility of government.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "astride_unbridulled",
                                    "body": "Except it will always devolve into monopolization and less competition and a race to the bottom in quality, safety, and robustness. Our system is holding up just fine and balances all the interests quite deftly, no need for rolling the dice in the food supply. Why dont we loosen up all the banks too so they can fuck around even more, grumble grumble grumble\n\nMore abillity to self-regulate = more fucking around = we have to suffer avoidable crises and bailout supervillains because you wanted us to ignore the natural logical endgame the US represents for this kind of thing",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sage_Planter",
                    "body": "\"I can make money at this size\" goes against everything corporate America believes in. Mega corporations want to make the most money and the biggest possible size, not just \"make money.\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "red_planet_smasher",
                            "body": "You hit the nail on the head. America is going beyond capitalism to something else, \"pathological capitalism\".\n\nEverything in moderation is what we need, capitalism included.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TransBrandi",
                                    "body": "Part of it is the stockmarket. The stockmarket heavily rewards growth because investors are predicting larger returns, so the companies need to always keep growing. If they don't grow or grow too slowly they are \"stagnating\" even if they are still profitable.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CanadianTrashInspect",
                                            "body": "This is why we need more public options and co-operatives that focus on things like quality products/services and employee standards before profit. Let's have reasonably sized operations close to population centers. Who gives a shit if it costs more - it's more stable, more reliable, and better for the local economies.\n\nCapitalism is fucking broken, the incentive is almost always going to be cheaper production and higher margins.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "okpjus",
                                    "body": "This is why they are threatening to annex resource-rich countries like us & Greenland. We actually care about our environment. They consume consume consume and they squeezed everybody and everything dry. There’s nothing left. They need to secure land and resources for their starving, impoverished population that is probably getting angrier and hungrier and poorer every day that goes by with the current administration.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Big_Primrose",
                                    "body": "It’s a pure unregulated capitalism which is how it was before any consumer/worker protections were put in place.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CloseToMyActualName",
                            "body": "I think the real issue is that under the US system you can't make money at that size. Agribusiness scales up and undercuts you, so you either need to scale up as well or be forced out of the business.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bigorangemachine",
                    "body": "I'm surprised they didn't mention the early cull in 2023\n\nThere was a time I couldn't get chicken wings under lock down and chicken prices spiked like craaaazy.\n\nI'd say our food system is also willing to make the hard decisions early",
                    "score": 30,
                    "replies": [
                        {
                            "author": "V1cT",
                            "body": "It didn't happen. It never happened. Stop remembering things that make sense.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "vodka7tall",
                    "body": "Donald is screaming about our dairy supply management while simultaneously begging for eggs, which we only have thanks to rigorous supply management. \n\nMassive factory farms are what got them into this mess, and they want to bully us into the same fate.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dontdropmybass",
                            "body": "Because when there's instability, there's money to be made.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "vodka7tall",
                                    "body": "Flood the market with cheap prices, buy up all the failing small businesses that can't compete with your prices, then once you have a monopoly, jack up the price... it's the american way!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Itchy_Training_88",
                    "body": "Also the fact that large farms are more susceptible to avian flu outbreaks which will require the cull of the entire flock.",
                    "score": 69,
                    "replies": [
                        {
                            "author": "Vyvyan_180",
                            "body": "Flock around and find out, as it were.",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "Itchy_Training_88",
                                    "body": "Quite honestly I don't give a flying flock about US eggs ",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "swift-current0",
                                            "body": "I've had it with these clucking puns you guys",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "SlapNutsInc",
                                                    "body": "I don't know about you, but I find them eggcellent.",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "swift-current0",
                                                            "body": "I still think we should give it a roost",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "author": "ManofManyTalentz",
                                                                    "body": "What's wrong with a little yolking around?",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FantasySymphony",
                    "body": "What's wrong with the part near the beginning, directly beneath the subheading **\"Why Canada is different?\"**\n\n>Von Massow suggests a number of explanations for that. It gets colder in Canada, so barns are more tightly sealed, which helps keep flu virus carried by wild birds out. Canada also has fewer free-range chickens, which are more susceptible to getting infected.\n\n>But perhaps the biggest difference is that egg farms in Canada are much smaller, so when one farm does suffer a flu outbreak, the effects are less far-reaching. The typical egg farm in Canada has about 25,000 laying hens, whereas many farms in the U.S. have well over a million. In effect, American farmers have put a lot more of their eggs in a relatively small number of baskets.\n\nAnd the very balanced take they put right after?\n\n>Many farms in the U.S. rely on automated equipment that requires a large number of birds to operate efficiently. Most of the time, that industrialized agricultural model delivers cost savings for consumers. Eggs are typically cheaper in the U.S. than they are in Canada.\n\n>\"The benefits have been affordable eggs at lower prices,\" Thompson says.\n\n>But there are also trade-offs, as the avian flu outbreak has highlighted.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Holiday-Hustle",
                            "body": "Hmmm, what’s better: eggs being $1 at best more expensive or factory farming leading to the spread of viruses 🤔",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Barbecue-Ribs",
                                    "body": "On average the latter is probably better.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "smurfette_9",
                                            "body": "Curious how you would \"average\" this because it's way more than just simple economics here. How would you price the spread of viruses and carbon monoxide that these culled chickens would release into the atmosphere as they decompose? And now with the lack of eggs, would it lead to people to eat less or find other sources of protein that may cost even more?  And what about potential health issues if this egg shortage lasts a long time?  How would you average this all out?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Barbecue-Ribs",
                                                    "body": "> Curious how you would \"average\" this because it's way more than just simple economics here. How would you price the spread of viruses and carbon monoxide that these culled chickens would release into the atmosphere as they decompose?\n\n\nLikey this is negligible. The US consumes 10 billion chickens a year and apparently they killed 150 million since 2022 due to avian flu. Would killing + composting a chicken even lead to a noticeable increase in carbon emissions compared to raising it for a month then killing + consuming + replacing it? If anything not raising it for a month probably reduced carbon e missions. \n\n\n> And now with the lack of eggs, would it lead to people to eat less or find other sources of protein that may cost even more? \n\n\n\nLet’s assume people paid the max price of $6/dozen (source FRED) over the last 4m. Google says average person eats roughly 280 eggs/year so let’s say 2 dozen/month. Compared to the august low of $2/dozen they would’ve paid a max of an extra $8/month for their eggs. I’m gunna go out on a limb and say 99% of people aren’t affected or are maybe mildly annoyed. \n\n\n\n> And what about potential health issues if this egg shortage lasts a long time? \n\n\n\nEgg shortage is pretty much over already. Also not sure what potential health issues you’re referring to.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Mr_ToDo",
                            "body": "The article is kind of missing a bunch anyway but they aren't wrong here. Lot's of small farms gets you redundancy over low prices.\n\nBut the real bugger and the reason the big vs small barn is a big deal to the market is that once you purge the barn you have to keep it empty for a few months(just what I've been told by farmers here). Bird flu is no joke, and why they go to such extremes to try and stop it from getting in.\n\nAnd one of the big pieces they miss is *how* that system exists. If we could make massive factories we sure as shit would(it's not like people don't like scaling up in Canada). What we have here is a system where you get a ticket from the government to raise a certain number of birds. Each ticket is, as far as I know, is worth the same number of birds and it's possible to have multiple. Now the problem is you can't just ask and get one. Everyone who is eligible gets put in a pool and it's a lottery. \n\nOh and to make it more fun you can actually sell it if you want, but you have to have had(and I think used it) for a certain number of years first. It's actually work a few hundred K and I'm told is often the most valuable thing in an egg farm(eggs don't make much money on a small scale apparently).\n\nAnd as for no automation, that's just not true from what I've seen. Even the small barns have automation of some level. I think the most manual step I've seen is the egg packing. I mean can you imagine trying to pick eggs from twenty five thousand birds trying to peck you?\n\nOh, and you don't need a ticket for something like a hundred chickens(I don't know the exact number, someone just told me there's an amount you don't need a license).",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FantasySymphony",
                                    "body": "It does say. Investing in automated machinery requires more volume to yield a return; American farmers make less per egg and need to sell more eggs. Thus the tendency for larger flocks.\n\nSupply management is a bunch of things lumped together; food safety regulation, production quotas, restrictions on foreign products, 'foreign' of course includes products from the EU, whose food safety regulations are at least as strict as ours. Some of those things are good, some aren't.\n\nBut when people argue about SM they always define it as the bits they like and ignore the rest, and then pretend people on the other side use the same restricted definition (*gasp* how could *anyone* be against *food safety gasp!!!!111*). SM does much more than \"protect you from crappy American food.\"",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "adonns2_0",
                                            "body": "Ya this comment section is really leaning into just ripping on the states when the reality is their guidelines aren’t a whole lot different than ours.  I work for a company owned by the same company that owns the largest producers of laying hens in the US and we follow all their biosecurity and guidelines because they were vastly superior to ours. \n\nThey simply have a lot of absolutely massive barns and their industry is predominantly in a few states.  They’ve been hit a lot harder by avian flu than we have largely because of proximity and when they have to wipe out a barn it’s a crazy amount of birds.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "swimingiscoldandwet",
                                                    "body": "“Yah the US is totally the same but …”",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sylbug",
                    "body": "The current trade war has as much to do with our farming practices as it does to fentanyl - in that it’s a total irrelevancy.\n\nThe trade was is 100% a political attack from a moron who wants to annex us. No change to our practices would l alleviate the trade war.\n\nStop spreading misinformation on this topic. It is a threat to our sovereignty to misunderstand the situation.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CT-96",
                    "body": "I legit can't think of a single reason to buy American milk even before all this. Hell, I can't even name any American milk brands, I've never even seen a non-Quebec milk on the shelves in MTL let alone one that wasn't Canadian.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AllstarYVR32",
                    "body": "One of the most potent differences between Canada and the US Is that we’re heavily regulated and the US isn’t. The values that underpin that mentality drives a lot of the friction.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "smallspudz",
                    "body": "Except, there is more and more consolidation in the supply managed cartels here. Dairy and chicken continue to be owned by fewer people and many want to get bigger and produce more.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "awsamation",
                            "body": "What the hell are you talking about? There is absolutely more consolidation of production under the US system than the Canadian system.\n\nSupply management quota specifically puts an upper limit on how much a single operation is allowed to produce. Unlike the US system where the only limit on how much you can produce is how big a loan you can get to pay for that growth.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "smallspudz",
                                    "body": "Correct. But I can own 10 different locations milking 200 cows each. That's the consolidation that's happening. Neighbor is selling? I will buy it for my son... Same family owing and running. Hoots are investing heavy in quota...",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "awsamation",
                                            "body": "The quota doesn't care how many locations you have. It counts the total production you own. 10 locations with 200 cows each requires just as much quota as 1 location with 2000 cows.\n\nYes you can play games by having different people own quota but share facilities. But the very fact that you have to do that is proof of how our system is less consolidated.\n\nIn the US you'd just keep building bigger and leave your son out of it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TomMakesPodcasts",
                    "body": "The restrictions are tariffs if the US exceeds imports of a certain amount. The US never exceeded their imports to Canada to trigger those Tariffs. \n\nFunnily enough those same tariffs that have never triggered were in the trade deal Trump was so proud about getting done last time he was president.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "moronyte",
                    "body": "I mean, the entire US is built on the \"go big or go home\" paradigm, so...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "linkass",
                    "body": ">So, what has kept Canadian egg farmers relatively small? Von Massow points to Canada's supply management system, which guarantees even small farmers enough income to stay in business.\n\nIs that what is the case though, I found this interesting\n\n*Ten states have passed laws allowing the sale of eggs only from cage-free environments. The supply of those eggs is tighter and focused in certain regions, so the effect on prices can be magnified when outbreaks hit cage-free egg farms.*\n\n*Many of the egg farms with recent outbreaks were cage-free farms in California. Cage-free egg laws have already gone into effect in California, Massachusetts, Nevada, Washington, Oregon, Colorado and Michigan.*\n\n[*https://apnews.com/article/egg-prices-record-bird-flu-a2394bdefc7bd0514d4f003cc5e8a908*](https://apnews.com/article/egg-prices-record-bird-flu-a2394bdefc7bd0514d4f003cc5e8a908)\n\n[*https://www.nasdaq.com/articles/cage-free-egg-supply-takes-outsized-hit-bird-flu-surges*](https://www.nasdaq.com/articles/cage-free-egg-supply-takes-outsized-hit-bird-flu-surges)\n\nAnd apparently 86% of laying hens in Canada are still caged so...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mysteriouskid00",
                    "body": "It also guarantees Canadians pay way more for things like eggs and dairy than most countries.",
                    "score": -11,
                    "replies": [
                        {
                            "author": "Lordert",
                            "body": "Not exactly accurate. Here is a list of global egg prices, Canada is 34th least expensive.\n\n[Egg prices by Country](https://www.numbeo.com/cost-of-living/prices_by_country.jsp?itemId=11)",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "veerKg_CSS_Geologist",
                            "body": "“Support farmers” has a cost. No surprise there, it’s not just a slogan.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "P4cific4",
                            "body": "Quality of the product and quality of life of farmers are a cost we're more than happy to pay.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "sens317",
                            "body": "I'll pay $2 more to avoid shit Velveeta WI Culver's unsqueeky cheese curds and $10 more for cheeses from Europe.\n\nNo prob.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Konker101",
                            "body": "We pay more for everything here which is fucking ridiculous",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "ZaviersJustice",
                                    "body": "Start comparing when we pay compared to any developed nation not called the United States to actually got some perspective.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Barbecue-Ribs",
                                            "body": "There’s a CPI type chart available for EU but I don’t want to spend time converting it to a dollar figure. Seems like (anecdotally) Europeans spend less than us on average https://www.reddit.com/r/YUROP/comments/1i83c2j/how_much_does_a_dozen_eggs_cost_in_europe/",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Born-Winner-5598",
            "body": "I am lucky enough to have a few choices of *very* local eggs (within a 5 min drive).  I will gladly pay $5 / dozen for *fresh* eggs.  \n\nLove my small local farmers!",
            "score": 119,
            "replies": [
                {
                    "author": "Inevitable-Stand-559",
                    "body": "Personally $5 a dozen should be the normal price for what is potentially 4-6 meals worth of nutritious food.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IndoorVoiceBroken",
                            "body": "Look at this guy advocating for price increases /s",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MyHorseIsDead",
                            "body": "Damn; you can eat 2 or 3 eggs and that's a complete meal?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "staunch_character",
                                    "body": "Yeah? I’m 5”4 & 125lbs. If I eat more than ~1500 calories a day I gain weight.\n\n2-3 eggs in a scramble with a bit of peppers & cheese = definitely full.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "mookeddit",
                                    "body": "Where did they say complete meal?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "theonlyquincy6189",
                            "body": "A dozen is 3 meals for me unlucky if even",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AlgebraicIceKing",
                    "body": "$5! Round here they went to $6/dozen last year. By next year it'll be $7. I'll still buy local though, despite the increasing costs.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Born-Winner-5598",
                            "body": "For local - I would pay it!  Those dark orange yolks are no joke! Fresh eggs are the best!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "buckaroonie",
            "body": "All their eggs are in the same farm, less diversity, less resiliency, less availability.  Small farms makes Canada more resilient!!!",
            "score": 69,
            "replies": []
        },
        {
            "author": "Nonamanadus",
            "body": "Pig barns in Saskatchewan,  you have to shower at work, dress up and after the shift shower again. I would expect chicken farms have the same protocols.  \n\nOnly takes one virus to start an epidemic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoxAstrumis1",
            "body": "Let me guess: it has something to do with our regulatory oversight and strict hygiene laws?",
            "score": 149,
            "replies": [
                {
                    "author": "Altruistic-Buy8779",
                    "body": ">The typical egg farm in Canada has about 25,000 laying hens, whereas many farms in the U.S. have well over a million.\n\nSeems it has to do with decentralization of our farms.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DankRoughly",
                    "body": "Supply management",
                    "score": 61,
                    "replies": [
                        {
                            "author": "bigorangemachine",
                            "body": "More like Agri-Management.  You gotta make these supply decisions years ahead of time.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "canvanman69",
                                    "body": "You also need something the American's hate. Empathy.\n\nSmall farmers don't need to sell their farm to Monsanto and friends to stay afloat.\n\nWho'd have possibly thought putting corporate greed above everything else has negative consequences?\n\nFrankly, fhe Americans can suffer the consequences of their own piss poor planning. Fuck around, find out.",
                                    "score": 55,
                                    "replies": [
                                        {
                                            "author": "bigorangemachine",
                                            "body": "Well we do use Monsanto Products up here... but ya mixed farming has its benefits.\n\nWhen it comes to animals you need more antibiotics to keep a dense population healthy.  In general giving them antibiotics everyday isn't good for them either.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "canvanman69",
                                                    "body": "Leads to antibiotic resistance actually.\n\nSome interesting studies on how the vast majority of antibiotics are being misused in agriculture. As prophylaxis against losing profit with diminishing livestock yield. So instead of properly caring for your livestock, you pump 'em up with growth hormones and antibiotics.\n\nThat ends up increasing antibiotic resistance among bacteria, so you then dump their faeces in fields to increase crop yields too. Then, you re-introduce those plants covered in anti-biotic resistant bacteria into human communities only now the antibiotics don't work.\n\nWe really are dumb AF and just foolishly selfish in large groups.",
                                                    "score": 14,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "adonns2_0",
                    "body": "No as someone who’s in the industry they have a lot more larger farms a lot closer together.  When they get avian flu it hits hard.  When we get it it affects one small farm generally.  Their biosecurity is generally taken extremely seriously because they are such massive producers with shareholders to please.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Front-Block956",
            "body": "I know people who had to audit chicken farms in Ontario. They would describe the hoops they had to go through to enter the secure areas in an effort to avoid any disease getting into the secure areas. Then I watched the documentary on the US food system (I can’t remember the title) where the film discussed the lax policies and regulations (like a cattle farm down stream of a romaine lettuce farm where ecoli originated) and they talked about how easy it is for salmonella to end up on eggs from MASSIVE production facilities.\n\nMaybe the US needs to take a look at their policies and fix the problem there instead of trying to take eggs from elsewhere. Oh wait they can’t, DOGE is firing everyone!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pitiful-MobileGamer",
            "body": "One thing I didn't see noted in the article, is that supply management allows those farmers impacted by a round of flu; and having to cull. Temporarily sell their market share to another farmer who isn't experiencing a decrease. This allows them to continue income while working to even out any supply issues by keeping the flow of eggs constant.",
            "score": 34,
            "replies": [
                {
                    "author": "bluecar92",
                    "body": "It doesn't really work that way though. If a farm has to cull, they might only have 2 or 3 weeks downtime for the cull, cleaning/disinfection and then bringing in a new flock. That's not enough time to transfer quota to another farm to bring in more birds. You can't scale up and down that quickly.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Pitiful-MobileGamer",
                            "body": "I understand that eggs that are not sold fresh into Canadian supply, are used in other applications like non-human consumption, export processor, medical vaccine use. The supply is mainly controlling shell eggs, what we domestic purchase. \n\nWhat is easily transferred is the shell egg quota between suppliers, so that a farm hit by a cull still receives a percentage profit to be able to turn over a new flock. The receiving farm will divert lower profit usage to high profit shell eggs. \n\nThis is how we stabilize the supply.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bluecar92",
                                    "body": "But how much production is for non-human consumption? Is this transfer of egg quota something that actually happens in practice?\n\nI grew up in a farming family and worked on 3 or 4 different egg farms during my teenage years. Mind you this was 25-30 years ago at this point, so maybe my experience is out of date, but I had never heard of farming eggs that were not intended for human consumption. In my limited experience - the quota was the most expensive asset in establishing an egg farm, so your whole operation was sized to the amount of quota that you owned. There wasn't really any opportunity to scale up or down, certainly not on a short time frame. Again, only based on my limited experience in my small corner of Canada - maybe not representative of the industry as a whole.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "concentrated-amazing",
                    "body": "I'm quite certain it doesn't work this way.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JiminyStickit",
            "body": "Bigger is definitely not always better. \n\n\nA million-plus chickens on one place is pretty risky.",
            "score": 1,
            "replies": [
                {
                    "author": "Nadamir",
                    "body": "It is quite literally all your eggs in one basket.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "phishstik",
            "body": "As someone in dairy it's weird to see a Reddit post about supply management without seeing edgy people use the word cartel and explain how terrible we are. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "sevenofnineftw",
            "body": "American chickens: weak, sickly, unattractive \n\nCanadian chickens: based, healthy, feathers puffed, chads 🇨🇦🐓",
            "score": 1,
            "replies": [
                {
                    "author": "bbud613",
                    "body": "Also all Canadian chickens are hormone and antibiotic free!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Inevitable_Sweet_624",
            "body": "When a local farmer got a positive SE result on one of three flocks that meant the destruction of ~30,000 hens. Not 300,000, not 3,000,000 like you hear from the US. It is disruptive because you need 19 weeks to get pullets to sexual maturity to start laying eggs. So you have a barn out of commission for 5 months. The downtime allows for complete disinfection and even time to do some upgrades to meet the new cage standards coming up in a couple years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elevatedspiral",
            "body": "It seems like this is another product of  late stage capitalism. everything in America has become corporate. Even our eggs. We did not keep with the old adage. Don’t keep all your eggs in one basket.",
            "score": 33,
            "replies": [
                {
                    "author": "AlarmTurbulent2783",
                    "body": "Have you really had an issue with eggs? I haven’t had any problem finding eggs at normal prices. I feel like it must depend where you live.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Elevatedspiral",
                            "body": "What do you consider normal prices?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AlarmTurbulent2783",
                                    "body": "24 large organic free range eggs for 9.99$ from Costco. Whole Foods has a dozen for 3.99 currently as well. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Elevatedspiral",
                                            "body": "Where?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AlarmTurbulent2783",
                                                    "body": "Florida",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Elevatedspiral",
                                                            "body": "Which store?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AlarmTurbulent2783",
                                                                    "body": "Costco and whole foods? [**https://postimg.cc/MM5nvpD7**](https://postimg.cc/MM5nvpD7) trying to link some proof I guess.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Elevatedspiral",
                                                                            "body": "Thank you",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PopeSaintHilarius",
            "body": "The main reasons mentioned in the article:\n\n>Canadian chickens can catch avian flu, just like their American cousins. But the impact on Canada's egg supply has so far been limited.\n\n>Von Massow suggests a number of explanations for that. **It gets colder in Canada, so barns are more tightly sealed, which helps keep flu virus carried by wild birds out. Canada also has fewer free-range chickens, which are more susceptible to getting infected**.\n\n>But perhaps the biggest difference is that **egg farms in Canada are much smaller, so when one farm does suffer a flu outbreak, the effects are less far-reaching. The typical egg farm in Canada has about 25,000 laying hens, whereas many farms in the U.S. have well over a million**. In effect, American farmers have put a lot more of their eggs in a relatively small number of baskets.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AbnormMacdonald",
            "body": "Basically, they put all their eggs in one basket of deplorables.",
            "score": 1,
            "replies": [
                {
                    "author": "ManofManyTalentz",
                    "body": "I have but one upvote to give.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mouseeeeee",
            "body": "Short and sweet...we have safty rules for food the end",
            "score": 1,
            "replies": []
        },
        {
            "author": "Barbarella_39",
            "body": "I live in Abbotsford and have many friends in the bird farming business. They take avian flu very seriously. Many have had their barns culled and they lose a lot of income as their barns are empty for months before restocking. No one goes into those barns or onto those farms without a reason. Any dead birds are put in special bins at the end of the property and tested by government. Flocks are tested before going to market. Birds die very quickly from avian flu so our food source is very safe as they do not get to the processing plants. We have had outbreaks for decades so farmers are very knowledgeable about how to deal with it.  We are fortunate to live in a country where government and farmers are taking every precaution to protect us. Fyi there is no free range because avian flu is spread by wild birds so flocks are not outside. Save your money and buy regular chicken or eggs.  Get cracking!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Significant-Price-81",
            "body": "I guess they need us after all! TAKE THAT ORANGE FELON!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrarieCoastal",
            "body": "Crazy fact from the story. Average egg farm in Canada has 25K hens. In the US, the average size is 1M hens. When bird flu is found on a farm, the entire hen population is destroyed.",
            "score": 1,
            "replies": [
                {
                    "author": "Castiel_Engels",
                    "body": "American farms don't vaccinate their chickens against relevant diseases either. They just put the eggs through a chemical bath and call it a day.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lopsided-King",
                            "body": "I mean, a lot of them don't vaccinate their kids, lol . Why would they on chickens.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "PrarieCoastal",
                            "body": "Canada won't allow importing of vaccinated chicken. Go figure.\n\nhttps://inspection.canada.ca/en/animal-health/terrestrial-animals/imports/2023-09-27",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Castiel_Engels",
                                    "body": "\"evaluation with the United States Department of Agriculture\" I can see where the problem is",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PrarieCoastal",
                                            "body": "There a few countries that disallow it. Odd, but I'm sure there are reasons.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Medium-Drama5287",
            "body": "Cause we are eggcellent people and the USA is broken.",
            "score": 1,
            "replies": [
                {
                    "author": "cheletaybo",
                    "body": "Are you saying the USA is like ... Humpty Dumpty. Heh",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ApatheticGenXer",
            "body": "THANK YOU TO OUR FARMERS for keeping us alive! 🇨🇦🇨🇦🇨🇦",
            "score": 1,
            "replies": []
        },
        {
            "author": "RottenSalad",
            "body": "/offtopic Dear America, bacon in Canada is the same as in the US. What you call \"Canadian bacon\" we call \"back bacon\" and nobody eats it except perhaps on the odd pizza.",
            "score": 18,
            "replies": [
                {
                    "author": "Neutral-President",
                    "body": "What Americans call “Canadian bacon” is essentially ham.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Auntie_Megan",
                    "body": "Isn’t American bacon  just Streaky bacon in UK , and we eat back bacon like Canada.? Bacon sarnies, breakfast fry up, bacon butties are  all back bacon. Streaky bacon always  seems the cheaper alternative. I use pancetta rather than normal streaky bacon, amazing taste.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ry_cooder",
                    "body": "I have back bacon roast at least once each month!  Usually I drizzle maple syrup on it...",
                    "score": 5,
                    "replies": [
                        {
                            "author": "RottenSalad",
                            "body": "Sounds delicious. Though I'm still pretty certain you're the exception.  I'm not saying people don't eat it, but the way Americans carry on about \"Canadian bacon\" they think we eat it for breakfast instead of \"regular\" bacon.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Girlielee",
                    "body": "Ha! Yes…back bacon or peameal bacon. Came here to say the same thing. Not sure how many more times or in how many ways we need to communicate that WE (Canadians) did not name it “Canadian bacon”. The Americans did that. But then again, they do seem to like to rename things, so it tracks?🙃\n\nBacon is just bacon. And ew, back bacon is gross.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RottenSalad",
                            "body": "Maybe Trump will decide to rename it like he did with the Gulf of Mexico lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LionAndLittleGlass",
                    "body": "I was in a particular situation with a bunch of americans we were talking about 'international foods' and they brought up 'Canadian Bacon' and were arrogant about it being a Canady only thing. I had to laugh at them and say I barely know anyone that eats back bacon and NOBODY calls it Canadian Bacon here.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "narielthetrue",
            "body": ">Despite the trade war, the U.S. government has one potential solution to help meet demand and keep egg prices from climbing even higher: temporarily increasing egg imports.\n\nI can’t believe _that’s_ where the article ends. How about the fact that most of the countries they’ve reached out to have told them to _suck an egg_?",
            "score": 1,
            "replies": []
        },
        {
            "author": "stopitkeval",
            "body": "We have strategic egg reserves, it’s called strategic cuz nobody knows about it including you.",
            "score": 3,
            "replies": []
        },
        {
            "author": "00Jaypea00",
            "body": "I don’t eat our American eggs. I go to small farm producers and buy pastured eggs. I’ve been paying 5 dollars a dozen for them since I started buying them. I’m not sure why Americans get freaked out over the price of eggs. It’s still less than 50 cents an egg at 5 bucks.",
            "score": 1,
            "replies": [
                {
                    "author": "WippitGuud",
                    "body": "Wait til costs start hitting places like bakeries. \n\nHas anyone been looking at bread prices?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "00Jaypea00",
                            "body": "I haven’t noticed any price increases at all. Of course, I really don’t look at prices too much. I buy what’s good for me. I mainly shop in the outside aisles of the store and leave all the processed crap for others.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Intelligent_Lime_703",
            "body": "When you balance protocol with profit and farmers insurance, you have a sustainable model. I am very glad to see Canada has this model in place. Now, if we applied this logic to most commerce here, we would be much stronger economically than we appear to be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "qjxj",
            "body": "US invading to secure a supply of eggs on the guise of a national security issue would not be surprising at his point, but wouldn't cease to be funny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGreatStories",
            "body": "America's response to this will be further deregulation for disease and quality management. The eggs and milk must flow. Probably best to avoid American foods",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unusual-Ad4890",
            "body": "I bought Chickens and Ducks. Never going to experience a shortage and they're fun to watch.\n\nNot going to lie I've been enjoying watching America going on a begging tour of Europe. From Denmark, to Finland, now to Germany.  Maybe that'll teach them about burning their bridges. The funniest part is they're so transparent in how they view the pecking order of European standard of livings. First they asked the Nordics, now Germany. Next they'll probably ask the Low Countries. It's all pure desperation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aglaeasfather",
            "body": "TL;DR: US chicken houses have much higher flocks to reduce costs. \n\nOnce again, the US operates on a “privatize the profit, socialize the losses” model. Chicken/egg farmers did things that opened them up to high risk and now when it’s time to pay the piper they’re reaching to the government for help. \n\nAlso the majority of the “broiler belt” chicken states voted for Trump. Surprise surprise.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Enough-Art9905",
            "body": "We didn’t kill millions of chickens last year either",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tree-farmer2",
            "body": "My fridge is full of them. I wish I had some Americans to sell them to (at double the usual price, of course).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Outrageous_Cut_6179",
            "body": "Us become a 51st state?  What a low bar.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tekuzo",
            "body": "They hate us for our eggs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NEWaytheWIND",
            "body": "Who the heck is eating this many eggs?! Find a substitute until the culling ends, mes amis.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HumDinger02",
            "body": "Don't let Trump know!!!!\n\nHe'll come for your eggs!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "hdufort",
            "body": "We had an outbreak in Québec and the egg farm was sealed and a sanitary buffer was created around it. It was in the Lanaudière region.\n\nIndeed we have smaller farms, they're less concentrated geographically, there is less employee and animal mobility between farms, and inspections are systematic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "torontopeter",
            "body": "Gee, we could help out the US in this situation, couldn’t we? If only we had reliable, trustworthy trading partners in the USA, we could really resolve their egg problem. Hmm, if you were the US leadership, it would be good not to piss off your best friends, ally, and strongest trading partner, right?",
            "score": 1,
            "replies": [
                {
                    "author": "zoeykailyn",
                    "body": "Oops a slightly larger third of us voted for this shit, here's hoping they're one of the ones bigballz fired",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "2nd-wind",
            "body": "A",
            "score": 2,
            "replies": []
        },
        {
            "author": "Appropriate-Text-642",
            "body": "This is a timely reminder to the Maga Assholes that the elite and super wealthy can easily weather any of the “pain” the spoiled narcissists in the waffle house,  refer to, while you feel like your out in the cold. Get VERY used to that feeling. This is only a tiny taste of your country’s future when your only pal is putin, who will actually give not one fuck about you guys, but only the best deal. We will hurt, and then join with other like minded people and carry on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TellMeAgain56",
            "body": "I remember crossing the border from US into Canada when they were focusing on eggs coming in.  They had a dumpster there to dispose of the eggs that weren’t allowed in. The smell from that dumpster full of broken eggs sitting in the sun for days was nauseous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "emeraldamomo",
            "body": "Vaccination against avian flu has started in Europe I expect the US to follow soon.",
            "score": 1,
            "replies": [
                {
                    "author": "Mastatheorm-CG",
                    "body": "Hahaha I’m sure they’ll like that",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "wwwhistler",
            "body": "plus american chickens tend to be the same genetic chicken bred over and over...so what makes one of them sick....makes them all sick.\n\nCanadian chickens tend to be more diverse in their genetic variation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Full_Boysenberry_314",
            "body": "Supply management is better because it offloads the cost of risk management to consumers and disincentives investment in production efficiencies. Somehow health and security regulations depend on supply quotas for as of yet unexplained reasons.\n\nGot it.",
            "score": 1,
            "replies": [
                {
                    "author": "ExtraGlutens",
                    "body": "Don't forget you're also paying for cartel PR.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PocketTornado",
            "body": "We have about 5 dozen eggs in our fridge...sometimes we have egg fights. It's great.",
            "score": 1,
            "replies": []
        },
        {
            "author": "northern-fool",
            "body": "America killed 100 million chickens in the last 6 months because of bird flu outbreaks.\n\nWe did not.\n\nThat's why we have eggs, and they don't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "turtlefan32",
            "body": "And….unbelievably it is about to become more lax in USA",
            "score": 1,
            "replies": []
        },
        {
            "author": "mathboss",
            "body": "Our eggs have shot up in price, too, albeit not as high. Why is that?",
            "score": 1,
            "replies": [
                {
                    "author": "Embarrassed_Quit_450",
                    "body": "The same virus?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WiredFan",
            "body": "I know this is a bit pedantic, but why do they use a photo showing LOT OF EGGS to illustrate a shortage of eggs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "IcecubePlanet8691",
            "body": "So basically too many eggs in one basket 😉",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrameCareful1090",
            "body": "Are these all old stories? $3.49/dz here for cage free, no shortage and gas just dropped to $2.49/g - Not saying its paradise but its cheaper than 6 months ago - NH",
            "score": 1,
            "replies": []
        },
        {
            "author": "nothingoutthere3467",
            "body": "What I don’t understand is if you’re boycotting the US why are you on Reddit? US owned.",
            "score": 1,
            "replies": []
        },
        {
            "author": "This-Importance5698",
            "body": "Honestly as someone against supply management, I will fully admit there are some benefits to the program.\n\nMy biggest issue with it is that it directly increases costs to consumers. IMO having a reliable source of food is important for national security, and well worth paying for.\n\nThe problem with supply management is it forces that increase in payment directly to consumers. Last estimate I saw was $300-400 per household per year. The problem with this is that the extra costs hurts poorer Canadians more than richer ones. Someone making minimum wage is paying a much larger % of there income towards supply management than someone in the top 1%.\n\nIf supporting Canadian farmers is a national priority (and I believe it should be) it should be paid for with a progressive system where higher income earners pay more into it (like a progressive income tax).\n\nI’d like to see changes to the system that see more of the increased costs paid for by progressive tax dollars than direct costs, although I’ll admit I don’t know how to get there",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy-Wing-3092",
            "body": "Yeah but our eggs are the same price Americans are spending. It’s just that our prices have so high for so long that we accepted the price point long ago, whereas Americans are upset at their prices rising to our absurd levels.",
            "score": 1,
            "replies": [
                {
                    "author": "oxblood87",
                    "body": "You pay $12CAD/dozen? Because a dozen hit $9USD in New York and people were selling $1 singles.\n\nI'm getting an egg for ~$0.28 CAD and those aren't the cheapest in the fridge.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FrameCareful1090",
                            "body": "I have been buying them for the past 2 weeks, cage free $3.49dzUS - dozen of the free range, vacationing and treated like lady eggs organo. $4.99/dz - NH",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "oxblood87",
                                    "body": "And before that....\n\n\nLike I said, at its worst the price spiked to almost $12CAD/dozen. \n\nMy understanding is that's its been coming down all or March",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JohnDorian0506",
            "body": "How many eggs do you eat per day?\n\nBecause don’t eat more than 4-5 per week. I don’t think it would put a dent in my budget. \n\nAnd according to Reddit \n\nCostco in Maryland price 3/9/2025 18 ct $6.79 and 2 dz $8.99",
            "score": 1,
            "replies": []
        },
        {
            "author": "TKs51stgrenade",
            "body": "Uh… the eggs in our grocery stores are $7-$8 too. Don’t think we have it all that good.",
            "score": -17,
            "replies": [
                {
                    "author": "Vex1om",
                    "body": "> the eggs in our grocery stores\n\nAh, I see that you have identified the key difference.  It should also be mentioned that $7 CDN and $7 US are not the same price.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "SniffMyDiaperGoo",
                    "body": "where?? I'm getting for half that in GTA",
                    "score": 18,
                    "replies": [
                        {
                            "author": "TKs51stgrenade",
                            "body": "Vancouver",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fit_Marionberry_3878",
                    "body": "Our eggs are not cheap but now we see what happens when you mass produce to cut corners. You get regulation issues. ",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Pitiful-MobileGamer",
                            "body": "You also get to do massive culls, because a single case of flu wipes out your whole production.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Fit_Marionberry_3878",
                                    "body": "Yes the Americans try to cut costs to mass produce in large farms, and the net result is any single issue is wipe out territory. \n\nAlso, as someone said, we should be able to get 30 eggs for 10 in Ontario. \n\n At least our egg prices are consistent because we don’t have all our eggs in one basket as someone above us said. If Americans had any respect for our Canadian way, which they don’t, they would understand why their dairy is discouraged here.  They would wipe out our farms and leave us in trouble. ",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "drivingthelittles",
                    "body": "Eastern Ontario 30 eggs=$9.87\n\nI think we have it very good.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Illustrious-Fruit35",
                    "body": "Can get 30 eggs for 10$ in Ontario",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "FlyingOctopus53",
                    "body": "3.79 a dozen where I shop",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "cryptotope",
                    "body": "Sure, if you buy the organic omega-3 eggs from the 24-bour drugstore.\n\nA dozen generic store-brand large eggs is still $3.99 at Farm Boy, in the heart of high-cost-of-living Toronto.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "bigorangemachine",
                            "body": "ya in Toronto seeing same thing.\n\nI saw as high as 12$ for organic eggs.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TKs51stgrenade",
                            "body": "Those are for normal large eggs, not fancy organic. West coast prices.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cryptotope",
                                    "body": "The Real Canadian Superstore in Burnaby shows out of stock of the No Name large eggs, but they have a dozen medium eggs for $4.04 and[ a dozen extra large for $4.64](https://www.realcanadiansuperstore.ca/en/grade-a-extra-large-eggs/p/20812726001_EA?source=nspt).\n\n(And if we're comparing to the States, 4.64 CAD is only 3.25 USD.)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MrWonderfulPoop",
                    "body": "Compare that to the U.S. prices in converted dollars. I’ve seen posts at over US1$/egg",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Prospector4276",
                    "body": "Ummm, I don't know where you're buying your eggs but the Jumbo ones I bought on the weekend were $6.19 a dozen, not on sale.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "TKs51stgrenade",
                            "body": "You’re not on the west coast I take it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Prospector4276",
                                    "body": "And so many people say it's better to live on the west coast.  It seems like the east coast is winning some small battles.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bizzybaker2",
                    "body": "here in Manitoba at our local specialty food shop can get 30 XL eggs for 12.50, with a nice not-watery white and beautiful dark yolk. Criminal if you are paying 7-8.00",
                    "score": 3,
                    "replies": [
                        {
                            "author": "TKs51stgrenade",
                            "body": "Welcome to the west coast",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Joseph_of_the_North",
                    "body": "A dozen large eggs where I live in Ontario is around $3.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "PhiliDips",
                            "body": "Heck I live in the downtown Toronto core and I can get a dozen for $3.70 or something like that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ManofManyTalentz",
                    "body": "Not sure why you're getting downvoted but you might want to edit to let people know you're in Vancouver. Most other places I've been to nationally are nowhere near that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bigorangemachine",
                    "body": "For Organic or free range\n\nNormal bulk eggs is like 4$",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "UhHellooo",
                    "body": "I buy a carton of Conestoga free run omega-3 brown eggs (the best yolk btw) for $7.28 and those are my luxury breakfast eggs. \nI could also easily buy a carton of store brand or Grey Ridge for $3.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "TKs51stgrenade",
                            "body": "Not on the west coast",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "McBuck2",
                    "body": "If you want free range maybe but a standard dozen eggs you can find on sale for under $5. They’re $4.50 on sale a Shoppers for the next few days. You’re welcome!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "aagent86",
                    "body": "Large eggs around here are under $4/doz",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "S99B88",
                    "body": "Mende stop shopping at Ye Olde Fancy Egg Shoppe?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "granny_budinski",
                    "body": "I still buy eggs for under$4.00 a dozen in Ontario. Even cheaper when sales are on. Where are you shopping?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "yvrbasselectric",
                    "body": "Where are you buying? I can get $6 eggs from a local rancher and I can see his healthy flock (not caged, running around outside) Grocery store are even cheaper in BC",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}