{
    "title": "Carney, defence minister and military chief in Iqaluit for sovereignty announcement",
    "author": "Old_General_6741",
    "subreddit": "canada",
    "rank": 14,
    "score": 1601,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 405,
    "url": "https://www.ctvnews.ca/politics/article/carney-defence-minister-and-military-chief-in-iqaluit-for-sovereignty-announcement/",
    "id": "1je3ltc",
    "selftext": "",
    "comments": [
        {
            "author": "RideauRaccoon",
            "body": "At this point, I expect he'll finish in Iqaluit, fly back to Ottawa to formalize the plans for dealing with Trump, make some blunt announcements, and then call the election. I'd have preferred he call an election right away, but he's basically clearing the board of the Trudeau vibe and staking out a tougher position for the country, and then using that as a foundation to run on. I'd be upset except the government's ability to react during an election will be limited, so it's better to set some parameters now, so Trump (and the world) know what our positions are.\n\nPolitics aside, this is a good and responsible move by a new PM during an international crisis. But there's limited wiggle room before it starts to be election campaigning before the election's called, so he'd better be careful.",
            "score": 1,
            "replies": [
                {
                    "author": "bluecar92",
                    "body": "Isn't it widely speculated that the election will be called on Friday? I thought I saw an article a day or two ago saying that the election date will almost certainly fall on April 28 or May 5th. \n\nHe only became the PM last week. He'll likely call an election within 10 days of being sworn in. Seems reasonable to me.\n\nEdit to add the source article I was thinking of:\nhttps://www.cbc.ca/news/politics/mark-carney-charles-tupper-shortest-prime-minister-1.7484061\n\n> Given that Carney is expected to call an election before March 24 — the day Parliament is set to return — it's possible that he could have a shorter time in office than Tupper if the Liberals lose the next federal vote.\n\n> Sources speaking to CBC News have pegged April 28 and May 5 as two likely possible election days. That would mean Carney would have between 46 and 52 days as prime minister before the vote.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RideauRaccoon",
                            "body": "I've heard Friday or Wednesday (tomorrow) and even some that said the Liberals want to take Singh up on his offer to pass a support bill before the election. I think all are fairly plausible, but the trick for him is that he needs to be visibly spending these days doing something that feels overtly Prime Ministerial, as opposed to \"Leader of the Liberals\"-ial. As soon as he tips into something resembling campaigning with one of these appearances, that sense of reasonableness will burn off quick with the changeable voters. Conservatives will complain regardless, but the squishy middle will look at a trip to the UK, or France, or Iqaluit as important moves to guard our sovereignty, and give him a pass. But the longer he pushes it, the greater the chance he slips up and gives the whole thing a less-noble hue.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Limos42",
                                    "body": "As a joe-schmoe voter, I'm applauding his immediate visits to foreign leaders, and reaffirming relations before the distractions of the election hit all of us. \n\nWe're in crisis mode and we need our PM to have strong ties to those nations while we deal with Trump in the midst of the election.\n\nEdit:  As was pointed out on a CNN clip I saw earlier this morning, it's also very poignant that Carney's first visit was to Europe, rather than America, as is tradition.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Sufficient_Rub_2014",
                                            "body": "I’d prefer he was elected.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "addstar1",
                                                    "body": "We don't elect Prime Ministers.  \nWe elected our local representatives, and the Liberals chose to change their party leader to Carney. And the party did have a vote for that specifically.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sufficient_Rub_2014",
                                                            "body": "Oh dang. I guess we don’t need an election then. /s\n\nI know how it works homedog. I voted liberal the last three times to help Trudeau get elected. You are being disingenuous or ignorant.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "addstar1",
                                                                    "body": "Our need for an election is not related to whether or not Carney \"was elected\"\n\nIf you know how it works, don't post ignorant statements.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sufficient_Rub_2014",
                                                                            "body": "Our need for an election is 100% related to that. I’m a liberal and will most likely vote for Carney. \n\nIf this was a conservative in power and we didn’t choose him I’d say the same thing. To say we don’t vote for PM is moronic. We vote for the person whose seat adds to the total in hopes to elect the leader we want.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "addstar1",
                                                                                    "body": "We've needed the election since December when the NDP said they wouldn't support the government anymore. It's not related to the liberal leadership. \n\nTo say we vote for a PM is moronic. We vote for a local representative, who's seat adds to the total for that party. And then maybe that party leader becomes PM. \n\nI'm not voting NDP to have Singh as PM, I'm doing it for party representation in the federal government. Imagine telling all the bloc voters that the election is to vote for a PM lol.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Sufficient_Rub_2014",
                                                                                            "body": "You don’t think the NDP’s decision in December had anything to do with liberal leadership? I’m not sure I can take you seriously. \n\nBloc voters never vote for PM. You should learn about that party. Interesting stuff.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "FutureUofTDropout-_-",
                                    "body": "I’d be very surprised if there isn’t an election call by Friday.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AzurraKeeper",
                                    "body": "Ya, I mean something as simple as his responses at the questions yesterday could be detrimental. For the small sample size I have, only the die hard Libs think he answered well while undecided voters think he looks like he's hiding something and those questions weren't even the hardest he will be getting.\nBe an interesting election for sure",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RideauRaccoon",
                                            "body": "I think Liberals excited about the polls flipping should be happy, but also prepared for a precipitous fall. I don't think Poilievre was popular because people liked him, they just didn't like Trudeau. Now we have this platonic ideal of a man named Carney, and people are relieved that he's not Trudeau, but also not Poilievre. The more he talks, the more that aura fades away, and the more likely it will be that people will just vote for the candidate who speaks to their immediate needs -- and it could go either way. \n\nThe more Carney can avoid feeding the doubt machine, the better off he'll be. Unfortunately, the doubt machine is otherwise known as \"interacting with the public\", so he's gonna have to take the plunge or face a whole other set of consequences.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "hacktheself",
                            "body": "…if.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Longjumping_Crab_345",
                    "body": "Also, my understanding is that there isn't much international travel during a campaign. Carney needed to go shore up Canadian support in Europe ASAP. Makes sense he'd do that first.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GuyLookingForPorn",
                    "body": "It's also a smart move politics wise, as foreign visits and dealing with major world leaders instantly makes someone seem more Prime Ministerial.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BubbaMcGuff",
                            "body": "Can you imagine PP meeting with European leaders and the king etc? Like it or not Carney carries himself with an air of dignity and is received accordingly. Just can’t see PP measuring up.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "vodka7tall",
                                    "body": "The King has met with bigger chuds than PP. Don't forget, Boris Johnson was the PM of UK for three whole years.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "a_f_s-29",
                                            "body": "And three long, dark years they were",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Once_a_TQ",
                            "body": "And all the photo ops and sound bites that will be used in the election campaign now. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Baeshun",
                    "body": "I mean, this is all stuff I’d want any incumbent tackling immediately.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RideauRaccoon",
                            "body": "Oh, 100%. It's just that he will be dogged by the whole \"he wasn't elected\" thing until he actually does get elected, and regardless of whether or not it actually matters, the longer he pushes the election, the greater the chance that that \"stain\" starts to eat away at his popularity. He seems to be triaging the roles of the PM right now, and doing the urgent things first, so he can get away with it. But as soon as he starts tending to sniffles instead of heart attacks, he'll be accused of rigging the game, and he'll start to lose ground to Poilievre.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Cycle5101",
                    "body": "Exactly they are strategically treading water right now and doing a pretty good job of it. Poilievre barely keeping his head above water and just hoping carney and the liberals make a mistake so he can pounce. This is a big game of cat and mouse. Right now.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "skywatcher8691",
                            "body": "I see your point with the whole cat and mouse comparison given how strong of a lead the CPC was in only months ago, however PP and the CPC have been a lazy cat as of late and they’re offering little in the way of concrete ideas or leadership during these recent months while Carney is coming into this role with some grit and a clear plan. \n\nI won’t buy into the idea of a liberal party win until this election is over, but the CPC is going to have to step up their action on unifying Canada against the threat of the US instead of just attacking the liberals if you ask me",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JediRaptor2018",
                    "body": "The more Carney is working to address the Trump issue, the better he looks in front of voters. He is using his position as PM as much as possible to get ahead of his opponents (who can't really do international visits like Carney can do as the current PM).  Trump is probably the biggest issue facing Canadians these days (leaving behind housing and immigration for the time being), and Carney is really trying to get ahead there.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RideauRaccoon",
                            "body": "Agreed. It's the unfortunate bonus of being PM in a situation like this. Now, if he makes a stop in Vancouver and talks about housing, or flies to the GTA and discusses immigration, that would be a terrible mistake or him this week. That's not foreign affairs, that's electioneering, pure and simple. So hopefully his team knows not to fall for that trap, because otherwise he'll burn off all the goodwill he's earned over the last few days.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Elean0rZ",
                                    "body": "I agree with most of what you're saying in this thread but this feels a little too black and white. Cutting the consumer carbon tax wasn't \"foreign affairs\" and was arguably pure electioneering, but it didn't burn off goodwill. I absolutely agree that his main goal for this ~week is to come off as \"Prime Ministerial\" and be seen to be doing things, but I think those things can involve subjects other than foreign affairs if they're decisive, broadly appealing actions that distance him from Trudeau and draw a line in the sand vs. the Cons.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RideauRaccoon",
                                            "body": "That's a good point, I totally blanked on the carbon tax (when do we stop living in the period where every day feels like a year?). He has some latitude with important bipartisan subjects like that, and I hope he takes as many of those chances as he can fit in, but I do worry that the LPC sense of what is \"common sense, everybody likes this\" policy vs \"Liberal policy\" is a little wonky, and he's going to end up doing something overtly partisan by mistake and ruin the whole effect.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "angrybastards",
                                                    "body": "Like banning more guns and pushing the buyback?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "jaymickef",
                                                            "body": "Will many gun owners ever vote Liberal?",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "RideauRaccoon",
                                                            "body": "See, if he actually makes an announcement about guns at all this week -- even if it's to back down from that issue entirely -- I think the honeymoon will have come to an abrupt end, and he'll suffer for it. This week should be about sovereignty and national defence, and everything else can wait for later. I'm just not sure his handlers will let him get through a week without crossing that line...",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Elean0rZ",
                                                    "body": "Historically speaking Trudeau is the aberration among LPC leaders for being substantially left of center, and Carney seems to be more in the blue Lib/red Tory vein. I think the odds of an average Carney policy being overtly partisan are much lower right off the hop, plus he has enough low-hanging fruit to work with that I imagine he can make it through a week without getting his proverbial dick caught in the proverbial ceiling fan. If he can't he probably shouldn't be PM anyway.\n\nTo me the bigger uncertainty and risk with Carney is how they manage the fact that he's (as far as I can tell) not a great *politician*. He's wildly competent and has strong opinions, based on that competence, about what needs to be done. He's at his most compelling when they let him cook, but on the other hand he's also likely to make some gaffes or get prickly in doing so. He's a doer, not a talker, he's used to operating in certain echelons, and he doesn't suffer fools. That's a fine line to walk--will his gaffes and snippy responses be compelling and endearing and contribute to his aura, in the vein of Chretien, or will they do the opposite and leave him open to being decimated by the Con attack machine, in the vein of Ignatieff?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "RideauRaccoon",
                                                            "body": "Of all the politicians I have ever seen in my life (and agreed, Carney is not really a politician) he is the first, except for maybe Obama, that I would love to have a sit-down with and just dig into complex subjects for hours. I bet he has thoughts and insights into *everything*, and that would be amazing to hear, even if I disagree.\n\nBut for now, he's just gotta protect his centrist position, put some distance between himself and Trudeau, and not make any more mistakes that fit into the CPC's scandal machine. I mean, once the election is called, the likelihood of gaffes goes up exponentially, but for this next week, he has the chance to make a mark as a PM that people will remember when it comes time to mark their ballots. It'll be interesting to see if his novice-politician instincts can get him through unscathed.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "hippysol3",
                                                            "body": "Astute reasoning you've made. Up til now he's been playing to his strengths. He DOES have international experience, he does indeed look like Prime Ministerial material and if he doesn't speak too long, he definitely appears far more reasoned and less 'showy' than Trudeau ever did. \nBut after the election is called, his work is going to get much more difficult. \n\nNow he enters Poilievre's ring. And if there is one thing Poilivere is good at doing its getting under someone's skin. Trudeau mostly avoided that by simply reiterating his last statement three times in the House without actually answering a question. Im not sure Carney's sensibilities will allow him to do that and as much as his team is going to be silently biting their knuckles and chanting \"Dont take the bait!\" in their heads, I think Carney gaffes are inevitable, especially during a debate. \n\nIt remains to be seen how much that will mean to voters, but it will definitely play a role in Canadian's decision to lead a country...especially when we know the person who is most likely to really rankle is the President.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "hippysol3",
                                                    "body": "I dont think the Liberals have actually changed their mind on the carbon tax. Carney signed a document saying the rate should go to zero, but the tax is still on the books. And for that matter, its still on the LPC website: https://liberal.ca/climate/ so its not like they actually did anything other than make a election play by appearing to do something about an unpopular policy.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "RideauRaccoon",
                                                            "body": "Honestly, I think that tax is gone for good, and only still exists because they can't officially remove it without Parliament. As others have said, it was just too toxic to keep around -- if they had, they'd have been fighting that same battle for the rest of time, which was a weird liability since it actually cost so much money in rebates, and so getting no political win out of it was a strong reason to nix it.\n\nThat said, I don't think the essence of the tax is gone. Carney in particular is really big on that kind of thing, so they'll change the name or the delivery method, but it will come back again. They probably just don't know *how* yet. Not in a conspiracy theory sorta way, just a regrouping of sorts. \n\nBut as for that specific carbon tax, I think it's actually dead, just not buried yet. The tax is dead, long live the tax.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "hippysol3",
                                                                    "body": "Exactly. Carney has built his entire career on carbon taxes and promoting them, he's not going to abandon the idea now. The tax is dead, long live the tax indeed.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BoysenberryAncient54",
                    "body": "I believe he's supposed to call the election on Friday. Parliament resumes on the 24th and we all know the first thing pp will do is trigger a vote of non-confidence, so Friday is the longest he can wait.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dontygrimm",
                    "body": "First time I've read someone make sense as to why he didn't call anyone election first. Most times when I questioned that I get down voted and told I'm a. Idiot",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Maleficent-Might-275",
                    "body": "I thought he couldn’t call the election right away because it would have fallen on easter",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RideauRaccoon",
                            "body": "The minimum is 36 days and the maximum is 50, but it has to be on a Monday, so if he called it today, it would be May 5 at the latest. At this point, May 5 seems like the most likely date regardless of when he calls it (unless he really pushes it back).",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Nearby_Translator_55",
                                    "body": "Bad look to have an election on Mayday, no?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RideauRaccoon",
                                            "body": "Depends how they frame the election, I suppose, but yeah, that could be dangerous for an elite global banker :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "justanaccountname12",
                            "body": "It could be held on the Tuesday following Easter.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mizz_Dressup",
                                    "body": "Is there a legal provision for holding it on Tuesday when the Monday is a federally recognized stat holiday?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "justanaccountname12",
                                            "body": "Yes.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Mizz_Dressup",
                                                    "body": "Cool, love a random and niche legal provision.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PlatformVarious8941",
                    "body": "A sensible move would be to get a throne discourse through, an unanimous motion Re the current situation and retaliation and then an election.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RobertGA23",
                    "body": "I'm ok with him taking a week or so. It's nice to get a bit of a glimpse into how he plans to govern.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "eatyourzbeans",
                    "body": "He's not clearing Trudeaus vibes,  he wiping PP policy platform before PP can really even announce it publicly.. I expect something relating to housing and possibly immigration this week before he announces  the call to election...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BigButtBeads",
                            "body": "You expect Carney to announce a stance on immigration before the election?\n\n\nHis immigration policies are super unpopular ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "eatyourzbeans",
                                    "body": "I doubt it , housing most likely. Immigration is to politically emotional and it's already in wide agreeance that we need alot .. I Expect him to follow PP and to avoid the topic of numbers , both will tweek student visa and smaller policies involved but neither will want to commit on over all numbers ..",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BigButtBeads",
                                            "body": ">and it's already in wide agreeance that we need alot\n\n\nAbacus poll suggests the large majority of canadians oppose it\n\n\nThe only ones in agreeance are landlords, Tim Hortons, and Blackrocks century initiative \n\n\nIt suppresses our wages and drives rent and housing meteoric",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "eatyourzbeans",
                                                    "body": "A large majority of Canadians have no idea how economics work or have any clue what are projected population growth rate is or how that translate into their quality of life over the long term ..\n\nIts not a surprising number , but it doesn't mean a thing because immigration is the og gaslighted political tool . It takes a much larger share of the blame for our negatives.. \n\nImmigration numbers will remain it doesn't much matter how you vote , even if a candidate lowers the qouta it's temporary, and after a surge , the numbers will get jacked right back up.. There's a whole lot of factors of reasoning for this ..",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "hairyballscratcher",
                                                            "body": "And mass immigration helps our economy? Seems to have proven the exact opposite.\n\nWe had roughly 250k a year for around 15 years until Trudeau took over and things were fine before that. And, we nearly were all in support of immigration at that point.\n\nI think *you* don’t understand the economics of mass immigration if you are defending it as a necessity. \n\nIf you flood your country with people, without time for it to adjust, you overburden every social system (housing, healthcare, education) and quite literally suppress wages as is what happened after Covid. Our gdp per capita is almost the same as it was ten years ago with everything being more expensive, with immigration being the leading cause.\n\nIt’s not the *Only* factor for sure, but it has become the largest factor undoubtedly, and denying that as you are is the quintessential gaslighting we’ve come to experience for nearly ten years now of mass immigration.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "eatyourzbeans",
                                                                    "body": "The actions of every political party at every level of government go against what you say , infact you can argue that the numbers pre Trudeau ultimately is what lead us to experience more pain then what otherwise would of been nessicary had our previous projections and Policy's had been more correct for our needs .. \n\nThere's tons of factors at play, including the fact that in 20 years, we might not even be able to attract anywhere near the amount of immigration we can today .. \n\nYou don't want to hear it though , you want to just keep beating your head against the negatives with out touching the positives because you want more for less today.. Your not speaking for Canada's future your speaking for your own position.. Which is actually fine if you acknowledge the whole conversation to be had and not just yours..",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "_Not_Jesus_",
                    "body": "Like a new dead-bolt installed by a good locksmith: it turns so elegantly, you almost forget that no one could ever break into your home---which is kind-of the point.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CrashedTaco",
                    "body": "If he would’ve called an election right away there would’ve been a good chance the UCPs have been elected due to the hatred of Trudeau liberal party \nLike you said he’s cleaning up the name and setting up a new foundation/expectations on which his party will ride on \nPretty darn good move especially as all he has to do is sit back at this point and let PP burn himself to the ground \nAnd also like you said, there’s too many pressing issues going on to be focusing on an election",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IamGimli_",
                            "body": "WTF is the UCP? There is no such federal political party.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CrashedTaco",
                                    "body": "The Conservative Party, my bad",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DarkhorseCanada",
                    "body": "I agree. He’s making the right move given the situation and context. He’s already proving he’s the better leader in dealing with Trump. PP is an attack dog and will just make things worse and lead us into a situation where the US can easily annex us. \n\nThis election is a matter of Canadian sovereignty. We need to elect a PM that can and will fight for us. We don’t need someone already openly trying to weaken our sovereignty by attacking the CBC, or making fiscally irresponsible moves like removing the industrial carbon tax that will lead to EU tariffs. PP’s plan has literal, set in stone consequences and negative effects and he’s just hoping catch phrases are enough to get voters to not do research or practice second order thinking.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Agitated-Donkey1265",
                            "body": "The term is “thought terminating cliches”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PragmaticBodhisattva",
                    "body": "I’m sort of sick of “optics” being prioritized over what actually needs to be done, so I’m really happy with what he’s been doing. They are all assertive moves, and I’m here for it. Screw what is ‘expected,’ sometimes people need to do what the *best* move is, even if it risks ‘decorum.’",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Chucknastical",
                    "body": "The other issue is we're coming up on end of fiscal and will be in election when the governments budget rolls over.\n\nThere's a lot of shit that needs to get done and signed before he calls an election so there's no disruption to services for Canadians. \n\nWe're facing hard enough challenges as it is with tariffs coming April 2. Why add fucking up EI and health care transfers until the election is over.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Friendly-Flower-4753",
                    "body": "IMO, Carney is laying the ground work for his campaign. As one contributor put it...nothing says \"I got your back Canadians\" like reducing government salaries(on day one), immediately convening with friends in high EU places, someone other than Macron slapping Trump telling him to grow up and act like a man for a change.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Memory_Less",
                    "body": "Well said, and the extra couple of weeks allows time for Liberals to finalize their election planning.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "apothekary",
                    "body": "He's literally doing the work that needs to be done right now, \"confidence of the house or not\". Winning, doing nothing and going straight to campaign/caretaker mode for the government in this time is not great. Set the stage first.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Haiku-On-My-Tatas",
                    "body": "I think he's making the right moves both politically and for the stability of the country. \n\nOnce the writ is dropped, he becomes a caretaker PM primarily focused on campaigning. For that reason, I expect the election period to be close to the minimum 36 days allowed by law. \n\nHe hit the ground running on day one making sure he's got important pieces in place ahead of the writ drop so things can function smoothly during the election period. \n\nMan's smart AF and it's so refreshing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Appa221",
                    "body": "Very great foundation, it's like the first week in and there's more money sent to ukraine lol. People gotta remember liberal party is still the liberal party, person representing doesn't change anything",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Low-HangingFruit",
                    "body": "Oh no, he is 100% making a world tour of a pre election campaign using taxpayer money right now.\n\nHe will keep doing this until the day before parliament reconvene then call an election.\n\nEdit: You can downvote this all you want but it's obviously true.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RideauRaccoon",
                            "body": "It's definitely *also* a pre-election campaign tour, but I think it's also important to signal to the world  (and to Trump) that Canada is not leaderless after Trudeau, and that we have interests that we are exploring and defending, so that there's no misapprehension about a power vacuum here. \n\nI'm 50/50 on the \"wait until Parliament resumes\" theory myself. Calling the election sooner helps bolster his \"get shit done\" credentials (which these trips are part of) -- even if it's just 2 or 3 days early -- but waiting until Parliament resumes means he might be able to get the NPD, Bloc and Greens to support a symbolic resolution to take a hard stance against Trump and pledge to help Canadians. That would force the CPC to either support it or appear disloyal, which would be an *excellent* way to head into an election.\n\nBut if he does delay until then, he's going to have to have a jam-packed schedule of counter-Trump events, or the stench of pre-election electioneering will overpower whatever he's saying. I'm not convinced he can maintain this energy that long without making a mistake, but I guess we'll see.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SeriesMindless",
                            "body": "You act like he came back from Europe empty handed.  Its not like he is not making good changes.  \n\nDropped carbon tax, strengthened military alliances, scored an ex-US intel agreement, likely spending on deference in the artic here.   \n\nWhat of this is bad?\n\nWhat if he is genuinely good for the role?\n\nOr do you simply vote along party colour?  What would be enough for you if good policy is not enough? Why do we actually vote for if not the pursuit of good leadership?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SenseMother3191",
                            "body": "Everything the government does uses taxpayer money. Your argument is nonsensical. Explain to me why PP using taxpayer money to trash his own country on TV (while never even trying to get a security clearance) is good, but Carney using taxpayer money to build new relationships with other countries and stand up for our country is bad. I suspect you can't do it without being disingenuous. PP will fold to the Americans and will not stand up for our country.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DogeDoRight",
                            "body": "Is he campaigning on the taxpayers dime just like every PM before him? Yes. Were these visits to our allies necessary right now? Also yes.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "S99B88",
                            "body": "So visiting the country speaking out in our defence, plus, going to meet with our King, is some sort of publicity stunt to you? Whatever dude, you got some real Pollievre style negativity going there, makes people kinda think the opposite you know?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Lower_Cantaloupe1970",
                            "body": "I'd be more pissed if we weren't in a crisis. Canada can't take a month off right now and these things need to be done. The other option would have been to have Trudeau stay on longer which I don't think anybody wants.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Ratsyinc",
                            "body": "So pompous, maybe you're simply getting downvote because It's not obviously true..  since when does visiting 2 countries and Nunavut equate a 'world tour' ? \n\nThis isn't flagrant spending of taxpayer money and while it may help his image heading into an election, the goal of strengthening ties to our former colonial powers alongside a focus of reaffirming artcic security, both strike me as intelligent strategies in preparing for Trump and the chaos he is throwing into the world.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "someuserzzz",
                            "body": "And nothing another party leader wouldn't also do - these are politicians we are talking about!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MrAkbarShabazz",
                            "body": "Another play from the Ford Nation playbook. Given it’s success in Ontario not a bad idea…",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "KeyFeature7260",
                                    "body": "Let’s just hope he doesn’t start looking at Danielle Smiths playbook and wait to call an election for 7 months like she did after she took over from Kenney. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Haiku-On-My-Tatas",
                            "body": "Are you of the opinion that he should just not do his job in the interim? \n\nHe's the PM now. He's doing PM stuff. And given the instability we are facing from our neighbour, it's pretty important stuff that can't be put off.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Low-HangingFruit",
                                    "body": "He's still prorogueing government and governing by OIC just like his predecessor. If he wants shit done bring back the MPs.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Haiku-On-My-Tatas",
                                            "body": "Parliament literally resumes on Monday...",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "V-Pudddin",
                            "body": "Username checks out",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Plucky_DuckYa",
                            "body": "This is it exactly. We’re basically in the campaign now, but Carney is taking full advantage of the opportunity to use the public’s dime to get as much free media and attention as possible before he formally drops the writ. It’s sleazy, but that’s Liberals for you.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ratsyinc",
                                    "body": "A 3 day trip to 2 countries with specific security and relational goals in mind amidst Trump's chaos.. some of ya'll just hate the libs so much you can't even see reality at this point.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Spotthedot99",
                                    "body": "Don't pretend that a Conservative leader wouldn't be doing the exact thing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "S99B88",
                                            "body": "How much of CPC/Pollievre’s budget as official opposition, paid for by Canadian taxpayers, went towards all his annoying, negative ad bombing the past couple of years?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "snowboarder_ont",
                                    "body": "\"That's liberals for you\" rofl show your bias more, Doug ford just did the exact same thing, it's politics. And the inability for the general public to find the nuance in anything anymore, or be able to accept that other's views, and their own, should be able to change with time and new information. Instead we get stuck with partisan bullshit like \"that's liberals/conservatives for you\". Like Jesus fuck progress as a country will not be effective until both of these sides learn to be adults and fucking grow up and work together for the betterment of all of us, until then fuck that crap and anyone that spouts divisive bullshit. Every party has issues, but that doesn't mean we need to be attacking the people or the party to try to make our side look better. Our ability to work together across party lines and get shit done to make the country better is what should matter. Grow up.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "S99B88",
                                            "body": "He also had a purpose to go there. Meeting with the King was important, at this moment in time more than ever. And seeing the French leader too for support plus trade issues right now was also imperative IMO",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "juiceAll3n",
                                    "body": "Let's not pretend the cons would've done it differently. Both sides are greasy. That's politics.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ABeardedPartridge",
                                    "body": "To call it sleazy is straight up wrong. It IS important to signal to the rest of the world (specifically Donald Trump) that we aren't operating without a Prime Minister especially when Trump has alluded to the fact that we don't. \n\nAlso, Kim Campbell waited 4 months to call an election when she took over for Mulroney. If anything the LPC is approaching the situation with a lot less sleeze than the CPC has demonstrably shown when they were in the same situation. Which, for the record, wasn't sleezy at all in my opinion.\n\nIf your only political position is that you hate the LPC no matter what, your opinion isn't worth listening to because you're too set in your opinion to allow it to change.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "DogeDoRight",
                                    "body": "Conservative PMs have done the same thing. Try not being so blinded by partisanship.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "asoupconofsoup",
            "body": "I'm very impressed by the strategic visits he chose, visibly touching base to the three corners of Canada's foundation - the Indigenous, French and British people. It's meaningful historically and for our future priorities. I think we often have underestimated how important the North and Inuit people are to the rest of Canada, but not anymore.",
            "score": 1,
            "replies": [
                {
                    "author": "hippysol3",
                    "body": "They were cool. But they aren't much more than photo ops. Image is important in the very short term, but in the land of elections, past records carry much more weight than handshake photos.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NarutoRunner",
                            "body": "He signed an intel sharing agreement with France which is super important.\n\nFrench intel is one of the best of Earth.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "asoupconofsoup",
                            "body": "Well on that front Carney has had a much more important role to play internationally and in Canada influencing economic policy that the con leader who's been kind of a back bencher. Has he even sponsored any bills in last 20 years? Has he actually been outside Canada?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GenericLurker1337",
                    "body": "> the Indigenous, French and British people\n\nCouldn't care less about any of these groups. What about your average working Canadians in the rest of the country?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "asoupconofsoup",
                            "body": "So you seem more interested in domestic policy than the big picture, international, am I right? Are you at all concerned about the tariffs and trump's threats to invade Canada? Or no big deal, don't think it affects you?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "asoupconofsoup",
                            "body": "By outreach to POC do you mean Indigenous folks? He is meeting with Inuit today so...? Or do you mean the broad varied base of Canadians whose ancestry is from other nations across the world? I'm a white settler myself and have no love for what France and England did here to Indigenous Nations. \n\n\nIn the present day, I think we are all at risk for much, much worse outcomes, white and POC alike if the US White Nationalist regime comes to have more power over Canada.\n\n\nAlso, have you read his policy stance on climate? Do you know he was the UN Climate Envoy?\n\n\nhttps://thenarwhal.ca/mark-carney-tariffs-oil/\n\n\nhttps://www.un.org/en/climatechange/mark-carney-investing-net-zero-climate-solutions-creates-value-and-rewards",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "PenonX",
                            "body": "Carney, a climate change denier? That’s hilarious. The guy has been one of the most staunch advocates of climate change and reaching net-zero. He quite literally pretty much never shut up about it, and wrote a whole ass book on reaching net-zero. Ffs he even worked at the UN specifically as a Special Envoy for Climate and Finance.\n\nHis net-zero stance and advocacy are one of the things the Cons have been trying to use against him to win the industrial conservative votes. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ThatAstronautGuy",
                            "body": "How are you saying he hasn't reached out to people of colour under the post about him being in the North with Intuit communities? \n\nHe's also a massive supporter of all kinds of climate issues, and has put a significant amount of time and energy into net Zero initiatives.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Alextryingforgrate",
            "body": "Wasn't he in London like this morning as well?",
            "score": 81,
            "replies": [
                {
                    "author": "GhoastTypist",
                    "body": "Thought his European visit was yesterday and today he could very well be back in Canada. Its not like he's waiting on commercial departure times.\n\nLots of travel but given whats going on with Canada at the moment, at least he's putting his boots on the ground as the saying goes.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GuyLookingForPorn",
                            "body": "Still when is the dude finding time to eat and sleep? He met with Starmer, the King, Macron, and is now in Iqaluit, all in like a 30 hour time period.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "kroqus",
                                    "body": "Plus he was at the st Patrick's parade and met the QC premier before his flight to France. ",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "tonkaty",
                                    "body": "He was working on the private equity time table for the last few years, this is a just another day in the office for him.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ThunderChaser",
                                            "body": "Yeah, there's no doubt the man is used to sleepless nights, that's just the reality at that level.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Nervousosity",
                                                    "body": "I know people at Goldman sachs, they may be rich but they unironically work 100 hour weeks. \n\nFunnily enough, Macron also comes from an Investment Banking background. I’m sure Carney and  him had some dialogue even before they both entered politics",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GraveDiggingCynic",
                                            "body": "Churchill got through most of his time in WWII on what amounted to power naps. I can't believe it's good for you in the long run, but it can be done.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "NaarNoordenMan",
                                                    "body": "Nothing Churchill did was good for his health. However, he was effective.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "mazdaman007",
                                                            "body": "And yet he lived until 90 !",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Impeesa_",
                                                    "body": "I once heard from a professional sleep expert that about the lowest you can cut it somewhat sustainably is two two-hour naps a day, spaced evenly apart. Get one full sleep cycle each time, basically, and you'll be tired but functional.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Alextryingforgrate",
                                    "body": "I'm luck to get my laundry washed and folded in 30 hours.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "hkric41six",
                                    "body": "Because he is an actual executive. An actual boss.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ai9909",
                                    "body": "Power-nap on planes, trains and automobiles.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "lord_heskey",
                                    "body": "> Still when is the dude finding time to eat and sleep\n\ni mean 6-8hr flights. im sure the seats are better than us plebs in westjet's super economy",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Jimlobster",
                                    "body": "Carney is an android confirmed",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Haiku-On-My-Tatas",
                                    "body": "Slept on the plane, probably.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Komodo0",
                                    "body": "I guess on the plane",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Own_Development2935",
                                    "body": "Sleep on the plane.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "alfredaberdeen",
                                    "body": "Lol please ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "firmretention",
                                            "body": "Superman Mark Carney performs inhuman feats! Move aside, single mom working three jobs to support her kids. Mark Carney flew on HOW MANY private jets in one day while having his food catered?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Alextryingforgrate",
                                                    "body": "The man is running a country not a house.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "T-Wrox",
                                                            "body": "It still made me snicker. :D",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SheIsABadMamaJama",
                            "body": "Though some commentators like to argue he should be flying commercial because he is “wasting tax dollars, not my PM”",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mizz_Dressup",
                                    "body": "God, the penny wise pound foolishness of the Canadian electorate is the fucking WORST. \n\nAnd hey, like all Canadians, I’m secretly proud of what petty bitches we are underneath our good manners, but it’s downright embarrassing the 24 Sussex had to be condemned because of shit like this.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GhoastTypist",
                                    "body": "Its not wrong to want a fiscally responsible government.\n\nThough I'm of the mindset Carney should be doing as much travel as possible with our future potential trade partners and NATO allies as possible while we're navigating a very tense time.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "WarOnHugs",
                                            "body": "Sure but air travel is a ridiculous issue to zero in on. It makes sense that the head of a G7 country wouldn't fly commercial.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "readersanon",
                                                    "body": "Especially if they're using the flight time to work. Can't discuss confidential/national security things on a commercial flight. If they were just sleeping the whole time, sure. But they're probably doing briefings and such.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "T-Wrox",
                                            "body": "I think this is the bigger fish to fry right now - we \\*need\\* to separate our trade from the USA.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "vodka7tall",
                                    "body": "I'm sure there are zero security concerns for the leader of a G7 nation to fly commercially. I bet he gets that sweet TSA pre-check clearance so he can keep his shoes on at security too.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "byteuser",
                            "body": "All that traveling sure is leaving a big carbon footprint behind",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Limos42",
                                    "body": "Abso-fucking-lutely worth it.  This is geopolitics, not vacation trips. \n\nGo find something else to virtue signal about.  This definitely ain't it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "elziion",
                    "body": "Yeah, and this is the reason [why](https://www.theguardian.com/world/2025/mar/17/canada-new-prime-minister-mark-carney-paris-london-visit):\n\n“The former economist is deliberately making his first foreign trip to the capital cities of the two countries that shaped Canada’s early existence. At his swearing-in ceremony on Friday, he noted the country was built on the bedrock of three peoples: Indigenous, French and British.”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Spider-King-270",
                    "body": "Quite the carbon footprint for one man already. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Previous_Repair8754",
                            "body": "It’s encouraging how hopelessly weak these criticisms are. Voters are not going to give a fuck that a prime minister facing war is flying too much when he’s literally coming back from a set of joint defence and trade agreement meetings with nuclear allies.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SasquatchsBigDick",
                            "body": "Guys got a job to do. Gotta admire his work ethic. As soon as day 1 he's putting actions in place and going around the world to make deals.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Training-Ninja-412",
                                    "body": "Canadians are watching intensely.\n\nHe might as well already be in campaign mode.\n\nThere is strong incentive to haul ass rn, no?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Former-Physics-1831",
                            "body": "Since when do Tories care about carbon footprint?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "arm_flailing",
                                    "body": "We don't. Nor do we appreciate being told we should care about our carbon footprints by people who apparently don't care about their own.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Former-Physics-1831",
                                            "body": "The PM meeting with allies during a crisis or touring the country is considerably more important than an accountant driving his Denali HD to his office job on Bay Street because it makes him feel like a man.\n\n\nCarbon emissions are dangerous, but I am much more concerned about the effect of 7B people making bad decisions collectively than the PM doing his job",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "IamGimli_",
                                            "body": "Kinda like being told firearms are not needed or appropriate for security by someone surrounded by a security detail carrying prohibited guns 24/7.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Alextryingforgrate",
                            "body": "My comment was more of a holy shit this guy is putting in work. It's also his job to travel the world. This isn't Taylor Swift going to Kansas Ciry every weekend from what ever city to see her stupid boy friend play football. These are people making decisions that shape our world and effect us directly.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Limos42",
                            "body": "Abso-fucking-lutely worth it.  This is geopolitics, not vacation trips. \n\nGo find something else to virtue signal about.  This definitely ain't it.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Expensive_Plant_9530",
                            "body": "In times of crisis, our leader must act.\n\nWould you prefer he doesn't visit foreign nations on trade building trips, potentially losing us millions or billions worth of trade?\n\nThough I must admit, I'm quite pleased that this is the worst people can come up with to criticize him.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Mizz_Dressup",
                            "body": "God, can you lot not at least get new materials/slogans?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "vodka7tall",
                                    "body": "PP & his lot are in a back room somewhere furiously writing more verb-the-noun and other 3-word slogans, tossing them all at the wall to see what sticks. \n\nCarbon Tax Carney didn't work, so maybe Carbon Footprint Carney will be the winner.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Mizz_Dressup",
                                            "body": "They just rolled out a new one this morning: they’re going to rename the “woke” monuments (seriously).\n\nDon’t think they’ve got a slogan for that one yet, but feel like “we’re so fucked” works nicely. Or maybe “just like MAGA”?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "studsauce32",
                            "body": "Good thing he doesn’t have to pay the tax on it now",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "radbaddad23",
            "body": "Carney acknowledges that he’s got limited political experience. But he’s doing the right things. Politically he was born yesterday but he stayed up all night.",
            "score": 1,
            "replies": [
                {
                    "author": "Mizz_Dressup",
                    "body": "Or he has the good sense to pick great advisors, and follow their recommendations. \n\nCouldn’t care less which it is, the end result is a still a masterclass. \n\n(And for the record: I suspect that he’ll have a much harder time when it comes to the real grind of the campaign, and may well have a number of stumbles…but holy hell has he ever set just exactly the right tone right out of the gate)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "radbaddad23",
                            "body": "I agree.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "hippysol3",
                            "body": "Which is a pro and a con. His advisors have steered him well so far. But his first pick was Mendecino, as Chief of Staff, not good. But he's been replaced already so at least they recognize toxicity quickly. Also using Gerald Butts as an advisor, also not good. But we've yet to see if Butts sticks around.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "a_f_s-29",
                            "body": "Better to have qualified advisors and listen to them than not",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Keykitty1991",
                    "body": "He understands the importance of working with other leaders around the world in addition to our Canadian politicians. He has the sophistication and experience to deal with leaders from other countries while representing Canada well and that'll play a big part in keeping Canada ours.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nonamanadus",
            "body": "He is maneuvering the his army in preparation for the battle. \n\nI think it is more advantageous for him to call a snap election. He is fresh and the Conservatives are out of focus on countering him. Given time Pierre will find a weak point and hammer away Trump style. \n\nIn addition the nation needs unity, having Pierre mouthing off in the back all summer calling for an election to be counter productive. (There is a possibility that the NDP might try to support the Liberals because their numbers just suck).",
            "score": 1,
            "replies": [
                {
                    "author": "AdHoc_ttv",
                    "body": "I’ve already seen them starting to run attack articles targeting his personal finances. Give them a few months and they’ll have all their attack messaging set up",
                    "score": 1,
                    "replies": [
                        {
                            "author": "hippysol3",
                            "body": "Months? Good lord, he gaffed in answering Rosemary Barton's question yesterday and I had three MP's sending me attack ads about it within a few hours (Michelle Rempel Garner is famous for her exasperated responses and she didnt disappoint)\n\nThe CPC has a huge war chest, 41 million, and they are watching him like a hawk. If he so much as wears the wrong color of shoes with his suit, there'll be an ad out in minutes.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DangerousProof",
                                    "body": "A war chest is useless when your polling is dropping rapidly, they’ve been running attack ads for months. I’m getting bombarded on all digital platforms with attack ads, they aren’t working\n\nI’m still getting “carbon tax carney” and “he’s just like Trudeau” ads",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "North_Activist",
                                    "body": "A campaign and only spend so much money, so that $41 million becomes capped once the writ drops.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "hippysol3",
                                            "body": "Yup. Another reason the LPC is being pushed to do it as soon as possible. They want to kill the influence that war chest can bring.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "5555",
            "body": "It’s amazing how natural this role is for Carney. I just picture it it were PP talking to world leaders and answering questions, still blaming the Liberals.",
            "score": 1,
            "replies": [
                {
                    "author": "Expensive_Plant_9530",
                    "body": "I'm just trying to imagine Poilievre having a working relationship with the Germans, French, UK, etc - how is he going to negotiate with him when he can't fall back on \"Axe the tax\" or blaming \"Justin\"?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MalarkyD",
                            "body": "He was a horrible choice for Conservatives.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RPG_Vancouver",
                    "body": "He would already be down toadying to Trump. \n\nProbably getting humiliated in the White House and nodding along to Trump commenting about ‘the 51st state’ only to make some weak statement about how  ‘the president was only joking’",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Limos42",
                    "body": "Well, that *is* Trump's playbook.   Everything going wrong in the USA right now is all because of Biden....",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IamGimli_",
                            "body": "What's different with the 9 years of Liberal rule where everything was Harper's fault? Other than the echo chamber it comes out of obviously.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "unidentifiable",
                                    "body": "Nothing, really.  The \"Write 3 Letters\" joke has been going around for decades.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "adonns2_0",
                    "body": "Glazing like this just looks silly.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "adonns2_0",
                                    "body": "Are you serious man?  This place is an entirely pro Carney echo chamber.  The 5 year olds are the ones repeatedly pumping a big banker that just finished advising an extremely unpopular pm who’s going to continue his unpopular policies.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Expensive_Plant_9530",
                                            "body": "It's not a pro Carney echo chamber. It's Canadians standing up and saying \"No! I've had enough toxic angry politics! I want solutions, not blaming others!\".\n\nMany Canadians are sick and tired of this constantly negative culture battle Poilievre seems to want to have.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Expensive_Plant_9530",
                                                            "body": "Poilievre is the one selling angry politics to Canadians. Mark is selling them the blunt reality mixed with pragmatic hope. \n\nSorry- who’s messiah? What are you talking about?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "adonns2_0",
                                                    "body": "It’s absolutely extremely pro Carney you’re just in denial.  Carney isn’t offering any solutions, he’s literally going to continue most if not all of the unpopular policies headed by Trudeau.  Calling that out isn’t being toxic.  Sometimes just stopping doing bad things is fixing things. \n\nPP can definitely run a better campaign than he is now but his criticisms of Carney are very legitimate and a big concern for a lot of Canadians.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "burkey0307",
                                                            "body": "This place was a massive Poilievre echo chamber for years, but I'm sure you were fine with that at the time. The winds have changed though and Canadians don't want someone like PP to be our guy to go up against Trump and foster a stronger relationship with the EU and UK. I literally can't even picture him in that role without feeling embarrassed for my country.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Pikshade",
                                            "body": "Considering our choices are Carney, or a literal 5 year old, it's not like we have many options this coming election. \n\n\nWe're stooping closer and closer to a 2 party system. I hope the other parties can climb their way back up after this election cycle.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "adonns2_0",
                                                    "body": "Maybe you’re confused on what the word literal means so I’ll just ignore the first paragraph.\n\nYes we are.  A large part of that is the ABC voters who are abandoning their parties to vote liberal again so the cons don’t win because they believe misinformation like that abortion or gay marriage will be banned if they win.  Which is ridiculous.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Pikshade",
                                                            "body": "Cute comeback. If you really think people are strategically voting against Conservatives in this election strictly because of \"Wokeness\" then you shouldn't be criticizing people for \"believing misinformation\".  \n\nI don't believe the Conservative party has the skills, or the tools to survive the current trade war with the United States. We will need to create strong ties and deals with our other allies which the conservative party will not do. They continue to platform on non-issues with no plan on how to combat the USA except to hope that they stop if we continue to give into their demands.\n\nWhile I don't know for certain what will happen either way whichever party wins, I believe our Economy and World Position will be worse off under the current Conservative Party. They can talk about \"Common Sense Politics\" all they want, but politics is not common sense, and they continue to rarely actually give a plan of action, over pretty words and slander campaigns.\n\nThe Conservative party would have been way better off keeping Erin O'Toole. He even had the Majority Vote in the last election.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Potential_Art_4598",
                                            "body": "What do you believe pp would do better? Genuine question",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "adonns2_0",
                                                    "body": "Canceling the carbon tax completely not just hiding it from consumers who will pay it anyway. Not letting violent criminals out immediately after being arrested.  Capping immigration at much lower levels than the liberals.  Creating a more business friendly Canada that focuses on competitiveness and actually gets some oil pipelines through so we can actually start supplying Europe and other parts of the world like we talk about.  \n\nJust off the top of my head.  Oh and also the cons haven’t been plagued by corruption scandals for almost a full decade now.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Potential_Art_4598",
                                                            "body": "Under normal circumstances I agree with you on a lot of that but I'm talking about our current circumstances with our economy and sovereignty being threatened. While all this is happening pp is talking about renaming monuments and still repeating the same old carbon tax lines. What is his plan? I say this as someone who has never voted liberal and hated Trudeau.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Covedrop",
                                            "body": "this place is definitely an echo chamber, but it’s reddit so that should be no surprise. \n\nalso, although i’m sure there are some things carrying forward from his time advising trudeau, don’t you think that people also just have more confidence in someone who has been in a relevant position (BoC, BoE, guiding Canada SUCCESSFULLY through the 2008 crisis) for the upcoming storm over PP who only campaigns on populism and the very fact that JT was unpopular? \n\nchoose the right man for the job. if someone with carneys CV was the conservative candidate, i wouldn’t question a conservative vote. \n\nnow is the time for pragmatism, not populism. hopefully, at the end of all this bullshit, we can go back to boring, who cares voting.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "adonns2_0",
                                                    "body": "PP can run a better campaign but frankly this is about choosing party.  If you think Carney is going to be much different than Trudeau then you’re dreaming.  Their caucus and party is largely the same.  He’s already put an extremely unpopular minister as his chief of staff. \n\nVoting for more liberal corruption and more unpopular policies just because you like carney more than PP is silly.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Covedrop",
                                                            "body": "my guy i won’t be voting for the party, i’ll be voting for who i believe is equipped for this bespoke and hopefully transient political situation. i was all for change and accepted PP was going to win and was ambivalent about it but nonetheless, it was necessary. however, the game has changed and as i said, this is a time for pragmatism, not populism or us vs them or my side vs your side or any of that other nonsensical political drivel that we find ourselves drowning in nowadays. \n\nif he can navigate us through this, which i believe he can, again, based on literally his experience with prior crises (not just focusing on the JT liberal hate momentum, but focusing on the actual situation - the 2008 financial collapse), then i’m willing to accept some gaffes in other areas, because, pragmatically, the bigger issue is being solved more effectively.\n\nwe can argue who likes who more or blah blah but the fact of the matter is, i’m not looking at this from a political lense any more than i have to. it’s a problem to be solved and i don’t see PP being the man, at the moment, to solve this specific issue.\n\nas i said, hopefully when this is all said and done, we can go back to voting for people because they’re not JT and the liberals, give them a chance to reform their platform, and people can have their taxes axed and carneys sneaked all they want for all i care. \n\nthis is bigger than my party vs your party, and you would 100% hire a plumber with prior experience with the problem your house is having over someone who says they can do it but never has. this is hardly any different in my eyes.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Key-Truck8568",
            "body": "Talk about serious jet lag. I would be a sack of potatoes for a week after a quick trip like that.",
            "score": 1,
            "replies": [
                {
                    "author": "StickmansamV",
                    "body": "The quicker the trip, the easier it is to adjust actually because you actually don't adjust and can mostly stick to your own time zone when not in a commitment. \n\n\nThink of it as the 23 hour layover that some people do to get the most out of a transit location.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hkric41six",
                    "body": "Thats probably why he's a multi-millionaire",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChaoticReality",
            "body": "Politics aside, does Carney have video game fast travel capabilities? Dude seems to be everywhere rn",
            "score": 1,
            "replies": [
                {
                    "author": "MeatMarket_Orchid",
                    "body": "Yeah he's unlocked fast travel beacons all over the world.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WislaHD",
                    "body": "Jumping around like Grey Worm in the final seasons of GoT.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Frostsorrow",
            "body": "Has the man even slept once since taking office? Man's been around the world in like 48hrs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mygirlscats",
            "body": "Using Australian radar tech … love it! He’s hitting all the right notes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Own_Development2935",
            "body": "Ooohhh this is fantastic. Three to four more year-round bases in Nunavut, with funds to address current and new housing needs. Nunavut is about to see a population bump!",
            "score": 1,
            "replies": []
        },
        {
            "author": "db7fromthe6",
            "body": "glad to hear guys at the wide airbus sqn getting hotel points and stick time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible_CDN_Duck",
            "body": ">Carney also pledged $253 million in new funding for Indigenous reconciliation initiatives in the North.\n\nThis needs more attention.\n\nThe previous Conservative government broke the Kelowna Accords and had a very hostile relationship for first nations which helped fuel the Idle No More protests.\n\nWhile it's been over a decade since Poilievre said \"former residential school students need a stronger work ethic, not more compensation dollars,\" he continues to take stands against first nations such as his 2021 vote against legislation supporting the United Nations Declaration on the Rights of Indigenous Peoples.",
            "score": 1,
            "replies": [
                {
                    "author": "Tribe303",
                    "body": "PP also wants to put up statues for Sir John A MacDonald, architect of the residential school system. The Conservatives actively dislike our indigenous peoples. Look at the past Manitoba provincial election where the Conservatives campaigned on actively blocking the search of the landfill site for those 2 indigenous murder victims. The second woman was found just yesterday.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Equivalent_Age_5599",
            "body": "[Freeland Maple Maga](https://youtube.com/shorts/6CDUvDNq9tI?si=v5w4zvGKHhjwvkCw)\n\nFor starters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "whyamihereagain6570",
            "body": "Gosh, only two weeks after Pierre went there and said he would do the same thing?",
            "score": 1,
            "replies": [
                {
                    "author": "Mizz_Dressup",
                    "body": "Was that before or after he said that Canada was weak/broken?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jakovasaursrex",
                    "body": "Gosh, Pierre said he would invest in a military support hub 9 months after the liberals said they would do the same thing?\n\nhttps://www.canada.ca/en/department-national-defence/corporate/reports-publications/north-strong-free-2024.html",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DinosaurDikmeat01",
                    "body": "One has security clearance one doesn’t",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "megatraum2048",
                                    "body": "It would prevent him from saying anything related to anything classified he has seen.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "DinosaurDikmeat01",
                                    "body": "its more of a trust issue. no need to get cheeky.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Erich-k",
                                            "body": "If trust was the issue you would have more of a problem with the liberal cabinet. We have a guy who claims a stellar work history, but has been called into question by a former British pm and a mayor from Peru, a former pm from our own country.\n\nI would rather see if we have another self proclaimed \"architect\" selling us a bunch of bs.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Erich-k",
                                    "body": "It is just a useless mention for people to say \"look he won't get a clearance because he can't\" or some B's like that.\n\nNo mention of the 11 names with everyone pushing an election we forgot about pretty quick.\n\nOr the documents the government has still yet to hand over.\n\nBut we have to be super worried about him not having a security clearance that does nothing for his day to day activities.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RoddRoward",
            "body": "Liberals going to say they are going to fix more problems created by the liberals?",
            "score": 1,
            "replies": [
                {
                    "author": "Serafnet",
                    "body": "That's what we hope to see with a new party leader, yes.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RoddRoward",
                            "body": "And same liberal team behind him and same liberal MPs in his cabinet.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DangerousProof",
                                    "body": "The cabinet are MP’s, only Justin resigned not the whole party\n\nBut I bet you don’t know how Canadian elections work\n\n“Verb the noun!” Or is it “MAGA!”?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RoddRoward",
                                            "body": "What did I say that you are trying to retort. Maybe re read my short and simple comment and get back to me.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "DangerousProof",
                                                    "body": "You think Carney is going to introduce a brand new liberal team when only Justin resigned, the rest of the MP’s still hold their jobs",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "RoddRoward",
                                                            "body": "And that's my point, it's the same liberal team with one change made.\n\n\nAll the scandals, all the bad policy and out of touch comments are all stil there.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "DangerousProof",
                                                                    "body": "As opposed to Pierre out of touch approach of “verb the noun” and “Canada is broken” in the middle of an economic war? \n\nYou think the average Canadian wants to hear that rhetoric while it’s under attack? \n\nPierre is incredibly out of touch and a one trick pony of 3 worded slogans",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "RoddRoward",
                                                                            "body": "Cost of living, crime, immigration, taxes on resources are all serious issues that need fixing. Liberals love distractions though and will capitalize on anything to take the heat off of them.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DangerousProof",
                                                                                    "body": "Of which Pierre has zero experience and only says slogans. \n\nHe says a lot with no substance. He has no education or work experience in any of that. 11 years to get a 4 year poli sci degree and a government pension in his 30’s. Pierre is not the answer to any of the issues you claim need solving",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GraveDiggingCynic",
                    "body": "So the Tory line is Trump is Trudeau's fault?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RoddRoward",
                            "body": "No, abandoning the arctic is trudeaus fault.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Yelnik",
                    "body": "Yes, but it's the Liberal party. So they'll say they're going to fix a bunch of things they caused, while not fixing anything and making everything worse. Sunny ways 2.0!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cc14cc",
                            "body": "Leave the shity american style rhetorique out of Canadian politics.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Yelnik",
                                    "body": "The last decade of the Liberals being an absolute disaster has nothing to do with America. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "NEEDHALPPLZZZZZZZ",
                                            "body": "List the specific things you have grievance with.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Yelnik",
                                                    "body": "Cost of living, cost of housing, wage stagnation, sky high taxes, out of control immigration, costly boondoggles that don't actually help the environment like the carbon tax, little to no infrastructure development, horrible economic/fiscal policies and regulations that make doing business here extremely unattractive, refusal to utilize any of our land or natural resources to develop the nation, a laundry list of scandals that would make eastern Europe blush, covid (likely the most destructive set of policies in Canadian history), sociopathic and costly policies meant to virtue signal to a tiny minority of the electorate (gun buyback program). Of course this list could go on for an eternity. \n\n\nIt would be much easier to try to name anything the Liberals have done right. \n\n\nThere's no measure of wellbeing that has improved under the Liberals, and they will continue to decline so long as they are allowed to retain power. But to fair, that is exactly what the Canadian voter wants. ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "NEEDHALPPLZZZZZZZ",
                                                            "body": "COL and COH is an issue everywhere. Immigration loopholes were already patched. Carbon tax was axed on day 1 by Carney. What infrastructure are you referring to? What economic/fiscal policies do you refer to? If it's that bad why do Canadian businesses exist and still exist. You think Canada started COVID? Or was the only country to experience COVID? Which country do you think handled it the way you like? Not a huge fan of the gun program but hey, do you need an AR to hunt deers? Can't win against deers with a shotgun or a hunting rifle? Skill issue. You think conservatives have no scandals, or is it just an issue when it's to own the libs?\n\n\nFederal portion of student loan no longer has an interest rate, improving QOL of graduates that add to the work force. Canada Child Benefit may not have benefited you if you are single, but it has contributed to a sharp decline in child poverty. Banning foreign investments on housing, Canadas workers benefits, lowered small business tax from 11% to 9%. And that's just a portion of the changes made. Do tell me that these do not improve the wellbeing of anyone.  ",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "NEEDHALPPLZZZZZZZ",
                                                                            "body": "Didn't need to repeal it if the amendment sets it to 0 lol. Here i found it for you too, don't need to thank me I'm not Vance. https://orders-in-council.canada.ca/results.php?lang=en",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "RoddRoward",
                                    "body": "You guys apparently hated the liberals 2 months ago. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "michyfor",
                    "body": "That’s Trump playbook projection. MAGA’s all think alike.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RoddRoward",
                            "body": "How? This is exactly what is happening.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Equivalent_Age_5599",
            "body": "Pierre was there to announce he would build a base there. \n\nWhat would the odds be that Carney takes yet another idea from PP and announces the same thing?",
            "score": 1,
            "replies": [
                {
                    "author": "RickMonsters",
                    "body": "Idk man if a good idea is a good idea I’d rather both parties do it",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ATworkATM",
                            "body": "Yea honestly. Enough my team your team. Let's be team Canada",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aggressive-Ad7946",
                    "body": "you think pierre is the only person to have the idea of an arctic base?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Equivalent_Age_5599",
                            "body": "Woah, testy. \n\nJust pointing out PP announced a month ago that if he were to win he'd build a base there. It was ridiculed at the time by people on this sub. No Carney seems poised to do the same, and take credit for it. Incredible.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WolfzandRavenz",
                                    "body": "\"Just pointing out\"\n\nSure sure",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hurls07",
                                            "body": "Exact same vibes as “I’m just asking questions”",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Erich-k",
                                    "body": "The difference is PP announced the building of an actual base, Carney is talking about more sites similar to CFB Albert (https://en.m.wikipedia.org/wiki/CFS_Alert)\n\nMaybe it's just me but a base in Iqaluit seems like a better use of money to extend our reach vs the other.\n\nThis is also assuming either actually does it, cause if there is one thing Canadians hate it is defense spending vs social programs.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SheIsABadMamaJama",
                    "body": "Does policy mean anything to you? or is this just a red, blue and orange game for you?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Nervse",
                            "body": "Dont worry PP will come up with more nicknames for liberal leaders from the trump playbook before he badmouths the dictator threatening to annex our country.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Equivalent_Age_5599",
                                    "body": "That's what you get from this?\n\nLiberals: \"PP has no policies\"\n\nPP: announces a policy\n\nCarney: copied said policy\n\nConservatives \"The liberals just took that policy\"\n\nLiberals: \"Who cares? It's about compromise. Also PP is maple MAGA, Skippy, Timu Trump and millhouse. Also he insults the other side like MAGA\"\n\nAre you not self aware?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Nervse",
                                            "body": "When Carney comes up with schoolyard bully nicknames for his political opposition I’ll let you know.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Equivalent_Age_5599",
                                                    "body": "Carney really doesn't have too; his lackey's are doing it for him. \n\nWhat is millhouse, Skippy or maple maga if not school yard bully names? Names that are being repeated by liberal MP's and cabinet ministers.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Zakluor",
                                                            "body": "Did Carney, or Trudeau before him, come up with those? I hadn't heard any of those uttered by political leaders. Trump-style is to coin and use them himself.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Hurls07",
                                                            "body": "Imagine thinking there is zero difference in the leader of a party unironically calling someone Carbon Tax Carney and people online calling someone Mulhouse or Maple MAGA",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Equivalent_Age_5599",
                                                                    "body": "[Freeland calling PP maple maga. ](https://youtube.com/shorts/hlf1ZtKWa8M?si=JBV42edBvSLA6nLi)",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Hurls07",
                                                                            "body": "Can you send me the link where Freeland became leader of the party? Or even a link of Carney slinging the same kind of mud would do.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TomMakesPodcasts",
                                            "body": "I mean I don't trust PP to get anything done. What bill has he passed in the last 20 years to help Canadians?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Equivalent_Age_5599",
                                                    "body": "He's authored 7 and passed one. Trudeau has authored 6 and passed 0 for comparison. Its not easy to pass anything bill; and it's far from the only role in the legislature. A minister writes directives, and manages departments and federal staff on government policy. PP was a minister. A shadow minister's job is to critique the minister in charge, and hold them to account. He's has been a shadow minister. \n\nThe CPC has been out of power for 10; there has been no opportunity to pass anything bills.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TomMakesPodcasts",
                                                            "body": "Yeah Trudeau sucks too. Glad you're acknowledging PP is on the same level as that pathetic twat. \n\nThe NDP has never been in power, and just past universal diabetes care which is a huge boon to Canadians. \n\nHe's had plenty of chances to pass bills, fun fact if you work with the other politicians you can achieve things. Instead PP wants to embrace that Mitch McConnell life and be a crying obstructionist preventing the government from governing. \n\nPierre's one bill that you mention, is that the one where he wanted to make voting harder and censor the chief elections officer from encouraging people to vote? The one where he tried to increase the limits individuals and corporations could donate to help influence our elections? Is that the bill?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Equivalent_Age_5599",
                                                                    "body": "Oh! Well I have more respect for a dipper than a grit at this point. \n\nBut your wrong; PP can't stop any bills. We are a multi party government; not a bipartisan one. The NDP, Bloc and green party voted with the CPC to ask for the unredacted documents relating to the green energy fund. The LPC refused to do so, so Greg Fergus the liberal speaker held them in contempt for it. Parliment has been ground to a halt because the LPC refused for the last 6 months to hand over those documents/ the prorougation. \n\nBullshit, it was Harper who banned corporate donations to begin with. Chretien limited them to 5000$ in response to the sponsorship scandal to try and boost their poll numbers. [Read about it in McLeans. ](https://macleans.ca/facebook-instant-articles/how-ottawa-banned-corporate-donations-to-parties/)\n\nPP wanted people to present government ID to vote, and eliminated the vouching (just trust me bro) system. I could never figure out why the LPC was opposed to this.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Distinct_Meringue",
                                                    "body": "He passed one bill that made it harder to vote and prevented elections Canada from promoting voting. It was repealed.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Equivalent_Age_5599",
                            "body": "Not at all. If he acknowledged that it was a good idea, gave credit where credit is due before taking it. I'd see it as a bipartisan exercise, and my respect level for Carney might actually increase. \n\nInstead, this is being done almost certainly to improve his election bid and undermine the CPC in a deeply partisan way. With Carney taking credit for helping balance the budget under Martin, and too much credit for helping Canada with the financial crisis; it would appear this is a pattern for Carney, and likely how he made it to the top. Plagiarizing the ideas of others.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Equivalent_Age_5599",
                                            "body": "Theres been so many policies they have taken at this point I'm losing count. \n\nFrom a blue seal program, to selling government property for homes, to applying a carrot and stick model for funding for home building and exempting homes under a million bucks from gst. And people have the audacity to claim they have no policies. Apparently they are good enough to plagiarize. I mean, they axed the tax, and are eliminating the capital gains increase, and even tying immigration to Housing and Healthcare. That's like 7 ideas literally off the top of my head, there's more.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Mizz_Dressup",
                                                    "body": "“Taken”? In what universe do you think those are original/unique ideas \n\nThose are all just very fundamental mechanisms, on critical topics, that have formed the basis for all public policy for literally centuries. \n\nThere are fairly significant differences in the proposals of all the parties on those topics, but they are nuanced and can be broken down in a three word slogan. \n\nRunning a country isn’t like a kid cheating off his neighbour on a test, and treating it as such is just juvenile.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Equivalent_Age_5599",
                                                            "body": "You may not care; but in 10 years, these 'fundamental mechanisms' that have 'been on policy for centuries' were never used. In the 5 years Carney advised Trudeau, some how not one was brought up. \n\nBut this is laughable. The GST came in back in 1991 for example; so excempting it from home building is not centuries old. \n\nOr a blue seal program so that trades people and doctors can get a single license to work country wide rather then needing a unique one for each province is a new and novel idea as well. \n\n3 word slogan? He's spelled this all out in detail. Then the liberals took it, made it their own. And guess what? Look at all the people defending the liberals, even having the audacity to suggest the conservatives don't have policy of their own. It's insane.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Mizz_Dressup",
                                                                    "body": "You can’t possibly believe that the notion of national level professional licensing is a new idea? Really? \n\nHell, that exact same program is likely in half of the electoral platforms of every single party (except the Bloc) over the last 50 years. \n\nSame goes for all of the others you mention, the licensing one is just the most basic and glaring examples. \n\nLiterally none of this shit is new, the whole point is that you have to actually have a viable plan to get it done. That nobody has thus far isn’t because the CPC has suddenly plucked some brand new brilliant idea out of the air, but because this shit is HARD. \n\nAnd yes, because the programs your talking about don’t offer any sense of actual process, they are indeed nothing by slogans",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Equivalent_Age_5599",
                                                            "body": "You are trying to blind people to the terrible job the country was run fir the last 10 years. We are clearly all worse off, and not just because of covid but because of the poor choices made by this government. A government MarK Carney was economic advisor to fkr the last 5 of. \n\nGrievance? It now takes over 80K to live in almost any major city in Canada comfortably. Over 152,000$ CAD to live in toronto. The median family income? 70,500$ CAD. People need to live. This iteration of the liberals is clawing us into poverty. Food bank usage is at record highs, and now a full quarter of Canadians are in technical poverty. \n\nThis isn't a simple grievance. It was not like this under Harper. Under Carney's advice and Trudeaus leadership we placed 34 out of 38 in the OECD for post covid economic recovery. Its time for real change, not more of this BS.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "unidentifiable",
                                                                    "body": "You misunderstand.  This is a highschool popularity contest, and Polievre is losing.  Frankly it's his election to lose, as the LPC under JT had lost all popular vote.\n\nIf you want real change (and I really do), you have to really change, and while PP has not changed, the LPC is quickly becoming popular.  The CPC has done a decent job of showcasing \"JT bad\" but not a great job of \"CPC good\", which is why their message is slipping now that their favorite punching bag is sidelined.\n\nI wanna hear more about how the CPC is going to make my life better, not just about how Carney's going to make it worse.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Equivalent_Age_5599",
                                                                            "body": "That will be done during the campaign",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "S99B88",
                                    "body": "Perhaps Carney has an idea about it that’s new, guess we can wait and see",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BabadookOfEarl",
                    "body": "Pierre should have announced that he would finish the arctic base Harper started.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CanFootyFan1",
                    "body": "Considering the government announced on March 6th that they would be “investing $2.67 billion over 20 years to establish a network of Northern Operational Support Hubs” it seems more like PP was following their lead.  \nhttps://www.canada.ca/en/department-national-defence/news/2025/03/minister-blair-announces-first-northern-operational-support-hub-locations.html",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BPTforever",
                            "body": "It's been in the making for the last 20 years. They keep announcing it and barely nothing is happening.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CanFootyFan1",
                                    "body": "Just responding to the idea that Carney is following PP around trying to copy his ideas.   Which is laughable considering the announcement I linked to.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sleipnir45",
                            "body": "Seems like that announcement wasn't all it was cracked up to be. \n\nhttps://cabinradio.ca/227217/news/politics/dnd-walks-back-entirety-of-ministers-substantial-increase-pledge/\n\n\"Only when pressed by email for an explanation of where the new money was coming from did the Department of National Defence, after several days, respond to say there is actually no new investment at all.\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mizz_Dressup",
                                    "body": "Appreciate the link, especially since I’d never heard of Cabin Radio and that one article was some of the best actual Canadian journalism I’ve seen of late (genuinely). \n\nNot saying that the reporter cracked some kind of scandal or anything (the discrepancy in the figures being quoted due to the switch in accounting methodology aren’t really all that exciting), but they put in the actual work instead of just getting quotes from a bunch of people, explained the basis for the discrepancy, and ended with well supported analysis. \n\nI dont even especially agree with some of the key criticism they raise (eg don’t think there is anything remarkable/problematic about the 5-year spending plan, rushing to spend money as quickly as possible is generally a terrible idea), but damn is it great to see the free press doing what it is supposed to do at a local level.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sleipnir45",
                                            "body": "This article was referenced by another publication ( Globe and mail or national Post not sure) but I figured it's best to go straight to the source and it's paywall free.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "36cgames",
                            "body": "Looks like they walked back this announcement already which is disappointing https://cabinradio.ca/227217/news/politics/dnd-walks-back-entirety-of-ministers-substantial-increase-pledge/",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mischling2543",
                    "body": "Let's just hope he takes some more cues from Poilievre and rolls back Trudeau's gun control too",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SonicStun",
                            "body": "During the French debate, he suggested he was continuing it, not rolling it back.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mischling2543",
                                    "body": "I know. That's one of the big reasons I'm voting Poilievre over him",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ialo00130",
                    "body": "That is how politics is supposed to work. \n\nIf something is a good idea, everyone should agree on it and pledge to do it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Equivalent_Age_5599",
                            "body": "They've taken over 10 ideas from the CPC thus far. I should make a running list at this point. \n\nThey are out of ideas and it's obvious. Time for a fresh face, with a different vision.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ialo00130",
                                    "body": "Or have you considered that the Liberals are moving with the population to a more Progressive Conservative stance, since the Conservatives have all but abandoned Progressivism? \n\nThe majority of the ideas that they've coopted are Economic policy ideals. \n\nThe country is at heart Centrist/Progressive Conservative. Carney *is* the fresh face with the fresh vision, that is extremely palatable to the overwhelming majority of the country.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Equivalent_Age_5599",
                                            "body": "83% of Carney's cabinet is trudeaus. His chief of staff is Marco Mendencino. His PMO has Katie Telford and Gerald Butt's. He was supported by the majority of Trudeaus cabinet. He was economic advisor to trudeau since 2020. \n\nHe's talking about running deficits still; and wants to use accounting tricks to separate social and infrastructure spending. BTW Allison Redford in alberta tried that and it was an unmitigated disaster, which was used to mask overspending. \n\nHe is not a progressive conservative; nor is PP extreme. And he is not a fresh face. The guy who has been advising Trudeau since 2020, and was the pick of 51 MP's and the majority of his cabinet is not a fresh face.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "IamGimli_",
                                            "body": "You mean just like the Liberals were moving to end FPTP elections? How they were moving to be the most open and accountable government ever?\n\nThe Liberals are saying whatever they think will get people to vote for them again, with no regards to actually deliver on anything they \"promise\". \n\nIf you don't hold parties accountable for their lies there is no incentive for them to stop lying.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Horror-Indication-58",
                    "body": "PP literally did a press conference at the airport and left. Didn’t consult anyone locally about his announcement/plans. Let’s see if Carney actually visits with people and works WITH them instead of telling them.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Equivalent_Age_5599",
                            "body": "So it's a bad idea when PP does it, but at good idea when Carney does it?\n\nWhat do you mean, work with them? He's not in charge, he can't work with them like the PM does.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Horror-Indication-58",
                                    "body": "As a party leader, he can easily reach out to Inuit orgs and involve them before he announced his plans. He didn’t even go into the community. Held his press conference and got right back on the plane. So nice of him.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "S99B88",
                    "body": "Hmmm maybe then Pollievre can change his ads from “just like Justin” to “Just like me”\n\nBut then again, when Pollievre finally rolled around to talking a little tougher about Trump, well, seems more like Pollievre was Just Like Justin",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Equivalent_Age_5599",
                            "body": "Maybe is Poilievre had 83% of trudeaus cabinet and 100% of trudeaus caucus, PMO and Marco Mendicino as his chief of staff there would be more of an argument for just like Justin. From where I stand, that honor falls on Carney.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "S99B88",
                                    "body": "Haha well guess we’ll see. Pollievre seems to be trying to tone it down a bit maybe realizing he’s just not that likeable, and coming out with stuff that isn’t all that new but gotta come out with something other than how bad the other guy is\n\nUnfortunately he’s been crying wolf so long people many have tuned him out. And, there’s this one really annoying and quite childish attack as he’s still running that I think is actually hurting Pollievre more than it’s doing any harm to its intended target \n\nGuess we will see whenever an election gets called. If Carney doesn’t do so, Pollievre can still go the non confidence route, though he’s not as eager as he was last year",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Equivalent_Age_5599",
                                            "body": "He's plenty likeable. I find Carney to be insufferable myself, so it's all relative right? I mean who likes someone who lies and takes credit for other people's work? Like claiming he helped Paul Martin balance the budget, or like he was the sole savoir of the Canadian economy during the financial crisis when the BOC governor is a minor role in comparison to the finance minister in relation to monetary policy.  Just disgusting behavior. \n\nI guess we'll see. I hope Canadians won't be fooled. Carney was literally credited by Justin as bring his economic advisor since 2020. Same time period we came in 34rth place out of 38 in the OECD for economic recovery post covid.  If anything, it's more than likely some of the dumb ideas came from Carney himself rather then Justin. \n\nBut I guess if you don't give a hoot about housing affordability, cost of living and wage growth. These guys are going to save the planet! And they don't seem to care about how many Canadians they have to sacrifice to do it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "S99B88",
                                                    "body": "Well the CPC and Pollievre could have taken the opportunity to work with the minority liberals in exchange for more conservative concessions, but instead Pollievre took the opportunity to complain while concessions were make with the NDP, making them more expensive and progressive, so there’s that. Liberals and NDP got down to business and many of us saw Pollievre to resemble a child refusing to play the game because he didn’t get to be the leader this time. He has been so full of negativity, though he seems to have turned that around *a bit*, perhaps noticing how many people are commenting on how annoying and I likeable he comes across to them.\n\nAnd yes, it’s subjective I guess. Your criticisms seems strange and unwarranted to me. They are exaggerating and making non existent connections from what I understand. And I can trust in people, just generally not in people who are as constantly negative as a Pollievre. \n\nGuess we will see, but no matter who wins I really hope that all the MPs put aside the nastiness we’ve seen the past few years, and just all work together to protect our Country. As much as I don’t want to see Pollievre as my next PM, I much prefer that to becoming a 51st state, and if he does become PM I hope that the others all rally around working to keep us strong, not trying to break us apart. Because we need to support each other now more than ever before",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Equivalent_Age_5599",
                                                            "body": "You don't see the merits in any if my critiques? You don't have a problem with him lying about being the driving force of moving his HQ to New York? Or the fact that he straight up lied about helping Paul Martin balancs the budget in the 90's when he was actually working in England? Or the fact that he made the bizarre claim that he single handily got us out of the 2008 financial crisis? You see no problem with that? Because I dislike braggarts above all else; and Carney definitely is one. \n\nThe liberals would never work with their main rivals. They refused every suggestion and every bill they proposed. Instead they prefer to let the hype die down, before taking the idea as their own. Just as Carney will undoubtedly announce building a base in iqualit, an idea rejected as dumb by most liberal partisans when PP announced it almost a month ago. \n\nOf course. Fuck the US and fuck Donald Trump. I'll be upset if Carney wins, but it is still preferable to that shit show down south. I don't think there are many canadians looking down south and thinking they want any part of that insanity. We must rally for canada once again.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "S99B88",
                                                                    "body": "TBH I’d have to look into them, though I’m not particularly inclined to. The reason is that these all seem to be trivial things blown out of proportion by the CPC and Sun media. A while back it was Harper saying he took credit for things Flaherty did, but when evidence turned up of Harper praising Carney back then, all that suddenly Evaporated and now it’s Martin? The Brookfield thing is such a nothing burger, I mean, he’s on a Board or Chairman or whatever, if the company is moving it’s HQ that sort of thing tends to be driven by a proposal, research, team discussions, shareholder ideals, rather than one guy doing something. All those items you mentioned seem to fit this “sneaky” narrative they’re trying to portray, which funny enough was just a little joke with Jon Stewart but they turned it into this ridiculous attack ad\n\nAnd you have to remember that the CPC and Pollievre have done nothing but sling dirt at first Trudeau and now Carney for the past couple of years. Get ready for whatever they may have on Pollievre, because I would imagine that comes out in a campaign once an election’s called\n\nTrudeau was actually trying to be very conciliatory, I think there would have been room to deal there, he tends to be quite resourceful and tries to just gets things done, and he does listen, and also seems to have respect for other viewpoints, at least more than other politicians seem to\n\nBut yes whatever happens come election time i will do my best to put it behind me even if Pollievre wins. If you see me in the wild not living up to that feel free to remind me :)",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Equivalent_Age_5599",
                                                                            "body": "Carney was bank of Canada governor from 2008 - 2013. Its a none partisan role, chosen by the BOC's board of directors and rubberstamped by the PM's cabinet. \n\nThe bank of Canada's mandate is to control inflation. They can do this by controlling interest rates, and the money supply. You may be more familiar when Tiff Macklem adjustable rates right? Well the BOC also sells and buys bonds. When they want to increase the money supply, they sell bonds and when they want to reduce it they buy them.  This is called quantitative easing. This is what Carney was responsible for, and to his credit he did a good job predicting what rates were needed, and he sold alot of bonds to provide a needed cash infusion into the economy. \n\nThe problem is that it is the minister of finance that creates the budget. They allocate money to each department, and choose where the money should be spent. IE the 800 million dillar stimulus they passed. Jim flaherty nailed it with spending it where it was needed. He also made the banks pay back every penny they used for the bail out; while limiting spending in areas that while vital were not as much of a risk to the economy. This financial event was the worst downturn since the great depression. So its a much more complicated job than the BOC governor, and has a much more significant effect on the economy. If Carney deserves 10% of the credit, Jim deserves 90%. The problem is that Carney was taking most of the credit. \n\nAs far as the paul martin thing, that's an entirely different issue to begin with.  In the 90's due to high spending from Trudeau the first, the country began to run out of money.  Mulroony didn't do the greatest job managing the debt, and didn't male the difficult cuts to pubkic service that was neccisary. What happened is that we got close to defaulting on our foreign debt in the early to mid 90's. That would be really bad, and make it harder to borrow money in ths future. Paul Martin became a folk hero because he managed to balance the books. Carney claimed he helped Paul Martin do this in the leadership debate, but it turns out he didn't start working for Paul Martin till the early 2000's, long after the budget was balanced. \n\nI hope this all makes sense. I'll acknowledge the rest of what you said, but I have to start my day and don't have time to debate it. \n\nLikewise! This is what I like about being Canadian. We can disagree politically and still be friends. In America they would just as likely kill each other. Ot makes me proud to be Canadian. So thank you, I'll appreciate you as a fellow Canadian.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "S99B88",
                                                                                    "body": "Hmmm some interesting things I learned. Paul Martin for sure worked wonders by eliminating that deficit and starting to work on the debt\n\nThe thing about Harper and the banking crisis that bothers me, is that he had just removed regulations and made our mortgages more like the US, i.e. more vulnerable in that regard. Thankfully it hadn’t been non place long enough to cause too much damage when things started to hit the fan\n\nThe other thing about Harper that I dislike is that he shorted paying veterans (which pushed that alimony $1 Billion into a Trudeau budget problem/deficit). He also seemed to do some shady things to ensure it looked like there was a surplus that last year - like selling stuff off and some apparently creative ways of recording things, though I can’t recall the details now, on top of that, I didn’t like Harper because of things like cancelling the census, gagging and canning scientists, and the election act fiasco",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jakovasaursrex",
                    "body": "Liberal government already had a plan to build military support hubs in the Arctic from May 2024\n\nhttps://www.canada.ca/en/department-national-defence/corporate/reports-publications/north-strong-free-2024.html",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rubbishtake",
            "body": "Just rename this subreddit to the Carney sub",
            "score": 1,
            "replies": [
                {
                    "author": "Peatrick33",
                    "body": "Oh noooo the Canada sub is talking about the new Prime Minister. How off-topic!!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "rubbishtake",
                            "body": "Keep sucking him off",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Peatrick33",
                                    "body": "What is it with your crowd and your consistent homoerotic references?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "rubbishtake",
                                            "body": "My crowd? Like people with critical thinking? This sub is obsessed with Carney and he hasn’t done shit. By the way, PP sucks too",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "TRTv2",
                                                    "body": "Wow so angry! Use some critical thinking, why wouldn't the Canada sub be talking about the new PM?\n\n🙄\n\nWhat should we talk about oh great gate-keeper of truths?",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ExaggeratedCatalyst",
                                                    "body": "Hey Queen, what are you expecting him to have done?",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "KEITHKVLT",
                                                    "body": "Are you mindless? Brand new PM of course everyone is talking.....",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ViagraDaddy",
            "body": "Carney has no business going anywhere or announcing anything anything until he's proven he has the confidence of the house.",
            "score": 1,
            "replies": [
                {
                    "author": "Cappa_01",
                    "body": "He's PM, he can do stuff",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IamTheOtt3r",
            "body": "Should be announcing an election…",
            "score": 1,
            "replies": [
                {
                    "author": "Former-Physics-1831",
                    "body": "Jesus, he almost certainly will this week.  What is with this frantic insistence from some people that the writs get dropped yesterday?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Spanky3703",
                            "body": "Because each day that goes along Carney looks like the better PM option and PP looks more and more like a one-trick pony who just lost his pony …?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ResearcherSubject513",
                            "body": "It's wild man, I'm in alberta and I have family who unironiclaly are throwing around the unelected leader shit when not a single one of them said a peep about danielle smith waiting 7 months to call an election. At this point conservatives (the populist types, not the classic ones) are a silly people, who don't have any real demands, they just want a daddy figure to tell them everything's gonna be okay and it's not their fault. It's the brown guys fault who moved here 2 years ago.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "arm_flailing",
                                    "body": "Danielle Smith was a serving, elected Member of Legislative Assembly (Alberta's provincial equivalent to Member of Parliament) when she was selected as leader of her party and then assumed the Office of the Premier. Mark Carney has never been elected to any public office.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ResearcherSubject513",
                                            "body": "She was unelected at the time of being appointed to premiere. She was a talk radio host at the time. So she would be an unelected official, she was out of office since 2015, that's 6 years out of office. So I really don't think your making the point you think you are.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "armenianmasterpiece",
                            "body": "Neither the population nor our representative have voted in this man at this point.  Yes he’s legally the PM but even his own Liberal MPs haven’t voted in confidence in him in the chamber yet.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "rush22",
                                    "body": "From what I understand, it's kind of pointless to vote no confidence in your own party. They would \"cross the aisle\" or become independent first.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Former-Physics-1831",
                                    "body": "And?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SonicStun",
                                            "body": "Yeah, why would anyone want the chance to vote on who's leading the country?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Former-Physics-1831",
                                                    "body": "You will, nobody is questioning why you would want regular elections.  I'm asking why it is an imperative that one happen not just in the near future, but as soon as physically possible.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "SonicStun",
                                                            "body": "I know it's insane to say, but some people want a government mandate, not pre-campaign posturing. So silly of people to want democracy manifest when there's significant change in their government.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Former-Physics-1831",
                                                                    "body": "The LPC's mandate hasn't run out.  And I get wanting an election soon, and I certainly expect one to be called momentarily, but that does not explain the way people are acting as if his presence in the PMO is an affront to parliamentary democracy instead of, y'know, how the system has always worked.\n\n\nEasily a third of our PMs have come into office this way, it is hardly unprecedented ",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SonicStun",
                                                                            "body": "Their mandate ran out when they acknowledged that the government wasn't working and the leader quit. Having precedent doesn't mean people should be happy to let the government languish. Or don't you think parliament is necessary for the operation of the country? Surely we have no active threats to our country at the moment, right?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Former-Physics-1831",
                                                                                    "body": ">Their mandate ran out when they acknowledged that the government wasn't working and the leader quit\n\n\nThat's not how any of this works\n\n\n>Having precedent doesn't mean people should be happy to let the government languish. Or don't you think parliament is necessary for the operation of the country?\n\n\nPrecedent means that people need to take a deep breath and remember how our system of government works.  Calling an election and recalling parliament are two very different things, but no, I don't think there's anything parliament could do at the moment that is critical for our current situation",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "SonicStun",
                                                                                            "body": "Sure, it's not like Trudeau had to quit because the entire country lost faith in his government. Are we doing revisionist history? Are you going to argue Carney can wait to call an election until October?\n\nYou don't think the new guy should survive a general election if he wants to truly be the leader of the country? You think it's okay that nothing he does can be debated or resolved in parliament?\n\nIt's truly a strange world when people like you are arguing against the people calling for democracy to be enacted.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "armenianmasterpiece",
                                                                                                    "body": "People like that aren’t real next door neighbour type people. They are on here to shape the conversation",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "SonicStun",
                                                                                                            "body": "Awfully convenient, isn't it?",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "Former-Physics-1831",
                                                                                                    "body": ">Sure, it's not like Trudeau had to quit because the entire country lost faith in his government\n\n\nHe had to quit because *caucus* lost faith in him,  and Carney is PM because caucus has faith in him instead\n\n\n>Are you going to argue Carney can wait to call an election until October?\n\n\nSure he can, unless his government falls first.  Should he?  That's a different question \n\n\n>It's truly a strange world when people like you are arguing against the people calling for democracy to be enacted\n\n\n\"Democracy was enacted\" when we had a general election in 2021, and until that mandate expires or the government falls, then whoever caucus wants as leader is the legitimate PM",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "SonicStun",
                                                                                                            "body": "Conveniently ignoring the massive displeasure across the country *and* the House. Or are you going to argue now that Trudeau prorogued parliament for some reason other than an imminent non-confidence motion he'd lose?\n\nThe mental gymnastics you're putting on display here are quite something.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                    "body": ">Conveniently ignoring the massive displeasure across the country and the House\n\n\nI'm not, that's why caucus lost faith in him.  But the point is that he was unpopular for a long time and it made no difference to his legitimacy.  It was only when caucus - and, yes, parliament - lost faith in him that he stepped down ",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "SonicStun",
                                                                                                                            "body": "Still more revisionist history, eh? Ignoring again the fact that he dissolved parliament to avoid the non-confidence motion.\n\nIf you can't even be honest, you really have no credibility.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                    "body": ">Still more revisionist history, eh? Ignoring again the fact that he dissolved parliament to avoid the non-confidence motion\n\n\nWhere am I ignoring that?  The imminent loss of confidence of parliament is in no small part what led to caucus forcing him out.  \n\n\nWhat is your point?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "SonicStun",
                                                                                                                                            "body": "Classic trickle-truth. The whole point is that when the House fails a confidence motion, either the opposition is given a chance to form government or an election is called. That's how our democracy works. Sad that I have to explain it to you, but you're arguing for its delay.\n\nYour constant dishonesty shows that there's no merit in wasting time with you, though. Forget the rest of your country as long as your guy is getting what he wants, eh?",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                                    "body": ">Classic trickle-truth. The whole point is that when the House fails a confidence motion, either the opposition is given a chance to form government or an election is called\n\n\nAnd the government didn't fall.  He resigned to avoid that, and Carney has taken office, which is - again - perfectly legitimate \n\n\n> Forget the rest of your country as long as your guy is getting what he wants, eh\n\n\nElections don't happen based on when you want them,  and I don't even disagree that he should call one to capitalize on his polling bump and try to secure a strong mandate, it simply isn't a crisis of democracy if he doesn't do so immediately ",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "SonicStun",
                                                                                                                                                            "body": "Sure, sure. Whatever dishonest revisionist of history your talking points say. Just ignore the parts of our system when they're inconvenient. Failing house? We can just ignore it by proroguing and pretend our mandate is still intact.\n\nCongrats on holding democracy hostage. \"Oh it's only for a little while.\" 🤣🤣🤣",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                                                    "body": ">We can just ignore it by proroguing and pretend our mandate is still intact.\n\n\nYes, that is indeed how the system works.\n\n\nI really don't think you know what \"revisionist history\" means.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "None",
                                                                                                                                                                            "body": "[removed]",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                                                                    "body": ">Remind me again what your problem is with people wanting an election and a functioning parliament?\n\n\nAbsolutely nothing.  My problem is with them insisting it is a miscarriage of democracy if they don't get one right now.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "SonicStun",
                                                                                                                                                                                            "body": "Yup, same dishonesty. What a joke of a position. How long has parliament been suspended? It's funny to see Canadians (if you are Canadian) waving away the idea that government should function for all people. Ignoring the majority of the country's representation for your own benefit.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                                                                                    "body": ">How long has parliament been suspended? \n\n\nNot very long.  They take longer breaks in the summer.\n\n\nLike I said, you're going to get your election - you're just not being oppressed if it happens later than you want",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "SonicStun",
                                                                                                                                                                                                            "body": "\"Stop complaining about not being represented, we'll let you have the chance when we like\" 🤣🤣",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                                                                                                    "body": "You are being represented, MPs jobs are about far more than parliament, and yes, an election will happen when the rules dictate.  Did you not think that's how this works?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "SonicStun",
                                                                                                                                                                                                                            "body": "\"You're not allowed to be upset about your representation until we say so.\" Tagline of free democratic nations everywhere. 🤭",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                                                                                                                    "body": "Lmfao, you're \"allowed\" to be upset about whatever you want.\n\n\nBut being mad about our democratic system working the way it was designed to and has always worked is going to get you mocked and almost certainly ignored 🤷‍♂️",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "SonicStun",
                                                                                                                                                                                                                                            "body": "Lmao, you're the guy pushing back against people wanting the election that they deserve.\n\nFor the record, your argument is the one saying Trumps actions are okay because the system allows it. 🤣🤣🤣",
                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                                                                                                                                    "body": "Again, no problem with wanting an election.  I agree it's a good idea.\n\n\nMy problem is with framing it as an affront to democracy that he hasn't called it yet",
                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                            "author": "SonicStun",
                                                                                                                                                                                                                                                            "body": "Has been since parliament was prorogued. Even Trudeau railed against proroguing when Harper did it. But it's okay when your team wants to suspend democracy, right?",
                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                                                                                                                                                    "body": "Lmfao, \"suspend democracy\".  Are you serious?",
                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                            "author": "SonicStun",
                                                                                                                                                                                                                                                                            "body": "Oh, a dishonest cherrypick? Shocker.\n\nHey, I'm just curious. How much does astroturfing pay these days? 🤭",
                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                    "author": "Former-Physics-1831",
                                                                                                                                                                                                                                                                                    "body": "...I literally quoted what *you* said was happening lmfao",
                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DogeDoRight",
                    "body": "He will be on Monday. Chill.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Equivalent_Age_5599",
            "body": "Reposting so people can read my message. Seems like the down vote brigades are out in force; but i'lm build on it. \n\nPierre was there to announce he would build a base there. [You can watch it here. ](https://youtu.be/XDs0_nmxDHA?si=2U3BvAOg_CnrKZV7)\n\nWhat would the odds be that Carney takes yet another idea from PP and announces the same thing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "markcarney4president",
                    "body": "I voted for him",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Possible-Champion222",
                            "body": "For party leader yes not priminister I’ll vote for him as well when he calls a election he has no mandate to speak for us yet as far as I’m concerned. Let’s show the world what a proper democracy is",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "markcarney4president",
                                    "body": "This is how the rules work though. Canadians elected the liberal party, and the liberals could remain in power and not call an election until October. He's not going to wait that long, but it's disingenuous to say he has no business being PM.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "S99B88",
                                    "body": "Funny I thought that Pollievre was going to call an election, he doesn’t seem as eager to do that lately?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "IamGimli_",
                                    "body": "How can you say you'll vote for him when you don't even know what electoral riding he'll run in? Unless you don't know that there is no Prime Minister ballot in Canadian elections.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Possible-Champion222",
                                            "body": "I mean that I would vote for his party I’m aware of how our government works.i’m not a liberal but I would consider this guy after seeing his resume seems like a smart guy .",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "wtkillabz",
                                    "body": "If you don’t know how our parliament works that’s your own problem, nothing nefarious has happened here.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "trplOG",
                                    "body": "Wow you dunno how it works at all. Concerning.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MilkshakeMolly",
                    "body": "Stop with this, it makes you sound so silly. No one voted for trudeau either.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SonicStun",
                            "body": "The people in his riding did.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Possible-Champion222",
                            "body": "Trudeau was elected into a riding seat",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Letscurlbrah",
                    "body": "You don't vote for the prime minister, you know that right?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Possible-Champion222",
                            "body": "Yes",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "michyfor",
                    "body": "I voted for him. That’s how our system works. That’s democracy. Let him plant roots.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Atsir",
            "body": "How about you announce an election ",
            "score": 1,
            "replies": [
                {
                    "author": "Affectionate_Link175",
                    "body": "He will within the next week or two.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hoggytime613",
                    "body": "I prefer that he takes a moment to show people that he's the best person to put out the fire first. The average Canadian should be familiar with him before being asked to vote for or against him.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Distinct_Meringue",
                            "body": "Their only concern is how the CPCs poll numbers are hurting. The more they wait, the less likely PP will become PM. Truth is PP has always been incredibly unpopular, JT was just more disliked by the end of his time as PM. Canada doesn't want PP as PM but they were willing to stomach him to get rid of JT. Now that JT is gone, the appetite for PP is too. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GenX_ZFG",
                            "body": "I agree. Which is why it's very bizarre that there is this massive shift in support already for him. Canadians don't know very much about him and yet are ready to hand another term to the Liberals (according to some of the latest polling) He is one new face backed by the same group who Canadians were fed up with only 3 months ago. These are very strange times in politics.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CanFootyFan1",
                                    "body": "To me that says  lot about what Canadians think about PP and the social conservative platform.  Many voters were willing to hold their nose and vote for PP because of how they felt about Trudeau but now with a strong alternative you are seeing the shift back to Canada as a centre-left country.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GenX_ZFG",
                                            "body": "That's a fair point, but the larger shift seems to be more of an abandoning the NDP. The larger drop has been in support for them. That could be strategic to balance the liberal vote, or it could be they have had enough of the little boy who cried wolf with Jagmeet's endless threats to bring the government down. It may also be a combination of both.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CanFootyFan1",
                                                    "body": "Some is coming from NDP for sure but the charts showing the polls also show a sizable drop by conservatives as the Liberals rise. It is undeniably both.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "S99B88",
                                    "body": "It’s almost like a lot of Canadians think the other candidates are really terrible, huh?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "OscarandBrynnie",
                                    "body": "Not bizarre at all.  We know him well.  He was our B of C Governor and then Britain headhunted him to get them through their biggest financial crisis in recent times.  I like that he is talking up our strengths, while the other guy is telling us we’re broken.  Not hard to pick a winner here.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Philomath117",
                                    "body": "He's completely different from the Trudeau party, he's very centrist which is what most of us want instead of either extreme. And given Pierre just appears to be a Maga puppet, it's an easy choice even without Carney's extensive resume.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "IamGimli_",
                                            "body": "He's a new puppet hanging from the same old Liberal strings.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Atsir",
                            "body": "Yes we can get familiar with him during the campaign period and debates, same as any other first-time MP fighting for a seat",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ReginaPat",
                                    "body": "You would be saying \"why didn't he do that as PM\" about his campaign promises if he called an election immediately. Come on man.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Atsir",
                                            "body": "Why put words in my mouth? I think the best course of action for everyone including the liberals and carney is an election. ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "lastcore",
                            "body": "Well that's a shit opinion lol. \n\nHe hasn't been elected by the Canadian people, he has no mandate and only elected by the LPC. \n\nBut he should hold onto power and do things to help his campaign.  \n\nI think calling an election would help his chances of winning. It is obvious that the Canadian people want an election, then he would have power longer than for a few months.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hoggytime613",
                                    "body": "You're talking like the election isn't imminent, all parties are planning for it. He's just taking a moment to do his job during an exceptional crisis before settling into the election cycle. I think that's the right thing to do, even if it's my 'shit opinion'. I also think it will help Canadians to make an informed decision in this imminent election.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "lastcore",
                                            "body": "Let's vote for another 4 years of LPC leadership.  Housing isn't unaffordable enough yet.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Healthy_Career_4106",
                                    "body": "Regardless of an election he would only get voted on by his riding, not \"the Canadian People\". Calm your tits.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "engineerection",
                                    "body": "Jesus Christ, he will call an election within the week, he's been PM less than four days. As soon as the election is called he will be in actual campaign mode and have less time to govern, at a very critical time.\n\n\nIf you think about it, a few days delay gives PP more time to come up with a new slogan while he's tanking in the polls.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "lastcore",
                                            "body": "As Carney goes around and lies to everyone. \n\nRemoves the carbon tax.....that he supports and pushed for. \n\nTells BC he is going to force pipelines. Then tells Quebec he won't. \n\nYou own a home? Imagine another 4 years of LPC leadership impact on housing lol.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "WippitGuud",
                                    "body": "> He hasn't been elected by the Canadian people, he has no mandate and only elected by the LPC.\n\nAnd that has never happened before for either party, right?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "lastcore",
                                            "body": "Didn't say that.....",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WippitGuud",
                                                    "body": "No, you didn't say that. \n\nHowever, your statement makes the implication that this is a horrible circumstance and is not right, but it has happened 11 other times in Canada's history.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "lastcore",
                                                            "body": "Define strawman. I didn't say it but you want to argue it. \n\nHe should call an election now. If he wants to act like he has an actual mandate. \n\nAnd it is possible he could lose, so anything he does could get scrapped anyways.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Jonsnow_throe",
                    "body": "Once he does that, where will you lot move to goalposts to?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Atsir",
                            "body": "Who is “you lot”? \n\nCall me crazy and old fashioned but I prefer my PMs to be elected ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FriendlyGuy77",
                                    "body": "He was elected. Pay attention. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Atsir",
                                            "body": "Don’t be facetious when you know what I mean",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "blue1321",
                                                    "body": "Don't be stubbornly incorrect. Every time you idiots comment \"he's not elected\", you're broadcasting to everyone that you know jack shit about Canadian politics.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Atsir",
                                                            "body": "Ad hominem attacks add no value to a conversation and are intellectually lazy",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "blue1321",
                                                                    "body": "We’re not having an intellectual conversation. You’re spouting bullshit into the universe and I’m responding as such.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Atsir",
                                                                            "body": "You’re capable of being better, just try",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "FriendlyGuy77",
                                                    "body": "Learn how our system works before commenting on it.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "voteforHughManatee",
                    "body": "Can't wait for the Conservatives to spend their campaign war chest on adolescent attack ads to distract No-Security-Clearance-PIerre, eh?\n\nThis sub will return to its old ways of posting every trash editorial about progressives.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Venice_Beach",
            "body": "Election now please. Pierre must become PM asap. Look at how many comments here are asking for an election. We are finally back, gonna be a CPC landslide!!",
            "score": 1,
            "replies": [
                {
                    "author": "Distinct_Meringue",
                    "body": "Must? Are you Pierre's sockpuppet? Polls show it being neck and neck, no landslide. ",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}