{
    "title": "Carney-Led Liberals (42%, +4) Expand Lead Over Stagnant Conservatives (36%, no change) and Weak NDP (10%, -2)",
    "author": "Seebeeeseh",
    "subreddit": "canada",
    "rank": 17,
    "score": 513,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 360,
    "url": "https://www.ipsos.com/en-ca/carney-led-liberals-expand-lead-over-stagnant-conservatives-and-weak-ndp",
    "id": "1jeaevw",
    "selftext": "",
    "comments": [
        {
            "author": "Brightstaarr",
            "body": "I can’t wait to see the debates. I think a lot of people want a debate to make their final decisions. That will determine everything. Anything can happen on both sides at this point.",
            "score": 1,
            "replies": [
                {
                    "author": "Leafboy238",
                    "body": "It will be interesting. Carney appears very measure, composed, and pragmatic and has all the expertise, but Poliavre is excellent at rethoric and political speaking. \n\nI think it will be a matter of whether or not Poliavre will be able to drag Carney down to his level where he can beat him with expirence, or whether Carney can remain composed under personall attacks and flippant arguments, and keep the discussion focused on Canadian issues and policy.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "limited8",
                            "body": "> Poliavre is excellent at rethoric and political speaking.\n\nI disagree entirely. Poilievre comes off as smarmy, pretentious, and weaselly when he's debating. It becomes extremely clear that he's a career politician and Trump sycophant when he rattles off verb-the-noun soundbites about woke leftist elites and cryptocurrency. His biggest weakness is his own personality, and his biggest challenge will be hiding his personality from the public and pretending to be normal on stage.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheForks",
                                    "body": "We haven’t seen much of Pierre’s ability to debate because he hasn’t even shown up most of the time.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "_Rogue136",
                                            "body": "Can we have a debate where Carney gets PP declared a hostile witness? That sounds funny.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Leafboy238",
                                    "body": "Well, I certainly dont disagree with you, but he must be doing something right because, up until a month ago, nearly half the country was fondling his balls and singing his praises. \n\nIf not likable, he at least is skilled at directing the emotions of the population against his political enemies.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HowieFeltersnitz",
                                            "body": "I don't think PP did anything to earn that support, he gained it simply by virtue of not being Trudeau. Now that being the defacto non-Trudeau candidate is no longer on his side, we're seeing how people really feel about him.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MafubaBuu",
                                                    "body": "Give credit where it's due, even when you don't like it. Plenty of people felt Pierre's messaging resonate with them, far more than the current governments messaging has. I know people that genuinely believe in him and want to see him do well. Whether it's all smoke or not waits to be seen. The biggest shift in public opinion has been based on the conservatives response to Trump being not nearly as loud as the libs.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "HowieFeltersnitz",
                                                            "body": "The problem with that is his messaging is shallow and doesn't hold any water beyond how it feels on the surface. Just because a concerted effort to tear down Trudeau worked doesn't mean the replacement to be actually has any substantial policy to improve on the established approach. This tracks when you look at PP's career - all tearing down, but no building whatsoever. The guy simply has no solutions. His very existence is defined by who he opposes. Now that his opposition is gone, he has nothing. He's a paper tiger, and I give him zero credit for fooling Canadians into believing he's anything more than that. In fact, it's rather despicable and underhanded.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MafubaBuu",
                                                                    "body": "Again, if people thought that , he wouldn't have maintained solid momentum for two whole years. Most people don't vote based on headlines, sound bites or clips. Policy is what matters, and many people felt the conservatives had good policy lined up to deal with issues that resonated with them.\n\nYou say he has nothing, yet their policy proposals  on their website haven't changed since he was in the lead. He still has those same policies that people are fans of. It's just that he lost the \"anybody but JT\" crowd that weren't ever voting for him based on policy In the first place.\n\nYou can act like you're some sort of big-brain, knows more than everybody else type, but that's just ignorant. People vote for different reasons - just because you disagree with those reasons doesn't make those people wrong, or fooled. It means they disagree with you, and that's okay.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "HowieFeltersnitz",
                                                                            "body": ">Most people don't vote based on headlines, sound bites or clips. Policy is what matters, and many people felt the conservatives had good policy lined up to deal with issues that resonated with them.\n\nThis is just flat out false. If you'd have me believe that the vast majority of the voter base carefully combs through policy you're out of your damn mind.\n\n>It's just that he lost the \"anybody but JT\" crowd\n\nThis is exactly my point. He has nothing beyond being someone not named Justin Trudeau. That's why everybody left. It's his only defining characteristic, and he shares that characteristic with 39+ million other Canadians. What's left is empty slogans and whiny tantrums. No thanks.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MafubaBuu",
                                                                                    "body": "Yet, they are still projected to get the second most amount of seats in an election if it were held today - that's not \"losing everybody\" it's,  as I said, losing the people that don't vote based on policy, and were anti JT.\n\nThat speaks more about those people's voting habits than it does Pierre. His stance has remained the same - supporters of those policies are still very much in support of him. Voting based on who you dislike, instead of who you actually think will govern the most effectively based on your values and priorities, is crazy to me.\n\nThe majority of people that discuss politics like to throw out shit constantly as reasons people are bad. I certainly  hope they are reading policy before doing such. You'd have to be a fucking idiot to vote at the federal level without looking at policy, which, I'm sure many are like that but I have respect for my country and in going to assume most people aren't that ignorant.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ToastOfTheToasted",
                                                                                            "body": ">You'd have to be a fucking idiot to vote at the federal level without looking at policy, which, I'm sure many are like that but I have respect for my country and in going to assume most people aren't that ignorant.\n\nThen 60-70% of all voters are fucking idiots.  The number of people who actually read party platforms other than me, that I've ever met in my entire life, is in the single digits.  My enduring impression here in Alberta is that almost everyone decides how to vote based on absurdist opinion articles and slogans.\n\nHalf the time I actually tell people what the UCPs policies here are, they're genuinely confused.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "_dmhg",
                                            "body": "The country wasn’t fondling his balls so much as kicking trudeaus",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "RaynArclk",
                                            "body": "Anything but the liberal government bending Canada over then coming on TV to say \"we know this is what Canadians want. The opposition doesn't care about Canadians...\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "RaynArclk",
                                    "body": "Yes yes pp bad. Find another argument other than \"i don't like how he sounds or how he looks\"",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Keepontyping",
                                    "body": "This is the Reddit take. The reality take is more like the prior post. \n\nPeople know Carney is likely the equivalent of lipstick on a pig - Pig being the liberal party.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "katbyte",
                            "body": "Didn’t pp skip some debate for party leadership and pay a fine instead of having to debate?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Leafboy238",
                                    "body": "Ha thats hilarious, i hooe he does it again",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BikeMazowski",
                    "body": "I would love a debate but won’t be surprised if Carney tries to avoid it. He already avoids answering media questions like the plague.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GoldenxGriffin",
                    "body": "If you are still voting liberal after the last 10 years there is no way you like Canada at all",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ateballoffire",
                            "body": "What do the conservatives/PP have to offer that makes them better than carney and the liberals?\n\nI’d rather have a guy with actual economic experience and success and who has had an actual public/private career, over a guy who’s passed like 1 bill in 20 years and bases his whole campaign strategy on hate and insults rather than actual plans",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SackBrazzo",
            "body": "I need to hear from Conservative supporters directly, what do you guys think of the campaign that Poilievre and the CPC are running? Do you think continuing to harp on “Axe the Tax” is a winning message?\n\nFrom what I can tell on social media, the CPC elites (insiders, staffers, partisans, etc) are starting to get a bit restless.",
            "score": 1,
            "replies": [
                {
                    "author": "ReserveOld6123",
                    "body": "CPC has had messaging issues for ages. They can’t pivot and can’t seem to read the room.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "spreadthaseed",
                            "body": "So true. They got rid of OToole because he tried to advance the party into the modern age.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "aedes",
                                    "body": "The party has struggled with being patient since Harper stepped down. They want results immediately and then throw the baby out with the bath water when it doesn’t happen. \n\nWe would be in a very different place right now if O’Toole was still around. Probably even if Sheer was still around honestly. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "spreadthaseed",
                                            "body": "OToole was 9 times the professional and leader compared to this new parrot and I’ve never voted con",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "octavianreddit",
                                                    "body": "100%. He would have been the guy for this moment. But PP and his buddies threw Otoole under the bus.. PP launched his leadership website while the last election was still running, ffs. \n\nI wonder if PP would go out gracefully if he were to lose? \n\nI know I'm getting way ahead of myself, but can't help wonder.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "RockingTurtle1664",
                                            "body": "O'Toole probably would've maintained a pretty sizable lead. He's kind of the good boring people seek right now",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Mister-Distance-6698",
                                            "body": "They spent so much effort convincing their voting base that Trudeau was some sort of lame weak sissy-man, that they immediately had to toss any leader who lost to him because they couldn't even beat a lame weak sissy-man.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "bdickie",
                                            "body": "As someone who has voted for both Liberals and Conservatives (and Jacks NDP), I didnt hate O'Toole. I just didnt trust he could keep the crazies in his party from slowing down the progressive push. Social conservatives are holding back the fiscal conservatives at this point. How you solve that problem without splintering the party i dont know but maybe the PPC needs to be their home and we need to bring down the big tent.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "BrandonIngeFan",
                                            "body": "I didn’t dislike O’Toole or Sheer as people. I disagreed with them politically. PP comes across as an incredibly unlikable weasel and opportunist. I was willing to suck it up and vote CPC because i was tired of the Trudeau led Liberals. Now, I am going to be voting red, and hope PP gets embarrassed on election day and takes off forever",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "feelingoodwednesday",
                                    "body": "They can't let the party turn into the progressive cons, because it will erode their culty religious/racist base. Who would then funnel directly into a PPC like party. \n\nReally we should have a proportional representation system, and if we did, the current Con party wouldn't exist. It would be split into PC, PPC, and SoCon.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Jasoy_Vorsneed",
                                            "body": "You'd think Tories would want this regardless, no? They could all get in line and stand together when it's time to vote (the same way the NDP supported the LPC) and still hold their turf other times. That way, they won't have to duke it out (like Scheer and Bernier did during their leadership race). The religious and/or racists could go to the PPC, the ProCons can have their O'Toole/MacKay type, etc. It would just mirror what the left has already had for decades, no? Evidently, a significant chunk of NDP voters *will* vote strategically regardless and frequently do. \n\nMakes me wonder how long their big tent can hold. You can almost see the tension between the Reform and PC wings (however marginal they are) in real-time as PP trots out the new Verb the Noun routine. \n\nHard to win over moderate or centrist Ontarians with an awkward blend of evangelical culture war slop and trite 'bootstraps' economics. If Tories can't even position themselves as the 'safe' party anymore, what do they even have? \n\nSorry for the rant.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "kornly",
                                            "body": "There are more moderate votes than ultra-conservative votes, especially in the current voting system where you are incentivized to strategically vote.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "spreadthaseed",
                                            "body": "Yea the evangelical second coming obsessed cult",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GT-FractalxNeo",
                                    "body": "Yep, and please remember this when it's time to vote in our National Elections! 🇨🇦\n\n*Conservatives will absolutely bend the knee and kiss Trump's ring*\n\nVote for the party who won't sell out to Trump.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "wulf_rk",
                                    "body": "He reminds me a little of Tim Walz (Governer of Minnesota), the good uncle football coach type. Just discovered his Blue Skies podcast, and hearing his long form interviews, would probably position the CPC better than Poilievre.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "turudd",
                                    "body": "I was gonna vote otoole then they ditched…",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GoldenxGriffin",
                                    "body": "They got rid of o'toole because he was a tool",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jayk10",
                            "body": "Which is ironic because the US is the exact opposite",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LPC_Eunuch",
                                    "body": "The CPC got rid of O'Toole because he did worse than Scheer lol.\n\nFor all the talk about redditors totally supporting the CPC if a progressive like O'Toole was at the helm, it never actually happened.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Advanced_Stick4283",
                            "body": "And by voting in the Liberals we’ll be giving them ANOTHER mandate for the same shit show we’ve had the last DECADE ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "magicwombat5",
                                    "body": "Right, so what would you suggest the COC do to counter the Liberals?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "firmretention",
                    "body": "I'm more of an LPC detractor than Conservative supporter, but I don't know wtf his campaign is doing. They needed to pivot weeks ago but they keep using the same ineffective messaging that clearly isn't resonating with people. It's baffling.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "king_lloyd11",
                            "body": "> LPC detractor than Conservative supporter \n\nI think we’re learning that a lot of Canadians were and that’s why the Cons were polling so high until recently.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "xylopyrography",
                                    "body": "Progressives too are just getting in line to avoid vote splitting as the last thing they want is PP.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "rampas_inhumanas",
                                            "body": "The ABC crowd will (presumably) be more likely to vote given recent events.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ok_Drop3803",
                            "body": "Yeah I'm not a CPC supporter by any means, but I'm just dumbfounded over how unable they are to switch gears and say anything that anyone wants to hear. Do they not employ political strategists? What the hell is going on over there?\n\nI don't want them to win, but I want strong opposition that holds the winning party to a high standard, and works toward agreeable policy that makes sense. That's not in the cards for PP and the current CPC, apparently.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "T_47",
                                    "body": "Poilievre is at the very least a very good attack dog. That he's not using that skill to attack Trump to win easy votes really shows where his allegiance lies. And we have to remember that Ford just won a big political win by taking a hard stance on Trump so the winning formula is already obvious.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "the_randinator",
                                    "body": "PP's campaign manager Jenni Byrne was photographed wearing a MAGA hat. That should tell you exactly why PP can't switch gears.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Leafboy238",
                            "body": "To me, the Conservatives failure here shows incompetence. They had the election IN THE BAG and then showed they were completely incapable of adjusting to new circumstance.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Nonamanadus",
                                    "body": "They are focused on defeating the Liberals, not on running the nation. \n\nThat is their platform.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hmm354",
                                            "body": "This is it. It's why they make the choices that they make. They're essentially running as the opposition and so they will receive the mandate as the opposition.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Blueskyways",
                                            "body": "1.  Trudeau sucks\n\n\n2.  Axe the Tax\n\n\n3. Trudeau sucks\n\n\nThat's the entire platform.   ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Advanced_Stick4283",
                                    "body": "And you’re saying the Liberals are competent ?\nHave you been in a coma the last DECADE ?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "chopkins92",
                                            "body": "CAPITAL LETTERS!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DomonicTortetti",
                            "body": "Do you dislike Carney though? He just seems like a way better operator than Pierre and definitely a better operator than Trudeau. Easily the most experienced leader the Liberals have ever had. And he’s just laser focused on economy / trade deals, and down for cutting bureaucracy and investing in projects that will actually bring a return. Reminds me of Harper, except Harper didn’t really have any experience before he was in gov.\n\nThe PM has so much unilateral power that in my mind a vote for the party is a vote for the leader, IMO there isn’t anyone to vote for other than Carney.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "firmretention",
                                    "body": "I'm not particularly enamored of him, and I don't believe in rewarding the LPC with another mandate after the past 9 years. To me it's just new lipstick on the same old pig. They need to be put in the doghouse to rebuild if they want my vote. I don't buy the \"PP will bend the knee to Trump\" fear mongering, so Cons are still the lesser of two evils for me. Wish we had better political options than either one, but here we are.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "rampas_inhumanas",
                                            "body": "PP has literally copied MAGA messaging...",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "firmretention",
                                                    "body": "It's just repackaged populist messaging. It's all centered around Canadian patriotism.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DomonicTortetti",
                                            "body": "I think jettisoning Trudeau and putting in someone outside the admin, especially someone who is willing to markedly pursue different policies from Trudeau is not just putting lipstick on the pig.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "aedes",
                            "body": "Based on the stuff they send me, I think the core party has drank the US-Republican-strategy koolaid. \n\nIt’s difficult to pivot away from that when the people in charge think it’s still the best strategy. . ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Blueskyways",
                                    "body": "Their biggest problem is that they don't have a Trump.  No charismatic leader for people to coalesce around.  Millhouse is as exciting as paint peeling off a wall.  \n\n\n\n\nAlso that they badly want to run a campaign targeting an American electorate that they just don't have outside of Alberta.  ",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GoldenxGriffin",
                                    "body": "They denounce all of that nonsense this is a statement you make when you have fallen hard for the liberal propaganda",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "aedes",
                                            "body": "They definitely do not denounce it lol. I’m a Conservative party member 😅.\n\nJust look at their messaging re: trans rights. \n\nOr look at all the meetings party members have with Republican strategists. Or Tucker Carlson…",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FerretAres",
                    "body": "I’m not so much pro conservative as just unconvinced that the LPC has fundamentally changed regardless of Carney (who I do like). \n\nPP’s inability to adapt his messaging has got to be one of the most embarrassing failures I’ve seen in modern politics. It reeks of an unwillingness to acknowledge change which is very much a Reform party attitude. Has me feeling pretty lacking in representation as someone who really just wants to see any party vocally pro-capital investment and willing to use up a bit of political capital to actually force the issue nation wide in the face of the current market captivity most of our export industries have been forced into.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CHUD_LIGHT",
                    "body": "Canadians don’t want trump style politics and Pierre has mirrored his whole campaign on being trumpian, and using their exact messaging. It helps when billions are spent on American media and messaging, that Canadians consume, to just attach yourself. It worked for Pierre until the tides turned and trump attacked Canada.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "canteixo",
                    "body": "I'm not following anymore but I was annoyed that Poilievre kept saying the \"carbon tax election\". For me it the carbon tax was definitely not the biggest issue. Now that the carbon tax is gone, the rag has been pulled from under him.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Few_Replacement_5864",
                            "body": "It's not gone, the consumer portion stopped for 60 days, and if Carney wins in the election, he'll let it come back and let it grow more and more, making us pay even more for gas and such than even Trudeau.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Enganeer09",
                                    "body": "Ah yes, the classic. \n\nYou're talking completely put of your ass, there's been nothing to indicate that carney would reinstate the consumer carbon tax.\n\nIn fact pausing the consumer tax is effectively a net loss for many Canadians because the rebate was proven time and time again to cover, for the majority of people, the cost of said tax.\n\nThe carbon tax isn't that impactful on inflation, but the cons worked so hard to make it their bogeyman that people started believing it was the root of all evil.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Few_Replacement_5864",
                                            "body": "There's been nothing to indicate that he wouldn't reinstate it.\n\nHow's it a net loss to pause it. If we pause the consumer carbon tax, that means we don't pay the carbon tax; or does it trinkle down and we have to pay it anyway? The people who don't have cars or do anything but walk or ride bicycles probably get more back than they put into it, but people with cars- the majority of people- lose more money than they put into paying for carbon taxes.\n\nA yes, saving money is a Conservative boogeyman. We were doing fine before Trudeau put that tax on us and now suddenly we're dependent on these tax rebates to even eat? Remove the whole carbon tax, every bit of it. When did we ever need a tax imposed on us to put food on the table and pay rent? When was it ever a good thing to tax the middle-class/lower-class? \n\nAll Carneys going to do is slap us with more taxes, make everything more expensive with tariffs and overall be worse for Canada than even Trudeau was.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Jasoy_Vorsneed",
                                    "body": "I doubt that he would reneg on one of the very first things he did as PM. PP's made you guys so afraid of the Carbon Tax you think it's under your bed lmao",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "A-Wise-Cobbler",
                    "body": "Industrial carbon pricing is necessary for trade agreements with the EU. \n\nIf we remove it then EU applies its own fee on imports. \n\nThe EU’s Carbon Border Adjustment Mechanism (CBAM) is the EU’s tool to put a fair price on the carbon emitted during the production of carbon intensive goods that are entering the EU, and to encourage cleaner industrial production in non-EU countries. \n\nBy confirming that a price has been paid for the embedded carbon emissions generated in the production of certain goods imported into the EU, the CBAM will ensure the carbon price of imports is equivalent to the carbon price of domestic production, and that the EU’s climate objectives are not undermined. The CBAM is designed to be compatible with WTO-rules.\n\nhttps://taxation-customs.ec.europa.eu/carbon-border-adjustment-mechanism_en",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ImaginationSea2767",
                            "body": "Also, a lot of the countries they get steel from are not willing to put a price on carbon on their own steel. We very well could make a lot selling our steel and other metals to them.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GoldenxGriffin",
                            "body": "Not going to matter in one year when the USA fully repeals their green laws that were passed in the last 10 years\n\nEurope are followers in the business world and they follow the USA pretty much on everything",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WislaHD",
                                    "body": "I can tell you don’t know shit about the business world then.\n\nAs someone who does and has to attract European capital on a day-to-day basis, European private equity and public pensions are BOTH tied to public reporting on ESG targets and will refuse to lend money on projects that don’t meet those criteria. This will not change because of regulatory reasons in the EU.\n\nEuropean capital is old money and does not follow nor give two shits about what the USA does.\n\nWhat Poilievre is proposing indicates that he also has very little experience with the financial capital world, because if he did, he would not be proposing that policy.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "StoreOk7989",
                            "body": "Europe doesn't want our stuff anyway.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JadeLens",
                                    "body": "What a brilliant strategy for when the US has turned on us, make people in other markets really not want our products. \n\nJeez Louise.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "StoreOk7989",
                                            "body": "What do they want?\n\nOur cars??? Nope\nOur gas? ?? Nope\nOur resources??? Nope\nOur steel?  Nope\n\nEurope is very protectionist.  We haven't even fully secured the free trade agreement after so many years.  You guys are illogical.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JadeLens",
                                                    "body": "They don't want our cars because we make huge cars and they generally don't fit in most places in the EU. \n\nLike Trump complaining about why or how Europe doesn't buy our Trucks. \n\nEurope doesn't have a lot of pavement princesses with double wide extended cabs hogging parking lots just to pick up a few groceries.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "StoreOk7989",
                                                            "body": "North america has different standards and regulations.  Our cars are specifically made for the north American market.  How dense are you?\n\nWe make small cars here like the civic but why would any European country make cars here when they could make them in Poland or Hungary where costs are cheaper?\n\nI repeat Europe doesn't want anything from Canada.  Having an industrial carbon tax to appease Europe where trade is minimal is stupid.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "JadeLens",
                                                                    "body": "If our cars are made for the North American market, then why complain when Europe (who has narrower streets and smaller vehicles) don't want our cars? \n\nSuch an odd stance. \n\nAnd again, Jeez Louise... it's like you're trying to avoid getting it. We need trade with the EU because America has lost their collective minds and become 'not an ally'. \n\nWe're going to be trading more with Europe over the next few years, so intentionally doing something to have our products be more expensive in their market is balls out stupid.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Downvote_Tornado",
                    "body": "They are cooked regardless - The LPC stalling until they could run against Trump and not on their record sealed the deal.\n\nThe only question at this point is LPC minority or Majority.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cagel",
                    "body": "What campaign? Where? The election isn’t called yet. When it is, you will see an aggressive campaign with PP’s beliefs and probably a sprinkling of lies/over promises such is the way.\n\nBut the cons aren’t running on drastic change, just more fiscal responsibility.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Moosewalker84",
                    "body": "Check the wild rose reddit. They think PP is the second coming, Carny is a bait and switch, and that PP will crush him in a debate. I think they fail to remember he was the Bank of England head...and their media is way harder than ours. Oh and actually demand real answers and not talking points. \n\nI have never voted Liberal. I am closer to switching this election than ever before. I'm just not in a...trusting...mood of the LPC as a whole.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Jasoy_Vorsneed",
                            "body": "I think it's fair and reasonable to be hesitant. For a lot of people, life did get more expensive in important ways over the last decade. Some thing they could control, others they couldn't. They misstepped, backpedalled, and made numerous mistakes with the public's trust (to the extent they had it). \n\nFor me, as a progressive voter who supported Gould in the leadership race, Carney is leagues ahead of PP in virtually every way that matters. Credentials, experience, stress tests, communication and political instincts, it's just not close imho. \n\nI believe them when they say Carney is a new leaf for the party. Will they break that trust? Maybe. Do I just want competent adults running my country right now? Yes. \n\nThats my pitch for you lol",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Moosewalker84",
                                    "body": "And I agree with everything you said. It's just so hard to figure out if he will control the LPC or just pivot into the same old BS of the last 10 years. \n\nTrudeau and PP are just opposites sides of the same coin, ideologues who would rather pander to their base than do what's in the best interests of Canadians. \n\nThis campaign will be interesting.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Jasoy_Vorsneed",
                                            "body": "I think that's a fair point - I remember thinking the same thing the past couple years about JT. I suppose I like Carney specifically because he hasn't succumbed to demagoguery.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PacketFiend",
                            "body": "I really don't think Carney will be that bad in the debates.\n\nHe's spent a lifetime arguing with people whose intelligence he respects. This is in stark contrast to Pollievre and Trudeau, who for years have tweaked their messaging to the lowest common denominator.\n\nIt's just a feeling, of course, but Trudeau, Singh, and Pollievre all leave me with the feeling that they're insulting my intelligence. Carney does not. I doubt I'm the only person who feels this way.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "limited8",
                                    "body": "PP's biggest weakness is how smarmy and off-putting he is to the general public. The debates won't do him any favours except with his far-right manosphere base.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Exciting_Bandicoot16",
                                            "body": "This election has been the PPC's battle to lose, and since the American election they've been doing a spectacular job of it.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Jasoy_Vorsneed",
                                            "body": "Which is so funny given the cognitive dissonance required. PP's old image was to be a twerpy finance dweeb. They gave him a tight shirt and some glamour shots and all of a sudden he's Mr. Tough Guy? Do they take his antagonism towards the media as him being based and alpha? It's all looked so contrived to me. \n\nJust like Donny, an obese septuagenarian. HE is the king? Jeez.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "neolthrowaway",
                                    "body": "The problem is that Bank of England audience is much more intelligent and receptive of Carney’s arguments.\n\nFor political debates where your audience is everyone including the stupidest of people, Trudeau and PP strategy of appealing to lowest common denominator might be better.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PacketFiend",
                                            "body": "Recent polling numbers heavily suggest otherwise, but it's still early days.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "UndeadDog",
                            "body": "Carney can’t even answer questions from reports without being arrogant and rude.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Local-Ad-5170",
                                    "body": "Do you really care about that though? I thought that most right aligned people wanted their politicians to fight?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "UndeadDog",
                                            "body": "Yes I do care. I may not have liked Trudeau at the end, I did vote for him, but I don’t think he ever talked down to anyone.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Napalm985",
                    "body": "CPC campaign doesn't really matter. Liberals should be buying a gift basket to Trump after the election. Without him they never would have been able to fuel the left's hatred of America to possibly win out a majority.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "neometrix77",
                            "body": "How did Doug Ford win then? Clearly they could’ve done better.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Few_Replacement_5864",
                                    "body": "Cause nobody knew who the hell anyone else was while Doug Ford is well known. It didn't even feel like an election.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Enganeer09",
                                            "body": "It was also incredibly short, called early, and in the middle of the winter when no one wants to leave the house.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Few_Replacement_5864",
                                                    "body": "That too, yeah",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Few_Replacement_5864",
                                                    "body": "That too, yeah",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "rampas_inhumanas",
                                    "body": "Ontario always votes the opposite between federal/provincial, and Ford hit a home run with his tariff stance and snap election.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Turtles4lyfee",
                    "body": "I don’t have any strong opinions regarding the campaign itself, as the external factor of Trump threw a wrench into the whole thing. I think the debates will be very important in deciding the race at this point. \n\nThe problem I have is that Carney has given zero indication that he is going to change our immigration policy and by all accounts, it seems to be more of the same when it comes to this front, with some small improvements. Trudeau 2.0 when it comes to immigration and better economic policy than Trudeau. He has stated already that he would like to transition a good chunk of our TR into PRs. I have zero hope on this front. \n\nAt this point I’ve already accepted that Canadians will be so blinded by events down south that they will hand the same Liberals who ruined housing and cost of living for young people for a generation, another majority. Though, considering the vast majority of people in Canada are already homeowners, I suppose, why should they care about that, right?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "fufluns12",
                            "body": "So what happened? This should have been a slam dunk for the Conservatives. Blaming voters and Trump only gets you part of the way there. What is it about the Conservatives themselves that has many people thinking that the Liberals are the right people to lead the country, in spite of their heavy baggage?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PacketFiend",
                                    "body": "It wasn't just the Liberal immigration policy under Trudeau. It was also their steadfast refusal to acknowledge people's concerns about it, basically calling anyone out who disagreed with them as a racist. I firmly believe that this came from the top (i.e. Trudeau).\n\nI don't see that happening under Carney. I have a much firmer belief that under him, the Liberals will at least *listen*. Time will tell, of course, but in this particular case, the devil I don't know is better than the devil I do.\n\nPollypockets was at least an alternative to that, for me. Now, I see a better alternative in Carney.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "neometrix77",
                                            "body": "I have not seen people claim racism with regard to raw immigration numbers very much tbh, they do get called out when people turn around and single out Indians or any specific ethnicity that they don’t like immigrating though.\n\nMost of the people that complain about getting called racist were already complaining incessantly about Syrian refugees back in the day, many of those I would say are genuinely xenophobic/racist.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PacketFiend",
                                                    "body": "It's possible my perception is skewed too. I live in Brampton. It's a very fine line here between complaining about immigration and complaining about Indians.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Enganeer09",
                                                            "body": "The city's demographic has shifted so quickly, primarily by Indian immigration, that being outspoken about it is inherently directed at Indians so being called racist is bound to happen even when discussing straight numbers so id take that with a grain of salt, however, there are absolutely very real racism being used against Indians across Canada. \n\nI can fully understand why someone who's lived in Brampton for their entire lives feels overwhelmed by it all.\n\nI'm in a rural town a couple hours away and needed to visit a specialist there, I was genuinely shocked by how few canadian born citizens, white or not, were there. Honestly the first time I've ever felt like a minority as a white guy in canada.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Turtles4lyfee",
                                    "body": "Part of the way? Nah, I’d say the Trump factor was about 75% of the issue. Canadians feel like voting in Liberals will stick it to Trump, this is a very common sentiment when I talk to people irl. Could PP have come out stronger in the beginning? Sure. But I’m not so sure that would have mattered here. He’s never sided with Trump on anything regarding tariffs or the foolish 51st state nonsense, but it’s drowned out. \n\nThe only issues I have with PP is that he hyper focuses on the carbon tax and doesn’t talk enough about his other policies, which I think would help him more, but perhaps things will change once the campaign actually starts.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "fufluns12",
                                            "body": ">Canadians feel like voting in Liberals will stick it to Trump, this is a very common sentiment when I talk to people irl\n\n\nThat's getting right to the heart of it. Why not the Conservatives? A couple of months ago polls were predicting a possibly historic Conservative victory, and now they're on the outside looking in. There's no inherent quality of the Liberals that makes them the natural leaders in a crisis. ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Turtles4lyfee",
                                                    "body": "Humans are irrational. Idk man, by all measures, PP hasn’t done anything to indicate that he would be bowing down to Trump but because he is closer on the political compass to him than Carney, people equate him with events down south. It doesn’t make sense to me at all. Canadian politics is nothing like anything down south. \n\nCould PP have done some things differently? Sure. But this surge is inexplicable, irrational.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "GryphticonPrime",
                                                            "body": "I don't see it as entirely irrational as someone who switched opinion from CPC to LPC in the last few months.\n\nPP's statements against the US sounded very weak when the tariffs hit. It feels like he's only on the attack against the Liberals (who are fellow Canadians). I don't trust him to hold up strong against the US threat. I can only see him bending like a twig within a few months.\n\nA few months ago, I would've voted for the CPC begrudgingly, not with the same interest as I would vote for the LPC today. I am very much in favor of fiscal responsibility but I detest the social conservatism package that came along with it in the CPC.\n\nCarney's past experience is also very appealing. I don't trust Trudeau as a former drama teacher to lead this country and he has shown himself to be very incompetent. However, I do think Carney is the right fit to bring prosperity to the country compared to a career politician like PP.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Few_Replacement_5864",
                                                            "body": "Plus you have all sorts of media outlets going off on PP and praising Carney. The last 9 years are forgotten as soon as Trump enters the equation. It's very irrational, but time will tell if it's all just because he's the new guy or if people really do believe him to be the savior of Canada",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "RPG_Vancouver",
                                            "body": "> he’s never sided with trump on anything regarding tariffs \n\nThat’s…not entirely true. \n\nWhen Trump first announced his tariffs and insane border justification, and Trudeau talked with him and reiterated Canadas investments in the border last year….instead of for once agreeing with the government that this justification was completely false…he made a big announcement about how the Liberals have completely failed with border policy and that he would crack down on the border. Just fuelling the fires of Trumps insane arguments. \n\nJanuary and February was the ONE time to show unity with the federal response, but Poilievre undermined us. He did it repeatedly whenever he holds a press conference where he will spend one minute tepidly critiquing Trump, and then 10 saying that Canada is broken and everything is terrible and only the Conservatives can fix it.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "pm_me_your_catus",
                                            "body": "I think the problem is that he's sided with Trump on so many things, that there's no trust he won't on others.\n\n\nThat and the laughably terrible job he did negotiating with Trump for his own personal well being.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Turtles4lyfee",
                                                    "body": "Negotiations with Trump? What? When did PP ever negotiate with Trump? He’s not the leader of this country, why would he negotiate with any foreign leader, much less for his own wellbeing?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "pm_me_your_catus",
                                                            "body": "If Trump had just shut the fuck up for a few months, PP would have easily slithered into office. Instead Trump threw him under the bus on day one.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Turtles4lyfee",
                                                                    "body": "Oh. Yeah, idk how successful those could ever be though, since I don’t think there’s a single person on the planet that could get Trump to shut up, much less for a few months lol.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "JadeLens",
                                    "body": "It's all the Conservatives have, self reflection and the right never intersect.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Few_Replacement_5864",
                            "body": "I've found it strange that the main talking points Carney has along with the media is mostly to do with Trump and his tariffs and not much to do with homelessness, the drug epidemic, the costs of rent and housing, it's Trump and tariff this, trading with Europe that but not much when it comes to actually helping Canadians that are hurting and just barely scraping by. \n\nI'd enjoy casting my ballot for someone that seems like they want to help us Canadians with all of that including curbing immigration for a bit too, but I'm not so sure a self proclaimed 'elite' who thinks he's exactly what we need is necessarily someone we actually need. His interests are where his assets are, and unfortunately, he won't say exactly where that is.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Clean_Mix_5571",
                            "body": "As there are lots of older people in this country, his high immigration plans helps them but I would say most young people should definitely try to move south if the libs get another term. It would be a great time for some provinces to disconnect from the country and for people to choose if they want to stay here or leave. If you are under 30 with no kids, no brainer to leave. Let the boomers crash this country.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Turtles4lyfee",
                                    "body": "That’s the thing, I really don’t want to leave. I love this country. But if we get another 8 years of Trudeau 2.0 and another housing price and immigration explosion, I really don’t know what else I can do. That is what I am scared of. So many people’s retirement is secured by the value of their homes that I truly believe that a huge portion of the electorate do not want housing prices to come down. And it seems like they’re the ones that are rallying around the LPC right now. No young person in my situation is voting for the LPC in my circle, it’s all either NDP or PC.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Clean_Mix_5571",
                                            "body": "This country is hell bent on betting the entire future to keep up the boomers inflated quality of life while it ranks 58th on happiness index for young people. I just don't see much of a future in this country unless you are pulling huge $$$ from your parent's HELOC. For the rest, it's just not worth it. The quality of life of white collar middle class is just much higher in the states while here everyone seems to be under ridiculous RE debt and RE seems to be only investment in this country. This country also mainly targets immigrants from a certain region that like to live with 10 generations of family in the same house and there is no way for the rest to compete with them without huge family money.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "kilawolf",
                                    "body": "If there was no immigration - the burden of boomers will be on the young ppl as well...who do you think will pay the taxes that fund the healthcare and other services that boomers need when they retire?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "neometrix77",
                                    "body": "Move south? Nah I don’t wanna end up somewhere where they would rather let people die than fund government services to do basic shit like weather forecasting and disaster relief.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AntelopeOver",
                    "body": "Nope, PP needs to hit immigration, on which carney is just a worse version of Trudeau",
                    "score": 1,
                    "replies": [
                        {
                            "author": "singingwhilewalking",
                            "body": "Don't you think that would just make people associate him more with Trump?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FerretAres",
                                    "body": "Imo people who are doing that would be doing that regardless of what he said.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AntelopeOver",
                                    "body": "No? I think everyone inherently recognises that the current Canadian immigration system has been completed fucked (pardon my French). Marc Miller ‘reduced it’ by a small amount, but now Carney has become in favour of providing TFW with PR’s. I’ve seen that there are estimated to be at least a million TFW’s here in Canada. \n\nBesides, a politician shouldn’t be scared to approach an issue because then they’re “just like *insert leader*” - by that logic nothing is ever going to ever get done.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "singingwhilewalking",
                                            "body": "Do you want PP to win? Because his association with Trump is 90% of why he is dropping in the polls.\n\nCPC attack ads are \"Carney is just like Justin\" while liberal attack ads are just showing side by side videos of Poilevere and Trump slogans.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Steamy613",
                                                    "body": "Acknowledging that we need to reduce immigration does not associate PP with Trump.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AntelopeOver",
                                                            "body": "To the lowest common denominator (which makes up much of the voting bloc) it does as they're unable to think critically lol",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AntelopeOver",
                                                    "body": "Personally yeah, I do want PP to win, as he's going to scale back immigration more than Carney while I expect him to reverse some of the liberals gun bans. \n\nAnd what association? Outside of the media and the perception of the lowest common denominator, they have very vague similarities - not to mention that personally I don't find trump anymore scary than one would find a mouse. It's a pest sure, but it's not worth burning the whole house over.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "singingwhilewalking",
                                                            "body": "What are PP' s proposed immigration targets?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AntelopeOver",
                                                                    "body": "Around 250k or so, which I think is still too high given the shortage of housing. He did say that it might be tied to # of new homes built but given we have a shortage as it stands, less would be better.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "singingwhilewalking",
                                                                            "body": "So 145k a year less than what it currently is.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AntelopeOver",
                                                                                    "body": "Yeah, which should hopefully allow for things to mellow out a bit on a # of fronts.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GoldenxGriffin",
                                    "body": "People are already doing that even though he has denounced all of the nonsense trump and republicans have been saying about Canada because that is how strong the liberal kool aid is apparently",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "singingwhilewalking",
                                            "body": "Ford doesn't seem to have any issues with distancing himself from Trump. I mean the least PP could do is not make his campaign slogan \"Canada First\".",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "silver_goats",
                                    "body": "If Carney was leader of the CPC people would associate him with trump. Just like every global right wing leader has been associated with trump or Hitler over the past 5 years",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "singingwhilewalking",
                                            "body": "Doug Ford had absolutely zero issue dissociating himself from Trump.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Hfxfungye",
                            "body": "PP really doesn't like to talk immigration, it isn't as much of a vote-getter as people think it is and it's politically unpalatable with business elites. \n\nThreading the needle between being a right-wing populist and being someone who represents business interests is insanely difficult. Oil politics can be a source of balance, but as soon as you spend too much time on about oil politics half the country starts to remember they don't live in Alberta and then start to ask themselves if they really enjoy the whole \"petrol-state\" vibe. \n\nIt's impressive PP held it together as long as he could. Then Trump came and instantly made every Canadian outside of Alberta and Saskatchewan wake the fuck up about what a populist right-winger can do to the economy and destroyed everything Pierre worked for.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Few_Replacement_5864",
                                    "body": "Nobody knows what Carney can and will do as the Prime Minister of Canada, besides the banker job, we know he was the advisor for Trudeau behind the scenes for a good while. It's generally all just guesses at this point but if our economy is garbage while Carney was advising him, well, maybe him being Prime Minister of this country (elected) will be very much like Trudeau being in power, just potentially worse. That my guess anyway",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AntelopeOver",
                                    "body": "I think it is a vote getter personally, I think if one were to ask the average Canadian earnestly how they feel about it they'd tell you they'd like to see at least some reduction. And unpalatable with business elites - isn't that effectively better for the Conservatives? As opposed to Carney who's going to be a textbook example of the influence of business on politics.\n\nOil politics is likewise fine I think, I think someone would have to be incredibly stupid to oppose supplying our supply of oil and gas to somewhere like Europe as we work (presumably) to green alternatives, which can only really work in cities in the first place imo. And petrol state? Our whole economy is based off extraction, if anything we should be wagging the finger at the liberals of the previous century who've removed protectionist policies that we've shared with Britain and over the century failed to encourage the expansion of our economy into the services and high tech sector. And then at the turn of the century both libs and cons agreed to pack up our manufacturing sector and send it to China and Mexico lol.\n\nI think the Trump derangement syndrome is really sensationalised, like do people genuinely think about the orange idiot daily? Is there nothing better to do",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hfxfungye",
                                            "body": ">I think it is a vote getter personally, \n\nYup and theres zero chance someone like you would ever vote liberal. No offense, but what I mean by \"vote getter\" is an issue that will net you new votes, not votes from someone who was already gonna vote for you. Vote getting issues are the issues that middle-class, non-ideological, suburban Canadians in Ontario, Quebec, Atlantic Canada, and BC care about. It's the stuff they see on TV that is scary, or important. Those are the people who matter in Canadian politics because those are the only people who change who they vote for. \n\nPierre basically has already done enough to get everyone who is anti-immigration to already vote for him. A few dog whistles here or there, a gesture in the direction of being anti-immigration. Spending more time on it will only alienate the people who want to vote for him for other reasons, but are not anti-immigration. Aka, business people that Pierre needs on his side. \n\n>And unpalatable with business elites - isn't that effectively better for the Conservatives? \n\nNo, no one becomes PM or stays PM without the backing of business elites. That's why both major parties have more or less the same policies for almost every issue. Wealthy elites are the people who run the businesses - they support your policies when you're in office, they trash you in the papers when you act against them too much in the office. It's an ecosystem that they created to their own benefit. \n\nAlso, as an aside - no, most Canadians don't support oil corporations haha. Sorry dude, reddit is a bubble on this one. Oil politics is about as popular as gun politics are in suburbia Canada - Very popular for a few people who are into it and mildly unpopular for everyone else.\n\nBelieve it or not, anti-gun stuff is a vote getter in Suburbia. Try knocking on doors in Suburban Toronto and talking about relaxing gun restrictions - you're getting the door slammed on your face. Suburban moms fucking hate guns, don't know anything about them, and don't have any interest in finding out. Just \"please leave and keep your guns away from me and my children\" vibes. \n\nSame with oil stuff - sure, you can build a coalition with it but the second you leave Alberta most people can basically only tolerate it a little. Oil politics is really tricky because it becomes incredibly toxic politically. You start getting the \"hey what about this oil spill, who has to pay for that, not me right?\" and \"is this project going to impact my property values or make my kids sick?\" questions pretty fucking quick.  \n\nYou and I can scream and cry about that all we want, call these people stupid for their beliefs, think it's all illogical, but it doesn't change reality.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AntelopeOver",
                                                    "body": "Oh I agree 100% lol, I wouldn't be caught dead voting liberal, no offence taken lmfao\n\nI'm not big into oil politics myself, I merely believe it's a potential opportunity, can't tell you earnestly that I know much more than that.\n\nI agree though that the anti-gun stuff is a vote getter in Suburbia, which just points to how uneducated and fear mongered the general population has become, and how just outright scared that are of shit that doesn't actively harm them, and which the politicians can use to boost their own approval at the expense of groups that were largely not planning to vote for them anyway.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "limited8",
                            "body": "Canadians have pivoted from blaming immigrants for all of society's problems to blaming Trump. Attacking immigration would not make PP more popular; it would just reinforce Canadians' perception that PP is a Trumpian immigrant-hating sycophant.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AntelopeOver",
                                    "body": "If you don't believe letting in upwards of 300k people a year into a country is a bad idea then idk what to tell you. If the average Canadian is fine with it than they're even more stupid than our cousins down south who elected a literal felon to president lol. Immigration is a problem, and pretending it's not to appear 'not like Trump' is kicking the can down the road and not solving anything, it allows for TFW's or immigrants to be exploited by corporations, and simultaneously keeps the wages down for Canadians who understandably don't want to be paid in peanuts.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "limited8",
                                            "body": "It's not really about what's a good idea or not, it's about what resonates with the public right now. You're angry with immigrants and TFWs, but the Canadian public are more angry with Trump and the threat of American annexation. Attacking immigrants wouldn't do PP any favours - I totally support him doing so though, given it would help his poll numbers drop even further.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AntelopeOver",
                                                    "body": "The Canadian public is being placated by being angry with Trump and the threats of annexation, as outside of military preparation and rhetoric these are fundamentally issues with no solution that instantly cancels them out. Both parties will diversify the economy, and both will put more money into the military, as they should. But pretending that this is an issue that can be solved the same way as inflation is delusional, the only way to deal with it is to allow it to sort itself out - meaning it's gonna be a very long 4 years if all you think about is trump lol",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GoldenxGriffin",
                                    "body": "Bingo!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HelloBello30",
                    "body": "As a CPC supporter, It was a relevant message a month ago, but it is no longer a winning message IMO.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "supersloot",
                    "body": "I think it’s more that they just really don’t like the Liberal party than them liking what Pierre’s offering.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Few_Replacement_5864",
                    "body": "I'm personally down for PP to cancel the entire carbon tax, not just put a 60 day stop on it on the consumer side.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Big_Treat5929",
                    "body": "I'm more \"Anyone But The LPC\" than true blue Conservative, but my two cents are that it's pretty clear Poilievre's campaign is in a tailspin. The political environment has changed dramatically, and he has failed to adapt. He's probably cooked unless something wild happens in the next few weeks.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DaringAlpaca",
                    "body": "From looking at YouTube comments on recent videos from Conservative propaganda YouTube channels, a lot of them are in a panic over PP not having a very diverse campaign and only going on about the carbon tax, beating the dead horse. There's a lot of panic comments saying that he desperately needs to branch out before it's too late, and that he's not getting the right messaging across.\n\nThere's a LOT more panic going on right now than ever.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Equivalent_Age_5599",
                    "body": "Well, we expected a poll bump from the leadership race.  It be odd if it didn't happen.\n\nIt's important to note, that if the NDP was polling around 16%, then that likely would come entirely from the liberals. So we would be in a tie situation. \n\nI wouldn't count the CPC out yet. The LPC has been in charge for 10 years, and anything can happen. For instance if the ceasefire is permanently broken in Isreal, progressive voters will likely be wedged between the NDP and Israel. It will change the whole narrative and over shadow the trade war. \n\nConsidering everyone had written the liberals obituary back in january, and we are only two months past that; it seems a bit early to write the CPC's obituary no?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Nearby-Poetry-5060",
                    "body": "Axe the Tax is the ONLY thing PP says. He offers nothing else other than subservience to the people destroying this country.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CapitanChaos1",
                    "body": "I'm not a \"big C\" Conservative, but am someone who thinks the LPC has done a piss poor job with a lot of things, aren't likely to change much under Carney, and need to be gone. \n\n\nHindsight is 20/20, so it's easy to criticize Pierre for his slogans, his attack dog persona, and his slowness to go after Trump. But on the flip side, he could have easily been criticized just as much for not having a clear message, not criticizing the government enough as an opposition leader, and for attacking a foreign leader when not in a position of power. \n\n\nGoing forward, I think he needs to emphasize which parts of Liberal trade policy and international relations he's going to maintain, what he's actually going to do to fix the areas of governance that the LPC messed up, and how he intends to cooperate with other parties in the event that he doesn't win a majority. \n\n\nBut what do I know, I'm just a guy on the internet. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "griffin_green",
                    "body": "No I don’t think it’s a winning message considering he cut the consumer carbon tax. If I was advising Pierre, I would focus on his general economic policies, and point out that the Liberals have openly endorsed many of them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Keepontyping",
                    "body": "Do you think Liberals championing \"we took down the carbon tax\" after 10 years of \"We brought in the carbon tax\" speaks of sound leadership?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SnackSauce",
                    "body": "I will be voting Conservative, but I don't like PP and I don't like their messaging at all. It just so happens that I dislike the current (and previous) Liberals more. It drives me nuts the way PP acts. He was gifted the easiest victory in Canadian politics and he is messing it up with his non-sense attacks. He is spending way too much time on the offensive and not enough time actual laying his plan out for people to see. It's pissing me off.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NoNudeNormal",
                            "body": "> The problem I have is that Carney has given zero indication that he is going to change our immigration policy\n\nWho has? Criticizing Trudeau over that topic isn’t the same as proposing or promising specific improvements.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Turtles4lyfee",
                                    "body": "PP has provided numbers on the amount of PRs will be admitted yearly and has committed that immigration will be tied to housing. \n\nThe numbers he provided were very similar to numbers during the Harper years where no one was complaining about immigration.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "peppermintblue",
                            "body": "If the provincial premiere's had spent the dollars the federal government handed them where they were supposed to, then we would have been in a much better position to handle the influx of additional immigrants.  \n\nI'm not saying that the federal government didn't make a mistake here.   They should have recognized that the premiere's weren't doing their jobs and pivoted.   They absolutely realized too late. \n\nI'll just Ontario as an example though, since that's where I'm from... and I'll use healthcare as I'm a healthcare worker.    Doug Ford put the majority of the healthcare dollars from the federal government in the general budget instead of the healthcare budget.  He used the general budget to fund things like the private spa at Ontario Place.   If he had put the money in the healthcare budget we would have more family doctors, which would lessen the burden on the hospitals.  If he had put the money in the healthcare budget, we would have enough hospital staff to withstand a rise in the population.   \nOh, and Ford also suspended the healthcare workers charter rights during the pandemic... and he hasn't really restored them either. \n\nImmigration is also partly controlled by the provinces.  They tell the federal government how many immigrants they think they'll need for things like the colleges and universities.  In Ontario Ford allowed a bunch of strip-mall diploma mills to open, increasing the immigration quota. \n\nSo yea, the Premiere's should be taking a load of the blame for the immigration problems too, but for some reason people can't see past the federal Liberal party.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Turtles4lyfee",
                                    "body": "You’re not wrong, Ford certainly dodged responsibility for the whole fiasco when he should have been assigned portion of the blame. But I’m not convinced that any amount of funding would have helped up cope with the insane level of growth we had during 2018-2024, it was rampant and uncontrolled to an almost insane level, and it suppressed wages. \n\nMy only issue with your argument is that the federal government had the final say on immigration, regardless of what the provinces ask. I just wish the Liberals had put their put down and said no. I’m not sure I can ever forgive them for that. I don’t ever see myself voting for the Liberals for a long, long time, maybe ever. I will probably only vote PC or NDP depending on who I think has the better platform.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "yhzguy20",
                    "body": "I have no problem with them stressing the carbon tax because its a perfect example of the point they’re trying to make: the Liberals are trying to fool people (moving the tax away from where consumers are, saying they got rid of the tax when they can’t do that outside of parliament, reversing positions they long held just to win the election) into thinking they’ve changed.\n\nIf Polievre campaigned on anything else, the LPC would probably just steal that idea too. If he starts stressing immigration he’ll just get compared to Trump. Tax cuts? Trump. \n\nI don’t see the poll changes as Polievres fault. The gains the Liberals are seeing are mostly at the expense of the NDP. And really, the country is distracted by Trump. So the playbook that the Liberals used against Scheer and O’Toole is working again.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RickMonsters",
                            "body": "My memory is good enough that I remember when even the CPC leader was talking about how rising immigration was necessary for post-covid economic problems lol",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "voteabc",
                            "body": "Carney isn't even close to being a billionaire",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Nonamanadus",
                                    "body": "Even if he was he started out like us, I doubt a billionaire family would be living in the NWT. And I dont think he became rich from screwing over people. He worked hard and made smart decisions.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Medea_From_Colchis",
                            "body": "I am so amused by conservatives having issue with a banker being PM now, lol. If Poilievre had the credentials of Carney, we all know you guys wouldn't shut up about it. Aren't conservatives generally looking for someone with financial experience? Was this not presented as a major benefit of Harper? Do conservatives not value that financial experience now only because it happens to be on the Liberal side? Also, Carney isn't a billionaire, not even close.\n\n>He will continue to undermine labour and wages, increase immigration, and underfund healthcare.\n\nFree-market conservatives are all about the free movement of labour and goods, my dude. Moreover, since when were conservatives going to fund healthcare more so than the Liberals? If anything, we should be worried about the Cons introducing privatization. Additionally, I hope you know that Poilievre was talking about increasing immigration and tying it to the needs of the business community a few months before he introduced his idea of limiting it to healthcare and infrastructure, which he never provided details on.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ABBucsfan",
                                    "body": "You're not wrong. To me it's actually less about the leaders and more just the idea I think the liberal party needs to be gutted. Imo Trudeau was definitely an issue, but when I look at who his ministers were none of them gave me any confidence. I think there are deeper issues with the party that one guy can't fix quickly. Some of those names I want far away from our government and see that some are still gonna be ministers under Carney. The idea that those were representative of some of their brightest scares me",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Exciting_Bandicoot16",
                                            "body": "Mélanie Joly has been pretty good, but I can't say that the rest of the Trudeau Cabinet has inspired me.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ABBucsfan",
                                    "body": "You're not wrong. To me it's actually less about the leaders and more just the idea I think the liberal party needs to be gutted. Imo Trudeau was definitely an issue, but when I look at who his ministers were none of them have me any confidence. I think there are deeper issues with the party that one guy can't fix quickly. Some of those names I want far away from our government and see that some are still gonna be ministers under Carney. The idea that those were representative of some of their brightest scares me",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ABBucsfan",
                                    "body": "You're not wrong. To me it's actually less about the leaders and more just the idea I think the liberal party needs to be gutted. Imo Trudeau was definitely an issue, but when I look at who his ministers were none of them have me any confidence. I think there are deeper issues with the party that one guy can't fix quickly. Some of those names I want far away from our government and see that some are still gonna be ministers under Carney. The idea that those were representative of some of their brightest scares me",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Medea_From_Colchis",
                                            "body": ">Honestly, after what billionaires have done to our country recently, why the hell would I want one in charge?\n\nWell, good thing is that Carney is not a billionaire. Don't know where you are getting this. Moreover, I am a bit amazed that you think the CPC isn't the exact type of party that caters to billionaires, lol. The propaganda is really working, I guess.\n\n>Do you think Carney wouldn't immediately sell us out to his business interests?\n\nI think Poilievre would. Poilievre has loblaws and wal-mart lobbyists on his campaign team, lol. I don't think he cares about the carbon tax because of affordability; I think he cares because oil and gas companies promote conservative governments across the world and the carbon tax hurts their bottom line.\n\n>Also, the Conservatives have stated they would lower immigration to 200k a year,\n\nNo, they haven't. Try backing that up with a source.\n\n>while Carney says lowering it would be irresponsible.\n\nWeird, because he said he wants a temporary cap on immigration. Gonna be honest: you seem woefully misinformed.\n\n[https://financialpost.com/news/mark-carney-pledges-immigration-cap](https://financialpost.com/news/mark-carney-pledges-immigration-cap)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "opinionatedfan",
                                                    "body": "they got called out on the billionaire thing by many people and not even an acknowledgement on their part not even a conspiracy theory, just spewing random things without any support.\n\nCanada has like maybe 50 Billonaires, it's not like there are a ton of them and oh we just didn't realize he was a billonaire.\n\nit's a silly point because he is quite wealthy, there is 0 need to exaggerate.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "JadeLens",
                                                            "body": "The Conservatives glamping onto the fact that most people don't like billionaires is the funniest thing to come out of 2025.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MusclyArmPaperboy",
                            "body": "A financial expert is an attractive option when dealing with an external economic threat, it's odd people are trying to make \"banker\" a dirty word.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MusclyArmPaperboy",
                                            "body": "Where do you get 'billionaire' from?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "NoNudeNormal",
                                            "body": "Carney is not a billionaire.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "maximm",
                            "body": "Ahh so pp wouldn't do any of that right?  He's a man of the people who's never held down a job, cannot empathize with voters on any single issue, nor will he get security clearance to be sure no background checks are run.\n\nYou don't think having a person who has worked heavily in finance and can stand their ground against the dictatorship to the south is worth it?\n\nJust make sure you 'own the libs' right!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "kilawolf",
                                            "body": "Healthcare is province btw so you should vote according in your province",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "kilawolf",
                                                            "body": "You think Trudeau was doing this by oppressing the provinces? LMAO, the premiers literally whined about the immigration caps - what do you think open for business means?\n\nAnything to deflect the blame...how highly partisan",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "kilawolf",
                                                                            "body": ">Under Canada’s Constitution, responsibility for immigration is shared between the federal and provincial/territorial governments\n\n>The federal, provincial and territorial governments meet to plan and consult each other on immigration issues. In addition, Immigration, Refugees, and Citizenship Canada (IRCC) has agreements with provinces and territories on how they share responsibility for immigration.\n\nYou work for the party or something? So defensive and jumping from Ontario to Alberta? Alberta's pretty open to America and the rest of the world last time I checked...",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Exciting_Bandicoot16",
                                                            "body": "And Ottawa gave Ontario a bunch of money to be injected into the Healthcare system.\n\nDoug Ford appropriated it and spread it out to other sectors that he deemed needed it more.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Tremor-Christ",
                            "body": "This moment calls for adults in the room, and if you think PP's few months of *call centre* experience before he became a lifelong politician is what is needed to head the federal government, we can only look south to the real-time collapse of the US federal government when incompetence is at the helm. PP's down fuck all with his life other than cosplay his way through House of Commons\n\nI'll take the central banker to guide versus a clown with the maturity of a first-year poli sci debate club nerd",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "turtle-berry",
                                            "body": "You’ve lied about the billionaire point about half a dozen times in this thread alone. Just sheer, unabashed, bad faith BS.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "senecant",
                                                            "body": "> 900,000 pounds\n\nSource? Sounds like a number you invented, honestly.\n\nHey, here's a question. How many years would you need to be employed at 900,000 per year to make a billion?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "senecant",
                                                                            "body": "Ok... \n\n> His starting annual salary of £480,000\n\nOh, weird. I guess I'll just believe you instead.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[deleted]",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "senecant",
                                                                                            "body": "Oh, so you can cite your claims. Funny, I thought you were not willing to do that. Glad to see you come around. \n\nNow do the \"billionaire\" one! I'm super excited to see it.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Clean_Mix_5571",
                                                                    "body": "People who take these kind of positions usually do it for connections rather than the wages. Their main income is in investments.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "TheCaMo",
                                                                    "body": "1111.11 years. \n\n\nBetter get back to work, Carney!",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "senecant",
                                                                            "body": "Hm, made me wonder if he started at the BoE around the turn of the 10th century, but Wikipedia says it was more recently. Something's not adding up here.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "senecant",
                                            "body": "> a billionaire\n\nWhy do you keep repeating this clearly false lie? Who is paying you to continually repeat it? What is your actual nation of residence?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "senecant",
                                                            "body": "When have you ever asked how much PP is worth? Could it be that with repeating an unsubstantiated claim is just meant to deploy mis- and misinformation? Who has been repeatedly shown to engage in foreign election interference via social media? \n\nI'm just asking questions. \n\nYou have made repeated claims throughout this thread and failed to source any of it. Example:\n\n> he is quoted as saying he made a fortune... \n\nCite? \n\nHere is what is true. I have no idea if you're a foreign agent. Though I'd expect a foreign agent to behave exactly as you are behaving.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "MiamiVicePurple",
                                            "body": "You could easily look up “Mark Carney networth” on google, it isn’t that hard. There are tons of credible sources all sharing the correct number. Instead you ignorantly choose to further spread misinformation.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Exciting_Bandicoot16",
                                            "body": "Carney actually has been recently quoted in the National Post as wanting to put a cap on immigration.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Big_Extreme_4369",
                                            "body": "It’s pretty crazy comparing Carney to Musk lmfao",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Big_Extreme_4369",
                                            "body": "It’s pretty crazy comparing Carney to Musk lmfao",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "quarrystone",
                            "body": "I'm surprised by this considering Carney just started the process to lower that tax to $0 for everyone but larger businesses.  It makes me wonder why it's a 'major issue for the people'; do those people have more of a vested interest in those businesses than their own wallets?\n\nAs for a billionaire banker, you seem to be misinformed.  Mark Carney's net worth, per *Pierre Poilievre News,* is estimated at just under $7M.  And to be honest, that's expected and kind of low for someone of his caliber in the international economics sector.  FWIW, I don't know how that even applies to his take on healthcare (as a start) and your comment doesn't really explain it.  It sounds like you're just suggesting to take your word for things, but at face value, there's nothing there to take-- especially when you're throwing around out-of-date or outright incorrect numbers.\n\nDid you create your account a week before the U.S. election, because if i'm being honest, that's as fishy as it gets with talking points like these.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "quarrystone",
                                            "body": "\\> And Carney's net worth is far higher than what you claim. He held 6.8m just in stock options with Brookfield. The man was making well over a million a year CAD during his time with the Bank of England. I've seen estimates of his wealth being from 300 million to well over 1 billion. There is no way he's worth only 7m.\n\nLol, then why did you call him a billionaire?  Why did you pitch on a high estimate you don't even have confirmation on?  At least I gave you a source.  You're just speculating with a \"well he MUST have this\" number.  That's almost baseless.\n\n  \n\\> Also, considering all of the things I listed were being done under Trudeau, and Carney now has the same team, why wouldn't they continue to worsen?\n\nHis cabinet has changed and it's been five days.  What are you talking about?  Lol.\n\n\\> Carney said it would be irresponsible to lower immigration.\n\nSo did the CPC.  Lol.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Curey0us",
                            "body": "Bros net worth is 7 million that’s a bit far from a billionaire rofl. Not saying he isn’t wealthy but most politicians are wealthy\n \nPP’s net worth is around 25 million USD.\n\nSimple google search my man.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "mangongo",
                            "body": "Your entire arguement is fueled by disinformation and emotion.\n\n\nCarney is not a billionaire, carbon tax was proven to have a negligible effect on inflation, consumer side has already been reduced to 0%, and everything else you said is mere speculation based on the irrational fear that Carney is a banker.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Friendly-Flower-4753",
                            "body": "Well, considering Mark Carney has saved the Canadian tax payers 1.8M a year in one day, downgrading 18 Ministers' salaries back to MP salaries. Then, pivoting to the UK as a whole, immediately ensuring committed alliances are solid, then sprinting to France, forming an intelligence/security bilateral partnership. Then up to the Artic to secure a deal with Australia for missile detection system. Vote for who you want. Partisan politics usually does. I'm going with self made billionaire this go around. Thanks.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SasquatchsBigDick",
                            "body": "Waaiitt, who is the billionaire in this race ? Lol\nYou seem to be making stuff up.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RaynArclk",
                    "body": "I just don't want another liberal government. They fumbled it and told us that it's what we want then continued to recklessly spend and spend and the country is hurting because of them. They had all the choices. They were the majority. They just padded pockets. Worse they told you if you don't like what they're doing then you don't like Canada.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GoldenxGriffin",
                    "body": "We think the liberals are total garbage and if you vote for them after the last 10 years we think you hate this country",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheWolfofAllStreetss",
            "body": "Do the majority here, think Carney will win?",
            "score": 1,
            "replies": [
                {
                    "author": "jon-in-tha-hood",
                    "body": "No one should ever say anything until the final results are tallied. If people don't show up or make assumptions, then they're 100% at fault if the result isn't in their favour. Reddit is an echo chamber and anything short of voting is pointless. We saw all the hype, comments, and assumptions last November and the result is 180° from what Reddit was predicting.\n\nCome election time, get your asses out and vote. Vote early. Vote by mail. Just do it. I don't care what party you vote for. LPC, CPC, Rhino Party, whatever.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheWolfofAllStreetss",
                            "body": "I am voting Carney.\nWe need a mature individual, who can not only assertively, but calmly deal with Trumps erratic nonsense.\n\nAlso its about time we have an actual intellect with a resume to back it up running the country.  Now more than ever we need financial planning.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "JadeLens",
                            "body": "People are looking beyond Reddit... \n\nWe have this thing called 'polling'.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheForks",
                                            "body": "I wouldn’t say polling was *supporting* Kamala as it generally showed a 50/50 split. That being said, it was still way off from the final result.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "JadeLens",
                                            "body": "That's a 'mistruth' because it was 50/50 pretty much right up to election day.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Marco2169",
                                            "body": "No it wasn’t. I keep seeing this.\n\nIt was a neck and neck race in every poll for weeks leading up.\n\nI did not see any polls saying Kamala could win outside the margin of error and in the end she lost all the swing states within that margin.\n\nUnless you saw a poll I did not",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hfxfungye",
                    "body": "I think either Carney or Pierre are gonna win. Yes, I am an educated adult 😎",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Hotter_Noodle",
                            "body": "Woah woah woah get outta here with these radical thoughts.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bluecar92",
                    "body": "If the vote was today, yes (based on polling data). But the vote isn't today, it will be at least 6 weeks from now. A lot can happen in that time, but no doubt Carney has the momentum right now.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WippitGuud",
                    "body": "I think he will win. 338 today said it would be a majority, I won't hold my breath on that one.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CGP05",
                    "body": "I now believe that Carney will win, but a minority rather than a majority. There likely is at least a bit of a honeymoon phase at the moment.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CaptainCanusa",
                    "body": "A lot of people have been counting a lot of chickens these past few months. \n\nI'm not sure there's an outcome I'd be surprised by in this election.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "zefiax",
                    "body": "I think Carney at the moment is more likely to win yes. But that doesn't mean anything until we get to the polls.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "S14Ryan",
                    "body": "I think it’s pretty interesting, like, most people that do 10 minutes of searching about Carney think he’s a shoo in. People thought he would have a tight race against Freeland for the liberal vote. Dude got fucking 87%, with the mass of anti-liberal propaganda ads firing at him. \n\nJust based on the polls, and my lived experiences talking to friends and coworkers, it just seems like as the average person puts their due diligence into learning about him is almost immediately wants to vote for him. I’m pretty certain the only people that are gonna be voting Pierre are gonna be this reasonably large but minority of people who either always vote CPC without any research, or get conned into their media bombardment. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Leafboy238",
                    "body": "The polls are showing a shot at a LPC majority and considering how high profile the election is, i vel8ve many Canadians will come out to vote. Beacase of thisni belive that Carney is likley to win the election as the silent majority has become emboldend.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "basedenough1",
                    "body": "Honestly, I don't think he will. \n\nHe isn't handling the media well, and he's been sheltered from PP's criticism. He hasn't faced any real criticism since taking office. He doesn't have a seat as an mp. Parliament still prorogued. I'm not sure if he's even in the country. \n\nI think he's going to crack quickly. I don't think he's best suited to negotiate with trump either. Trump is highly partisan, and if he can't handle a question from Rosemary Barton, how exactly do you envision him handling a question from Trump or Vance?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Medea_From_Colchis",
            "body": "Is everyone's else reddit bugged? Or is every comment in this thread actually deleted?",
            "score": 1,
            "replies": [
                {
                    "author": "michyfor",
                    "body": "Yeah it’s doing some weird shit I keep having to refresh to make comments reappear",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "vitraaaa",
                    "body": "I had that issue on mobile. Switched to desktop and it seems to be working like this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Seebeeeseh",
                    "body": "working fine for me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thrway18749",
            "body": "What are the odds Wab steps up as leader of the NDP?",
            "score": 1,
            "replies": [
                {
                    "author": "BloatJams",
                    "body": "Unless Singh delays his exit to late 2026 or early 2027, I'd say zero. He has too much work to do in Manitoba, and he doesn't strike me as the type of person to quit early.\n\nAngus or Notley might be more realistic successor options.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "thrway18749",
                            "body": "Tbh I'd be hyped for Angus to take over, he seems like he'd do a good job",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CriscoButtPunch",
                                    "body": "Notley would be better, she is actually a centrist, I think the NDP would reject her or she would try to become something she is not.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "JanesCircumcision",
                            "body": "I've been saying for years that Angus needs his shot at NDP leadership. \n\nThe guy is basically the designated Canadian correspondent whenever American left wing news outlets want insight into what's happening this side of the border. He's been on MeidasTouch more times than I can count in the last half-year, each video garnering millions of views.\n\nThat's not to suggest that popularity in America legitimises one's standing in Canadian politics—but come on, it's pretty obvious that the guy is what the NDP needs right now.\n\nThere are other potential candidates I could see doing well. Niki Ashton is another established member of the caucus, and is a huge advocate for indigenous rights and social justice. But seeing how Canada is moving away from its sweeping social progressivism (at least for the next little bit), there's also someone like Peter Julian, who's always emphasised left-wing approaches to industry and finance.\n\nSingh's shelf life has expired. The NDP needs a new model. For the good of the party, he ought to step down after the next election.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "feelingoodwednesday",
                                    "body": "I'd say the issue with the ndp is they've lost the plot on policy and on messaging. They really do need to stop campaigning on social issues and get back to campaigning on workers' rights reforms, socialist policy platforms, building government housing, etc. \n\nEvery time Singh rants about billionaires, he's failing to address the working class. We don't care about billionaires so much as what you are going to do to help us. Also his comments on race are off putting, the party should be for everyone, not just people of color. \n\nI like the attempts at dental, pharma, childcare, etc, but all these programs are super limited and half baked. Also the ndp have seemingly no interest in governing, as half the nonsense Singh says is incredibly inflammatory and incoherent for a governing majority.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "JanesCircumcision",
                                            "body": "Absolutely, I agree wholeheartedly. Finger-pointing takes up space that policy goals should inhabit.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GenericFatGuy",
                    "body": "He hasn't even been Premier for 2 years. Manitoba still needs him right now.\n\n\nThat being said, I'd love to see him take a crack at it once he's done what he wants to do here.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hfxfungye",
                    "body": "As cool as he is I don't see it. \n\nNDP politicians are, more than anything, pragmatists. They want to get shit done, even if that means giving up power to do it. If Carney wins with the NDP numbers as they are, it's because he took away all the pragmatic NDP voters. Thee federal NDP will go into stasis, soul searching mode like they did after the 90s. Competent politicians who are already in office like Wab are gonna shy away and focus on their own province.\n\nIf Pierre loses, I am not sure what will happen with the Cons. This would be their biggest let-down ever, and con voters are gonna be PISSED OFF, 2016 Democrats style. But who is there to be an angrier, meaner, conservative than Pierre? Nothing else compares. So they might keep him on. If not, I see them going one of two routes:\n\n* Wealthy, Blue Tory Con donors whip the party into electing a more milktoast, back-to-basics con leader à la Erin O'Tool. A pro-business Quebec conservative could do this, if they are pro-resource extraction.\n\n* Dark horse populist conservative no one has heard of who wins on the 5th round of the ballot. \n\nSome people think that one of the con premiers could run, but the only two conservative premiers who fit that bill left are Doug Ford and Tim Houston, both of whom just won massive majorities. Doug Ford has skeletons in his closet that make him VERY unlikely to be national-leader material. Houston could be an option, but he's currently having a moment in NS and politicians from Atlantic Canada can have a hard time getting into federal politics sometimes.\n\n\nThe next factor is that, Unless Carney pulls off a miracle, Canadians are going to HATE him as PM. This happens every time the Libs pick a business Liberal leader - he might represent the \"sane, anti-trump\" right now that people think they want. But Carney is going to face some really tough calls and will probably end up a lot like Keir Starmer, just with a very, VERY angry Alberta chomping at the bit to tear them down. \n\nCarney is, to put it lightly, not a fan of organized labour. He could inspire a more populist, pro-Union NDP since he's likely gonna have to do a lot of Union-busting to keep shit together. Charlie Angus would be this kinda dude and I could see him being elected if he keeps his seat. But if you go too far pro-Union and start promoting protectionism you lose the yuppie vote, and more importantly, you loose every possible in-road into suburban Toronto. So the party is pretty shy about running loudmouths. If the cons shy away from a loudmouth, someone like that could fill the air, though.\n\nMy guess for the more likely choice? The NDP doubles down and chooses another pragmatic yuppie who is popular within the party ranks but can't appeal to anyone who doesn't pay attention to politics closely enough to tell them apart from the Libs.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "optimus2861",
                            "body": "Great write-up. \n\nWhile I too think Carney isn't going to wear well as PM (look at his early interactions with the press; there's a level of contempt for being questioned there that must be giving his political advisors nightmares), there's no question he's been gifted a golden opportunity to not just win, but potentially win **big**. \n\nHe's suddenly got all the winds at his back if he calls the election now, and even if he just wins a minority it's the political comeback of the century and it very likely causes the Conservatives to tear themselves to shreds trying to make sense of it all. The knives will come out for Poilievre, and the moment the Cons fall into such disarray, the Libs (if in minority power) would be all too eager to pounce with a snap election and massacre what's left of the Cons. \n\nI don't know where the country goes from there but I don't think it's anywhere good, to be honest. A new Liberal majority government full of people and policies way past their expiration dates facing broken wrecks of opposition parties (the Bloc might be the only ones still functional!) will be empowered to double and triple down on every policy we've loathed about them these past years.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "_dmhg",
                            "body": "Where can I learn more about Carney’s anti labour stance?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hfxfungye",
                                    "body": "He was chair of the Board for Brookfield, which is notoriously anti-union.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "_dmhg",
                                            "body": "😩 so I rly have to take myself to the polls to vote for an anti union guy to prevent a bigger anti union guy? Yay democracy",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Hfxfungye",
                                                    "body": "Such is the state of the world. I live in an NDP/Lib riding, so I'm voting NDP still. But I'd do the same as you if I lived in a Lib/Tory riding",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "_dmhg",
                                                            "body": "The first time I ever voted for the NDP was in fifth grade mocking elections / my political awakening LOL.   \n\nFirst time I voted after 18 was for a provincial election, I voted NDP and I was so excited - cons won.   \n\nOntario just had an election, NDP didn’t stand a chance, I voted against what I wanted for the liberals, to lose by about 100-200 votes to the cons, and I felt so shitty after the act of voting too, even before the results.  \n\nI vote every time, but I also really can’t hate people who don’t. It doesn’t feel like I actually have a voice at all",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Exciting_Bandicoot16",
                    "body": "You get your hands off my Premier. Wab's great in Manitoba because he knows the province and it's people.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "thrway18749",
                            "body": "Bro I'm so jealous we got spineless Legault as our premier",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Exciting_Bandicoot16",
                                    "body": "At least you aren't in SK?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "michyfor",
                    "body": "That would be amazing!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SomewherePresent8204",
                    "body": "If these numbers hold up, the question could be “what NDP?”\n\n10% with the Liberals flirting with 40% shows a complete wipeout on 338.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "China_bot42069",
            "body": "It’s just wild singh hasn’t stepped down to give the NDP a chance. It’s also wild we are hitching our wagon to a central banker as we the people are left leaning. Pp is pp. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClearCheetah5921",
            "body": "I wonder how Patrick brown is feeling watching dougie and PP",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nonamanadus",
            "body": "Former supporter,\n\nP.P. was a bad pick to start with. I was never a fan of negative campaigning.  I supported of Mulroney and Harper but Pierre just rubbed me the wrong way. He is great at criticism but offers no indepth alternative. And after watching the monkey show south of the border I see way too many parallels between him and Trump. \n\nOn another note I will set politics aside and go with the individual who is best suited to defending our nation from the Americans.  Having an individual with as much experience as Mark Carney is a god send. Who better to wag a trade war than an individual who successfully ran both the Bank of Canada and the Bank of England (plus other large financial institutions). He knows the best way to kneecap America and counter Trumps awkward attempts to destroy our nation. He is the best one to understand how to reorient our international trade, he has the contacts. \n\nPierre will not gets his security clearance,  he has none of the skills to go up against Trump. At most he is that dog that is all bark and no bite. Trump would steamroll us into submission under his leadership.  The conservatives will self sabotage our economy,  look at Pierre's move from axing the Carbon tax to that of elimination of the emmission charge on industry. All that would do is move tax revenue to Europe,  we would lose simply because it was a self defeating electoral promise. \n\nMark didn't start out rich he worked his way up from the bottom through hard work and smart financial decisions.  Pierre is a life long career politician who focuses on looking good infront of the camera.",
            "score": 1,
            "replies": [
                {
                    "author": "turudd",
                    "body": "To add, Canadians are not American in any way shape or form. The CPC went all in on the retarded republican politics it doesn’t work",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GreatGreenGobbo",
            "body": "When are we getting a call for an election? Kinda need one ASAP.",
            "score": 1,
            "replies": [
                {
                    "author": "Weird-Recommendation",
                    "body": "Very likely by the end of the week. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bluecar92",
                    "body": "Best guess is the election will be called Friday, with the vote to be held by May 5th:\n\nhttps://www.cbc.ca/news/politics/mark-carney-charles-tupper-shortest-prime-minister-1.7484061\n\n> Given that Carney is expected to call an election before March 24 — the day Parliament is set to return — it's possible that he could have a shorter time in office than Tupper if the Liberals lose the next federal vote.\n\n> Sources speaking to CBC News have pegged April 28 and May 5 as two likely possible election days. That would mean Carney would have between 46 and 52 days as prime minister before the vote.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FriendlyGuy77",
                    "body": "Most likely end of this week. Be patient.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Xyzzics",
                    "body": "Need to finish the taxpayer funded globe trotting press tour first.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Wild_Loose_Comma",
                            "body": "Yeah, god forbid the Prime Minister of Canada travel around the globe to <checks notes> conduct high level diplomatic talks on trade, security, and defense. Who does he think he is? The Prime Minister!?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "rune_74",
                                    "body": "Some random unelected guy. Speaking for all of us.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DeadEndStreets",
                                            "body": "> Some random unelected guy.\n\nWe get it - civics hurts your brain and you have no idea how the westminster system works. \n\nIt's kind of funny we didn't get you chuds complaining when the UCP switched out a leader mid term.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "limited8",
                                                    "body": "> We get it - civics hurts your brain and you have no idea how the westminster system works.\n\nBe sympathetic. It's tough for commenters pretending to be Canadians to attack Carney when they have no clue how a parliamentary democracy functions.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "RiverCartwright",
                                                            "body": "The party leading the polls is despised? Look in the mirror Maple MAGA.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "DeadEndStreets",
                                                            "body": ">Oh look a douche liberal comment.\n\nThat'd hit if I was a liberal voter lol. \n\nI just enjoy calling out stupid comments.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GenericFatGuy",
                                            "body": "But he was elected. The party voted for him, and anyone who wanted a say on the matter was welcome to join the party and make their voice heard.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GreatGreenGobbo",
                                    "body": "The problem is he should not be because he's unelected.  \n\nhttps://nationalpost.com/opinion/carson-jerema-mark-carney-is-acting-like-a-normal-pm-hes-not\n\nI know you're going to cry foul because it's The National Post and not CBC.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Wild_Loose_Comma",
                                            "body": "The writ has not been dropped, by Westminster convention he is a normal PM. ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "GreatGreenGobbo",
                                                    "body": "Without a seat in Parliament.  That's not normal. He should have dissolved Parliament ASAP instead of flying around and making proclamations.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "skiboy95",
                                                            "body": "https://nationalpost.com/news/canada/canada-unelected-prime-ministers\n\nDon't worry - its happened many times before and is a known occurrence in our system.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "GreatGreenGobbo",
                                                                    "body": "Sure, but there wasn't a European Tour before calling an election.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "skiboy95",
                                                                            "body": "Damn Prime Minister doing his job and talking with our allies. \n\nNot really sure what the complaint is - I guess just roll over and let the US tariff us to shit with no response is your preferred PM strategy?\n\nI wouldn't vote for you.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GreatGreenGobbo",
                                                                                    "body": "Is the urgency to make a big show with an appointed Prime Minister?  OR call an election, win and then get back to governing ASAP.\n\nI wouldn't vote for you either so we're even.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Wild_Loose_Comma",
                                                            "body": "It isn’t typical, but it is not verboten in the Westminster system. Multiple PMs have not held seats, including William Lyon Mackenzie King, who didn’t win his seat multiple times during his PMship. \n\nI agree Carney should call an election very very soon, and the buzz is that he will. ",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "GreatGreenGobbo",
                                                                    "body": "Again that's fine too.  Sure it happens. But call an election ASAP instead of taking a week long European tour.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Low_Hanging_Fruit71",
            "body": "If they couldn't navigate a political slam dunk issue. How can we trust them to run the country?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ManofManyTalentz",
            "body": "Are you the leader of an official federal party? \n\n\nThen you should have a full security clearance before being able to lead. \n\n\nFull stop. ",
            "score": 1,
            "replies": [
                {
                    "author": "Xyzzics",
                    "body": "While I agree, it’s not a legal requirement and was never even close to being the standard until the massive liberal foreign interference event. Pierre has also already held a security clearance, this is a fact.\n\nPierre could simply echo Carney’s “I am complying with all laws” line and be 100 percent correct. The people this would upset are the same people that feel comforted when Carney says it. Realistically, people downplay one side and play up the other. \n\nThere is what the law says, and what people feel is right. The rest is for the voter to decide.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Wyevez",
                            "body": " Pierre has also already held a security clearance? Is this true? I can't find a source for this.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HotIntroduction8049",
            "body": "I planned to vote PeePee until JT quit and Trump lost his marbles. Those are 2 game changers in the equation.\n\n\nCons could have had a stellar leader with Peter MacKay.",
            "score": 1,
            "replies": []
        },
        {
            "author": "raw_copium",
            "body": "Don't care. Get out and vote! Let's make politics boring again",
            "score": 1,
            "replies": []
        },
        {
            "author": "edtheheadache",
            "body": "PP is getting properly poo pooed!",
            "score": 1,
            "replies": []
        },
        {
            "author": "DrinkInfinite1033",
            "body": "So glad that c l o w n is done, he deserves jail for being maga maple traitor",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cagel",
            "body": "Everyone here acts like we are in a constant state of campaigning. \n\nJust wait until an election is called and then judge the parties on their own merit.",
            "score": 1,
            "replies": [
                {
                    "author": "Dougustine",
                    "body": "Sure will be an election for the ages though!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "workingjan",
                    "body": "If Carney were to run against PP and the American President wasn't threatening Canada's sovereignty, then there wouldn't be a surge in polling for LPC.\n\nIf PP came out strongly against Trump after tariffs were announced then there wouldn't be a large surge in polling for LPC. \n\nDoug Ford, who's very much a Conservative, was very combative against the tariffs after they were announced. He was re-elected within minutes of polls closing. \n\nI dunno why Poilievre isn't as public in denouncing this shift in American foreign policy as his peers. But it may appear spineless to anxious voters. Olivia Chow was on CNN recently to denounce the tariffs. It's a layup, politically. \n\nPolitics do not exist in a vacuum. So yeah, voters were tired of the LPC. And if the main concern for voters is still cost of living and immigration, then yeah, they'd be outta here. But now, there's a much more immediate, existential issue that's taken all the oxygen. And the LPC have done a pretty strong job of communicating to voters that they're the better party to respond.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "wink1says",
                            "body": "Didn't he pointed out the Canada's weakness? I think it's a fact that we have weakness and relying on other nations too much, Canada needs to learn to stand on it own lags and stop the reliance so much of others. Canada first type of approach needs to happened to prevent future threats like that from other sovereignty.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Jewsd",
                                    "body": "His whole tune was \"Canada is broken\". Then when trump tariffs came he was silent for awhile. That type of slogan doesn't work when the nation is rallying together.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "workingjan",
                                    "body": "he may have. But it clearly was not a point that was communicated well, even *if* it was a good point. \n\nA response of, \"bad LPC policies made us weak,\" is a miscalculation because Canadians' anger is directed squarely at the Trump administration. The President's intention to harm Canada is open, public. Trying to redirect that anger towards Trudeau and the LPC is just bad politics. And the fact that PP hasn't course corrected makes him seem ineffective at best, tacitly agreeable to Trump at worst.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GraveDiggingCynic",
                    "body": "A leading question that answers itself.\n\nCongratulations.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "S99B88",
                                    "body": "Your question assumes people think it was all bad. It wasn’t. Definitely Pollievre did a good job of convincing people it was. People have a different perspective now, and see Pollievre for what he represents and what dangers he could pose. They also realize there’s more important things than complaining about carbon taxes and whatever else slogans Pollievre went on about",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Leafboy238",
                                            "body": "Good point. The trudeau government made a mistake with immegration policy and their failure to supply the housing market, and sparked discontent with a largley pointless restiction on gun control, but beyond that did fairley well at keeping the country together through a very tumultuous decade. \n\nThe Liberal partys biggest failure was allowing the right to control the narrative about the state of our country.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "wink1says",
                                            "body": "Why has there been more than one resigning and quitting because of corruption allegations? There were ppl who were forced to shut too",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "S99B88",
                                                    "body": "It’s not like the previous government didn’t have their scandals, or the one before that. And with Pollievre, even not being in power he keeps people on a tight leash so they seem afraid to even speak",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kingswash",
                    "body": "Because there is no good alternative party.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "wink1says",
                            "body": "I think there is",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "kingswash",
                                    "body": "Sorry, no alternative that has a realistic shot at winning*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hfxfungye",
                    "body": "The world has changed and people are reacting to it. \n\nRemember that most people don't like politicians at all. Most people despise every political party. They choose the least bad option. \n\nThis is especially true for the type of voter who changes their mind. Statistically, these are the least engaged, least educated type of voters. People who are middle class, don't read the news, don't have a lot of time for political stuff. They live in the burbs are are more focused on work and kids. Those are the only people you need to pay attention to to understand this change. \n\nIt's much, much more simple than you are making it out to be. Here's what happened:\n\n1. Trudeau was PM for a long time and things aren't going well. Pierre was anti-Trudeau, so people started to think \"maybe Pierre will make things cheaper idk Trudeau seems dumb, diversity isn't making gas cheaper\". \n\n2. Trump got elected on basically the same platform Pierre is running on, and immediately went to work attacking Canada. Trump brand politics immediately became \"enemy #1\" for all Canadians.\n\n3. Canadians who vote Liberal but sometimes conservative are the exact sort of Canadians who despise Trump because he is \"very bad and attacking. Canada\". They also feel impacted the most because of the way they rarely engage with politics outside of monumental events. Trump news may be the only news they even follow. So this feels like a massive deal for them.\n\n4. Pierre represents Trump brand politics because he sounds and acts exactly like Trump in the ways that matter to these people. It's impossible not to connect them. \n\n5. Carney is specifically running as \"anti-trump\". He can do that because he isn't a right wing populist.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Scryotechnic",
                    "body": "I am more left leaning than Trudeau. Carney is quite a bit more right than Trudeau. His platform is much more centrist, that in it's self is a massive departure. \n\nI think a thing that con voters are struggling with is that they think liberals disapproval of Trudeau was also a disapproval for their party. Realistically, a lot of liberal voters have their gripes, but overall, think that Canada has coped well to the major world events over the last 10 years.\n\nTrouble with Trudeau was he out lived his shelf life. A politician accumulates a lot of baggage being in the hot seat for a decade. \n\nI don't have a problem with the liberals at all, I just need them to have a leader that I am confident will focus them on the issues that really matter, and to make up for lost time on the areas Trudeau's attention drifted from.\n\nI would prefer to vote for an actual leftist Candidate, but we don't have that in Canada. Even the greens are just Eco focused neo-liberals. NDP should be the leftist party, but they just have no vision. I am grateful for all the work they did on dental and pharmacare for the vulnerable, though.\n\nLong story short, for Canadians that believe in progressive values and respecting human rights, the current iteration of the CPC under PP have disqualified themselves. Carney is legitimately a strong candidate. So, I'll take it for now. If Cons want to win in Canada again, they are going to need to drop the culture war bullshit and be the socially progressive and fiscally conservative that the majority of CPC voters are anyway. We have a charter of rights and freedoms. If a federal party is showing they intend to impinge on our Charter and constitution, they are disqualified from my voting considerations.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SignificanceJust972",
            "body": "Liberals will prob hard debate PP re: him refusing security clearance. I doubt they will hit as low as to accuse him of being lil Agent Krasnov Jr. but here for it all the same :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neko-flame",
            "body": "Conservative voter, not worried one bit. CPC winning. There’s a lot of time until the election and Liberals have been inc charge for decade. It’s gonna be the last thing that voters think about when voting. Throw out the party in power for a decade or more Liberals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "StayFit8561",
                    "body": "My attempt at a genuine assessment:\n\n\n\n\n1. The \"Liberal Base\" won't change their mind, just like any parties base would be steadfast.\n\n\n\n\n2. NDP voters are switching to Liberal because as much as they don't want a Liberal government, they *really* don't want a conservative government.\n\n\n\n\n3. A portion of the Liberal voters that would've flipped to the conservative party is being swayed by the messaging around Trump affiliation, and they might not be thrilled about voting Liberal, but they feel compelled to vote against the conservatives.\n\n\n\n\n4. A portion of the Liberal voters that would've flipped think Justin was the problem and are optimistic about a Carney government.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bluecar92",
                            "body": "To add to this - Canadians generally don't have a very strong party affiliation, at least not compared to the situation down in the US. Most people don't identify themselves as a \"liberal\" or a \"conservative\". And I'd argue that politically, a lot of Canadians actually lie pretty close to the centre politically.\n\nCanadians do tend to vote out politicians they don't like, rather than voting for a particular candidate. With Trudeau stepping down, we are in a unique situation now where there isn't an incombent. It seems that a lot of Pierre's \"support\" was actually an anti-Trudeau vote, and with Trudeau gone that support seems to be shifting to Carney.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "S99B88",
                            "body": "I think you’re forgetting the CPC voters who are old time PC (pre merge with Reform) who are suddenly looking at Pollievre and realizing it’s taken them very far from their values. And, Trudeau was quite left leaning but now he’s gone",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SPL_034",
                            "body": "Number 3, if I were to hazard a guess, is the reaction we are seeing. I think Trudeau fatigue was absolutely real and the post-Covid economic realities faced by a lot of the people (especially millennials) who voted for him in 2015 played into that......but Trump has turned a lot of people away from the Cons ( the messaging strategy used by Poilivere in 2023 and 2024 is biting him now).\n\nIt really is a shame about the NDP...I think the appetite for a worker-centric, progressive party has never been stronger...but the messaging from Singh and the rest of the party leadership is exceptionally weak.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ChaosBerserker666",
                            "body": "Number 4 is huge based on what my family and friends are saying.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FriendlyGuy77",
                    "body": "Instead of blaming voters perhaps some critism of Pierre is warranted.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RickMonsters",
                    "body": "Why would we see massive immigration again? That was a very specific policy done to handle post-covid economic issues that all parties at the time agreed was necessary",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BigButtBeads",
                            "body": "Carney speaks at century initiative functions with Blackrock, and chaired a trillion dollar real estate portfolio\n\n\nNot to mention hes both goldman sachs, and a central banker, whom both love endless debt slaves \n\n\nI believe the mass immigration will continue, and nothing will change except 1 bathroom townhouses will be $3 million",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bluecar92",
                                    "body": ">Carney speaks at century initiative functions with Blackrock\n\nI find it funny that a world renowned economist, and former head of both the Bank of Canada and Bank of England, being asked to speak about the economy is somehow a black mark against him.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BigButtBeads",
                                            "body": "Why would that be funny? It's sole purpose is to further bloat their real estate portfolios by having you compete and outbid an additional 60 million people for basic shelter\n\n\nTrudeau added just 5.5 million people. And look what happened to the housing crisis",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bluecar92",
                                                    "body": "Well Mr. BigButtBeads, the fact that he's asked to speak at these events doesn't necessarily mean that he personally endorses these groups or their mission. But it does mean that he's widely recognised as an expert on economic issues and a variety of groups want to hear what he has to say.\n\nI find it funny that people think being an expert on something as important as \"the economy\" is a bad thing, especially as we are heading into a trade war with the US.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "mangongo",
                                    "body": "Century Initiative ties immigration growth to GDP growth. \n\n\nThe only way we will ever grow as an economic superpower is to engage in programs such as this, keeping in mind that housing needs to keep up with immigration, and that we do need to play catch up in that regard, but these are all things Carney has already stated himself.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Intelligent_Baby_812",
                    "body": "It shows you how deeply PP has fumbled the bag",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Seebeeeseh",
                    "body": "What policies have the cons put forth that will make healthcare better? The housing crisis? \n\nLabour and wages were the lowest they've been in 50 years under Harper. \n\nLiberals haven't done a very good job. But I'm not automatically replacing them with someone worse just out of spite. \n\nShow me some good ideas and stand up to Trump and you'll win those votes back.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Seebeeeseh",
                                    "body": "You are just making stuff up.\n\nNo where did PP state that he would cut immigration levels in half. He said that he would tie immigration to housing levels. But failed to state what that would look like. And it's corporate pressure that is behind all these immigration levels. You think the Cons don't have business lobbyists banging on their doors and filling their pockets with donations to keep that cheap labour flowing? I have a bridge to sell you.\n\nAnd They would allow for more growth and development? Growth and development in what exactly? And how would they do that? Such a vague non-statement.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "S99B88",
                    "body": "Do you not see that the Liberals most recently did reduce immigration? Why is there this tendency to take everything, be they things happening across the world, things that were provincial responsibilities, things that have been addressed and corrected, and just blame absolutely all of it on one guy, oops wait, we have to change that one party now that Trudeau’s gone.\n\nDo you have some crystal ball that tells you what Carney is going to do? Must things always be the way they used to be for ever and ever?\n\nAnd wake up and smell the coffee, Pollievre has gone too far. He convinced the whole world that Canada was “broken,” all while he seems to have managed to grow his net worth from $5 million to $20 million. Yet his wife, who’s it’s reported is worth a few million in her own right, has ads complaining that Canada hasn’t fulfilled its promise of her kids being able to afford houses. People aren’t buying what he’s selling anymore",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "snipingsmurf",
                    "body": "Aren't you excited for 14 consecutive years of power with a completely flat gdp per capita and 1.2M dollar homes ?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Swooping_Owl_",
                    "body": "I was planning on voting conservative until Carney became leader.  PP has looked very weak in his response to Donald Trump.  His recent slogans seem like cheap japs catering to people who are unable to manage their money and are looking for someone to blame.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Phenyxian",
                    "body": "I'm not sure how you can take a leader like Pierre, who doesn't have to lie and misrepresent at every turn yet chooses to do so, and compare that to Carney.\n\nI have not lost my mind. I find the CPC leader to be lacking in morality and integrity. I will not entertain his legitimizing of Republican talking points around 'woke' and 'radical leftists'. \n\nI need adults to be in the room, and then we can debate the ideas they have. I'm not going to listen to the debased ramblings of the CPC leadership.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "maximm",
            "body": "Cons just looking for another thing for pp to hate, then they will get back in the game.  Now they have help from the us/russia team.",
            "score": 1,
            "replies": []
        },
        {
            "author": "torontoker13",
            "body": "Apparently not enough people saw the clips of carney being asked questions in Europe yet.\nHe will show the country who he really is soon enough.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SellingMakesNoSense",
            "body": "I feel like the long, long, long, list of scandals and corruption of the last decade just don't matter to Canadians anymore. \n\nIt truly baffles me how we can go through so much.\n\nSNC Lavalin  \nThe SNC Lavalin donation scandal   \nWe Scandal  \nEthics Commissionaire Violations    \nArriveCan   \nSister-in-Law Ethic Commissionaire Scandal (Dominic LeBlanc's SIL being named to the impartial office)  \nThe numerous government contracts and tenders that went to improper sources/ conflicts of interests  \nThe large amounts of unaccounted for spending  \nMary Ng's sole source contract  \nTheir part of the Phoenix scandal, lack of commitment to fixing it\n\nI really wish Canadians cared more about corruption and cronyism.",
            "score": 1,
            "replies": [
                {
                    "author": "rainman_104",
                    "body": "No right now we care about threats made to our sovereignty and don't want a doofus put in charge defending that.  \n\nCarney is the perfect person to be our PM.  He's very smart.   PP has a BA from U of C.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SellingMakesNoSense",
                            "body": "There are threats foreign and threats internal. A $62 billion per year deficit, doubling of our debt, 15% of all pandemic spending being fraud (according to the PMO), numerous scandals.\n\nRegardless of Carney, he's the leader of a party proven to be filled to the brim with crooks and corruption. In any other era, it would be a death spiral for a party to have so many major scandals. Harper had $16 orange juice scandal, the current Liberal government had multiple scandals into the billions of dollars.\n\nIf anyone actually thinks that this band of crooks is going to do any better to protect our sovereignty even though its the government who repeatedly cut military funding (even weeks after promising our allies we would meet our quotas), who alienated so many of our allies, who did absolutely nothing to improve our place in the world, who allowed multiple security threats to our land through the relaxation of immigration policies and standards.... it's foolishness.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "rainman_104",
                                    "body": "Yeah man meanwhile PP is stroking the clownvoy folks.   That's just awesome.    Shaking hands with extremists.\n\nWe don't need that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SellingMakesNoSense",
                                            "body": "So... you'd rather the guy who drew considerable attention while leading the Bank of England for attending dinners with Prince Andrew after the accusations had come forward?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "rainman_104",
                                                    "body": "Yes because he is very connected with parties that are not USA.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lopsided-Echo9650",
                    "body": "That list is just a preview of the LPC corruption, and now we might see the full force of the Canadian government leveraged on items that boost Mark Carney's personal interests. Nothing matters anymore.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dougustine",
                            "body": "There is an election to be held and I think carney may not actually win. Especially if the honeymoon period ends",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Parking4569",
            "body": "Do we think that a liberal lead could prompt serious election meddling by not only the usual suspects (China, Russia, India) but also the United States?",
            "score": 1,
            "replies": [
                {
                    "author": "heyhey922",
                    "body": "Trump is already openly meddling, boasting about getting Trudeau out and complaining about the Liberals using the Tarrifs politically.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhispyWillow7",
            "body": "I don't want to give you more money, and would like more for my quality of life that I work for. I'm sure that people will automatically designate me to a political side and belief system regardless of any other factors based on that alone.\n\nThat also clarifies the purpose of the political side they are on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZhopaRazzi",
            "body": "This is Pierre’s race to lose. No matter how amazing and smart Carney might be, he’s still leading the same party that put Canada into the mess it is right now. It is this version of the liberal party that needs to be hollowed out. The fact that Pierre is at risk of losing underscores how weak and unlikeable he is as a leader - and how much people hated Trudeau.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Individual_Cheetah52",
            "body": "I'm sorry but I'm absolutely not buying this fucking bonkers propaganda campaign. Your average Canadian didn't suddenly forget Trudeau and the Liberal party's near complete mismanagement of internal policy over the last decade. Nobody just out of the blue in the last fews months has drastically changed their minds on who they're voting for, as is that even a common occurrence anywhere else at any other time. \n\nConservatives are still winning a majority government; at the VERY worst a near miss minority government. Nobody, besides chronically online redditors, believes that Poilievre isn't making a stand against Trump in a proper manner. \n\nIn case you couldn't tell,  nobody (besides the mainstream media) on the planet has been happy with left wing politics for quite some time now. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Keepontyping",
            "body": "Simple challenge - Poilievre says Canada 1st. Liberal voters disagree. Which country should be 1st Liberals?",
            "score": 1,
            "replies": [
                {
                    "author": "professcorporate",
                    "body": "ROFL\n\nI mean, I suppose it makes sense that Timbit Trump's prairie base would have a lot of straw for those men...",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}