{
    "title": "Why is anarchism always portrayed as violence and chaos?",
    "author": "F4113N_4nG31_",
    "subreddit": "Anarchism",
    "rank": 126,
    "score": 271,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 86,
    "url": "https://www.reddit.com/r/Anarchism/comments/1itutty/why_is_anarchism_always_portrayed_as_violence_and/",
    "id": "1itutty",
    "selftext": "The media often paints anarchism as chaos, violent protests, destruction, and a lack of structure. They say it’s an ideology of disorder, embraced by the uneducated and reckless. But is that really what anarchism stands for?\n\nFigures like Peter Kropotkin, Emma Goldman, and Mikhail Bakunin argued that anarchism is about cooperation, mutual aid, and the rejection of oppression in all forms. Instead of rulers and enforcers, anarchism envisions a society built on voluntary association and shared responsibility.\n\nSo why is anarchism always framed as a threat rather than a solution? Is it because true freedom and self-governance challenge the very foundations of power? Or is there something about anarchism itself that makes it easy to distort and dismiss?",
    "comments": [
        {
            "author": "ThalesBakunin",
            "body": "It is framed as a threat because it is a threat to the people who have power over the masses.\n\nIt isn't a threat to someone who doesn't lord authority over others.",
            "score": 293,
            "replies": [
                {
                    "author": "Plaguedoctorsrevenge",
                    "body": "I think a great deal of projection goes along with it, most of these people are tipping their hand at what they would do if they felt they had no consequences to face",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Cpt_Folktron",
                            "body": "Also what they think everyone else would do, believing themselves to be the only ones capable of self control. Big part of white supremacy that.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DarthRandel",
                    "body": "Simple as",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "bigjollyride",
            "body": "Anti state ideologies are always scary to the state.",
            "score": 140,
            "replies": []
        },
        {
            "author": "phoenixhunter",
            "body": ">Is it because true freedom and self-governance challenge the very foundations of power?\n\nhonestly yeah this is about the sum of it; i don't think there's anything much more complicated or deeper to it than that.\n\nthose who hold power seek to keep it, and they have an enormous and wide-reaching propaganda machine to convince people that the alternatives to oppressive power structures are dangerous to the people *themselves*, rather than just dangerous to the power structures which oppress those people.\n\nanarchy = chaos\n\nsocialism = gulags\n\nmutual aid = personal weakness\n\nit's why i always point people to graeber's \"[are you an anarchist](https://theanarchistlibrary.org/library/david-graeber-are-you-an-anarchist-the-answer-may-surprise-you)\", because it so succinctly demolishes the red scare lies that people are fed about what is ultimately the natural human propensity to be social co-operative creatures.",
            "score": 71,
            "replies": [
                {
                    "author": "PaganWhale",
                    "body": "uhmm, mutual aid is actually communism, checkmate liberal",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "WaxMaxtDu",
                    "body": "Hitler = Communist",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Square_Radiant",
            "body": "The same reason that they called Luigi a terrorist - did you experience \"terror\" as a result of his actions?\n\nYou might also like to read Goldman's Anarchism and Other Essays - when you look at the events around the Haymarket and the notoriety that a well-spoken free-thinking woman received (dios mio, we can't have that) you can see who thought that anarchy is chaos and why that idea might have been rolled out to their subjects",
            "score": 49,
            "replies": []
        },
        {
            "author": "SubterFugeSpooge",
            "body": "\"All who gain power are afraid to lose it.\"",
            "score": 18,
            "replies": [
                {
                    "author": "OwlHeart108",
                    "body": "Unless they find what's even better than power: Love ❤️",
                    "score": 8,
                    "replies": [
                        {
                            "author": "DarthRandel",
                            "body": "https://pbs.twimg.com/media/FajFn-zXkAANm6q.jpg",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "OwlHeart108",
                                    "body": "Fascism relies on fear. Where there is love, there is no room for fear.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "zenmasterdredd",
            "body": "The U.S. and western capitalists have always portrayed any group or movement that opposes capitalism and western imperialism as \"radical\" and \"dangerous\". If a group of civilians rise up against their government in another country the West will call them one of 2 things, \"freedom fighters\" if they support U.S and Capitalism, or \"Terrorists\" if they support ANYTHING that opposes those ideals. It's a game of propaganda that has been going on for longer than any person has been alive. After the Nazi party fell, the U.S. needed a new \"enemy\" to fight against in foreign affairs, a \"reason\" to invade foreign lands in favor of their own capitalist motives. So the U.S. turned on the communists, that primarily won WWII, because they weren't capitalists. They used this opposition to capitalism as an excuse to meddle in foreign affairs and send either the CIA, or the actual military, to secure U.S. interests around the world. It's one of the biggest propaganda theaters(psy-ops) in modern history, the myth that communism, or any groups not capitalist, are inherently \"evil\".",
            "score": 16,
            "replies": []
        },
        {
            "author": "GlassAd4132",
            "body": "Because actually telling people what the word means might make people actually realize that the people who rule us are not capable of ruling us, that people are better at ruling themselves, that all the things that elites tell us we need them for are better handled by us.",
            "score": 8,
            "replies": []
        },
        {
            "author": "partylikeyossarian",
            "body": "(some Western-centric thoughts ahead)\n\nSome people believe hierarchy to be \"natural\". To oppose illegitimate hierarchies looks to them like opposing nature, therefore violent. Some people cannot imagine order outside of rigid hierarchy, they interpret this unknown as chaos.\n\nSome people conceptualize all human relations through the lens of coercion. (For example a recent ex of a friend framed their mutual aid network as \"I don't know what kind of leverage so-and-so has over you\"). I think people have been groomed to accept coercion from the state (and capital) as orderly and acceptable. If someone cannot understand organizing on the interpersonal level without coercion, they may see anarchic types of organizing as somehow infringing upon the state monopoly-on-force, and therefore violent.\n\nChristianity, as popularly practiced, is often big on obey this and submit to that. Anarchism feels spiritually offensive to even a lot of secular people raised under Christian-influenced norms.\n\nFear of Mob Rule runs deep through the history of Liberalism as applied by elites who shaped governments.\n\nTriangulation of political ideologies to paint neoliberalism as the Goldilocks zone. Planned economies are too authoritarian. Decentralization requires too much fragmented decision-making. The pyramid of meritocracy? Just right.\n\nAgents of manufactured consent tend to portray all resistance to establishment violence as inherently illegitimate.\n\nAt risk of getting too Freudian: a lot of people just *feel* a need for a Big Daddy (sometimes Mommy) in a Big Chair giving orders and reassurance from on high. On an emotional level, they see anarchism simply as something that threatens the structure on which they depend on for a feeling of psychological security.\n\nPoor humanities education combined with low quality social relationships can stunt the ability to understand some seemingly basic concepts surrounding interpersonal organizing.\n\nSome people fundamentally do not believe in human liberty and voluntary association. They just, don't believe in it. And everything that comes after that is just backwards justification.",
            "score": 6,
            "replies": []
        },
        {
            "author": "zenswashbuckler",
            "body": "Same reason punk rockers in 80s movies are all aggressive, knife-wielding thugs. If they showed the compassion and humanity these communities are based on, the proles might find that attractive and heavens to betsy we can't have *that*!",
            "score": 7,
            "replies": []
        },
        {
            "author": "CapmLongFingr",
            "body": "Because both dominant political spectrums are extremely anti-communist in every way.",
            "score": 6,
            "replies": []
        },
        {
            "author": "SiQSayaDjin23",
            "body": "They just constanty creating fear.\nIn every possible and impossible way.\nThey run on fear.",
            "score": 4,
            "replies": []
        },
        {
            "author": "NoUseForAName2222",
            "body": "So we won't be taken seriously ",
            "score": 5,
            "replies": []
        },
        {
            "author": "Serendipetos",
            "body": "Anarchists, seen as propaganda-of-the-deed murderers,  were a primary bogeyman in the imperial core in the early 20th century in the same way communists would be after the October Revolution. Some high-profile assassinations and bombings were magnified by the media into a brush which has tarred us ever since.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MrCaptainDickbutt",
            "body": "It's literally just the Media/ruling class stigmatising it to delegitimise it as a competing concept. Look at what Americans did to communists and socialists - commie is a pejorative.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Agent_W4shington",
            "body": "Because that perception benefits the state",
            "score": 3,
            "replies": []
        },
        {
            "author": "AKAEnigma",
            "body": "Look at who's portraying it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "EDRootsMusic",
            "body": "The people who have the money to fund large media works like movies and TV typically do not have much reason to sympathize with anarchism, or bother studying it enough to understand it. Moreover, violent scary terrorist anarchists make compelling villains for lazy writers. It would be a lot of work to make a compelling story about a society built on reciprocity, mutuality, federation, and horizontal power relationships.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jotundaggers",
            "body": "imo, to discourage folks from looking deeper into it. exhibit a: my own mom, who gets scared when i say the word 'anarchist' in any conversation because she thinks it means molotov cocktails and no order and chaos. \n\nif it's been widespread that anarchy = pure chaos and violence, it's a threat, and people don't like to feel threatened, leading them to just turn their backs on the idea entirely with no further questions or research. the masses are conditioned to see it this way so they're easier to control, or just fall into far-right territory leftism and see that as the most extreme they can be.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AustmosisJones",
            "body": "Because it's the thing they hate the most. They would rather tolerate actual Nazis than anarchists.",
            "score": 3,
            "replies": []
        },
        {
            "author": "acareeningdirigibug",
            "body": "I can't prove beyond a reasonable doubt as to why. \n\nThe common belief is \"it goes against those with power, and those with power have too much power\". \n\nI would say this is accurate. I am writing this from a north American perspective. I dropped out, i completed part of grade 10. I never got to see the curriculum for my own eyes beyond that. However i think the curriculum is mainly to blame. From what I've heard, (please feel free to tell me what you learned about anarchism in history class), it seems the curriculum has provided students with the most extreme cases of anarchism. By this, they tell mainly the stories of the insurrectionists. \n\nOf course violence has existed in anarchism. But violence has existed in every political/religious movement. Even broad groups that have toted themselves on being pacifists have had violent sub groups. Take Christianity for an example. Its safe to say not all Christians are violent. Some are just normal people that walk over to their toaster every morning, and head off to work, living the most simple lives like everyone else. But there are also Christian extremists who have committed heinous acts of violence in the name of Christianity. The problem isn't any particular group, the problem is that, violence has been a go to answer for a long time. We have relied on violence being a solution to problems that either do or don't exist. By we i mean all of humanity. At some point we push the envelope of morality.\n\nI think the education system doesnt have a pluralistic system of political education. I believe all tolerant political movements should have a fair shot in terms of how they are portrayed. By that, i mean intolerant political movements such as fascism have no place in any society to be viewed as legitimate. Outside of that i think we need more pluralistic attitudes. \n\nInstead of being bias towards classical liberalism and conservatism, i think we should take an approach in which we try to convince learners of every single political movements validity (minus nazism and hateful obviously toxic ones). Make solid objective persuasive detailed arguments for every movements validity, as to give it all a fair shot. And let people decide from there what they want to accept. \n\nHow it is now, it seems maybe its lopsided. And from that, we have the societal collective false understanding that \"anarchy is just chaos\". \n\nI might be wrong about lots of this, its just my own thoughts. I hope this helps you answer your question. Peace and love.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Separate_Ticket_8383",
            "body": "One of the most beautiful representations of Anarchy Ive ever read is in Ursula LeGuins beautidul sci-Fi novel, \"The Dispossessed\". She envisions anarchy deeply inspired by Daoism which has its own unique expression of anarchy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ivanaglob",
            "body": "I think they have brainwashed people into believing capitalism is human nature and without the state we'd go savage and start killing and raping left and right.\n\nThat's what power wants. To be perceived as INEVITABLE.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BeneficialDay9563",
            "body": "Beacuse if not it would make too much sense.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jerby17",
            "body": "Propaganda is a hell of a drug.",
            "score": 2,
            "replies": []
        },
        {
            "author": "authorityiscancer222",
            "body": "Because anarchy meant chaos before edgelord Proudhon got ahold of it",
            "score": 2,
            "replies": []
        },
        {
            "author": "schem",
            "body": "Everything else isn't really a threat to the status quo",
            "score": 2,
            "replies": []
        },
        {
            "author": "Anarchy_Coon",
            "body": "Statist propaganda isn’t it obvious?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Previous-Task",
            "body": "Because it's the real threat to the powerful. They need it to be misunderstood. It's propaganda 101, always go for the anarchists first, they're the real opposition.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fickle-Ad8351",
            "body": "Mind control. It's intentional so that people won't want it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "EasyRNGeezy",
            "body": "it's just bullshit",
            "score": 2,
            "replies": []
        },
        {
            "author": "DefunctFunctor",
            "body": "Something to keep in mind is that \"anarchy\" was originally a synonym for \"chaos\". It's not the case that anarchy developed as a concept in the 19th century and thereafter gained the meaning of \"chaos\" by those who opposed it. Rather, the first anarchists took the existing word and developed a new meaning out of it. So even without the perceptions of anarchism as an ideology, you have to contextualize that you are talking about something different. There are other factors of course, such as the first red scare; even if anarchism didn't have a name problem, the development of socialism proves that it would still have an image problem. But the etymological association with chaos and violence makes it very easy to highlight certain incidents",
            "score": 6,
            "replies": [
                {
                    "author": "Square_Radiant",
                    "body": "Looking at the etymology, I'd love to see your sources citing it as a synonym for chaos?  \n1530s, \"absence of government,\" from French *anarchie* or directly from Medieval Latin *anarchia*, from Greek *anarkhia* \"lack of a leader, the state of people without a government\" (in Athens, used of the Year of Thirty Tyrants, 404 B.C., when there was no *archon*), abstract noun from *anarkhos* \"rulerless,\" from *an-* \"without\" (see [an-](https://www.etymonline.com/word/an-#etymonline_v_13376) (1)) + *arkhos* \"leader\" (see [archon](https://www.etymonline.com/word/archon)).",
                    "score": 12,
                    "replies": [
                        {
                            "author": "DefunctFunctor",
                            "body": "Perhaps \"etymology\" was the wrong word to use. Yes, it etymologically means \"without rulers\", but also gained an association with chaos well before people started calling themselves anarchists. The OED cites, for instance:\n\n* **1667** Milton *P.L.* x. 283 The waste Wide Anarchie of Chaos. **1821** Byron *Sardan.* i. ii. (1868) 356 The satraps uncontroll'd, the gods unworshipped, And all things in the anarchy of sloth.\n* **1656** Cowley *Chronicle* ix, Thousand worse Passions then possest The Inter-regnum of my Breast. Bless me from such an Anarchy! **1713** Steele *Englishm.* No. 7. 44 The Licentious are in a State of barbarous Anarchy.\n* ***a*****1661** Fuller in Webster, There being then‥an anarchy, as I may term it, in authors and their reckoning of years. **1719** Young *Revenge* iv. i, No more I'll bear this battle of the mind, This inward anarchy. **1754** Chesterfield in Boswell *Johnson* (1816) I. 237 Our language is, at present, in a state of anarchy.\n\nEdit: Just as further evidence anarchists were aware of this association, here's the first few paragraphs from Malatesta's *Anarchy*:\n\n>The word Anarchy comes from the Greek and its literal meaning is *without government*: the condition of a people who live without a constituted authority, without government.  \n\n>Before such an organisation had begun to be considered both possible and desirable by a whole school of thinkers and accepted as the objective of a party, which has now become one of the most important factors in the social struggles of our time, the word anarchy was universally used in the sense of disorder and confusion; and it is to this day used in that sense by the uninformed as well as by political opponents with an interest in distorting the truth.  \n  \n>We will not enter into a philological discussion, since the question is historical and not philological. The common interpretation of the word recognises its true and etymological meaning; but it is a derivative of that meaning due to the prejudiced view that government was a necessary organ of social life, and that consequently a society without government would be at the mercy of disorder, and fluctuate between the unbridled arrogance of some, and the blind vengeance of others.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Square_Radiant",
                                    "body": "Interesting - I do wonder whether this has more to do with colonial notions of \"civilisation, authority and blasphemy\" than chaos, I'll do some more exploration",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ventomar",
            "body": "Razão simples:  \nQuem retrata e difunde anarquismo dessa forma?\n\nVindo de quem vem essa mentalidade, não poderia ser diferente, afinal são justamente quem nós combatemos.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bulky_Mix_2265",
            "body": "Projection, the people who feel that is what anarchists would do if empowered would themselved do these things is empowered.\n\nFor examples see current American administration, chaos, destruction, and the looming threat of violence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DirtyPenPalDoug",
            "body": "Same reason pirates are the baddies. The colonial powers sold slaves, did horrific killing, he'll even stole their own people from the docks to enslave as crew for ships...\n\nPirates didn't have a state.. but they go all genocide most the time. Split up what they got, took on new pirates, cared for their injured as best they could...survived in a world where colonial  powers where genocidal slavery selling fucks.\n\nBut they were the baddies,  they threatened the state.. the brits, the Spanish, all the good guys.. ignore their wars. Slavery and genocide, that was legal after all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cybin333",
            "body": "If people think they need to be controlled then they'll be okay with it so they need to make it seem dangerous",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaintValkyrie",
            "body": "I think it's propaganda. \n\nIt has two definitions. One is to live without governmental authority controlling you through free will and choice, snd the other definitions is looting and shooting and chaos and fire oh my. \n\nThat's like saying medicine can either mean a life saving or life improving substance that can improve your health, but the other definition means poison and kicking puppies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Edu23wtf",
            "body": "Tbh i think the way people view anarchism in general is way too easy to distort and that's why it's so hard to convince people of anarchism. I did in the past 2 months tho, and thanks to andrewism",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/blue-red-mage - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cpt_Folktron",
            "body": "The family of man at times produces monsters such that their pleasure only arises from the suffering of others, and morally perverted men use the terror these monsters inspire to manipulate the fearful into willful submission.\n\n:D",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Instruction-3653",
            "body": "Because under this system of Capitalism and Statism they need Anarchism to be portrayed as chaos to benefit their status quo, and keep the masses indoctrinated in Capitalist thinking. As long as they control the narrative of what is beneficial for the working class they maintain their image and status quo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dallasrose222",
            "body": "Because the term anarchy is over 500 years old and a lot of people just play word association and don’t thing further",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fickle_Air2092",
            "body": "Because Anarchists liked to bomb things back in the day",
            "score": 1,
            "replies": [
                {
                    "author": "Fickle_Air2092",
                    "body": "And propaganda",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AC_KARLMARX",
            "body": "it is a frame, generally done by wealthy, powerful and more power hungry, serious people, using media etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Epona44",
            "body": "Because people don't take the time to learn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SurveyMelodic",
            "body": "Anarchism is what the state and corporation says it is",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lord488GTB",
            "body": "If you want a historical answer, the characterisation of anarchists as lunatic bomb throwers dates all the way back to the mass media hysteria surrounding propaganda of the deed in the 1880s and 1890s, especially in France and western Europe. There were many well-known 'anarchists' such as Ravachol and Emile Henry, who were seen (somewhat correctly imo) as deranged psychopaths willing to kill indiscriminately.\n\nPropaganda of the deed started well enough with admirable efforts like the Benevento uprising, but at the end of 19th century individuals who often only had tenuous links to the larger anarchist movement were commiting violence for violences sake and calling it propaganda of the deed in an effort to rationalise it.  \n\nUnfortunately, this period of anarchist history was when the movement was the most publicised in the mainstream press and had the greatest impact on the public imagination, at least in Anglophone countries, and the image of the crazed bomb thrower has been difficult to shake in the 130 years since.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anarcho_Humanist",
            "body": "To be fair to the anti-anarchists, most people are pretty terrible at grasping opposing political ideologies. I'm included in this.\n\nBut for anarchism specifically... it's an ideology that fundamentally threatens powerful, well-connected people. These are people who are willing to murder, lie and destroy entire nations to keep themselves in charge, lying about (let's be honest) obscure and niche political theories is 100% in their playbook.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jfishdog",
            "body": "Destruction is a natural part of creation. Destroying oppressive systems allows people to flourish",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/Previous_Scene5117 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnxietyFrequent5305",
            "body": "The government is fearful of people actually understanding the truth behind anarchism and is afraid of the people realizing that the government is evil. they portray anarchy as chaos because they're afraid of their oppressive system being overthrown and raided by people who gathered around to help take down their oppressors. The stereotypical violence and fires in the street is used to make people afraid of anarchism and leads them to believe that anarchy will get them and their family killed and that it's bad for society. The government is afraid of losing their control over the people and the freedoms that they've restricted from having, which makes big money and big satisfaction for the greedy politicians. this isn't always the case or what some people believe, but this is just my personal take on it and why I've become an anarchist.  \nanarchy isn't some \"ideology of disorder\" it's an ideology based off of seeing through the lies of the government and what they really intend. They make anarchists look bad so others can't join in support to change society for the better and make changes that really benefit the people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elegant_Rice_8751",
            "body": "It is not possible to be achieved by peace as many people told me when I asked this question before.",
            "score": 1,
            "replies": [
                {
                    "author": "ThalesBakunin",
                    "body": "My wife and my praxis actually prefer to try to bring it about from a ground up approach that wouldn't be inherently violent.\n\nWe work with children and just promote a very anarchist lifestyle view and try to promote independent and critical thinking along with compassion, community and respect.\n\nWe hope if we can get enough kids with the right message for long enough we could change it from within.\n\nOur naive fantasy would be to simply make government obsolete.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "eatpackets",
                            "body": "Practical Anarchism subscribes to this view. Lifestyle praxis and the larger picture don’t have to be mutually exclusive. \n\nGood on ya!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Elegant_Rice_8751",
                            "body": "Anarchism cannot be manifested without a revolt or revolution because those in power will never give it up.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ThalesBakunin",
                                    "body": "What I am talking about absolutely is a revolution, it just isn't inherently violent.\n\nIf you mean to imply it can't manifest without a violent revolt, I patently disagree. \n\nIn which case I'd like to see the proof of your assertion.\n\nI think if you want change you need to do it by supporting the children of today.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Elegant_Rice_8751",
                                            "body": "On my posts I inquired if ‘‘twas possible for a democratically elected party to bring about Anarchism. Almost everyone said no.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ThalesBakunin",
                                                    "body": "I would also say that is a big \"no\"\n\nBut those two concepts are not mutually exclusive to me.\n\nI don't think a democratically elected party in the US (or anywhere) could achieve Anarchism.\n\nBut I also don't think it has to be done with a violent overthrow.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Elegant_Rice_8751",
                                                            "body": "How would it come about because something that cannot democratically be achieved is not worth it",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ThalesBakunin",
                                                                    "body": "How would violence be democratically condoned in your scenario?\n\nThe issue you just made would also be an issue with your violent approach too.\n\nI don't know of any democracies that actually are representative of the total population.  They are catered to promote the rights of a certain group.  So I disagree with your statement already.\n\nYou presume so much about my stance based on things that aren't inherently dictated as you state.\n\nAn example, just because I don't like the color blue it doesn't imply I like the color red.\n\nYou keep making assertions that aren't linked in my mind.\n\nI don't think our representative democracy would ever bring about Anarchism.  I also don't think a violent revolution will.  I see no issues in holding both ideas.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Elegant_Rice_8751",
                                                                            "body": "Then how? If democracy doesn’t work nor does autocracy through a revolution, then how does this get achieved?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[deleted]",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Elegant_Rice_8751",
                                                                                            "body": "A naive fantasy as you so rightly put it. But this will never amount to anything. Real change needs action",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "[deleted]",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Elegant_Rice_8751",
                                                                                                            "body": "What exactly are you implying about me, sir?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "[deleted]",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Elegant_Rice_8751",
                                                                                                                            "body": "Sir, I am a minor and can do very little to change anything. I am just trying to pass my iGCSEs at the moment.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "None",
                                                                                                                                    "body": "[deleted]",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Elegant_Rice_8751",
                                                                                                                                            "body": "Is jy Amerikaans?",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Elegant_Rice_8751",
                                                                                                                                                    "body": "Please ignore that",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        },
                                                                                                                        {
                                                                                                                            "author": "Chemical_Bar_9842",
                                                                                                                            "body": "I don’t believe he’s dismissing your actions and I’m sure he absolutely appreciates that you have put forth so many hours into your craft because I know I do but realistically you and thousand others have put millions of hours across the globe into peoples heads and we’ve been at an impasse. The end of the day the government will not give up the reigns on its control of the people and what is taught/learned to the masses. The only way anarchy could truly work and work somewhat well is on the brink of our government decline/fall. But I don’t see it not being a violent matter in the beginning if hypothetically it did happen.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Elegant_Rice_8751",
                                            "body": "The most recent one on my posts",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Worried-Rough-338",
            "body": "I’d argue that the media doesn’t paint anarchism as violent and chaotic (the media rarely discusses at all) but rather paint anarchy as violent and chaotic, which it is.",
            "score": -4,
            "replies": [
                {
                    "author": "No_Thatsbad",
                    "body": "I actually think you’re doing the same thing OP is pointing out. Your idea of anarchy is based on a media-constructed definition rather than what it actually is.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Worried-Rough-338",
                            "body": "I guess in my head I make a distinction between anarchism as a thoughtful political theory and anarchy as a Mad Max cliche of lawlessness. I understand that in anarchist discourse, the term anarchy has a more precise meaning.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "No_Thatsbad",
                                    "body": "I see what you mean.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}