{
    "title": "Short stories by H.G. Wells: my impressions",
    "author": "EndersGame_Reviewer",
    "subreddit": "books",
    "rank": 11,
    "score": 12,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/books/comments/1je1heb/short_stories_by_hg_wells_my_impressions/",
    "id": "1je1heb",
    "selftext": "**Still excellent a hundred years after they were written**\n\nFor a guy who lived almost half his life in the 19th century, it's amazing how well the fiction of H.G. Wells (1866-1946) has stood the test of time, and can still be enjoyed and appreciated by readers today.  An early pioneer of the science fiction genre, he's especially known for his novels, and four in particular stand out: The Time Machine (1895), The Island of Doctor Moreau (1896), The Invisible Man (1897), and The War of the Worlds (1898).  But it's not his novels, but his short stories that are the subject of this review.  He wrote over eighty of them in the course of his life, and I've read well over half of them.  These are my personal favourites which I enjoyed the most:\n\n* **\"The Story of the Late Mr Elvesham\"** (5 stars): A brilliant premise in which a young man's mind ends up in old man’s body. Is this where Tim Powers got the idea for his book Anubis Gates from?\n* **\"The Country of the Blind\"** (5 stars): Apparently a one-eyed man isn't king among the blind after all; at least that's what a man who ends up in an isolated region full of blind people discovers.  It's a brilliant reversal of perceptions and of what is normal, and shows the power of the collective against the individual.\n* **\"The Apple\"** (4.5 stars): More of a literary story, in which a schoolmaster is given an apple from the Tree of Knowledge by a stranger on a train.  While some biblical inaccuracies detract from the storyline, this more literary story has interesting things to say about knowledge and about sin.\n* **\"The New Accelerator\"** (4 stars): Suppose your inventor friend comes up with a drug that lets you speed up your actions to a thousand times those of everyone else, so you can move about them as if they're frozen?  It's a great concept.\n* **\"The Treasure in the Forest\"** (3.5 stars): More of an adventure story, this tells the tale of two men who hike into a secret forest to find a hidden treasure.  It's really the ending that made this for me, but it's a story that warns against the allure of wealth and unchecked greed.\n* **\"The Stolen Bacillus\"** (3.5 stars): Another story with a fun twist at the end, this is about a deadly cholera bacterium that apparently gets stolen by an anarchist.\n* **\"The Man Who Could Work Miracles\"** (3.5 stars): A man makes a strong argument against miracles, when he accidentally performs one.  What will he do next with his amazing power?\n* **\"Mr Ledbetter's Vacation\"** (3.5 stars): A vicar gets more than he bargained when he decides on a whim to step out of his usual calm character and seek adventure by performing a burglary.  Light, whimsical, and entertaining.\n* **\"The Magic Shop\"** (3 stars): A son pulls his father into a magic shop for a demonstration of magic tricks, but things take a sinister turn when the tricks become increasingly powerful.  The ending is somewhat ambiguous, and raises questions about what is real versus what is an illusion.  And is the point merely to highlight a need for protecting the innocence of children, or is there a deeper meaning about how we lose our sense of innocence and wonder as we get older?\n* **\"The Truth about Pyecraft\"** (3 stars): A lesser known but humorous and light story about a fat man who loses weight - literally!\n* **\"Answer to Prayer\"** (3 stars): A less popular story, but for me it made a strong impression in light of my religious beliefs.  What happens if a religious man who frequently goes through the motions of prayer actually prays from the heart, and gets an immediate answer?\n\nBesides \"Answer to Prayer\", all of the above titles are well-known and popular stories in the H.G. Wells' canon.  But there are plenty of other highly regarded stories Wells has written that deserve mention too.  While these wouldn't make the cut for me personally as personal favourites, clearly others respect and admire them very highly, and many of them are still decent stories worth taking a look at.\n\n* **\"The Door in the Wall\"**: This is more literary in nature, and often considered by many as Wells' best short story.  A man tells the story of a magical world he visited as a child but has never been able to return to.  Is it real or is it a dream?\n* **\"Dream of Armageddon\"**: Another common favourite for many.  A man dreams of a terrible future world war he could have prevented by choosing duty over love.  Again it raises questions about what is real and what is a dream, and about why we have a craving for pleasure and beauty.\n* **\"The Pearl of Love\"**: A prince who has lost his love resolves to build a glorious monument for her.  There's a shocking ending as he forgets his original intent.  The point is somewhat ambiguous, but some have interpreted this as a warning about how we can often make an idol of our loved ones and eventually forget them altogether in our worship of them.\n* **\"The Star\"**: An apocalyptic scenario as a star appears in the sky, and gets increasingly larger since it is on a collision course with earth.\n* **\"The Empire of the Ants\"**: Humanity is threatened by an ant that has evolved in an aggressive and intelligent way.  It's another story with an open ending, which to me felt unfinished and begged for more, although the concept is good.\n* **\"The Flowering of the Strange Orchid\"**: A rather decent story bordering on sci-fi horror, about an attacking orchid; but for me the ending was too abrupt.\n* **\"The Sea Raiders\"**: Another decent story that borders on sci-fi and horror, this time featuring giant squid-like creatures that attack people from the sea.\n* **\"Valley of Spiders\"**: More gothic horror, with giant spiders being the source of terror; really not my thing.\n* **\"The Cone\"**: A man takes terrible revenge on another man who was having affair with his wife.  Too gory for me, unfortunately.\n* **\"The Crystal Egg\"**: An unusual crystal egg proves to be a portal that enables remote viewing onto Mars.\n* **\"Aepyornis Island\"**: Suppose a castaway comes across a prehistoric egg ... and manages to hatch it?! Quite a decent story.\n* **\"The Red Room\":** A ghost story about a skeptical man who experiences the fear of meeting a ghost in a haunted house.  It's one of Wells' more popular stories, but just didn't interest me much.\n* **\"The Inexperienced Ghost\":** Another ghost story, this time about a man meets a ghost so pathetic that it can’t get back to the spirit world.  But a surprise is in store when the man tries to replicate the moves the ghost did to pass back into the vale of shades.\n* **\"The Triumphs of a Taxidermist\":** An interesting idea about a man who commits taxidermy fraud by forging existing birds and inventing new ones, but it feels more like a concept and isn't long enough for a story.  Also worth a look is the follow-up, \"A Deal in Ostriches\".\n* **\"Miss Winchelsea’s Heart\":** This story shows how Wells was capable of a wide range of different types of story.  It's about a pretentious woman who falls in love with a stranger, but her later regret after she first rejects him when she finds out his name is the undesirable \"Snooks\".\n* **\"A Slip Under the Microscope\":** A student confesses to accidental cheating and gets thrown out of university - but I was left wondering what the point of the story is.\n* **\"The Stolen Body\"**: Another \"out-of-body experience\" story, as a man has his body taken over by demon-like creature.  It's a clever concept, but a bit dark and not my favourite.\n* **\"Mr. Skelmersdale in Fairyland\":** This is about someone's impossible obsession for a perfect woman, but like some of Wells' other stories, just didn't sustain my interest.\n\nNearly all of the above stories are quite short and easy to read, which is remarkable considering how long ago they were written.  They also show that H.G. Wells was capable of a wide range of different types of fiction.  While the genre is predominantly science-fiction, some feel more like horror stories, others adventure stories, and others again are quite literary in nature.  Some of his speculative fiction anticipated later inventions that would be used in war such as aircraft (\"The Argonauts of the Air\"), and tanks (\"The Land Ironclads\").  I especially enjoyed his stories about fantastic inventions and concepts, as well as his more whimsical or humorous stories, and those with unexpected twists.  \n\nTo lend authenticity to his tales and make them more believable, Wells often uses a framing device, by having the story told by a character in the tale.  And while Wells was not a Christian and at times his atheist presuppositions show, he does sometimes work with Christian ideas and themes.\n\nBut in my view not all his stories are equally good.  For the most part his stories communicate remarkably well to modern audiences, but occasionally they do feel dated.  What was normal behaviour and within the daily experience of 19th century people can at times feel obscure to modern readers, e.g. some methods of transport.  At other times his stories end too quickly, and feel more like an exploration of a concept rather than a narrative tale.  The point of some of them is ambiguous and unclear, and while this may be an intentional stylistic choice on his part, it can sometimes be frustrating for the reader.  \n\nBut because they're all so short, it's worth wading through them to find the gems - and there are enough of them to make reading H.G. Wells short stories a rewarding exercise.  Start with some of the ones I've given highest ratings to, and go from there!",
    "comments": [
        {
            "author": "BigJobsBigJobs",
            "body": "I read these stories in a horrible falling apart paperback when I was very young.\n\nThanks for reminding me  - your reviews are quite good!\n\nThe Crystal Egg - which is like a prequel to WotW.",
            "score": 3,
            "replies": []
        },
        {
            "author": "richg0404",
            "body": "Is there a good collection that contains all or most of these short stories? I'm especially looking for an audiobook.",
            "score": 2,
            "replies": [
                {
                    "author": "EndersGame_Reviewer",
                    "body": "It's not an audiobook, but I used this free ebook, which is excellent:  \n\n[https://standardebooks.org/ebooks/h-g-wells/short-fiction](https://standardebooks.org/ebooks/h-g-wells/short-fiction)\n\nIt contains 54 short stories from Wells, compiled from five of his published collections.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "richg0404",
                            "body": "Thank you!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NekoCatSidhe",
            "body": "Interesting. I enjoyed his most famous novels, but never thought of checking his short stories. I should try reading them too.",
            "score": 2,
            "replies": []
        }
    ]
}