{
    "title": "What's the pettiest reason you've been mad at a book before?",
    "author": "tambitoast",
    "subreddit": "books",
    "rank": 2,
    "score": 145,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 565,
    "url": "https://www.reddit.com/r/books/comments/1je9imj/whats_the_pettiest_reason_youve_been_mad_at_a/",
    "id": "1je9imj",
    "selftext": "I was wondering if there has ever been any really ridiculous reasons people have been annoyed at a book? I'm asking, because I just finished a book and got mad at a really stupid detail.\n\nSo I just finished Crooked Kingdom by Leigh Bardugo. Loved the story, the characters, the writing, the setting, etc. Gave it 5/5 stars.\n\nHowever, I had already read the entire Shadow & Bone trilogy and Six of Crows prior to this and one detail at the end of CK really pissed me off. So Leigh Bardugo added a 'cast of characters' list at the end of that book which included how to pronounce the characters names. This also included the name of a character who appeared in all three S&B books, was mentioned in SoC and appeared in CK. For those wondering, it was >! Genya !<.\n\nAnd through that guide I figured out I was mispronouncing their name in my head the entire time. I got so annoyed, because my way of pronouncing it makes so much more sense to me. I'm still annoyed, so I wondered if anyone else has a funny/dumb/petty reason for being annoyed at a book/author.",
    "comments": [
        {
            "author": "Underwater_Karma",
            "body": "\"The Omen Machine\" by Terry Goodkind\n\nin a 500 page book, the word \"Prophecy\" appears over 400 times.  I downloaded a PDF so I could get a count and prove to myself I wasn't crazy.  \n\nthe worst part was I listened to the audiobook, and eventually realized I was cringing constantly...waiting for the next person to say \"Prophecy!\", and they did.  they always did.",
            "score": 154,
            "replies": [
                {
                    "author": "LadyLoki5",
                    "body": "This kinda thing drives me nuts too\n\nI got suckered into reading Fourth Wing for a book club, and the amount of times I read \"Xaden's jaw ticked\" was upsetting.  Bro needs a neurologist, sounds like he's got nerve damage lol",
                    "score": 69,
                    "replies": [
                        {
                            "author": "CriscoCamping",
                            "body": "I am middle aged male and read those, anytime they got horny I just skipped 3-4 pages. \n\nHave also done this with George Bernard Fraser. \n\nJust not what I read books for;  c'mon, we have online porn now.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ViolaNguyen",
                            "body": "Speaking of petty reasons to put a book down, if I accidentally bought a book with a character named Xaden, I'd immediately donate it to one of those little library boxes in my neighborhood.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DrunkRobot97",
                    "body": "You reminded me of a video that the YouTube channel Overly Sarcastic Productions did summarising the Aeneid. Every time reference was made to Aeneas' \"prophecy\", it was accompanied with an electric guitar riff.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Subservient_Foxy",
                    "body": "His books are notoriously famous around booktube. Not in a good way. And booktubers have faaaar more problems with this guy. Never read him. But what I've seen... Gosh. He is... Something. Like... Without being petty... Let's say I won't have a beer with him :p That's my prophecy.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "gyroda",
                            "body": "There's a reason for the \"Terry Badnasty\" nickname.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Talking_Waterfall",
                                    "body": "Terry Badmean as my wife and I say 😂",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Hartastic",
                            "body": "> Let's say I won't have a beer with him\n\nCOVID saw to that, unless you want to drink a beer in a graveyard.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "plastikmissile",
                                    "body": "Is that how he died? I don't recall his cause of death was ever disclosed. I mean, the timing works, and he's the kind of guy I can see refusing to wear a mask and exercise social distancing.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Hartastic",
                                            "body": "I don't know if we'll ever know for sure, but that seems to be the accepted theory based on the combination of the timing, his belief system, and the family's refusal to disclose anything about the how.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SolomonBlack",
                            "body": "Wizard's First Rule was... alright. Passingly clever maybe even. \n\nThe books only get more insufferable from there though.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "hamlet9000",
                            "body": "Whenever someone says they read four or five books in Goodkind's series, this means that they read the 100 page rape sequence in the first book (after which the plot just resets to what was happening before the rape sequence) and decided to keep on reading.\n\nMake of that what you will.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Skill3rwhale",
                            "body": "There's thousands of Fantasy readers that got into the genre when I was a teenager *because* of him and the Sword of Truth series. So I am thankful for that bit at least. \n\nEven as a teen when I was reading the series I just had to give up after the Jagang stuff atttempting to read Confessor. Bash your head with symbolism and poor writing for ages. \n\nBut my god is that series just not good. I tried reading it again and Wizard's First Rule is okay, but blegh to the rest upon rereading.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Leettipsntricks",
                    "body": "All his books suck\n\n\nThe prose and visuals trick you into thinking his stuff is good, but then it's just a penthouse kink editorial written by ayn rand and the concept of shitty technolibertarianism",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "a_shifa",
                    "body": "Omg, hard relate. I was in a book swap with a pal, the rules being you read the book and come back and discuss, they gave me On Photography by Susan Sontag (usually I love Sontag essays they’re great) however, on one page she mentioned the word Beauty 14 times, and then I obsessed over it and underlined it every time I saw it and had to painfully force myself to read 10 pages a day to finish it ahead of the reswap!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Trashgamer",
            "body": "the author made me read \"suckling the nubbin at the top of her sex\" with my two eyes",
            "score": 214,
            "replies": [
                {
                    "author": "thewizardsbaker11",
                    "body": "The thread is about the pettiest reason not the most traumatizing",
                    "score": 138,
                    "replies": []
                },
                {
                    "author": "69pissdemon69",
                    "body": "This ruined my day",
                    "score": 55,
                    "replies": []
                },
                {
                    "author": "Scared_Ad2563",
                    "body": "And now you've just made me read it with my two eyes!",
                    "score": 52,
                    "replies": [
                        {
                            "author": "Trashgamer",
                            "body": "i needed more people to suffer with me!",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "Scared_Ad2563",
                                    "body": "Well, now we are angry at you for a petty reason, lol.",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WildVariety",
                    "body": "Hey thanks to you I've finally read something that topped GRRM's 'her sex slick and steamy. Robert would have loved you, for an hour. The queen slid a finger into that Myrish swamp, then another, moving them in and out,'",
                    "score": 25,
                    "replies": [
                        {
                            "author": "SolomonBlack",
                            "body": "No fat pink mast for you?",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SJWTumblrinaMonster",
                    "body": "This reminds me of Justin Cronin's *The Passage* (I hope I'm remembering the right book). I found the book to be passably enjoyable right up until the birthing scene where he referred to the character's 'flower opening up' and that was it for me.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Daghain",
                    "body": "OMG I just snorted water out of my nose. That's AWFUL (and hilarious).",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "AllTheThingsSheSays",
                    "body": "Was the author Joey Tribbiani?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "yeonmena",
                    "body": "WHAT!!!! 😭😭😭😭😭😭",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cheesepage",
                    "body": "Also, the slowly gathering weight of his manhood.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Fappy_as_a_Clam",
                    "body": "I'm using this on my wife tonight.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ChaoticxSerenity",
                    "body": "What the what 😭💀",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EdgarsFlowers",
                    "body": "I feel harmed by reading this with my two eyes.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ViolaNguyen",
                    "body": "That's awful...\n\nBut I'll usually forgive bad sex writing because there's probably no such thing as good sex writing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thrownalee",
                    "body": "This is what you get for not learning Braille.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "positivelysandy",
            "body": "reading a book set in the us where the characters are american, seeing the word ‘singlet’ instead of tank top, and finding out the author is australian lol. \n\ntheir nationality wasn’t my problem, just coming across that word broke my immersion in the book.",
            "score": 286,
            "replies": [
                {
                    "author": "magpie-pie",
                    "body": "Same! When the setting and characters are British, but the American author uses American phrases on them. Like fall instead of autumn. Freshmen, Sophomore, Senior years. The book series is Scholomance by Naomi Novik btw.",
                    "score": 53,
                    "replies": [
                        {
                            "author": "Dogbin005",
                            "body": "I remember a Brit talking about how an American author had written an English character, who used the term \"soccer field\" in one book. \n\nIt completely broke their immersion because the British call it a football pitch.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "MyDarlingArmadillo",
                            "body": "That was so jarring, and it really wouldn't have taken much to check through it if anyone had cared. I'd point the finger at her editors as well, tbf, but it was just rather sloppy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "p_larrychen",
                            "body": "I couldn't put my finger on why that made me feel a little off in Scholomance until you pointed it out!\n\nStill my favorite of her stuff that I've read.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "uggaguggaunclejoey",
                    "body": "I experienced this minor annoyance recently as well! American characters discussing a \"cookery book\" instead of a cookbook. Author turned out to be British. The book was riddled with them. I'm definitely put off and a little offended by lazy editing like this.",
                    "score": 69,
                    "replies": [
                        {
                            "author": "IndependenceMean8774",
                            "body": "Fifty Shades of Grey was full of these.\n\nWe don't call it a pram in the states, my dear. Usually we call it a stroller.\n\nAlso, a lot of Americans don't drink Twinnings English breakfast tea. Okay, maybe some do. But they usually drink Lipton's or just have coffee.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "SolomonBlack",
                                    "body": "I dunno as an American who enjoys tea casually I would definitely drink Twinnings over Lipton. Lipton is okay for iced tea (especially Southern sugar drink style) but otherwise is that trash you settle for at the office or in the waiting room. The Bud Light of tea if you will. \n    \n....    \n   \nOf course I still mostly just drink coffee.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "oooooglittery",
                                            "body": "Disagree about Liptons. It's good for compost. That's it.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "Leettipsntricks",
                                            "body": "It's a regional thing, Pacific northwesterners drink tea and coffee in quantities that would upset most other Americans. We have a bit of a cafe culture absent in the rest of the country too.\n\n\nWell also make more beer and whiskey than anyone else, it's just all illegal",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "cheesepage",
                                            "body": "Bud light of tea. Excellent.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "pink_highlight",
                                    "body": "Agreed except for the tea. Twinning is my go to cause Lipton is trash 😂",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "youve_got_moxie",
                                    "body": "I grew up in the wilds of Downeast Maine, and I think the only way anyone I know would drink Lipton is if the only other beverage alternative were Manhattan clam chowder. Our family “casual tea” was Tetley, but my mother always had Twinings for herself. \n\nI would get Twinings “as a treat” if I was sick, but it also came with enough Dewar’s in it to fry the hairs out of my 8 year-old nose. It did not feel fancy.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ViolaNguyen",
                                    "body": "> Also, a lot of Americans don't drink Twinnings English breakfast tea.\n\nI suspect most Americans who enjoy tea don't pay attention to which brand.  I had some tea with lunch today.  What kind was it?  Uh, green tea.\n\nSpeaking for my particular American subculture, though.  I suspect brand loyalty for tea might be more of a thing in New England.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Loftyjojo",
                    "body": "I was irrationally annoyed by my fave author setting a book in Aus, when he said the port was in Perth, not Fremantle",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "vivaenmiriana",
                    "body": "I'm this way but with historical novels. If you have generic past fantasy, you can do what you like. The second you say this is \"regency fantasy\" or \"Medieval fantasy\" is the second I will judge your basic inaccuracies.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "SectorSanFrancisco",
                    "body": "See also: counterpane\n\nI'm looking at you, Lee Child.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "emergencybarnacle",
                    "body": "I had a similar reaction reading a British romance novel once - they kept described male characters as wearing nothing but jeans and a vest?? and I was picturing like...a suit vest. but yeah they meant a white ribbed tank top. I was so confused",
                    "score": 52,
                    "replies": [
                        {
                            "author": "FullmetalRD",
                            "body": "that's because that's what Brits call those... not sure why it pissed you off that a British romance novel called something a British word",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "bendbars_liftgates",
                                    "body": "I think they may have left out that the characters and setting were ostensibly American, unless this reply doesn't really fit with its parent.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "FullmetalRD",
                                            "body": "If that's the case then yeah, it would be annoying, but calling it a British romance novel makes me think it's set in Britain rather than written by a Brit.",
                                            "score": 18,
                                            "replies": []
                                        },
                                        {
                                            "author": "emergencybarnacle",
                                            "body": "yeah sorry, it wasn't about being pissed off, more just relating to misunderstanding a commonwealth word for tanktop",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "emergencybarnacle",
                                    "body": "ah sorry, should have been more clear, I wasnt annoyed or pissed off, that they call it that, I was just confused because I didnt realize \"vest\" meant something different.. so I was just picturing guys with bare chests and suit vests, which was confusing. afterward I looked it up and learned the meaning, and it made much more sense.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "DanimalPlays",
                                    "body": "The question was the pettiest reason to be mad with a book. The whole point is that it doesn't actually make sense to be angry about it.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RathVelus",
                    "body": "I recently read a book set in upstate New York that had a poem. It rhymed horrid and forehead. I was like… How British is this author.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "MarcElDarc",
                    "body": "The Girl Who Could Move Sh\\*t With Her Mind. Set in Los Angeles with all American characters. Spelled curb \"kerb\", tire \"tyre\", and called air conditioning \"aircon\". Author was South African. I blame the US publisher for not doing a US copy edit.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "sailcrew",
                    "body": "Or gumboots!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Mysterious-Coyote442",
                    "body": "There are some British authors that write trashy romance books. And like, I know, expectations are low. But one of their series takes place in the US (a fictional US, but still) and they were so bad about using British terminology throughout. They kept calling a can a tin. There were some other ones but the tin thing was the first instance and it pulled me out of the story immediately.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Akantis",
                            "body": "Garth Ennis having Texan cowboys say \"bloody hell\" repeatedly.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Serventdraco",
                    "body": "It didn't make me stop reading it, but I came across something similar. The main characters, from America, got into a Harry Potter school scenario because they found out they were changelings but the narrative never explained what a changeling is.\n\nI eventually remembered what a changeling is but I spent a good minute very confused because that's not a widely known concept over here.\n\nFor those that don't know, a changeling scenario is when elves/fairies steal human babies and replace them with elf/fairy babies.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Winter-Priority-7447",
                    "body": "Fifty shades was like that too. The protagonist's dad got introduced as this small town dude who's really into guns, fishing , woodwork - and soccer.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HiJane72",
                    "body": "And vice versa not really knowing how to use certain words. I remember reading an historical romance set in the ton where someone said “in two fortnight’s time”. I laughed so hard - lady even us Commonwealth countries who use fortnight all the time would call that a month (approx)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "menta-e-chocolate",
                    "body": "When I read The Library at Mount Char and the author was narrating a time where a brazilian character was in Brazil, got sick with stomach issues and her mother gave her a bowl of feijoada so she could get better, which is the least appropriated brazilian dish to give to someone with stomach ache.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ViolaNguyen",
                    "body": "In case there are Australians reading...\n\nIn the U.S., we have singlets, but those are the clothes that Olympic-style wrestlers wear for their matches.  I've actually never heard the term in any other context.\n\n\nEdit: Addressing another issue here...\n\nI get irritated when modern British slang shows up in fantasy stories.  I cut my teeth on British novels written 50 to 100 years ago.  I read a lot of them when I was a little girl, and so its *incredibly* jarring to me when I encounter language that is meant to sound old-fashioned and European but that really just sounds like it came from someone younger than I am.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "chigangrel",
                    "body": "This reminds me of reading various Doctor Who books where they came across Americans... who say things like mum, sweets, carpark, rubbish, etc lmao",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OGB",
                    "body": "This would make me mad, too.\n\nI saw a clip from Great British Bake Off where someone was mocking the show for being racist when they were having some Mexican themed episode.\n\nThe racism made me mad, but I was irrationally angry at their hosts pronouncing tacos as \"tack-ohs.\"\nIt's not your language, the world doesn't revolve around England. Fucking pronounce it properly.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Barbarake",
            "body": "I got totally annoyed when someone was strangled with two fingers.\n\n(Character in car, attacker in back seat. Punctuation exactly how it was in the book.)\n\n\"A hand reached out from behind, then two-fingers thick and strong, as they wrapped around her neck. Squeezing.\"\n\nThis doesn't even make sense!!",
            "score": 91,
            "replies": [
                {
                    "author": "moxipls",
                    "body": "This is hilarious, I can't even imagine how that'd work",
                    "score": 31,
                    "replies": [
                        {
                            "author": "HappierShibe",
                            "body": "Strangling someone with your hands is actually pretty hard. It takes *minutes* of sustained grip pressure at what is for most people their maximum force.  If your victim can get even a little bit of leverage to reduce the pressure, they are going to get some air, and then the clock essentially starts all over.   \nYou really need to train your hands and your forearms and focus in on grip strength to stand a chance of pulling it off with two hands.    \n     \nOne handed strangling is doable if you have a flat surface, large hands and good  leverage (pressing someone against the floor).  \n  \nUsing just a couple fingers is absolutely hilarious nonsense, if you *have* to stop someone breathing with two fingers, curl them up and go or a hard punch to the trachea just to the left or right of the centerline of the neck, but that's going to be a hell of a lucky shot, and it's *probably* not going to kill them.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DentistsAreCool",
                    "body": "Sorry but this made me laugh so hard 🤣🤣🤣🤣🤣🤣",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Updownuptownpop",
                    "body": "Maybe they meant the actual hand/palm thickness? As in “two fingers high with palm flat on a surface”, would be a Jack Reacher sized hand but a terrible way to describe it.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "deskbeetle",
                    "body": "I think they meant the fingers/hand was so meaty that they were twice the thickness of normal fingers. \n\n\nHorrible way to describe thay though. \n\n\nEdit: hard to tell but is it \"two-fingers thick\" or \"two--fingers thick\". Was it hyphenated or a dash. If it was a dash it would be more like: \" a hand reached and then a second hand reached. The fingers thick and strong, as they wrapped around her neck\". Could be an overly complicated sentence to show how abrupt the strangling started. ",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Barbarake",
                            "body": "It looked like a dash (definitely longer than a hyphen). But it was at the end of the line so I can't be positive if it was an en-dash or an em-dash.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "arowthay",
                    "body": "I guess I can KIND OF see like... thumb and forefinger being the only fingers actually 'touching' the neck, holding the hand flat? but it's a weird way to describe it. I just fake throttled myself to see lmao, you can do it",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "XenosHg",
                    "body": "> A hand reached out from behind, then two ---\n\nJudging from the length of that dash in the page I find online, it might mean \"one hand, then the second\",",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Pretty_Trainer",
                    "body": "Oh my god was it Blake Crouch? He likes to write in not sentences. I think he's actually given up on writing and is actually making notes for the screenplay.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Silent-Selection8161",
                    "body": "Hey don't mock Johnny Twolongfingers!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ChaoticxSerenity",
                    "body": "Like someone from behind just reached out with their crab claw 😂🦀",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bliggityblig",
                    "body": "Andre the Giant.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Anaiira",
            "body": "- An American character in a hotel in downtown London is agonizing over accidentally poisoning her (shitty) husband with eucalyptus oil. She's unable to recall the phone number for emergency services in the UK and just proceeds to sit there in the hotel room.\n- A character is a self professed tea afficionado, but puts half a cup of milk in her cup of tea.\n- The narrator says that there is a team of 6 people. One person has the strength of 10 people. The narrator says this gives the team the effective strength of 16 people. This is not correct math.\n- A character gains magic scissors and that improves the speed at which she can knit. How are scissors supposed to do that. \n- A character in a fantasy novel wears size 8 boots. I think this is the pettiest thing ever but, why would your fantasy bootcamp with dragons have US women's foot size measurements?\n\nTo be honest, I don't go out of my way to find petty reasons to hate books. I end up finding and remembering them because I'm already irked by the book and discrepancies in details jump out at me.\n\nI find less now that I go out of my way to avoid booktok recommendations and dark academia books.",
            "score": 75,
            "replies": [
                {
                    "author": "raevnos",
                    "body": "I've never been to England and even I know the phone number is 0118 999 881 999 119 725 3.",
                    "score": 60,
                    "replies": [
                        {
                            "author": "Benjaphar",
                            "body": "Could you repeat that please?",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cats_books_tea_123",
                    "body": "The Lost Apothecary was straight up just a terrible book",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Cool-Firefighter2254",
                            "body": "There were so many things about that book that bothered me. The ending, where the protagonist just announced  a major life change as a done deal without going through any of the necessary steps (like applying, being accepted, getting the right paperwork in order), just drove me nuts. The other was the librarian becoming her best friend and delivering something in person to her hotel room. I’ve worked in museums and libraries and do you know how much time I spend on the floor interacting with patrons? Very little, unless an appointment has been prescheduled. The museum where I used to work has a completely separate building for curators, located about 5 1/2 miles from the public building for visitors. Also, that relationship was just SO weird. I work hard and I’m happy to chat with members of the public who share my interest, but I’m not staying after hours to do research for them! The author knows nothing about higher education or collections.\n\nWe read this for my book club and I’m the only one who outright hated it. We did all agree that we liked the chapters set in the past more than those in the present. We’d been reading a lot of dual timeline novels and I requested a break from that plot device for a while! There’s always one half of the book that is inferior.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "molotovmimi",
                                    "body": "I screamed at that book when Tepid Broth got into Cambridge. Ma'am that university predates the effing Magna Carta and that program you applied to accepts fewer than 30% of the people who apply, but your unremarkable ass finagled an acceptance after working on your application one whole entire evening? Suuuuure. I can't remember if it was a fully funded spot too.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Cool-Firefighter2254",
                                            "body": "Ha, ha, ha! I was in my book club and slapping the cover of the book for emphasis. “This. Does. Not. Happen. This. Way!” You can’t even get into a community college overnight! There are DEADLINES. And an academic calendar! And visas! And why would Cambridge give a prime spot to a dumb American who doesn’t know how to do her own research?! I was irate. I guess I’ll just announce tomorrow morning that I’m going to Cambridge for graduate studies in a highly selective program and then I’ll be on my way!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Blkbltchic",
                            "body": "Wish I could upvote twice...",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "catsinthbasement",
                                    "body": "I just finished it. The eucalyptus oil thing was incredibly dumb. But her finding the “lost” apothecary shop because she hopped a fence and walked through an empty lot? Every kid from the past three hundred years within a 1 mile radius has been in there. So stupid.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dragonmp93",
                    "body": "> The narrator says that there is a team of 6 people. One person has the strength of 10 people. The narrator says this gives the team the effective strength of 16 people. This is not correct math.\n\nThis is MBA math.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "ChaoticxSerenity",
                            "body": "The power of friendship: when you play 6 of the same card together, they get a +1 overall strength buff.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Hagenaar",
                            "body": "Each of the other five people have 120% strength. Which is impressive but they don't make a big deal about it because the 1000% person is a narcissistic jerk.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MarcElDarc",
                    "body": "Please name and shame the book(s).",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Scared_Ad2563",
                    "body": "Omg, this list just got better and better.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "titaniumjackal",
                    "body": "That tea one is good though! It shows what an idiot the character is. They're like the guy who loves steak and orders it well done, or someone who claims to be a wine expert and mispronounces Merlot.\n\nNow if it wasn't self-professed, and an omniscient narrator said they were a tea afficionado, then I'd be annoyed.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "NegativeLogic",
                    "body": "For the size 8 boots thing is that how the author describes them to the reader, or is that how the character describes them in the novel to other characters?",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "bb_or_not_bb",
                    "body": "The knitting thing hurts to read. What book is that from?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Unboxious",
                    "body": "> The narrator says that there is a team of 6 people. One person has the strength of 10 people. The narrator says this gives the team the effective strength of 16 people. This is not correct math.\n\nThis is too funny.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "boofman572",
            "body": "I forget what the book title was but it was a murder thriller based in the Portland Oregon area and kept describing the city as buried in snow in winter. It maybe and I mean maybe it snows once or twice a year in Portland and it's only about a couple inches max. It also quite a big deal and shuts down the entire city since Oregon doesn't ice its road for environmental reasons. No one goes to work everyone stays home.\nAnyway, the book kept describing the character trudging through snow, or following deep foot prints through the snow, in burying cars under mountains of snow. The city it was describing was not Portland Oregon and I found it so distracting.",
            "score": 125,
            "replies": [
                {
                    "author": "KhonMan",
                    "body": "They got confused with Portland, Maine perhaps?",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Vio_",
                            "body": "I always wanted a one off Portlandia opening theme song of \"The Spirit of the 80s is Alive in Portland\" and it's set in Portland, Maine",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "IAmSnort",
                                    "body": "That would have been amazing.  Same ethos but Maine accents, lobster, and waterfront views.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kitty_kat_sammy13",
                            "body": "As someone in Maine, that was my first thought.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tarothoe",
                    "body": "Very responsible of Portland to not ice its roads. /s 🤓 just yanking your chain. I always say that by accident too",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "littlestbookstore",
                    "body": "lol, as a Portlander, I agree. \n\nI’ve lived in a bunch of places and any time a city I know very well is described inaccurately, I get super annoyed. People are always doing this with SF/the Bay Area too. ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "onarainyafternoon",
                    "body": "I was born and raised in Portland and you are right on the money. I specifically have a memory of being in the 6th grade or so in 2005 ish maybe? And it snowed so freaking much that it shut the entire city down. School got canceled for an entire week. It was amazing as a kid! But that literally only happened once when I was growing up as far as I can remember. It usually snowed maybe once a year and if we got even an inch of snow, it would shut school down for the day.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Gatraz",
                    "body": "I wonder if they researched weather in Portland and found Maine by mistake? I mean if they said Bend was snowed in it'd pass easy but Portland's only snow comes in baggies 99% of the time.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Smooth-Review-2614",
            "body": "I dropped All the Sinners Bleed because the travel times didn’t work. You don’t go from coastal SE VA to Richmond, have a meeting, and get home in 4 hours. It doesn’t work. ",
            "score": 60,
            "replies": [
                {
                    "author": "Anxious-Fun8829",
                    "body": "That's surprising considering the author is from VA.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Smooth-Review-2614",
                            "body": "It could be as simple as my mental map being off. I grew up near Richmond.  The travel times to get to the coast depends on how forgiving you want to be on interstate and truck routes.  \n\nThe other answer is just that character leaving earlier than I think.  If the author had not given a time stamp it would have been fine. ",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Akantis",
                                    "body": "Honestly it depends on the tolls, parking, and traffic that day, if you're doing the official Virginia Speed Limit (10 mph over whatever is posted) you could make that, especially if it was the nearer part of Richmond.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Smooth-Review-2614",
                                            "body": "Except that the ME is over by the convention center. So 1.5 hours each way minimum and what a 1 hour meeting before you pull into the sheriff office and do a press briefing as soon as you exit the car? \n\nJust no. ",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "OfficePsycho",
                            "body": "There was a tabletop RPG in the 80s called Twilight: 2000 that had a book set in Western Pennsylvania.  In the 2000s/2010s, someone did an article ripping down the author for cultural and geographical mistakes in the book, and why you needed locals to write books about places.\n\nThis was followed by someone bringing out a newspaper article which indicated the author had lived in the area he'd written about for at least a decade.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Anxious-Fun8829",
                                    "body": "According the Wikepedia, he lives in SE VA. But, in fairness to Crosby, I think perceptions of time depends wildly on personality (\"If you are on time than you are late\") and how familiar you are with the area. \n\n\nFor example, I live in the further DC suburb but rarely go into the city. If I had to go DC, I would plan for like 1.5 hour, whereas some of my friends who go there more frequently will plan for 45 min and just cross their fingers.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "XenosHg",
                    "body": "Reminds me of the anecdote about \"The Three Musketeers\", how it used to be obvious to the readers that between the character's departure on horseback and his arrival in the next chapter, too many hours have passed and thus he must have visited some third location that will be revealed later.  \n\nBut that stopped being obvious since most modern readers know nothing about the speed of riding on a horse through the city, and now sometimes deserves a footnote.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RunawaYEM",
            "body": "Lies of Locke Lamora is one of my favorite books of all time, but after a certain point it feels like someone dared Scott Lynch to use “alchemical” every 100 words",
            "score": 88,
            "replies": [
                {
                    "author": "astronautsamurai",
                    "body": "like william gibson with lozenge",
                    "score": 25,
                    "replies": [
                        {
                            "author": "bendbars_liftgates",
                            "body": "Lmao I've only read like 5 chapters of ~~Snow Crash~~ Neuromancer and I've already noticed he has an obsession with lozenges. That's fucking hilarious that it keeps up.\n\nEDIT: I have no clue why I mixed those two up. Actually, I do. I bought them at the same time. Still I read Snow Crash a while ago and all the way through, so my brain really just shit itself.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "arowthay",
                                    "body": "just checking but gibson did not actually write snow crash unless i'm missing smth here",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "utopia_mycon",
                                            "body": "you're not as far as I can tell, unless Neal Stephenson just also really likes the word lozenge (possibly as a reference to Gibson)",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "pgpndw",
                                                    "body": "The word \"lozenge\" occurs precisely 7 times in Neuromancer and 3 times in Snow Crash. I just checked both.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bendbars_liftgates",
                                            "body": "You right, it's my mistake. I meant Neuromancer. I bought them at the same time, so I guess maybe that's why I mixed it up- even though I read SC in its entirety and over a year ago.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Germanofthebored",
                                    "body": "That's Neal Stephenson, though",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "bendbars_liftgates",
                                            "body": "I *meant* Neuromancer, my mistake. I did buy both books at teh same time, maybe that's why? I've read all of Snow Crash though, over a year ago.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Gatraz",
                                    "body": "Snow Crash was Neal Stephenson, not Gibson.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ViolaNguyen",
                                    "body": "It's like mixing up Record of Lodoss War and The Slayers.  One is kind of a send up of the other.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bluecheeseur",
                    "body": "brandon sanderson and grimace",
                    "score": 7,
                    "replies": [
                        {
                            "author": "MyCodesCumpie-ling",
                            "body": "This is one I've never noticed. Is it all his books or a particular one?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Bluecheeseur",
                                    "body": "I read the way of kings recently and grimaced every time he used it",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DearLeader420",
                            "body": "He's started using \"tens\" a lot lately. Stuck out like a sore thumb in WaT and I think Sunlit Man.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Artemicionmoogle",
                            "body": "lol, there are 304 Grimaces in the Malazan Book of the Fallen. They both like it. OMG and 747 scowls!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "HeyJustWantedToSay",
                            "body": "Brandon Sanderson and “damnation” in place of damn. It just doesn’t really work and it came allllll the time in Words of Radiance.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheDejectedEntourage",
                                    "body": "Isn't that because there is a place they call Damnation?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "HeyJustWantedToSay",
                                    "body": "Probably, but he also uses it in ways like, “Get back, damnation you!” Like saying “damn you” and it’s supremely awkward.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "zombiegamer723",
                            "body": "A lot of people snarl in Jim Butcher’s books iirc. \n\nMouse has a doggy grin too. (But he’s a Good Boy, so we can let that one slide.)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Underwater_Karma",
                    "body": "I quit shortly into book 3 when Locke was turned into a constantly whining simp who just got chumped by a pretty girl over and over.\n\nIn fact, for 2 books we heard about master thief Sabetha, who was the best student of the troupe.  then we finally meet her, and her master talent was she's pretty and she just seduces men.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "selloboy",
                            "body": "I was so disappointed with Republic of Thieves. I liked Red Seas Under Red Skies but there were some things that annoyed me in that one as well, particularly with a fakeout towards the end. It makes think that it would've been more effective if the first book was just a standalone",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Underwater_Karma",
                                    "body": "the first book was so good.  then it was like a downhill slide for subsequent books.  \n\nit really annoyed me that the first book made such a huge point of the Bondsmages being so fearsome that nobody of any level would ever cross them.  and then Locke does a lot more than that, and they're like \"ok, no big deal\"",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Hartastic",
                                            "body": "Of course, it also turns out in book 3 that >!the most powerful Bondsmage we see in the books is... probably Locke.  So that's a choice.!<",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pope_Khajiit",
                    "body": "I think it was in *The Blade Itself* where the author kept describing the character's eyes as \"orbs\". \n\nIt was a distinct description which saw itself repeated more often than expected. Which is to say, more than zero.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "XenosHg",
                            "body": "https://www.reddit.com/r/tumblr/comments/10is3qn/",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ViolaNguyen",
                    "body": "Some authors get away with this.\n\nBrian Jacques could talk all he wanted about turnip 'n tater 'n beetroot pie and I'd never get tired of it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gibber_Italicus",
            "body": "As an enjoyer of gritty historical noir/WW2 spy shit, a few years back I stumbled across a book recommended to me via Kindle, and it was even free! It had an intriguing premise: the notorious Nazi monster Reinhard Heydrich had an obscure nephew, who was secretly working with the British. Cool!\n\nI downloaded it and made it one page. It was an amateur, self published work with wooden writing. The worst sin, somehow, was that this fictional nephew's name was Nigel. For some reason that did it. My suspension of disbelief came thudding to the ground, and I've been wary of free, Kindle-recommended books ever since.",
            "score": 41,
            "replies": [
                {
                    "author": "DentistsAreCool",
                    "body": "Hahahahaha. Yup, totally get it. I once gave up on a book like that because the family is indian Immigrated to the US and the words sounded like that author looked down on her scrabble tile. And the daughter had a bf named John Smith. I just gave up.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Happiest_Mango24",
                            "body": "damn, the bf's parents didn't even try with that name",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "evilgiraffee57",
            "body": "Read a book that was set in the city I live in. One character went out for a drink after work in the middle of the city and decided to leave their car there (would have cost a fortune and can't figure out where they COULD leave their car overnight) and walk home. They got home in time to hear their child come in from sports.  They live a 30 minute train ride from the city centre! Totally infuriating.",
            "score": 41,
            "replies": [
                {
                    "author": "magpie-pie",
                    "body": "Oh or they always go into the most touristy, overrated districts in the city. For example, there's this book set in Cambridge and the characters only stay in King's Parade and the most central part of the city",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "helloviolaine",
                    "body": "There's a fantasy book written by an American author which is set on a real German island. In the blurb it was described as \"north of Berlin\" and while that's technically true, it's a very odd way of locating it. It's like 200 miles north. Maybe he just looked on Google Maps and it seemed close-ish zoomed out? Or maybe 200 miles is really close to an American?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "TopHatGirlInATuxedo",
                            "body": "As an American, 200 miles isn't _close_ but it's \"within driving distance\", about a 4-hour drive assuming 50mph average.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "WordStained",
                                    "body": "Yeah, I wouldn't call it close, but it's not that bad as an every once in a while trip, like going to an event or something. I mean, my friends and I in a whim got tickets to a movie that the closest showing to us is about 100 miles away, and it's just a matter of arranging schedules to accommodate a 2 hour drive after everyone gets off work.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "clintCamp",
                                    "body": "I am sure they were from rural montana and figured everyone drive at least 80 mph cause there's and Autobahn around there somewhere right?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "spreetin",
                            "body": "If the intended target audience for the blurb was Americans that somewhat makes sense, considering Berlin is probably the only landmark in Germany most Americans know (if they know any at all).",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "North-Purple-9634",
                    "body": "I randomly found a book set in the small town I grew up in.\n\nIt wasn't very good, but I powered through it to see if there were any fun references. Nope. Pretty sure it was written by someone who vacationed there for a weekend.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "vinniethestripeycat",
            "body": "I just finished hate listening to one where the author used the word \"waggled\" probably a dozen times & \"sauntered* another six times or so. That's lazy writing & poor editing.",
            "score": 38,
            "replies": [
                {
                    "author": "sexless-innkeeper",
                    "body": "I absolutely cannot tell you how many times Lloyd Alexander has used \"he cried\" when the main character talks. It isn't that he uses it incorrectly, it's that he uses it WAY. TOO. MUCH. Every book. Lazy writing and poor editing, indeed.\n\nex. \"That's the wrong direction!\" he cried.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "glipglopsfromthe3rdD",
                            "body": "Who’s the author that complained about people not just saying “said”? I think of that CONSTANTLY when I’m reading now.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "flyover",
                                    "body": "Elmore Leonard!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "XenosHg",
                            "body": "> not incorrectly, but I hate it  \n\nI can't even complain, it is indeed not incorrect. Do you think \"He screamed\" would sound better?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "knight_in_gale",
            "body": "When I was a teenager, my friend Larry read this book called \"Snow Crash\" by Neal Stephenson. He went on about how awesome it was, and tried to get all of our friends to read it. \n\nThe book really did sound cool. \n\nThen Larry slept with my girlfriend. \n\nSo I refused to read the book for years...because \"F**k Larry!\". \n\nI got over it and read the book in college. Loved it. Stephenson has been one of my favorite authors since.",
            "score": 30,
            "replies": [
                {
                    "author": "Tariovic",
                    "body": "Well, fuck Larry for two reasons!",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Beanpod79",
                    "body": "Ha, I'm reading that now.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LazyRiverHomicide",
            "body": "Was reading a book, don’t remember what it was (might’ve been a Dan Brown book), and the author decided that it was appropriate to use the word “something” rather than appropriately describe what was happening. And before you ask, it was not related to the scene/plot/character or anything other than author laziness. Ex. “The bartender did something with his face.” Well what did he do?! Is he making a face at you? Did he smell something weird? Is this related to anything else happening in this scene? No? Then why is it written here and why couldn’t you give me a description.",
            "score": 24,
            "replies": [
                {
                    "author": "Scared_Ad2563",
                    "body": "This brought me back to a college writing class I had to take. The professor was very specific about wanting descriptions and not using vague references like \"something\" or \"things\" or whatever. I.E. \"I grabbed my things.\" What things? Bag? Hat? Keys? Knives?\n\nEven after nearly an entire class period discussing this, a girl did not understand why he gave her so much flack for, \"We had a wonderful dinner of turkey, stuffing, and other foods,\" in our first assignment.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pope_Khajiit",
            "body": "Nearing the end of *The Expanse* series and it bothers how formal everyone talks at times. \n\nFor example, a character might say to a colleague/friend, \"A representative from Laconia will board the <ship name> and escort the individual off ship onto the <ship name>\". Instead of a more natural \"A guy from Laconia is coming onboard to escort <character> off ship.\"\n\nEven the lowliest of thugs will make demands using weirdly formal phrases and exact wording. It's like there's an attorney whispering in the ears of every character.\n\nThat, and the comically scientific daydreams people have. Which will usually make reference to our primal monkey hind brains.",
            "score": 26,
            "replies": [
                {
                    "author": "pooshlurk",
                    "body": "Don't forget the atavistic urges !",
                    "score": 14,
                    "replies": [
                        {
                            "author": "LurkingArachnid",
                            "body": "Ha so I’m not the only one who that stuck out for!\n\nI also got tired of the phrase “dry swallowed”",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Awesome4some",
                                    "body": "\"The copper taste of fear\"",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ArsonistsGuild",
                    "body": "I remember LW coming so highly recommended over the supposedly top-tier worldbuilding only for one of the main overarching conflicts to be introduced through the main character going on a deranged conspiracy rant over a colleague's prosthetic arm and everyone acts like its totally normal. And then when its not doing that its doing the absolute worst infodumping I've ever read in a book.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "flyover",
            "body": "I couldn't get through _Never Let Me Go_ because of the paperback's typeface. It's called [Bembo Infant](https://fontsinuse.com/uses/18826/never-let-me-go-by-kazuo-ishiguro-vintage-boo), which is appropriate, because it made the book look like a super-sized baby shower invitation.\n\nI should still seek out a different version, someday. But I was just so mad at that typeface that it soured me on the book!",
            "score": 77,
            "replies": [
                {
                    "author": "Scared_Ad2563",
                    "body": "This is delightfully petty.\n\nNo sarcasm, this gave me such a chuckle.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "flyover",
                            "body": "Thanks! Just wanted to respond in the spirit of the post.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Scared_Ad2563",
                                    "body": "Of course! It is absolutely perfect and fitting.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "glynndah",
                    "body": "I HATE the font Kensington House uses on their books so I refuse to read anything published by this company.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "chigangrel",
                    "body": "I don't understand how you have responses from people who are confused how a bad font can make a book unreadable. It's one of the reasons I love ebooks - I can typically adjust the font to something readable for me!\n\nA worse thing is feint indentation for paragraphs - it can make a book a wall of text. The Arkham Horror books are guilty of this. And that's not an adjustable setting unfortunately, so as much as I want to read their books I just can't deal with walls of text!",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Consistent-Climate16",
                    "body": "You can try seeking out the edition published by faber and faber (ff), it uses a different typeface.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "LilMartinii",
                    "body": "I'm super confused. What's wrong with the font?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Boredombringsthis",
                    "body": "Ha, may I inform you about the Czech edition of I Did Not Kill My Husband from Liu Zhenyun? It was printed in **IMPACT** with basically no paragraphs. Just walls and walls of text in bold impact! It was unreadable.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "flyover",
                            "body": "Noooo! Like reading the world’s longest meme caption.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ok-Equivalent8260",
                    "body": "You’re not missing much.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "StrategicTension",
                    "body": "Yeah I didn't get through the whole thing either",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Gatraz",
                    "body": "I don't read that as baby shower invite at all, I was expecting something like bubble letters",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Kyber92",
                    "body": "Seriously?!? Of all the things...",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Verdant_Green",
            "body": "Use of the word “chronicle” in the title. Like, I just don’t like the word and the over-blown air it gives. About the only time it gets a pass from me is when it is attached to some epic story that feels worthy of being chronicled or it is used ironically to describe an ultra-minor event in the style of “The Rape of the Lock” or similar.",
            "score": 24,
            "replies": [
                {
                    "author": "Ekyou",
                    "body": "For me it’s “A ____ of ____”. My brain automatically thinks of it as a Song of Ice and Fire rip off (although I don’t even know if Martin was the first to popularize that title structure, but I feel like I see it everywhere lately)",
                    "score": 25,
                    "replies": [
                        {
                            "author": "whatagloriousview",
                            "body": "Extending that, `A ___ of ___ and ___`. Instantly ignorable. Tiktok can have it.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "MyDarlingArmadillo",
                                    "body": "I will chip in with the Somebody of Somewhere. I haven't read it but the Bookseller of Kabul is an example. There are many others, too many. I'm sure plenty of them are good but i probably won't pick them up and find out.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "WildEeveeAppears",
                                            "body": "How about The [Profession]'s [Female Relative]",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "MyDarlingArmadillo",
                                            "body": "oh yes - defining a woman in terms of some relative of hers, generally male - I know perfectly well why I don't want to read that.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Verdant_Green",
                            "body": "Huh. I hadn’t thought about it but, yeah, I see that pattern on TV Tropes pages a lot.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ChaoticxSerenity",
                            "body": "But also, why do those books always use the same-ish curvy font 😭",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jarlax1e",
                    "body": "The Chronicles Of Narnia",
                    "score": 9,
                    "replies": [
                        {
                            "author": "magpie-pie",
                            "body": "I think Narnia is epic enough to be worth the word 'Chronicles'",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "hikemalls",
                            "body": "We love the chronic (what!) cles of Narnia",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Verdant_Green",
                            "body": "Good example, yeah. I’m on the fence over whether Narnia gets a pass. I’d probably have to read the whole series to decide.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "trexeric",
                            "body": "I feel like when you get into classic territory like Narnia, it gets an automatic pass.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Verdant_Green",
                            "body": "I get that. Like if the Iliad and the Odyssey were “The Chronicle of Ilium” or “The Chronicles of Odysseus”. Yeah, I could get behind that.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "trexeric",
                            "body": "Or the Anglo-Saxon Chronicle, or the Book of Chronicles in the Bible. I mean, that sort of stuff is where the word comes from, they defined what a chronicle is, so they really should get an automatic pass, even more than Narnia.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "spreetin",
                    "body": "If they use the word I expect it to be a chronicle (i.e. set over a significant span of time and describe events that happen in that time, in chronological order). Using it just for \"the rule of cool\" is annoying, and the same goes for misusing other fancy sounding words, just because you think it lends more weight than more correct but pedestrian terms.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Verdant_Green",
                            "body": "Like the Terminator TV show, called “The Sarah Connor Chronicles” which manages to fail all three of your criteria. I actually liked that show, but have never once verbally called it by its proper title lol",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "curiouskayleigh",
            "body": "The Nightingale. The author set up Isabelle as such a rebel, non-conformist around gender roles/stereotypes and then when she returns from >!the concentration camp and sees Gaetan!< her first thought is ‘how do I look?’I was SO annoyed by this. I had a thin grasp of willing suspension of disbelief in that book anyway and that just blew it up. I mean I still finished the book but ugh",
            "score": 21,
            "replies": []
        },
        {
            "author": "glynndah",
            "body": "The author called the hospital by the wrong nickname. She referred to the Sarah Bush Lincoln hospital as the \"Lincoln hospital\" instead of \"Sarah Bush\" as ALL the locals do, including the newspaper and other media. Since I grew up in the town, this error was very galling to me. Not to mention the author bragged about how much research she did before writing her books.",
            "score": 24,
            "replies": []
        },
        {
            "author": "ConstantComforts",
            "body": "A love interest character had a mustache. I hated it so much, I tried to erase it in my mind but every mention of the mustache😩. Thankfully it was shaved before any romance actually happened lol",
            "score": 55,
            "replies": [
                {
                    "author": "Tariovic",
                    "body": "This is my favorite.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "tambitoast",
                    "body": "ahaha that's crazy 😂",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "whiskeyrebellion",
            "body": "I didn’t know who this “Frodo” asshole was or why he replaced my beloved Bilbo as the main character but I wasn’t having it. \n\n(LOTR has been my favorite book ever since)",
            "score": 20,
            "replies": [
                {
                    "author": "throwaway3270a",
                    "body": "Just be glad Tolkien didn't stick with \"Bingo\" like in an earlier design consideration.\n\nNot kidding.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "polgara04",
                    "body": "My exact reaction when I first picked up LotR. It took a cross country road trip with my dad listening to the audio books on cassette to bring me around.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ViolaNguyen",
                    "body": "You picked up the wrong edition.  His name is supposed to be Frito.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "adlittle",
            "body": "This is super petty, but books where the food is improbable due to place and time. I have run across several set in Europe pre-16th century where food is described as including potatoes and turkey in particular. Those are New World foods introduced via the Columbian Exchange.",
            "score": 17,
            "replies": []
        },
        {
            "author": "c-e-bird",
            "body": "I’m currently listening to an audiobook where the narrator pronounced *saxophonist* as sex-AH-phuh-nist. \n\nI couldn’t even tell what the hell word it was meant to be until the third time he said it.",
            "score": 34,
            "replies": [
                {
                    "author": "tambitoast",
                    "body": "That's amazing 😂",
                    "score": 9,
                    "replies": [
                        {
                            "author": "c-e-bird",
                            "body": "the narrator owns a jazz bar and the reader doesn’t know enough about music to make it believable in his pronunciation of multiple musical terms. it’s infuriating. I don’t know how the producers of the audiobook didn’t notice and/or care.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PharaohAce",
                    "body": "[https://en.wiktionary.org/wiki/saxophonist](https://en.wiktionary.org/wiki/saxophonist)\n\nDo you mean like the pronunciation recorded here?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "c-e-bird",
                            "body": "Same enunciation on the second syllable but my guy also said ‘sex’ instead of ‘sax’",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TheGhostofWoodyAllen",
                                    "body": "Giggity.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "emergencybarnacle",
                    "body": "lmao!!!!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "monkeyhind",
                    "body": "Whew.  You have to wonder if the narrator is AI.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RealAgnetha",
                            "body": "I’ve had my share of self-published books voiced by fiverr ”voice actors“, trust me when I say humans can suck at reading as well",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "c-e-bird",
                            "body": "Nope! it was released in 2013 lol.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Taste_the__Rainbow",
            "body": "I’m still mad at Troy Denning for killing off Anakin Solo. I’ll die mad.",
            "score": 16,
            "replies": [
                {
                    "author": "Aceofrogues",
                    "body": "New Jedi Order spoilers\n>!Does it help if I tell you that he wanted to kill Jacen and the story group said no?!<",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Taste_the__Rainbow",
                            "body": "Hahaha oh man. I genuinely loved the broad arcs of the Jacen stuff later so I don’t know if that’s better or worse.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mawarup",
            "body": "If you can't describe what your characters are wearing without being irritating or leering, I'm going to be annoyed. Bonus (negative) points if you're writing fantasy and feel the need to describe a type of clothing that doesn't exist poorly in the middle of an otherwise interesting scene.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Hivemind_alpha",
            "body": "I resisted reading Terry Pratchett for years despite rave reviews from friends etc purely because in the UK they were published with, to my mind, garish cartoonish covers. I refused to purchase the book-as-artifact no matter how good the story it contained was. They looked childish.\n\nI still hate the covers, but the books are great.",
            "score": 58,
            "replies": [
                {
                    "author": "ThinCommon7",
                    "body": "Lol! I love the Josh Kirby covers. The artwork is what attracted me to the books back when I was 12 or 13 (i.e. a child).",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Verdun82",
                    "body": "In a similar vein, I hate book covers that show images from a movie. I always try to find the original art, or I will not buy it.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "spreetin",
                    "body": "I love discworld, but always also felt that way about the covers. Have now invested in the complete 40 volume set of hardcovers with the new more subdued covers. Finally they look as good on my shelf as their contents are.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "tintinsays",
                    "body": "I hate the Hitchhiker’s Guide books with the annoying green guy on them. I normally have a couple extra copies of my favorite books to give to friends so I don’t have to worry about getting them back, and I refuse to buy copies with that little green thing. ",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Flat_News_2000",
                            "body": "I have the Hitchhiker's version that legit looks like a bible with gold on the outside of the pages.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CthonicProteus",
                    "body": "Those covers were at least somewhat evocative of the setting. The American covers up until very recently were hideous beyond words.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "whatagloriousview",
                    "body": "Agreed! The new UK covers are much more my speed.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "UnexpectedVader",
                    "body": "I had a mix of this along with the first book just kinda being shit. I later tried the first book in his discworlds witches series and felt bad for being a snob about it because those are awesome.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Deblebsgonnagetyou",
                    "body": "I adore those covers lol. I feel like fantasy lost something when they stopped doing painted scenes for covers.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Gatraz",
                    "body": "I mean, the books often do garish and cartoonish things, so I figure it scans. Local doofuses luggage eats 15 people, topples fake-China, more at 11.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "garbanzobby",
            "body": "I hate when the author uses excessive exclamation points. Something about it just pisses me off",
            "score": 13,
            "replies": [
                {
                    "author": "magpie-pie",
                    "body": "That's a sure sign of an insane mind.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "TheGhostofWoodyAllen",
                            "body": "There's nothing insane about it! Leave us and our exclamation points alone!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Pilchard123",
                                    "body": "You're okay, you didn't use more than one at the end of either sentence. But if you used more than one per sentence, that's an indicator that you wear your underpants on your head.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "TheGhostofWoodyAllen",
                                    "body": "Oh, so you want more of 'em?! More!! More!!! MORE!!!!\n\nI don't think I have read a book where more than one is at the end of any given sentence. Have you actually seen that?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kratly",
            "body": "I DNF’d a book one time when 2/3 of the way into it, a character started browning ground beef for fajitas.",
            "score": 28,
            "replies": [
                {
                    "author": "estheredna",
                    "body": "Why? \nSigned, a vegetarian who doesn't get it",
                    "score": 11,
                    "replies": [
                        {
                            "author": "kratly",
                            "body": "Fajitas are made from marinated strips of beef (skirt steak) or chicken (breast or thighs), or even veggies.  But using ground/minced meat makes it fundamentally NOT a fajita.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "CthonicProteus",
                            "body": "Fajita meat is a very specific kind of meat that is sliced but not ground. For beef I believe skirt steak is used, but I might have the cut wrong.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Daghain",
                    "body": "OMG that's hilarious!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "forgedimagination",
            "body": "Being wrong about the deck layout and purpose of a clipper ship.",
            "score": 13,
            "replies": []
        },
        {
            "author": "sleepingchair",
            "body": "I hate books with songs in it. Sorry, I'm not hearing the song and the lyrics outside of a musical setting are just very bad poetry. Yeah, that includes you too Bombadil, you can eat it.",
            "score": 13,
            "replies": [
                {
                    "author": "cheerylittlebottom84",
                    "body": "Oh god, I get the worst cringe reaction to books with songs in. Luckily I don't tend to read many books where it happens, but when it does... 99% of it is just shit. Flaming, drippy shit. So much bad poetry. I feel like The Hunger Games used an original song quite well but it's a vanishingly low number of authors who know when to stop\n\nI also agree that Bombadil can eat it. Horrid.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "sleepingchair",
                            "body": "I feel like Hunger Games gets a bit of retroactive grace since the movie adaptation actually made the song. Then again, they made a dance remix of it too which was tone-deaf or ironically appropriate depending how you read it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheGhostofWoodyAllen",
                    "body": "Even Thomas Pynchon?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sleepingchair",
                            "body": "Nothing that'd make him an exception.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheGhostofWoodyAllen",
                                    "body": "Lol, fair enough. I mean, if you're hating on Tolkien for it, then why would Pynchon be safe?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "sleepingchair",
                                    "body": "You got it!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TowelMonster0",
                    "body": "Ugh I just finished an audio book that kept bringing back a song that was \"hacked\" into the computer system and the was a running joke throughout the book that this music was still playing and no one could fix it or turn it off.  And being an audio book they made some of the song and would play it. ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sleepingchair",
                            "body": "Gotta admire that they stuck to the shtick at least and I think you got the better (or at least more authentic) experience getting it through the audio book. I'd imagine it'd be less annoying, but less immersive just reading about an annoying song.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "leopold_crumbpicker",
            "body": "Quit Christopher Moore's *Sacre Bleu* about a third of the way in because the incessant dick jokes/references got on my nerves.",
            "score": 11,
            "replies": [
                {
                    "author": "drewcorleone",
                    "body": "Definitely don't read any of the Shakespeare books then (Fool, Serpent of Venice, etc).",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "imriebelow",
            "body": "Book set in the USSR had a character reference something as feeling like “being hit with a baseball bat.” Yes, I’m sure this guy fresh out of the gulag is going to be using the most American idioms possible.\n\nedit: Book was ‘The Half Life of Valery K’ by Natasha Pulley. Also featured the tonal whiplash of a comic-relief pet octopus and a cameo by Josef Mengele!",
            "score": 11,
            "replies": [
                {
                    "author": "xenizondich23",
                    "body": "Huh, she also has a comic relief clockwork pet octopus in The Watchmaker of Filigree Street. And weird cameos. Yet I don't think these books are in the same series?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "imriebelow",
                            "body": "No, they’re definitely not set in the same series, but I’ve found most of her books indistinguishable from one another barring whatever set dressing she scattered over the top. I’ve only sort of liked one of her books (The Bedlam Stacks); not sure why I kept torturing myself lmao. It’s always the same two tragic gays (with zero chemistry) falling in love in a magical realism setting, having some kind of cute disney sidekick, and zero interesting female side characters .",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "chimmy_chungus23",
            "body": "I tried to read Infinite Jest. It was tedious at most, with a few interesting bits here and there. At one point, I got to a footnote within a footnote. The initial footnote alluded to a character's nickname. When I flipped to that sub-footnote, where I expected an explanation for the nickname, what I got was a very simple two word passage: \"Don't ask.\" I instantly got the feeling DFW was intentionally wasting my time and never picked it up again.",
            "score": 11,
            "replies": [
                {
                    "author": "TopHatGirlInATuxedo",
                    "body": "The jest is making people read it.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "CasuallyMediocre",
            "body": "I think this is the pettiest I have ever been in general. \n\nI really dispise Ready Player One and Earnest Cline. I have been this way for years. \n\nSome people talked me into reading ACOTAR this summer. At some point while reading, I realised that I hated it more than Ready Player One and got incredibly annoyed. I have not stopped ranting about it to my husband. Don't feel bad for him, though. He is one of the ones who told me to read it because he thought it would be funny.",
            "score": 11,
            "replies": [
                {
                    "author": "al-sahm",
                    "body": "this is probably the most i've ever wanted to read ACOTAR bc i also despise RPO",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mimich4ma",
            "body": "I was reading *Stay True* by Hua Hsu and the narrator was just too much like an annoying coworker I have so I couldn't continue -- I feel like that is an incredibly petty reason to stop reading, lmao",
            "score": 13,
            "replies": [
                {
                    "author": "tambitoast",
                    "body": "Oh man I totally get it though. I work with kids and for some reason one of the kids names keeps popping up in the books I read so I can't keep going without thinking of that child in these messed up situations I'm reading about. Takes me out of the story so fast.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Germanofthebored",
            "body": "Read a book where a character falls to his death out of a window and feels gravity all the way down as he plunges in free fall. In free fall you are weightless and don't feel gravity.\n\nAlso, he gets re-incarnated as a male tortoise cat. Cats are tortoise because some of the fur color genes are on the X chromosome, and random inactivation of either one chromosome in heterozygotes will lead to random color patches, This does not work in XY males. There are XXY male cats that are tortoise, but that is less common than reincarnation",
            "score": 11,
            "replies": []
        },
        {
            "author": "snake-hearts-fox",
            "body": "I read the Twisted series by Ana Huang after I'd heard it was going to be made into a Netflix series. It was... alright. I guess. If those books are your cup of tea (no judgment at all, I read them, lol)\n\nBut I was *unreasonably* pissed off that every single FMC in their respective books had a nickname. And for some it made *sense*? *Maybe* two out of the four? And I mostly ignored it up until the fourth book where the MMC just kind of spits out a random word when talking to the FMC as a nickname, and even *she's* like, \"What? Why did you just call me that?\" And the reason was the *stupidest* most *contrived* thing that he hadn't spent *any* time in his previous POV chapters thinking about, nor had she really exhibited any of the characteristics that he claimed made her choose that nickname for her?\n\nIt definitely felt like \"Well, the other three girls got nicknames, this one needs to have one too!\" and I just... ***fumed***.\n\nI could go on about how a lot of the girls felt like Written By Men characters, which I found strange as hell, given that Ana is a woman, but I digress.",
            "score": 9,
            "replies": [
                {
                    "author": "XenosHg",
                    "body": "> a lot of the girls felt like Written By Men characters, which I found strange as hell, given that Ana is a woman  \n\n> read \"romance with darker themes\"  \n> descriptions of girls  \n\nI'm subscribed to \"Men writing women\" subreddit where people complain about books written by men and also women, really about any mention of breasts or women, or being attracted to women, or just in general being attracted, or attractive, or described in any way that isn't clinically vague   \n\nAnd also to \"Romance books\" subreddit where there are daily requests for novels describing sex with aliens or dinosaurs, weirdly shaped dicks, specialised mini-kinks like touching the guy's boner in his sleep (with a dozen recommendations, mind you).  \n\nI feel like the contrast between the lovers and the haters keeps me a bit grounded",
                    "score": 2,
                    "replies": [
                        {
                            "author": "snake-hearts-fox",
                            "body": "I'm all for describing someone's breasts. Or hips. Or butt. Maybe I'm biased as a bisexual woman, but I can appreciate a good description.\n\nWhat I meant more had to do with all of the rapid shallow breathing when they talk barely above a whisper (\"lethally soft\" is Ana's favorite description of someone whispering), of how their \"arousal drips down their thighs\".\n\nMaybe I'M the broken one? But I've never been so turned on that it dropped down my thighs. And I've been very, very turned on at various points in life.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Any-Difficulty-1247",
            "body": "I put off reading A Feast for Crows and A Dance With Dragons because my brother bought me the mass market paperback box set. Like I had already owned 3/5 of the series and I just **hate** mass market paperbacks.\n\nTook two years but I did read them but I bought them in a different format.",
            "score": 11,
            "replies": []
        },
        {
            "author": "nick_picc",
            "body": "Just recently read a nature book called Alfie & Me and he kept referring to his dogs as \"the doggies\" and it drove me crazy.",
            "score": 9,
            "replies": []
        },
        {
            "author": "purringsporran",
            "body": "In the first The Expanse book, somewhere around 20%, a bald extremist started to speak space-German. I _didn't_ throw my Kindle across the room because that shit's expensive. But the space-German speaking extremist was so cheap that I haven't finished that book ever since, and I don't think I ever will",
            "score": 7,
            "replies": [
                {
                    "author": "tambitoast",
                    "body": "As a German I probably would have thrown my Kindle tbh",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "pooshlurk",
                    "body": "As someone who read the entire series, you aren't missing much.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "purringsporran",
                            "body": "Thought as much, haha",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JacksAnnie",
            "body": "I'm currently reading Emily Wilde's Encyclopedia of Fairies, and in the edition I have the pages are like printer paper white rather than cream/yellowy like most books tend to be (including other books from the very same publisher). This is a historical cosy fantasy about scholars, and the book is her notes. The pages being so brightly white is....not ruining my immersion, cause I'm really enjoying it. But it's just annoying. I don't want the pages of a book set in the early 1900s looking so aggressively modern. Why are you reminding me of computers and printers when my head is trying to be in the 1900s?",
            "score": 7,
            "replies": []
        },
        {
            "author": "H8trucks",
            "body": "I work at a public library and was in charge of their book repair. There was one book in the Court of Thorns and Roses series that seemed to need repair every time it came back from being checked out. I effectively rebound the damn thing and it still had issues. I got so mad at that book that I'll never touch anything in that series.",
            "score": 7,
            "replies": [
                {
                    "author": "AJI-PIanist",
                    "body": "I was expecting you to say you'd read it and then finally understood why everyone else must have thrown it at walls.  However, I haven't read this series either, so I don't know if such a reaction is likely.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "xenizondich23",
            "body": "I knocked a whole star off my rating for a book I finished this month because the author used 'crochet' and 'knitting' interchangeably.",
            "score": 7,
            "replies": [
                {
                    "author": "ChaoticxSerenity",
                    "body": "😂 top reply IMO",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IAmNotLookingatYou",
            "body": "I was very excited to read The Outsider by Stephen King, especially because we get a lot of backstory on the potential suspects. However, about 2/3 the way through >!it is revealed that a monster was the one to blame.!< It's petty because I should have known Stephen King would add that kind of horror element, but it read so much like a mystery that I refused to finish the book",
            "score": 13,
            "replies": [
                {
                    "author": "TheJokerAndTheQueef",
                    "body": "Hilarious! I had the exact same experience. This was my first Stephen King book in 15 years. I got to the big reveal and was so disappointed. I told my wife, and she was completely unphased. She literally said, \"It's Stephen King, what did you expect?\"",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "books-ModTeam",
                    "body": "Please use spoiler tags. Spoiler tags in markdown are done as follows: \n\n    >!Spoiler content here!< \n\nwhich results in:\n\n >!Spoiler content here!<.\n\nOr apply the built-in spoiler tags when using the redesign.\n\nSend a [modmail](https://www.reddit.com/message/compose/?to=/r/books) when you have updated and we'll reapprove it.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SquidSlug",
            "body": "Tad Williams. There will be a character very slowly explaining something important. Suddenly, they are interrupted for explaining too slowly. Then someone's like \"be patient\" and gives some long analogy. Someone else is like \"this is all too confusing!\".\n\n\nI'm sitting here dying to hear the original point. ",
            "score": 12,
            "replies": []
        },
        {
            "author": "thebroadestdame",
            "body": "Every time I have to deal with a slippery, low quality dust jacket on a nice hardcover, I see red.",
            "score": 4,
            "replies": []
        },
        {
            "author": "tintinsays",
            "body": "The author of The Very Secret Society of Irregular Witches *needs* you to know their favorite word is “irksome”. They’d also like to bash you over the head with the fact the main character is lonely- I started tagging every time she mentioned it and I have over 35 tags. That’s only after I got really sick of it. ",
            "score": 6,
            "replies": []
        },
        {
            "author": "Neither-Magazine9096",
            "body": "Home is Where the Bodies are: the date June 16, 1999 is described in the book as a quiet Sunday. That date had been seared into my memory due to a personal traumatic event, and I remember it being a Wednesday.",
            "score": 5,
            "replies": [
                {
                    "author": "lindsaydemo",
                    "body": "Jeneva Rose’s books are so poorly written, it doesn’t surprise me in the least that she did zero research about what day it actually was.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OfficePsycho",
                    "body": "I feel you.  There was a comic book in the 90s I loved in my that followed a mother and son through their lives, with dated stories for them.  The happy, bonding moment story that occurred to them in 2022 is the day my mother died.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EmergencyMaximum6370",
            "body": "I was reading \"I am Jennie\", by Jenni Ketcham. Somewhere along the way, she describes someone as being \"half-Portuguese, half-white\". I'm Portuguese. Being Portuguese is not a race, it is a nationality. There's no such thing as someone being \"half-Portuguese, half-white\". I just couldn't continue, didn't finish. ",
            "score": 9,
            "replies": []
        },
        {
            "author": "bdog556",
            "body": "Ken Follett has a bad habit of overusing the word “indignant”.",
            "score": 12,
            "replies": []
        },
        {
            "author": "midnighteyesx",
            "body": "I dnf'd Divine Rivals because the font was too small and the tails of d,b,f etc were too long.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ladylibrary13",
            "body": "Okay, so not a specific book. There are a lot of indie romance series out there that insist every single book out of the twenty-four that they've written has to be read in the exact same order they were written. Okay, I say a lot, it's not as common as just straight up being like \"yeah, these are stand-alone but in the same universe\", but still, it's something I've noticed. Anyways, it's a gimmick to make your purchase the whole series. I read the first one and then I read like book number seven and there was zero need for me to have read the six books in-between. There were a few vague details, but it's a romance book, the gaps are very easily filled in. \n\nOther things I cannot stand are when authors put their really bad music playlist at the front of the book. It makes irrationally peeved, especially if it's just music I don't like or vibe with at all, it really sours my opinion on the book itself, even though it probably shouldn't. Oh. Okay. I have a specific book for you all. \n\nZodiac Academy is very badly written, but I don't know what those authors did, but it was laced with like word-crack. I sped through that series, only to come up to the book before the last. They promised it was going to be the last book. Swore up and down. Came out, it's their worst reviewed book yet, because it was like 900 pages of just nonsense used to stretch out the book instead of finishing it like they promised. It was their series that had a mild bump in popularity on TikTok, so I understanding wanting to cling to it, but it just made me lose total interest in the series and a loss of respect for the authors.",
            "score": 4,
            "replies": [
                {
                    "author": "XenosHg",
                    "body": "> there was zero need for me to have read the six books in-between\n\nIf you read book 1, you know who will be the couple in book 2 because they're usually the relative, or friend, or employee, of the first couple.   \n\nIf you read book 7 you will know all couples from book 3 to book 6 because they will be name-dropped and possible participants. Possibly with the exact details of him kidnapping her and other final plot twists.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ladylibrary13",
                            "body": "\"There were a few vague details, but it's a romance book, the gaps are very easily filled in.\"\n\nLike with Mariana Zapata, who does this same thing but without forcing me to buy the whole series, there's zero need for me to actually read these books in order. She uses characters and references couples all of the time, but she does not link their books - because it's still not actually a major deal. A lot of this stuff can still be read and inferred very easily.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "XenosHg",
                                    "body": "Nah, I meant to say as \"It contains obvious spoilers\" rather than you missed anything.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 6,
            "replies": [
                {
                    "author": "books-ModTeam",
                    "body": "Please use spoiler tags. Spoiler tags in markdown are done as follows: \n\n    >!Spoiler content here!< \n\nwhich results in:\n\n >!Spoiler content here!<.\n\nOr apply the built-in spoiler tags when using the redesign.\n\nSend a [modmail](https://www.reddit.com/message/compose/?to=/r/books) when you have updated and we'll reapprove it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pretty_Trainer",
            "body": "Once read a novel in which the author claimed england is the only country in the world where people drive on the left. Which is wrong in at least two ways and also a very easy thing to google. I am still angry with everyone involved in getting that book into print.",
            "score": 4,
            "replies": []
        },
        {
            "author": "IndigoBlueBird",
            "body": "I found out a book I read was originally Harry Potter fan fic and it gave me insurmountable ick",
            "score": 19,
            "replies": [
                {
                    "author": "Historical_Bunch_927",
                    "body": "Was it the Mortal Instruments series? I know that was specifically Harry Potter fanfic. \n\nThe fanfic turned novel series that I find the weirdest is Fifty Shades of Grey which was originally a Twilight fanfic.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "IndigoBlueBird",
                            "body": "Nope it was the atlas six",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "limeholdthecorona",
                    "body": "What book?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "IndigoBlueBird",
                            "body": "The atlas six",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "meganfrau",
                                    "body": "Well now that makes a whole lot of sense",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "limeholdthecorona",
                                    "body": "Where did you read about that? Do you have a link?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "IndigoBlueBird",
                                            "body": "No link. The author got her start writing HP fan fic and apparently the characters strongly correspond to her archetypes for Draco, Pansy, etc.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "meganfrau",
                    "body": "Fair, a few books I have read where after I found out they were reylo fics turned books have given me incredible amounts of ick.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Scared_Ad2563",
                    "body": "A little in reverse and not a book, but I once was reading this \"original\" fiction on a fanfic website. It was a really sweet story about two guys in a band that struggled with their feelings for each other and coming out to their bandmates, etc. It was a really cute story with a touch of angst that young adult me found amazing. One day, I realized it was a Fall Out Boy fanfic and I couldn't read it any more. I didn't listen to Fall Out Boy at the time (it's been so long since I read this thing), so didn't make the connection. It shattered the way I pictured everyone since I then looked them up and knew what they looked like and could not continue.\n\nIt was on a recommended list on a different story I had been reading in the \"Original\" section which is how I plain missed it in the first place, lol.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tambitoast",
                    "body": "Valid",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JitterSquirrel",
            "body": "I am mad at both Big Swiss and A Little Life solely because of their uncomfortable cover art and I, very pettily, will probably never read either just because I hate the covers so much",
            "score": 12,
            "replies": [
                {
                    "author": "Ok-Equivalent8260",
                    "body": "I love A Little Life’s cover art!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "emergencybarnacle",
                            "body": "ah man, it looks like Morrissey doing a super fake crying face to me",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "littlestbookstore",
                            "body": "I had neutral-positive feelings towards it, but then I saw the credits and it’s a photograph by Peter Hujar, titled “orgasmic man,” and that shifted how I saw it. Now it feels like an odd choice considering the book’s subject matter…",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Krysokolla",
                    "body": "Thankfully you aren't missing much by not reading A Little Life",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "tintinsays",
                    "body": "I hear you, but I did really enjoy reading Big Swiss! Maybe an ebook or a book cover? ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "JitterSquirrel",
                            "body": "I did read the description and am intrigued. Will try an audiobook!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cheerylittlebottom84",
                    "body": "Which Big Swiss cover? I hate the dogs one but the woman one is great",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Shakeamutt",
                    "body": "Oof, those covers are abhorrent.  ",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "sallypeach",
                    "body": "I hated Big Swiss's cover art and also thought the book was merely OKAY so I don't think you're missing out too much.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "irime2023",
            "body": "When I first read The Silmarillion and my favorite character died, I was sad, and then wildly angry. I was angry at the author for not giving the hero victory over the main villain. But then I realized that I had read the most epic scene in fantasy and, perhaps, in all of literature.",
            "score": 14,
            "replies": [
                {
                    "author": "Willie9",
                    "body": "The Silmarillion is not a book for people that get emotional over their favorite characters dying lmao\n\nI know exactly which character you're talking about, too.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "irime2023",
                            "body": "The fate of us all Lies deep in the dark",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Sweaty-Refuse5258",
                                    "body": "When time stands still at the Iron Hill",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xijalu",
            "body": "I feel this way about the Stormlight Archives. The pronunciations are so dumb (pronouncing Shallan like salon but with a sh- sound :/…or Adolin like AY-dolin ??) so I just stick to my way lol \n\nAlso learned from a Spanish speaking friend that Leigh Bardugo wrote a character named Concha but anyone would know that despite its literal meaning being shell, it’s a common euphemism for v*gina (not sure what im allowed to say on here)",
            "score": 12,
            "replies": [
                {
                    "author": "MyCodesCumpie-ling",
                    "body": "Are you American or from somewhere else? I'm British and have real trouble with this stuff sometimes too. It's literally impossible for Shallan to be pronounced with a long ah at the end in a British accent without it sounding like mock-american. It will always be Sha-lan to me",
                    "score": 2,
                    "replies": [
                        {
                            "author": "xijalu",
                            "body": "I’m American unfortunately but my instinct was SHALL-in (shall pronounced like “I shall go there”)\n\nI guess his way does sound very American but thought that would be so out of place?? ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zhephyx",
                    "body": "I read the first book, and listened to the rest, and the pronunciations check out tbh, I didn't encounter anything unexpected. Some people also thought Jasnah was with a G sound for some reason",
                    "score": 1,
                    "replies": [
                        {
                            "author": "xijalu",
                            "body": "In what world is J like G? I can see a Y sound but it’s Middle East influence not Nordic :/ ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "XenosHg",
                                    "body": "yeah, she's officially Yasnah.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TopHatGirlInATuxedo",
                    "body": "Like \"salon\" with an \"sh\" would be the default American pronunciation. Same with Adolin.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bierroboter",
            "body": "I was so annoyed by “grok” in strangers in a strange land i almost quit reading it. Just rage reading.",
            "score": 9,
            "replies": [
                {
                    "author": "monkeyhind",
                    "body": "Not sure why, but I feel that word might have been less cringe-inducing in the 1960s.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Bierroboter",
                            "body": "I don’t think it was a word before that book. It was less about meaning than frequency of use.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "monkeyhind",
                                    "body": "It was definitely invented by the author, that's not what I'm saying.  I just think it sounds dated.  But I get your point about over-use.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "penalty-venture",
                    "body": "That book started out so well and then devolved into weird kink.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ScreenTricky4257",
                            "body": "There are so many Heinlein books that you can apply that to. I love his work, but he infamously sent in his first draft for everything he wrote, which leads to a lot of devolving.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "therainonthepavement",
            "body": "No one died at the end. 3/4 of the book the main character was freaking out about who's going to die in battle. And then they all lived. Such a stupid letdown after all that build up. ",
            "score": 7,
            "replies": [
                {
                    "author": "Parking-Two2176",
                    "body": "To be fair...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sparksgirl1223",
            "body": "I can't remember thr title nor author but I was insanely mad at a book being set in a small town very near me, the author lived in the next state over \n\nShe CLEARLY looked ONLY at the damn population because she described it exactly the opposite of what it actually is.\n\nActually she described it like the outskirts of Seattle (all lush pine trees and whatnot) when it's maybe an orchard or 2 of apple trees and sagebrush.\n\nMy favorite (not) part being she described the summer town up the high way as a bopping place to party.\n\nAt the time setting of the book...it was a few summer houses and a boat dock back then🤣\n\nIf I hadn't wanted to know who the killer was, I would have angry deleted that download.",
            "score": 4,
            "replies": []
        },
        {
            "author": "sunheadeddeity",
            "body": "Reading a book set in 13th century Europe where they were eating potatoes roasted with paprika. I mean come on...",
            "score": 5,
            "replies": []
        },
        {
            "author": "usesbitterbutter",
            "body": "I dropped one on my little toe once. I was super mad at the book instead of me. It wasn't even a hardback, but it still hurt like a M\\*F\\*. Stupid book.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Corgi_with_stilts",
            "body": "Using \"There!\" in the MCs narrative to indicate where something is. Author didnt bother to say *where* something was, only \"there\".",
            "score": 3,
            "replies": []
        },
        {
            "author": "msarianne",
            "body": "I got really mad at Goldfinch. I felt like the conclusion was a huge moral / philosophical reveal that took 776 pages to get to that was profound if you could believe the premises; which were completely outlandish. In the same way Fairies Wear Boots by Black Sabbath were a universal truth, but you had to believe the insanity of a madman’s bad acid trip. \n\nThen I took I breath because I thoroughly enjoyed the book. \n\nI had a moment of “Oh, fuck you Donna” though.",
            "score": 5,
            "replies": []
        },
        {
            "author": "YorkshireRiffer",
            "body": "Some 'righteous cop' character in a book shitting on metalheads and alternative subculture in general. It was clearly the author inserting their own opinion.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ryukotaicho",
            "body": "The poor book unfortunately being overhyped by public. Pretty much the feeling that EVERYONE is reading it, and there’s absolutely no complaining about it.\n\nThe book might honestly be that excellent, but now I don’t want to touch it. The whole “being told to do something when you’re about to do it and now you don’t want to” feeling.\n\nMight eventually read it, just years later. (I do the same thing with Anime).",
            "score": 5,
            "replies": []
        },
        {
            "author": "Anacarnil",
            "body": "Is it ok to be mad at the whole romantasy genre because I hate their focus on superficial character development, psychology, and their ridiculous passion for fanservicing sex without any narrative/logical reason?",
            "score": 9,
            "replies": [
                {
                    "author": "TheGhostofWoodyAllen",
                    "body": "You don't think strong women should tremble as their perfect yet incompatible lovers insert their members between their thighs as her wetness glistens on his pulsing cock with each deepening thrust when they finally have a contrived moment together?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "zippopopamus",
            "body": "I got so pissed when i got to the middle of franny&zooey and found out that zooey is a 25 years old guy. I wanted to throw the book against the wall, thinking there's no gaddamn way anybody at 25 would talk to their mom like that",
            "score": 3,
            "replies": []
        },
        {
            "author": "borlak",
            "body": "I really enjoyed the story, lore, and characters in the Drizzt novels.  But Salvatore's writing is so awful, I couldn't keep reading the books, so I gave up.",
            "score": 3,
            "replies": [
                {
                    "author": "gr8balooga",
                    "body": "I remember them being super depressing as well.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ExcellentResponse382",
            "body": "Author used the word ‘smirked’ in the wrong context. It doesn’t just mean smile, it’s a smug or mocking smile.",
            "score": 3,
            "replies": [
                {
                    "author": "TheGhostofWoodyAllen",
                    "body": "I'm smirking at this comment. /s\n\nIt is similar to how often people use poignant to mean deeply relevant when that's not what it means.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "sallypeach",
                    "body": "Smut authors LOVE using 'smirked', regardless of whether it works or not.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mad_Aeric",
            "body": "This isn't exclusive to books, but is a thing I've noticed across all media. Characters who share my first name are always villains, or at least a jerk or some sort of obstacle. So if I see that name, I know they're going to be a problem, and that annoys me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mrdevil413",
            "body": "Extreme reaction I know but it’s decades of reading that I got to this point a long time ago, if the main character is some kind of OP :: best female cop ever, rolled 20s on all stats and has s tier abilities, the second prince that got all the military training- considered a genius :: as some examples \n\nGets captured ( usually in a very simple to not get captured in way) to further the plot. I can’t do it immediately DNF and back to searching for my next read",
            "score": 3,
            "replies": []
        },
        {
            "author": "ellasaurusrex",
            "body": "Some random Dan Brown book that he constantly mentioned peoples iphones (as opposed to just \"phone\"), and also REPEATEDLY talked about said phones having dial tones. I remember yelling at the book in frustration about it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "penalty-venture",
            "body": "The last chapter of *Homegoing* was frustrating for me simply because I wanted the final two characters to be female like the first two. The circle felt not quite complete as a result IMO.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MaeClementine",
            "body": "The main character shared a (uncommon) name with a reality show contestant I disliked.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kaysamm",
            "body": "I'm preparing to read a (fairly popular) romance set in the town where I grew up. Just reading the synopsis I can tell the author has never been there, and I know I'm going to hate every minute of it because it'll all be wrong. I'm pretty excited. Sometimes it's fun to hate read.\n\nOne that's (slightly?) more legitimate was the romance I DNF'd because the recommendations I saw billed it as a fun, sexy rom-com, and instead the FMC was struggling to get out of an abusive marriage. I knew that was involved going in, but I didn't know it would be as graphic as it was, on page. My fault for not checking the content warnings as close as I should have, but I'm still mad that reviewers I follow didn't mention it. I feel like normally there'd be a 'hey make sure you heed the warnings/ dead dove etc' but there wasn't.  Just gushing over how sexy her writing is. (Which I don't disagree with! I read another book by the same author and I really liked it, and I'll be reading the rest of the series. It's just that one that didnt feel like what was advertised.)",
            "score": 3,
            "replies": [
                {
                    "author": "yesthatnagia",
                    "body": "Gonna need title & author on that second one! I love a rough \"escaping an abuser\" story.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kaysamm",
                            "body": "Long Shot by Kennedy Ryan. A lot of people loved it and I do love her writing, but I just wasn't prepared. I also DNF'd so I can't speak to how much of the book is specifically about the abuse.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kaysamm",
                    "body": "Another: I found out the audiobook version (which I did not plan to listen to) was read by an actor I didn't like. Never read the book.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "turquoise_mutant",
            "body": "Anything with a dog, cause I don't like them. Moment there is a dog I get mad, lol. \n\nOn your blurb tho OP, I really dislike when I find out there is a big glossary or something at the end and I hadn't realized it til I got to the end and it would have been so useful...",
            "score": 12,
            "replies": [
                {
                    "author": "tambitoast",
                    "body": "Now THAT is a controversual opinion lol",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "TopHatGirlInATuxedo",
                    "body": "Oh, great, cats have learned to type.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "closerupper",
                    "body": "I DNFed Marley and Me because everything that dog did that the reader is supposed to find funny, I found incredibly annoying. Plus, those people are horrible pet owners and I was getting a sense of toxic masculinity from the main character",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Deblebsgonnagetyou",
                    "body": "My favourite book is about a dog lol!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MikeyTheShavenApe",
            "body": "On my most recent read of the Hitchhiker's books, I was kind of done with the cynicism of the latter books. For God's sake, just have Fenchurch--the real Fenchurch--pop back into reality on Arthur's flight home. The man has been through enough, give him something at the end of the story.",
            "score": 7,
            "replies": [
                {
                    "author": "Wonderpants_uk",
                    "body": "You need to look up the final coda for the radio dramatisation of Mostly Harmless  then. \n\nAnd Adams himself even acknowledged that the last book was pretty goddamn bleak. If he’d lived, he would have written a more upbeat continuation to it. ",
                    "score": 7,
                    "replies": [
                        {
                            "author": "MyCodesCumpie-ling",
                            "body": "Is this including And Another Thing, or is that not considered canon?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Wonderpants_uk",
                                    "body": "It’s not written by Adams, so probably not canon, but I like it as a feel good ending to the series. I think And Another Thing references it too. \n\n>!In situations of grave danger, Babel Fish can teleport themselves and their hosts to a place of safety. The ones in Arthur and Ford’s ears therefore teleport them to Table 42 at the Restaurant at the End of the Universe, along with the 2 Trillians, who merge and are reunited with Zaphod. Marvin turns out to be again working in the car park there, having been rebuilt as his warranty hasn’t expired, despite him now being older than the universe itself due to having time travelled extensively. Finally, Arthur discovers that Fenchurch has been working there as a waitress since she disappeared, and asks if she’d go flying with him again, to which she says ‘always.’ !<",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SodaSkelly",
                                            "body": "You just healed an old wound for me with this.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ScreenTricky4257",
                    "body": "I tend to stop rereading after the fourth book, except maybe for the bit about sandwich knives.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "emergencybarnacle",
            "body": "very similar, in The Neverending Story, the land is called Fantastika (not Fantasia, like in the movie). I hate the name Fantastika so much, it feels so bad in my head. I DNF unfortunately, because I couldn't keep looking at it.",
            "score": 7,
            "replies": [
                {
                    "author": "jeheuskwnsbxhzjs",
                    "body": "I was annoyed at the movies for doing that name change because I was used to Fantastica lol. But to be fair, in German it’s Phantásien I think. Fantasia is probably a better translation.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "double_teel_green",
            "body": "The Sweet Hereafter by Russell Banks. Great book but I hated the girl in the wheelchair, everything about that subplot was so dated (1991).",
            "score": 2,
            "replies": []
        },
        {
            "author": "zippopopamus",
            "body": "I got so pissed when i got to the middle of franny&zooey and found out that zooey is a 25 years old guy. I wanted to throw the book against the wall, thinking there's no gaddamn way anybody at 25 would talk to their mom like that",
            "score": 2,
            "replies": []
        },
        {
            "author": "OriginalName687",
            "body": "The Andy Serkis version of Lord of the Rings drove me crazy. Fellowship good for the most part but I had to return Two Towers and go back to Inglis instead. \n\nMost of it was fine but the voice he did for Gollum, the Orcs, and the Ents was like nails on a chalkboard. I started fast forwarding through their parts until I finally gave up. \n\nApparently his version is a lot of people’s favorite version but not mine.",
            "score": 2,
            "replies": []
        },
        {
            "author": "little_brown_bat",
            "body": "The book \"Cry, the Beloved Country\"  \n\nThe reason. We read it for English class and were supposed to read \"Lord of the Flies\" and another book whose title I can't remember. We never got to even start \"Lord of the Flies\" because \"Cry, the Beloved Country\" was a slog to get through, no one in the class liked it at all, most just looked up the spark notes and cheesed their way through tests. I refused to \"cheat\" so I tried reading through it. It ended up taking us so long to read we never got to the other books.",
            "score": 2,
            "replies": []
        },
        {
            "author": "69pissdemon69",
            "body": "This has actually happened to me a couple of times. I don't remember what the books were. They kept using the term \"gain purchase\" to say someone grabbed something. Like instead of saying someone grabbed a ledge, it will say he \"gained purchase\" on the ledge. I've never heard anyone say that in real life, and I could probably look past it used once or twice in text, but seeing it over and over grates at me. Ruins the immersion.",
            "score": 2,
            "replies": []
        },
        {
            "author": "basicbolshevik",
            "body": "I just read If We Were Villains and there’s a scene where their college class ends by a bell. All I could think after that is the author originally had it set in HS and aged it up so she could include more “adult” scenes, so every character suddenly felt super immature and YA. Completely broke my interest in the characters after that",
            "score": 2,
            "replies": []
        },
        {
            "author": "KcirderfSdrawkcab",
            "body": "Overuse of the word \"whilst.\" 90 something times.\n\nAlso one use of the \"word\" \"welp\" in a not modern day fantasy book. Definitely not referring to a puppy either.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bda22",
            "body": "The author referred to a calico cat as male",
            "score": 2,
            "replies": [
                {
                    "author": "ProjectedSpirit",
                    "body": "If it makes you feel any better, it can happen. It's a genetic mutation and the cat will be sterile and it's incredibly rare, but not impossible.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "bda22",
                            "body": "yes i do know that, and know that its quite rare - therefore most regular house cat calicos will be female.\n\nIf the author went as far as to describe the cat as calico, i guess they could have kept going to describe the cat as \"one of the very rare, genetically mutated, male calicos\" lol",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ChaoticxSerenity",
                                    "body": "Maybe he's the most special and bestest boy 🥺",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Angharadis",
            "body": "I read the first two ACOTAR and thought they were terrible, but in one (or both?) of them the annoying main character kept painting things with total disregard for how paint works. Like - what type of paint was she using? You use different types for a painting or a house or a wall or a chair! I think she painted a piece of furniture and then rolled around on her paint during sex - like girl, if it was paint that works on a chair you’re going to need mineral spirits to get it off your ass.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Actor412",
            "body": "The very first page described the main character \"looking at the sunset, in the west.\"\n\nYeah, I know which direction the sunset lies. DNF.",
            "score": 2,
            "replies": []
        },
        {
            "author": "H8trucks",
            "body": "I work at a public library and was in charge of their book repair. There was one book in the Court of Thorns and Roses series that seemed to need repair every time it came back from being checked out. I effectively rebound the damn thing and it still had issues. I got so mad at that book that I'll never touch anything in that series.",
            "score": 4,
            "replies": [
                {
                    "author": "AJI-PIanist",
                    "body": "Oh, you double-posted.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "H8trucks",
                            "body": "Aah heck",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Garmiet",
            "body": "I used to take ships and anti-ships way too seriously. If the main character got with “the wrong person,” I’d get upset. Not an uncommon feeling, but one I’ve worked on changing in myself, because it’s a dumb thing to get worked up over.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DentistsAreCool",
            "body": "If a book is overhyped to the point where everyone and their mother recommend it saying “are you even a reader if you don’t read THIS”, I automatically HATE that book",
            "score": 3,
            "replies": []
        },
        {
            "author": "oxycodonefan87",
            "body": "Incorrect terminology based on where / when a book takes place. \n\nLike in a fantasy novel based on a medieval setting, you should not be talking about modern shoe sizes!!!",
            "score": 3,
            "replies": [
                {
                    "author": "TopHatGirlInATuxedo",
                    "body": "Fantasy novel isn't actually medieval history.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "oxycodonefan87",
                    "body": "Oh no really? Is Star Wars not real either?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThaumKitten",
            "body": "Quo Vadis.  \nI got mad because it ended. XD",
            "score": 3,
            "replies": []
        },
        {
            "author": "limeholdthecorona",
            "body": "Just finished Metal Slinger, and the ending has made me mad. There's a twist ending, there's unreliable narrators, then there's... Metal Slinger. lol",
            "score": 2,
            "replies": [
                {
                    "author": "tambitoast",
                    "body": "Oh man yeah I realized I hate unreliable narrators, because it ruined >! The Murder of Roger Ackroyd by Agatha Christie !< for me. I HATED that ending.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "limeholdthecorona",
                            "body": "I don’t mind unreliable narrators, I just think they take a lot of skill to pull off!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MoundDweller0824",
            "body": "Hi all I meant is that I go to Barnes & Noble or Books A Million and 50% of the books that I pick up to check out all seem to be written in the present tense. It just seems to be a current trend over the last few years. It’s like the covers of so many of the cozy mysteries these days that have people on the cover facing away from us. A trend. No offense to the authors. It’s just my own personal opinion. I find it a little uncomfortable that’s all.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MoundDweller0824",
            "body": "I don’t know if this is petty or not but I will not read novels written in the present tense and I especially do not like the fact that so many authors these days have jumped on the bandwagon and are writing that way! I will not read any book written in the present tense.",
            "score": 2,
            "replies": [
                {
                    "author": "tambitoast",
                    "body": "I usually don't even notice if it's present or past tense until halfway through lol",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "littlestbookstore",
                    "body": "I think it can work so long as it isn’t calling attention to itself— that’s when you know it’s a clumsy conceit instead of an effective authorial choice. \n\nI’m curious what you mean by bandwagon, though? The Handmaid’s Tale is written almost completely in present tense and even Les Miserables has some present tense thrown in in certain sections ",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "_kvl_",
            "body": "I quit an audio book because the narrator read the book in the oddest rhythm. It felt so off putting that I went back on Libby and saw that there was another audio book version read by another narrator and listened to it with no issues. \n\nI also got mad at the Sheppards Crown by Terry Pratchett. Not because I didn’t enjoy the book, but simply because it was the last Discworld book. Knowing that I had finished reading the entire series made me sad and angry for a bit because I wanted more. But that passed and I am going back and listening to them all as audiobooks and catching jokes that I missed before as a non British person (pronunciation differences suddenly are making some jokes pop that I missed before. I would highly recommend the audiobooks)",
            "score": 1,
            "replies": []
        },
        {
            "author": "l3tigre",
            "body": "now i wanna know your pronunciation vs hers. Also i love Leigh Bardugo so much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "l3tigre",
            "body": "i like a great sci fi or fantasy novel but some of the names the authors come up with are so stupid I just don't even try to get through or purchase the book. Gives me real Tragedeigh vibes. Also I don't wanna get through 500 pages trying to sound out \"hauagahgayiequieqiuwe\" or whatever in my brain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OriginalName687",
            "body": "The Andy Serkis version of Lord of the Rings drove me crazy. Fellowship good for the most part but I had to return Two Towers and go back to Inglis instead. \n\nMost of it was fine but the voice he did for Gollum, the Orcs, and the Ents was like nails on a chalkboard. I started fast forwarding through their parts until I finally gave up. \n\nApparently his version is a lot of people’s favorite version but not mine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sparksgirl1223",
            "body": "I can't remember thr title nor author but I was insanely mad at a book being set in a small town very near me, the author lived in the next state over \n\nShe CLEARLY looked ONLY at the damn population because she described it exactly the opposite of what it actually is.\n\nActually she described it like the outskirts of Seattle (all lush pine trees and whatnot) when it's maybe an orchard or 2 of apple trees and sagebrush.\n\nMy favorite (not) part being she described the summer town up the high way as a bopping place to party.\n\nAt the time setting of the book...it was a few summer houses and a boat dock back then🤣\n\nIf I hadn't wanted to know who the killer was, I would have angry deleted that download.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SectorSanFrancisco",
            "body": "I'm reading Bill Bryson's *At Home*, and on top of his usual casual fatphobia, he refers to Native Americans as Indians. At first I thought maybe he wrote it in the 1990s but no- it was 2010, so it was a deliberate choice. Serious white Boomer energy.",
            "score": 1,
            "replies": [
                {
                    "author": "Parking-Two2176",
                    "body": "This is a constant source of debate but many people from that community prefer \"Indians.\" In fact the Smithsonian museum for the community is called the Museum of the American Indian. It opened in 2004.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SectorSanFrancisco",
                            "body": "I'd feel better if he'd even used \"American Indian.\"",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bullet_kissed",
            "body": "Taro by Blue Spruell. \n\nAny time there was a Japanese word, it would get *italicized*. And not just the first time it was used, but every time. So a chapter where the MC is being dressed in a *kimono* you had *kimono* italicized every time it was used, which was already far too often. Blah blah blah *kimono*, and my mom really liked this *kimono* because it matched her own *kimono*… \n\nDrove me nuts and I wound up DNFing it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vet_Leeber",
            "body": "FYI your spoiler doesn't work on old.reddit unless you remove the spaces.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Routine_Left",
            "body": "The End of Eternity.The main character is such a doofus. Such a ... ugh, enervating person.\n\nBut then the ending. The ending worth it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ulan250",
            "body": "Nightlife by Rob Thurman because many jokes is about and names and places only American would understand so I didn't get about 50% of the book.\n\nAlso Riftwar Magician Apprentice the protagonist name is PUG I can't... I can't take him seriously.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gargore",
            "body": "One of ghecdragon rider of pern books. The one where they stopped the thread and were happy about what they were pissed about in the first book. They are now out of the job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrangeJourney",
            "body": "When the audiobook narrator stresses the wrong word in a sentence. \"I wasn't asking you. I was asking him.\" In the second sentence he stressed the \"I\" instead of the \"him\".\n\n\n\n\nIn audiobooks where different characters are voiced by different people, sometimes it makes me wonder if they weren't given the context to know which word to emphasize. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "closerupper",
            "body": "Behind Her Eyes by Sarah Pinborough mildly annoyed me the entire time I was reading it because the writing style annoyed me and the characters were irritating. That said, I was intrigued enough by the story that I kept reading because I wanted to know how it ends. I had heard the twist is very good.\n\nThe twist was, in my opinion, the stupidest fucking thing I’ve ever read. It actually made me angry when I finished and I gave it one star",
            "score": 1,
            "replies": []
        },
        {
            "author": "FeelTheWrath79",
            "body": "Realizing later that I read the first book in the series then the third, skipping entirely the 2nd book. I wish I could remember which series it was, because maybe I would try to go back and reread it, but it was when I was 12. It was about dragons or something, but not Dragonlance or anything to do with DnD.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SJWTumblrinaMonster",
            "body": "Station Eleven: THAT'S NOT HOW COMIC BOOKS WORK",
            "score": 1,
            "replies": [
                {
                    "author": "Parking-Two2176",
                    "body": "I've read it but don't remember the comics books...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sunfreckles73",
            "body": "The Traitors by Carissa Ann Lynch:\n\n- The murderer of the book manages to hide an axe in their pants' pocket or the back of their pants, which none of the characters could see or notice. How many people do you know can fit an axe into their pockets? Even suspending belief momentarily, wouldn't the axe be uncomfortable and bulging? \n\n- The murderer of the book is an old man in their 70s. And yet can move at speeds that can rival Olympic champions. The character will be at one end of the castle before appearing at the other end of the castle without being out of breath. And trekking up those stairs! \n\n- And that's not including the number of editing errors such as typos, punctuation, repetition. Did this book go through an editor at all?\n\nCan't recommend this book, sorry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JFKwasInnocent",
            "body": "Ralph Lister in the Shogun audiobook, which is excellent btw, keeps pronouncing the Dutch names as if they are German.\n\nIt is just ridiculously petty of me because I speak Dutch and German and I'm pretty sure Lister does not but \"Pieterszoon\" being pronounced as \"Pieterschön\" annoys me to no end.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slow-Height6274",
            "body": "Was reading Sunrise on the Reaping (10/10 would recommend) and there's a line where 'the snake bared its teeth' and I just. It conjured up the image of the snake with human teeth and completely jolted me out of the story and I had to sit there and calm down for a few minutes. If they had said 'fangs' it would have been fine but I just couldn't stop thinking about [this ](https://www.reddit.com/r/MBMBAM/comments/j6y4ur/googling_snake_with_human_teeth_did_not/)image",
            "score": 1,
            "replies": []
        },
        {
            "author": "darthbob88",
            "body": "I finished it, but I was a little annoyed by [Half-Resurrection Blues](https://www.goodreads.com/book/show/22393174-half-resurrection-blues) by Daniel Jose Older, because so much of the setting and world-building, apart from the urban fantasy \"New York Council of the Dead\", was just \"Have you heard about being Puerto Rican in New York?\" They say you should write what you know, and he really knows that area of the city.\n\nI'm not going to criticize him or the book for this, but I'm not interested in reading more of the series.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Journalist_2303",
            "body": "For a maths puzzle that was wrong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gr8balooga",
            "body": "Book 3 of The Inheritance Cycle TRILOGY ended without finishing the series.  The fourth book in the \"trilogy\" was the last one, and I didn't even enjoy how it ended.  It's the Eragon series of books.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eeeeeeeeeeeum",
            "body": "I dnf Slightly Married because it used niggardly as an adverb and I'm not about words that sound too close to slurs",
            "score": 1,
            "replies": []
        },
        {
            "author": "IndependenceMean8774",
            "body": "A Simple Plan by Scott Smith. The book felt needlessly cruel, and it was impossible for me to believe the basic plot. I also found the narrator's attempts to justify his own horrible actions to be infuriating.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thebookmagpie",
            "body": "I was reading Love & Luck, which is an admittedly fairly terrible YA romance, and the author had the main character, who is IN Ireland, look at a map of Ireland and state that a peninsula stems into... the Pacific. What.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chonny",
            "body": "I don't like authors who aren't concise. I tried reading some GK Chesterton, and didn't make it past the first few pages because I could tell the point he was trying to make, but he was taking so long to make it. Contrast it with Victor Frankl's Man's Search for Meaning where I feel every sentence serves a purpose. \n\nIt's a funny thing: the more the author writes themselves into their prose, the less I want to read them, but if they just tell the story, I'll care more about them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Parking-Two2176",
            "body": "This is more common with older books (thank God) but any egregious fatphobia will set me off. Insulting descriptions of body types, especially women, ESPECIALLY when you realize the character isn't even that big by modern standards. Or the character is fat and they're basically described as eating stupid amounts of food as if they're morons in addition to being fat. I might DNF this Ruth Rendell book I'm in the middle of (published in the 2000s!) because of how it describes one fat character. There was a terrible Sophie Hannah one recently in the new \"Agatha Christie\" series.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DustBinBabyGirl",
            "body": "The Truants pissed me off bc the ML drove a hearse as a car and it was treated like he was So Cool fot it…the book sucked but that was the thing that got me the most lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "clintCamp",
            "body": "I read a book about polyglots solving a world ending problem but the whole book read like it was written by a thing grader. It totally broke it for me and I finished the first book but couldn't get past the first chapter in the second.  I should go back and see what the author's native language is if I can remember the book. It was one of those free books on Amazon a few years ago trying to promote new authors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "internetdiscocat",
            "body": "I was furious at Romantic Comedy by Curtis Sittenfield when the second section of the book was an epistolary email romance. \n\nEmails?? EMAILS???\n\nI was bamboozled by those dumb emails.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FurionEQ",
            "body": "I made it halfway thru A Pale Fire before I realized it was all just an elaborate troll of literary critics.  The whole premise of the novel was to pack in as much symbolic nonsense and unreliable narration as possible and have performed by a deluded college professor.  I felt like an innocent victim of an authors private vendetta.  At least it some of it was funny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MariposaPeligrosa00",
            "body": "The main characters being dumb. Ugh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ranger_1302",
            "body": "So how is that name supposed to be pronounced?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Peachpikachu",
            "body": "Da Vinci Code. There was one chapter where every other sentence was \"Sophie looked shocked\" and I just couldn't take it anymore.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirGigglz",
            "body": "I the Way of Kings, when Kaladin >!finds the spear at the bottom of the chasm and runs through his training form in front of the rest of Bridge Four!<, they use the word \"kata.\" But for me, \"kata\" is a karate-specific term for forms. It's Japanese. Roshar isn't Japan, so why are they calling it a \"kata?\" couldn't they have used any number of other words for it? Heck, it's a Sanderson book; he could have made up some other Alethi word for a set of memorized training movements done in sequence. It kicked me right out of the story.\n\nOf course, I get that this is a ME problem, not a problem with people using \"kata\" how they please. Kata is only that specific in my mind because I spent so many years doing Okinawan karate, I associate the word implicitly with the specific martial arts practice. Other people don't have that connection. But it irks me with every reread and every instance of it later in the books.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mariweeenus",
            "body": "It by Stephen King\n\nYou know exactly why.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ViolaNguyen",
            "body": "New editions with boring covers.\n\nI could say covers with movie photos on them, but I don't consider that to be petty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chanovsky",
            "body": "My sister and I have a running joke about how authors overuse the word \"padded\" to describe someone quietly walking– usually in the morning, down a hallway or the stairs, usually in pajamas.\n\nWe send each other screenshots now every time it pops up, and [we are up to 12 documented \"paddings\"](https://imgur.com/a/98ualLW) now within the books we have read in just the past couple of years! If you hadn't noticed it already, you will now! Sorry in advance... haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "YoureSoStupidRose",
            "body": "Repetitive words, especially when its a repetitive sentence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImaginaryMotor5510",
            "body": "Oh! Romance book where dad is revealed to be a cheater because his wife (main character’s mom) gets cancer. It made me so irritated. I feel like the one place I shouldn’t read about infidelity, especially that extra-horrific kind, is in romance.\n\nBeach Read by Emily Henry.\n\nEdit: I don’t think this is a ridiculous thing but eh 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "gypsymsun",
            "body": "Conversations with friends by Sally Rooney. The ending literally was nothing, nothing happened at all. Crap.",
            "score": 1,
            "replies": []
        },
        {
            "author": "estheredna",
            "body": "I remember a review in the 90s where Stephen King said the Harry Potter books used way too many adverbs (quickly, knowingly, wisely, etc).  Goofy reasoning but fair enough.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tuggas",
            "body": "Stephen Kings Holly. The constant talk about covid, masks, and anti vaxers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "suppadelicious",
            "body": "If a book has the uneven page edges I won’t read it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "opaldawn88",
            "body": "It wasn’t a hardcover… lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "831_",
            "body": "In Stephen Baxter's Manifold: Time, a character proves a point using probability:\n\n> Cornelius reached under the table and produced a wooden box, sealed up. It had a single grooved outlet, with a wooden lever alongside. ‘In this box there are a number of balls. One of them has your name on it, Malenfant; the rest are blank. If you press the lever you will retrieve the balls one at a time, and you may inspect them. The retrieval will be truly random.\n\n> ‘I won't give you the opportunity to inspect the box, save to draw out the balls with the lever. But I promise you there are either ten balls in here—or a thousand. Now. Would you hazard which is the true number, ten or a thousand?’\n\n> ‘Nope. Not without evidence.’\n\n> ‘Very wise. Please, pull the lever.’\n\n> Malenfant drummed his fingers on the tabletop. Then he pressed the lever. A small black marble popped into the slot. Malenfant inspected it; it was blank. Emma could see there was easily room for a thousand such balls in the box, if need be.\n\n> Malenfant scowled and pressed the lever again.\n\n> His name was on the third ball he produced.\n\n> ‘There are ten balls in the box,’ said Malenfant immediately.\n\n> ‘Why do you say that ?’\n\n> ‘Because if there were a thousand in there it's not likely that I'd reach myself so quickly.’\n\n> Cornelius nodded. ‘Your intuition is sound. This is an example of Baye's rule, wich is a technique for assigning probabilities to competing hypotheses with only limited information. In fact--’ He hesitated, calculating. ‘--The probability that you're right is now two thirds, on the basis of your ball being third out.’ \n\nIt's all good except... The actual probability of there being 10 balls instead of 1000 is 100/101, not 2/3. \n\nIt just... completely ruined the book for me. How can it be hard sci-fi if the math is provably wrong!? There is no suspension of disbelief if I know for sure that it's not true!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cachar",
            "body": "Smacking me in the face. I was reading the Buddenbrocks in bed and already wasn't enjoying it a lot. I sort off dozed off with the heavy book propped up on my chest and it fell right on my face. I decided it was a sign and did not finish the book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ohfrackthis",
            "body": "Names of characters,  repetition of stupid phrases such as \"his shitkickers\" looking at you JD Ward ugh. I would say fictional maps but I would have to abandon 60% of my books if I dismissed them on that reason alone. I just hate fictional maps for these reasons: 1- I read on a Kindle and they look shitty 2- the maps are always either too detailed or not detailed enough with no in between 3- my brain always wants to absorb and study said stupid fictional maps like I'm taking a damn quiz so I'll bookmark it and then try to finagle stuff from the book to reference of the map and it's usually a dumb unnecessary process.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kamirose",
            "body": "I got mad at Robert Jordan for always using the word \"bosom\" in Wheel of Time. If you're gonna obsessively mention every female character's boobs, at least use a variety of words for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "agoia",
            "body": "The author kept reusing the title in the book. Like a few times each chapter. I eventually just gave up and reread a different book about the same topic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "quietscribe77",
            "body": "MMC/love interest was blonde. I’m soooo not in to blonde guys 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mind101",
            "body": "It was SHOCKING how many times J.F. Brink used SHOCKING to describe something in the first Defiance of the Fall books. Thankfully it's let up since, but I still wince every time I hear it.\n\nAlso, the MC never laughs, chuckles, or guffaws - he always, ALWAYS just smirks...",
            "score": 1,
            "replies": []
        },
        {
            "author": "hagrid007",
            "body": "Buying the last in a series, and finding that the cover had one of those awful stickers on (cannot be removed without defacing the cover) just to say \"As seen on TV\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "ToasterOwl",
            "body": "Used the word ‘Perfectly‘ in the first page. I despise that word, it tells me nothing other than an action was performed well. There’s no personality to it, no verve, no sense of style. This action was performed to the pinnacle a human could achieve. Dull. \n\nQuite a few books, I just have this one really specific pet peeve.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eligius_MS",
            "body": "Audiobook narrator pronounced 'aloe' as AY-lo. Not sure which annoyed me more, making it two syllables or the long 'a' sound. Could not get through the rest of that chapter before tapping out and never going back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmokyBarnable01",
            "body": "I won't read anything that takes more than one book to tell it's story anymore. Sure there's a fine literary tradition of it such as Proust, Durrell or Tolkien but now it just seems like an attempt to bulk a thin story out to maximise sales. I've definitely been burned by too many multi volume fantasy 'epics', as soon as I see 'book 1 of the Blerghvx saga' I'm out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MacDugin",
            "body": "How many times she tugged her braid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "realbingoheeler",
            "body": "I DNF’d a book because it had my ex’s name in it. Wasn’t even a main character. Some small side character whose name probably wouldn’t be mentioned much, but I hated it. It’s an uncommon name so that was also part of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Taste-9749",
            "body": "It was about a city that I visit a lot and the stereotypes were raging. I hated it. I swear she’s never been there or to the state at all. And I know it didn’t matter to the plot that much, but it was so frustrating",
            "score": 1,
            "replies": []
        },
        {
            "author": "cruzredditmail",
            "body": "Anne Rice - preternatural.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FittyTheBone",
            "body": "I finished Count of Monte Cristo when I was 19, proudly put the book down, and saw the word \"abridged\" for the first time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "donquixote2000",
            "body": "Contractions. It's terrible. He's being petty. The road's so rocky. Be careful, the slope's sļippery. You're right, I'm a pedant.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low-Ad-1092",
            "body": "I stopped reading Stephen King books because I was tired of all his characters being low key bigots.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lagrey_648",
            "body": "Too many “vulgar gestures”",
            "score": 1,
            "replies": []
        },
        {
            "author": "BethiePage42",
            "body": "I don't know if it counts, but I was reading a series by TJ Klune. I had a long drive, so I got the third one on audiobook. One of the main characters was a drag queen whose stage name was \"Helena Handbasket\" and the narrator kept saying \"He- LEEN-a\" I was so mad I couldn't even listen.",
            "score": 1,
            "replies": [
                {
                    "author": "Coffeeandbooks1031",
                    "body": "Ugh. I had a similar problem with The House on the Cerulean Sea by TJ Klune. The audiobook narrator kept pronouncing it “ga-zA-bow” instead of “ga-zee-bow” and it just really drove me nuts!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bb_or_not_bb",
            "body": "I read a book where the characters summer at a beach town that I grew up near. At one point, they mention being on a ferry going over the ocean to get to the town. The ferries go across the bay to get to that particular beach town, they don’t go near the ocean. \n\nI was so annoyed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cecidelillo",
            "body": "I bought a book that I was really interested in reading because it was based on a true story. A missing girl’s case. The introduction was so gripping that I actually cried on the train. But before the first chapter, there was a disclaimer that the book was a work of fiction and none of the characters nor the story was true. I got so upset, betrayed if I’m honest, that I left the book on a shelf at Tesco and exchanged it for a Stephen King’s one. I was so pissed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wickd7witchwest",
            "body": "Dune. Does anyone know why authors reuse the same basic names?",
            "score": 1,
            "replies": []
        },
        {
            "author": "krysnyte",
            "body": "My favorite writer put the Epic NPC man characters in her last book I read.  Annoyed me so much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArtisticButtMole",
            "body": "Reading a book called ‘Unwind’ for school,  wasn’t that good but an entertaining read. But there was this one scene that basically went like “He punched him. “That’s for leaving us,” he said. And then he hugged him. “And this…this is because I missed you.” \n\nAfter that I was pissed",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReichMirDieHand",
            "body": "The author had a character who was described as \"perfectly average\" in every way - looks, intelligence, charm - and yet, this character somehow managed to become everyone's favorite and the hero of the story. It bugged me because there was no explanation for why everyone gravitated toward them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "squid-toes",
            "body": "I read a romcom by someone and at the end the famous pop star performed at the hockey arena in Nashville to a crowd of something like 50k. The capacity at that stadium is closer to 20k and it made me irrationally angry. The author could have taken the same 40 seconds I took to verify capacity, or have used the Titans stadium instead, but no, just wrong for no reason other than laziness I’d assume.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Warm_Shoulder3606",
            "body": "Ella Minnow Pea royally pisses me off because of how it's literally written\n\nThe book takes place on an island where the guy who came up with the \"The quick brown fox jumps over the lazy dog\" was from. And the folks on the island adore him like a deity and take the statue and sign very seriously. They have a statue of him in the town square with that phrase on it. Well, one day, a letter falls off the sign. The town holds a meeting and the council decides to ban the letter that falls off. As more and more letters fall off, more and more letters get banned from usage. OK, fine, you say. What's the deal, why do you hate it?\n\nWell, the book is written in first person perspective from residents on the island via letters they write to each other. So, as letters get banned, the way the book is physically written changes. It becomes such a fucking headache to figure out what these people are saying because they've gotta come up with new, weird ways to spell words in order to work around the letter bans. And because more and more letters fall as the book progresses, it becomes more and more convoluted. Here's an excerpt:\n\n\"To the Towgate Phamilee:\n\nPlease asept mie hartphelt simpathee at this time. Georgeanne passt awae last night phrom let poisoning. She paintet her whole selph phrom het to toe with manee prettee, ornamental hews. She was so resplentent, almost ratiant in repose- the happee, appealing pigments an aesthetit reminter oph her lophlee warm spirit. She shoot loog smashing 4 the phooneral. Her remains shoot arriph shortless. With all regrets, Ella Minnow Pea\"\n\nThe WHOLE BOOK is like that, it's unbearable. I've read books before that I didn't like or that were whatever to me, but that's the one book I've ever read that actively genuinely makes me mad",
            "score": 1,
            "replies": [
                {
                    "author": "Coffeeandbooks1031",
                    "body": "No one else I know has ever read this book and I want to talk about it all the time lol. I loved it! I thought it was an interesting challenge to read.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Warm_Shoulder3606",
                            "body": "It's so funny too, there seems to be nobody else on earth who is of the same opinion of this book as me lol. Like you look at goodreads or on reddit threads or somewhere else people leave book reviews, everyone who ever reads this book adores it and has so much fun with it and loves the concept, and then there's me bashing my head into a wall out of frustration with it 🤣😭 And credit where credit is due, it's a very unique concept and props to the author because I'm sure it was a challenge to write. But man, once the spellings start getting super convoluted and like a third of the alphabet is missing and vowels start dropping, I just can't with it lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "StopHammerTom",
            "body": "I gave Throne of Glass a shot. One of the castle guards is described having bronze armor. Why the hell would he have weak and inferior armor if he’s guarding the king? They have iron",
            "score": 1,
            "replies": []
        },
        {
            "author": "anitalincolnarts",
            "body": "The protagonist bit her lip three times by page sixteen. I’d had enough, after waiting six months on the hold list at the library. Almost threw it across the room.",
            "score": 1,
            "replies": []
        },
        {
            "author": "g_Vaishali",
            "body": "I was reading yellowface and initially it checked all the right boxes for me. Funny, smart, well written, but then the punch after punch against writers and how cruel it is to make it in the writing industry, was really bumming me out. So I just dnfed it. \n\nI would not suggest this book to a writer in making or someone who's about to get their first book publish.",
            "score": 1,
            "replies": []
        },
        {
            "author": "scorpiemm",
            "body": "better than movies by lynn painter has the main character say that daisy buchanan is the “unambiguous villain” of great gatsby, and i’ve been refusing to read her books ever since",
            "score": 1,
            "replies": []
        },
        {
            "author": "Warm_Shoulder3606",
            "body": "I like the books, but a small detail that ***really*** annoys me in the Hunger Games trilogy is the fact that it's told in present tense. I don't know why, there's just something about \"I say\", \"I yell\", \"He screams\", \"She mutters\", etc. that sticks out like a sour thumb to me and really annoys me",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoochoMaas",
            "body": "Cari Mora - Thomas Harris  \nsomewhere in the beginning he got dura mater and arachnoid mater (brain lining layers) wrong or mixed up and I DNFd\n\nRetired RN",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotYourGa1Friday",
            "body": "An author spelled out an accent instead of just letting me know where the character was from. I stopped reading when the character began a TED Talk on the importance of “terlets“ (toilets)",
            "score": 1,
            "replies": []
        },
        {
            "author": "MuonManLaserJab",
            "body": "I read a story that was pretty good but it complained about Chopin all the time...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lucy1813",
            "body": "The pettiest reason I can remember is the repeated misuse of semi-colons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sapghp",
            "body": "This murder thriller where the main character always overheard phone conversations and could somehow hear both sides of the call even when the person was in a car and the character was inside a building. It was always for crucial story info and it happened THE WHOLE TIME. It drove me mad. It’s a stupid book - The Butcher And The Wren.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SadoraNortica",
            "body": "I won’t name names but I finished a book that is the first book in a trilogy. \n\nFirst off the jacket art had what looked to be two males on the cover with “forbidden love” in the description. I thought it was a gay vampire story. It wasn’t gay. \n\nSecond, I read the about the author, after I finished, and it said he didn’t believe in happy endings. It was already a difficult read with all the suffering the characters had to endure. While I can handle that, I’m not a fan of tragic endings. \n\nThird, I went on a fantasy book subreddit to ask if the author was known for sad endings and if it would be safe to continue since I’m not mentally in a place for heartbreak over characters I spent 3 books growing attached to. The author’s fans were quite rude. I went there to have them convince me to continue the series and they failed, miserably. \n\nI donated the book and will not be continuing the story or ever read that author again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cozykeegs",
            "body": "When the only good part is the smut. If the story sucks and it has the hottest smut scene, at that point I don't even want the smut cause there's nothing backing it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LLJKotaru_Work",
            "body": "Harry Turtledove's colonization series. I'm supposed to have sympathy for the 'murder' of thousands of invading aliens in cold sleep whose fellows have caused millions of human deaths with their aggressive attempts to colonize another world? Imperial racist alien colonizers are not innocent. The entire train of thought from Sam Yeager and his son really ripped me out of my enjoyment. \n\nAlongside the laundry of list of repetitive turtleisms that plague the author.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sea_Arm_304",
            "body": "I read a book where the author had the MC casually take the battery out of their iPhone for a few hours and then put it back in. No tools, just pop the back off and remove the battery.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bliggityblig",
            "body": "James Joyce Ulysses because I was forced to read it in a class I took as an elective. I LOVE reading and that is the only book I failed a test on because I just couldn't finish that pretentious bullshit.  Made it worse that actual English majors would give classmates hell if they dared say anything critical of it. Sorry had to vent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "billyandteddy",
            "body": "I was reading this fantasy slice of life iseki book and I spent like 700+ chapters reading about the main character and her family and how her life revolved around raising her kids and then she magically gets transported back into the real world and she and the author seemingly forgot about her kids for like 50 chapters and then all she says is she misses them in one sentence and then her kids aren’t mentioned again for like another 300 chapters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guillotine-Wit",
            "body": "It ended.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Namen37",
            "body": "None of the characters walked anywhere. They all padded from place to place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1angrypanda",
            "body": "The main character was from my home town, Colorado Springs. She spent a lot of time complaining about the weather, specifically the rain. \n\nWe get rain here for about 30 minutes in the afternoon for June and most of July. That’s it. Otherwise it’s basically a desert. Even in winter, we don’t get a ton of snow. The sun shines most days here, even if it’s below freezing. \n\nI DNFd but I’m still unreasonably frustrated about it. How do you set a book somewhere you know nothing about and not even bother to Google it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExternalSelf1337",
            "body": "All the Reacher novels: He uses periods instead of commas.",
            "score": 1,
            "replies": []
        },
        {
            "author": "al-sahm",
            "body": "books set in times new roman",
            "score": 1,
            "replies": []
        },
        {
            "author": "candlelightandcocoa",
            "body": "One I recently finished was where the author had to keep mentioning that this Nazi kept styling his hair with Brylcreem before going off to his Nazi meetings.  \n\nI kept thinking, 'a little dab will do ya' (the old ad) and the LOL over that took me out of the tense WWII drama.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mistervimes65",
            "body": "The author of a fantasy series used terms for weapons and armor that made it clear they were just using a list of items from a D&D book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "labhraitearnafocail",
            "body": "in james islington’s debut, the licanius trilogy, it is clear that he learned the word “melange” half way through book two and used it everywhere he might have used mixture in the third book",
            "score": 1,
            "replies": []
        },
        {
            "author": "AJL42",
            "body": "The Licanius Trilogy, especially in book 2 has entire chapters in italics. I'm dyslexic so it ended up playing haywire with my reading comprehension.\n\n\nAny large selection in italics now triggers me immediately.",
            "score": 1,
            "replies": []
        },
        {
            "author": "streamstroller",
            "body": "The 5th book in a 5 book series that took DECADES to conclude had the most bullshit shenanigans at the end that just undid every inch of character growth and storytelling. Just absolute trash and I was so pissed that I threw the book across the room, then got up and stomped on it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGhostofWoodyAllen",
            "body": "*The Cretaceous Past* by Cixin Liu has dinosaurs that weren't around in the Cretaceous. Still enjoyed the story, but it bugged the everloving shit outta me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Left_Lengthiness_433",
            "body": "When Dragons Rage, by Michael Stackpole.\n\n>!He kills off the main character, only to have him “come back” in the next book as a completely different character with a completely different personality.!<",
            "score": 1,
            "replies": []
        },
        {
            "author": "lindsaydemo",
            "body": "I have a really hard time reading romance books mostly because of many authors’ overuse of the word “murmured”. I get what they are trying to convey but after reading it over and over it has annoyed me to the point where I have declared I will no longer read romance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Naznarreb",
            "body": "In junior high I picked up one of the Xanth novels by Piers Anthony, flipped it open to the map, saw that it was just Florida with marginally different names, and put it down in disgust",
            "score": 1,
            "replies": []
        },
        {
            "author": "byingling",
            "body": "It's  pronounced 'gif'.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MissReanimator",
            "body": "I stopped reading a book because the main character referred to all police as \"coppers.\" Not occasionally as if it were a little quirk, but every single time she thought about a cop, spoke to a cop, saw a cop.\n\nAnd since she, herself, was a cop, she said \"copper\" a lot. Way too much, actually.",
            "score": 1,
            "replies": []
        },
        {
            "author": "the_spice_police",
            "body": "I gave up on Wheel of Time about 4-5 books into the series. Besides the tortuously slow pacing, the most annoying thing was how Nynaeve could seemingly ONLY express herself by tugging her braid and smoothing her skirts every fucking five seconds of every scene she was in. And this is from someone who has no problem with long, slow paced books (I loved the whole Dune series and was devastated when I finished the sixth one), but after a few thousand predictable and unnecessary tics later I just couldn't do it anymore. \n\n  \nThe story was good too, but my god Robert there's more than one way to show a character is annoyed",
            "score": 1,
            "replies": []
        },
        {
            "author": "fendaar",
            "body": "John Edward Williams uses far too many semicolons in Stoner; it seems every sentence has at least one; sometimes, there will be two or three in a sentence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy-Condition2500",
            "body": "I hope I don’t get too much hate for this since it’s such a well known book but I was so upset about reading a book within a book. Not just a snippet but a WHOLE chapter…just to find out that THE book was a fake-me-out meant to throw people off. I’m still offended because I read that as “yea, I wanted your time and now, you know.” I disliked  that aspect of that book VERY much!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Irisisawoman",
            "body": "The print was too large.\nThe print was too small.\nThe author used too many colons.\nAnd many other reasons. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoodMagazine9040",
            "body": "Reading  Skin of the Sea by Natasha Bowen and the amount of times the main character mentions her “curls, coils, braids, curly hair, twists” is ridiculous lol And I say this as a black woman it’s like the author wanted to remind you every 5 seconds that the protagonist was a black girl. The sentences would be like . “She twirled her black curls pensively before answering the question. Before she spoke she ran her hands through her thick coils as the curls got stuck in her fingers. As they attacked her curls covered her face making her lost in a sea of coils.”\nLike we get it she has curly hair! 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "CriscoCamping",
            "body": "This isn't exactly fulfilling the answer, but when I tried getting into audiobooks I started with some books I liked in high school, by Ayn Rand (this prior to my brain hardening) .\n\n Now of course they're complete garbage in terms of their philosophy, but I did have a soft spot for them. The problem was the narrator was also the narrator of Thomas the Train, which I heard an inordinate number of times as a toddler parent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EdgarsFlowers",
            "body": "I'm currently struggling with the book of the Super Powereds by Drew Hayes because he keeps using the word \"said\" for every. sentence. uttered. by. a. character. \nLike mofo.... Do I need to mail you a tabbed thesaurus with *all* your options for the word \"said\"?! Fucks sake. \n\n\nI love the story to be clear but the writing feels kinda lazy and I want to scream.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MushroomAdjacent",
            "body": "Comma usage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fluffy-KatRunner",
            "body": "Many years ago, I ran down the stairs screaming it was a religious book when I found out Edward was a virgin.  Put the book down and waited to finish!",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Pinkstead_",
            "body": "I started reading Lessons in Chemistry and right from the start I got the impression that the author was a lay-chemist. I said to my husband, “…if she dares to call the table salt “sodium chloride” I am putting this book in the bin”.\n\nIt went in the bin before the third chapter I think. \n😞😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "wolf_kisses",
            "body": "Most recent one I can think of is when I came across a typo on the very first page, then another one just a few sentences later. There weren't any more in the rest of the book, but come ooonnn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Any_Soup_3571",
            "body": "Started sending the main character to sleep in his second floor bedroom. The home was one story for 30+ books. \n I don’t respond well to Inconsistencies in small details. Lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "BtDB",
            "body": "Catcher in the Rye.\n\nsays some variation of \"It really does\" so many times.  I had a count at one point.  \n\nI've never had a book hang on me so long. It isn't even well written. \n\nHolden is a terrible kid.  The fact that it spoke to the Boomer generation makes them make a lot more sense.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UpvoteBecauseReasons",
            "body": "Hugh Howey, Silo. He uses 'silicone' when he should have used 'silicon.' Had to put it down .",
            "score": 1,
            "replies": []
        },
        {
            "author": "cat6Wire",
            "body": "Years ago when I was in my twenties, I went through an Ayn Rand phase (yes I know) where I devoured all her books, fascinated with her philosophical ideas, views on society etc.  \n\nLike many young men, I was fully bought into the idea of the 'virtue of selfishness' (I even read that book of essays often), and bought into her all or nothing approach to morality.\n\nThen, when reading 'Atlas Shrugged', there was I remember a scene where Dagny Taggart and Howard Roark were driving through the countryside, and she happens to comment, to paraphrase, that some people want to _ban billboards_, which is anti-capitalistic.\n\nWait a second, I thought, I hate billboards, of course a beautiful countryside should not be spoiled by a crass advertisement.. and then it started to unravel for me. It was the little tumbling rock that kicked off an avalanche of re-evaluation of what I was buying into, the awful vision of a world devoid of human empathy, love of nature, general humanity.\n\nSo for the most part, I have completely rejected her views. There was much more - her weird sexual assault love scenes, her love of 80-page court drama monologues, and the complete hypocrisy how she carried on in her personal life (interfering in the marriage of her assistant that she was mentoring) while demanding strict adherence and loyalty to her ideas.\n\nSo imagine how funny it has been to me to see this resurgence of her writings, promoted by people that clearly have not read her books carefully, or are cynically using those concepts to manipulate less experienced minds for their own ends.  Crazy!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Consistent-Climate16",
            "body": "One Hundred Years of Solitude- why did different characters have the same name? Ughh!\n\nI read 2/3rd of the book but didn’t finish it, didn’t understand what was going on, or what was the point of it all. Maybe magical realism isn’t for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lombard333",
            "body": "I can see this complaint, but to be far, families do pass on names. I have a cousin named after my grandma, and another cousin who is the third to be named “Michael” in a row (after his dad and grandfather). It’s confusing but I found it realistic",
            "score": 3,
            "replies": []
        },
        {
            "author": "arowthay",
            "body": "Lol I'm here for this. Currently on my second re-read\n\nThe thing you have to know about this is it's basically all a metaphor for the history of Colombia. From indigenous history, to being 'found' and colonized by the Spanish. With immigration from Europe, the Middle East, the African diaspora too. Between independence, and reconquest, and independence again. Federalism, republicanism, etc. The real [banana massacre](https://en.wikipedia.org/wiki/Banana_Massacre)\n\nThe names being confusing give a sense of it all kind of happening in a cycle, while the magical realism evokes Greek myth. It's like this mythology of Colombia and you do need to know some background to really get it imo. \n\nThere's a kind of fun piece in the bbc about towns (and events) inspiring the book https://www.bbc.com/travel/article/20241218-the-towns-that-inspired-one-hundred-years-of-solitude",
            "score": 2,
            "replies": []
        },
        {
            "author": "schroedingerx",
            "body": "Talking this over with my wife and we aren’t finding many. \n\nWhen I’ve been mad at a book it’s been big mad for angry reasons. I get petty about movies but maybe I’m just more forgiving for books.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tambitoast",
            "body": "Usually I'm the same, but this really annoyed me for some reason. Don't know why.",
            "score": 2,
            "replies": []
        },
        {
            "author": "schroedingerx",
            "body": "Honestly what you wrote completely made sense. It's why we discussed it -- thought we'd quickly find funny examples, but then came up completely dry.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stunning_One1005",
            "body": "Slaughterhouse five fits this, more or less…",
            "score": 1,
            "replies": []
        },
        {
            "author": "-p_d-",
            "body": "It most assuredly does not.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Stunning_One1005",
            "body": "idk about you but i got a little tired of all the “more or less”es",
            "score": 1,
            "replies": []
        },
        {
            "author": "biter7753",
            "body": "The author kept using the word “slacks” instead of pants.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TopHatGirlInATuxedo",
            "body": "Are you sure the book wasn't British?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Machobots",
            "body": "Spends 100+ pages describing how the hero perfects the art of using magic to fuck a fairy.\n\n\nDude, wtf are you making us read? ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Subservient_Foxy",
            "body": "Oh, I hate that book so much! 😡 It was some kinda dictionary... Feels like it has all words in the world in there! Because it feels like it weighs a ton! So, it fell on my head from a high shelf 📖💥🤕\nWorst. Book. Ever!",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -1,
            "replies": []
        },
        {
            "author": "TigerHall",
            "body": "> the use of the word 'kerfuffle' to describe a commotion\n\nThat's... what the word means? What about the description didn't land for you?",
            "score": 6,
            "replies": []
        },
        {
            "author": "GESNodoon",
            "body": "I have never gotten mad at a book.  I have not finished books, I have not liked books.  I have never been mad at one.",
            "score": -7,
            "replies": []
        },
        {
            "author": "tambitoast",
            "body": "You're stronger than most of us",
            "score": 6,
            "replies": []
        },
        {
            "author": "GESNodoon",
            "body": "Perhaps.  I doubt that though.  I just do not hate inanimate things.",
            "score": -5,
            "replies": []
        },
        {
            "author": "tambitoast",
            "body": "You also seem to take internet posts that have been made for fun way too seriously.",
            "score": 9,
            "replies": []
        },
        {
            "author": "GESNodoon",
            "body": "I mean, you asked a question...I answered your question.  Are you mad that I did not answer the way you wanted me to?  Are you taking my answers to seriously, perhaps?",
            "score": -5,
            "replies": []
        },
        {
            "author": "tambitoast",
            "body": "Just saying that if you have no answer that is relevant to the question you could also just keep scrolling I guess. Your comment comes off as if you feel superior to other people in this thread for not having 'silly emotions' about books. Honestly I feel bad for you if you never get emotional over books, that's one of the most fun parts about the hobby of reading to me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GESNodoon",
            "body": "I do not feel superior to anyone.  You can enjoy books how you want and I can enjoy books how I want.  I apologize if my response was so upsetting to you.  I have no idea why it would have been but whatever, people react to things in all kinds of ways.  \n\nI enjoy books for the world it creates in my imagination.  You are correct that I do not get emotional over them though.  I did not know that was a requirement for reading books.  You have taught me now though, I will read in a completely new way going forward.\n\n  \n:)",
            "score": -1,
            "replies": []
        },
        {
            "author": "CHRISKVAS",
            "body": "I don’t think people are mad at the literal book itself… People get mad at the choices the author made when writing the book or what they chose to convey to the reader.",
            "score": 6,
            "replies": []
        },
        {
            "author": "GESNodoon",
            "body": "And that does make sense.  Still, I would not get \"mad\" at the book or the author.  There can be books written poorly and there can be books that I just do not like but those are not reasons to be mad.  I can be disappointed I suppose.  Maybe the concept for the book is really good but something about the way it is written is not what I want.  Or it is part of a series and the direction it goes is not what I expect or any number of other reasons.  But still cannot get mad at an artist for not doing what I want them to do and I can not get mad at the art just because I do not like it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "helloviolaine",
            "body": "What about the ones that have those icky rubbery covers instead of normal paper that doesn't peel off after one read",
            "score": 4,
            "replies": []
        },
        {
            "author": "GESNodoon",
            "body": "I do not think I have ever run into this.  Now I will try to avoid it :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Historical_Bunch_927",
            "body": "I think I could theoretically get mad at a book, I just don't think I have though.",
            "score": 3,
            "replies": []
        }
    ]
}