{
    "title": "Do you study maps and family trees at the beginning of novels?",
    "author": "peripheralpill",
    "subreddit": "books",
    "rank": 3,
    "score": 39,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 50,
    "url": "https://www.reddit.com/r/books/comments/1jefphu/do_you_study_maps_and_family_trees_at_the/",
    "id": "1jefphu",
    "selftext": "Or flip back and forth as necessary, or ignore them entirely and hope the story does a good enough job of cluing you in?\n\nOr does it depend on the format?\n\nFor me, if its a physical book, it takes little to hold your place and flip to the beginning and back, but I find that too annoying to do when reading an ebook.",
    "comments": [
        {
            "author": "AutumnDream1ng",
            "body": "Nope. I just use them as reference if I get confused.",
            "score": 46,
            "replies": [
                {
                    "author": "smootex",
                    "body": "Yep. And then I get annoyed because flipping back and forth in an ebook is a pain and sometimes you can't even read the graphics. Physical books had some advantages. There are a handful of books that are really hard to follow without being able to see the list of who's who.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "infidel99",
                            "body": "my ebook reader lets me click on a characters name and brings up a list of all previous times the character was named.  The first entry gives you the author's description.  Also a dictionary for words I'm not sure on.  I miss the feel of real books but tech really helps read modern ponderous novels with Tolkien style depth.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "smootex",
                                    "body": "Which reader do you have that does that? I have a very old kindle.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Natural_Let3999",
                                    "body": "This would be a live saver fore, as I'm currently reading Malazan. How do you do it?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Grammey2",
                    "body": "Yes this!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChoneFigginsStan",
            "body": "I look at maps. I’ve had a lifelong love of maps. Idk if I’ve ever encountered a family tree, except in “The Fortune of the Rougons” and I assumed it was put there after the fact by Penguin and the translator, and wasn’t part of the original work.",
            "score": 10,
            "replies": []
        },
        {
            "author": "HypotheticalMuskrat",
            "body": "I do both. I'll study a map for a few moments before starting the book and then flip back occasionally to refresh my memory and orient myself in the story.",
            "score": 9,
            "replies": [
                {
                    "author": "Darkrai240404",
                    "body": "Same, I take a quick look when I start a new book, and whenever new locations or directions are mentioned I flip back so I can follow the story better.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrggy",
            "body": "I'm that person who looks everything up on Google Maps. If a character in a show mentions a location I'm unfamiliar with, I check Google Maps. If a friend mentions a restaurant or neighborhood I've never heard of, I look up where it is on Google Maps. I have a really good sense of direction as a result lol. \n\n\nSo, given that that's my personality and default approach to life, of course I study the maps. I also flip back to it whenever a location is mentioned",
            "score": 5,
            "replies": [
                {
                    "author": "Annual-Body-25",
                    "body": "Google maps is like my social media lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lIlIllIIlllIIIlllIII",
            "body": "Personally, and I may be in the minority with this one, but if a book has a map or family tree at the beginning, I’m not reading it. I just know it’s going to be such a chore for me to keep flipping back and forth to keep track of what’s happening and I read for pleasure and to unwind. I know this disqualifies me from reading a lot of fantasy books but I’ve never been into the genre anyway so I guess it worked out well that way ",
            "score": 15,
            "replies": [
                {
                    "author": "Whatdiffer",
                    "body": "It doesn’t disqualify you. The maps, in my experience, are just for fun, or at least can be. I don’t bother with them beyond a cursory glance and it’s never hindered an experience.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "lIlIllIIlllIIIlllIII",
                            "body": "That’s fair, I’ve just noticed that the map and family trees usually go hand in hand. I haven’t seen a book with a map but without a family tree, and I think it’s the family tree that completely puts me off. If it’s just a map, whatever, but it rarely is",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "dth300",
                                    "body": "Conversely I’d say that I’ve seen far more books with maps, but without family trees, than with both",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "lIlIllIIlllIIIlllIII",
                                            "body": "I definitely believe you I just haven’t had that same luck haha",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KeaAware",
            "body": "Nope. \n\nIf i really love the book enough to reread it obsessively, then at some point, I'll probably glance at a map. Maybe at the 5th or 6th read?\n\nFamily trees, nope. Unless there's a really funny who's who at the beginning? But even then, on the first read I don't know who any of the people are, so I don't really care and won't remember.",
            "score": 5,
            "replies": []
        },
        {
            "author": "MikaAdhonorem",
            "body": "I do.  I get a feel for the land.  It's like reading an introduction to a book.  It sets the stage.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Necessary_Chip9934",
            "body": "I glance at them at the beginning, knowing they won't make sense until I get into the story. Then I definitely refer back to maps and charts. In fact, I like to do that. That's for actual books. \n\nFor ebooks, it's not convenient to look back so I don't.",
            "score": 4,
            "replies": []
        },
        {
            "author": "YakSlothLemon",
            "body": "Both— I will give it or any kind of map a good glance, and then I’m flipping to it when I need to!",
            "score": 3,
            "replies": []
        },
        {
            "author": "HollzStars",
            "body": "I love maps so I always spend a few minutes looking them over when I come across them in books. \n\nSometimes I go back, sometimes I don’t, depends on the book and how good the map was.",
            "score": 3,
            "replies": []
        },
        {
            "author": "KashiBrat",
            "body": "If it's a grrm book, I will read the family tree until my brain hurts. I cannot, for the life of me, remember which  aegon the whatever did what in his lifetime. Otherwise no. \n\nMaps, i will study. I like knowing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BiWaffleesss",
            "body": "Maps, no. Family trees, yeah.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Anxious-Fun8829",
            "body": "The only time I referenced the family tree was for One Hundred Years of Solitude.",
            "score": 2,
            "replies": [
                {
                    "author": "coloradogirlcallie",
                    "body": "Came here to say that I flip back to the family tree in One Hundred Years of Solitude every few pages 🫠",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "arrec",
            "body": "I got a fancy copy of The Lord of the Rings for the pull-out maps. I hate trying to look at maps in an e-book.",
            "score": 2,
            "replies": []
        },
        {
            "author": "coalpatch",
            "body": "My books don't usually have family trees, but I'll often draw them myself to remind myself who everyone is.\n\nI find maps very useful",
            "score": 2,
            "replies": []
        },
        {
            "author": "Peach_Stardust",
            "body": "Nope. I just straight up ignore them. If it isn’t clear enough in the narrative it must not have been too important.",
            "score": 2,
            "replies": []
        },
        {
            "author": "chokerfromthe90s",
            "body": "Yep, plus I usually end up on a fandom wiki",
            "score": 2,
            "replies": []
        },
        {
            "author": "cardinalandcrow",
            "body": "For a physical book, I skim it and put in a bookmark. For an ebook, I’ll do the same, but add a ‘tab’ to it so I can get back to it easily enough if I need to. Mostly, though, once I’m absorbed in the story, I don’t need to refer back as much. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "dangleicious13",
            "body": "I wouldn't say I study either of them. However, I'll look at the map and try to get the general lay of the land.",
            "score": 1,
            "replies": []
        },
        {
            "author": "amyaurora",
            "body": "Maps yes. I love maps and globes so I am drawn to them right away anyways.\n\nFamily tree no.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Excellent-Artist6086",
            "body": "I like flipping back and forth. If I’m listening to an audio book I will look it up when I have an inkling",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alwayssunnyinarizona",
            "body": "I've been making dog ears for my Agatha Christie books with maps and room layouts, but they don't help much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bognosticator",
            "body": "I go look at the map after I've *finished* reading, when all the place names have sunk in and have meaning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StylishMrTrix",
            "body": "I look at them\n\nLove when a book has a map and family trees are interesting \n\nTraci Harding early book all involve reincarnation and so instead of family trees by the 3 boom you have a reincarnation tree to help explain who is who from the past",
            "score": 1,
            "replies": []
        },
        {
            "author": "cozykeegs",
            "body": "Flip back and forth. I will 100% forget cause idk what I'm looking at yet haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "francois_du_nord",
            "body": "I always use the maps in physical books, but can see how it would be a PITA with an e-book. I'm reading a great book right now \"In the Valley of the Nobel Beyond\" - it is about an exploration of native tribes & Sasquatch in Northwestern British Columbia on the coast, with islands and small communities.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Serenemattie",
            "body": "I'll usually look at maps, but only look at family trees if they aren't too complicated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "archblade7777",
            "body": "I ALWAYS study maps. I've loved maps ever since I was a kid, and getting a visual representation of the world I'm reading about is huge for me. \n\nI'll often go back and check the map whenever the story goes to a different area just to refresh my perspective.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FoggyGoodwin",
            "body": "I really enjoy perusing maps. There's a reason why the author included them, and I appreciate the effort. I've been almost exclusively ebooking lately on Kindle app; it's easy to collapse the book, scroll quickly to the map, reopen the book to peruse a bit, then shrink and return to where I was reading.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrMschief",
            "body": "Completely ignore them, regardless of what's going on in the story.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CarcosaJuggalo",
            "body": "I might skim over the information, but I usually skip to the story unless it's something with vital information like Fellowship of the Ring or something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1catfan1",
            "body": "It's a heart sink moment for me. Even a character list.  It makes me assume the writer hasn't done a good job!",
            "score": 1,
            "replies": []
        },
        {
            "author": "jamieseemsamused",
            "body": "For the most part, yes. I think the best-written books shouldn't require constant flipping back and forth. But I also appreciate a world that is complex enough that a map is helpful.\n\nI love fantasy maps. I appreciate the art of them. I have a photo album that I collect of my favorite ones. I love it when a book takes the time and effort to hire an artist to render a map. \n\nFor e-books, I actually reference the map on the Kindle app on my phone or ipad while I'm reading on my Kindle. The picture quality is better, especially if it's in color, and you can zoom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KitchenV",
            "body": "I usually just read them at the end unless it's a truly complex web.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Annual-Body-25",
            "body": "I study them all lol. I love slipping into lore",
            "score": 1,
            "replies": []
        },
        {
            "author": "WhilstWhile",
            "body": "I look over maps before I read a book and then refer back to the map as needed. For family trees, I only look at them when I start to get confused by character names/relations in a book. Glossaries I also only look at as needed. \n\n\nAlthough, if its sequel books in a series, I will look over the family tree and glossary before reading as a sort of refresher from the last book(s) I read in the series.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deblebsgonnagetyou",
            "body": "I like to look at them, but I wouldn't say I'm studying them, just admiring. I only flip back to them when I get confused about how things work geographically/genealogically.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrSquid",
            "body": "I never do. Maybe I'll check a family tree if I'm confused about 2 characters relationship. But if the book says the MC went from City A to City B, that's all I need to know.",
            "score": 1,
            "replies": []
        }
    ]
}