{
    "title": "My friend’s view on genres - thoughts?",
    "author": "CrittersVarmint",
    "subreddit": "books",
    "rank": 8,
    "score": 3,
    "upvote_ratio": 0.55,
    "num_comments (reported by reddit)": 38,
    "url": "https://www.reddit.com/r/books/comments/1jei5fk/my_friends_view_on_genres_thoughts/",
    "id": "1jei5fk",
    "selftext": "I am an avid reader but I do not enjoy all genres, and there is a particular genre of fiction that I simply do not enjoy. I have tried many times to read books from this genre but have only ever succeeded in completing and enjoying one or two. The rest just became DNFs. It's just not my thing. \n\nWhen this topic has come up in discussion with one of my friends he immediately says \"the setting is the setting, it doesn't affect the story.\" He says that if the core story is good and essentially the same in a romance novel, a sci-fi novel, a horror novel, etc., that it should not impact anyone's enjoyment. He says it makes no sense for anyone to say they don't like a certain setting because if the story is told well, then it's irrelevant. \n\nThis weird take blows my mind. He generally LOVES to be a contrarian and seems to really enjoy disagreeing with me no matter how trivial the subject--even passing comments like this he will turn into a \"you're wrong\" thing. Thank you, I am wrong when I say I do not enjoy XYZ. He will even take an opposing stance and try to argue against my opinion on books, video games, and movies that he has never read, never played, never seen. So this may just be one more (in my opinion) idiotic take he has just to find a way to disagree with me. \n\nBut just for my own information, I want to know if many people share that same view? ",
    "comments": [
        {
            "author": "No-Strawberry-5804",
            "body": "Genre is so much more than just the setting tho",
            "score": 76,
            "replies": [
                {
                    "author": "CHRISKVAS",
                    "body": "One of my biggest peeves is reducing media to nothing but plot points and ignoring everything else about it.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "kylekez",
            "body": "I mean, the setting is an extremely integral part of any narrative. His argument makes no sense. Setting doesn't affect the story? In what world?",
            "score": 41,
            "replies": [
                {
                    "author": "VokN",
                    "body": "They’re weird but I sort of get it, sci fi can be set in the 1970s and still feel very genre-correct in the same vein as something set in far flung space sci fi, the setting doesn’t change the genre-isms as much as other factors can \n\nGood interview snippet with neal Stephenson about it\n\nhttps://www.locusmag.com/1999/Issues/08/Stephenson.html",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mammoth-Corner",
            "body": "Setting isn't the only element of genre—it's just one of the most visible. Tone, plot expectations (e.g. HEA for romance, solving the whodunnit for mysteries), tropes, pacing, and a shared language are also extremely important. Stories in a genre share ideas and riff on one another. Your friend has a pretty shallow take.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Samael13",
            "body": "Your friend is being contrarian and irritating. \n\nI mean, sure, you *can* find examples of stories where the setting is just window dressing, right? You could have a story, and then you can find examples of that story with different set dressing. Core story is the same, but the setting is different. Die Hard is basically \"a group takes over some location and take some hostages. Unbeknownst to them, there's a lone wolf loose, who begins to take them down, ultimately winning in a showdown with the villain's leader.\" More or less. \n\nYou can slap horror theme on it (30 Days of night) or make it a comedy (Airheads) or Sci-Fi (the third act of Fifth Element) or a kid's movie (Home Alone) or a Christmas movie (Violent Night). \n\nThe part where your friend is just being contrarian is the \"it makes no sense for anyone to say they don't like a certain setting...\" which is just utter bullshit. books are a subjective experience, and we all like different things. If someone *doesn't like horror*, then slapping a horror theme on an otherwise good story is going to mean that person doesn't like it, *because they don't like horror.* \n\nMost people don't read books (or watch movies) *just* for the story. They're reading for the *total package*. The setting will impact the tone. It will impact how graphic it is. It will guide dialogue and characterization. The world building. If you don't like horror, then you're not going to like 30 Days of Night, even if you loved Die Hard. *Because it's still horror*.",
            "score": 11,
            "replies": [
                {
                    "author": "ViolaNguyen",
                    "body": "I'm not sure I follow.  How do you make Die Hard into a Christmas movie?  It's already a Christmas movie!\n\nJokes aside, I totally agree with you, and in fact I think reading a book *just* for the story is kind of a shallow experience.  Not that that's always wrong *per se*.\n\nFun example: a Shakespeare play and the CliffsNotes version of the play will have the same story.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "CrittersVarmint",
                    "body": "Ha! I love your movie examples of 30 DoN and Airheads. I wasn’t expecting that. XD",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "zmacleod527",
            "body": "He sounds like an exhausting person to be friends with.",
            "score": 21,
            "replies": []
        },
        {
            "author": "Liefst-",
            "body": "I think your friend doesn’t really know what he’s talking about.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Averageplayerzac",
            "body": "I think I agree in the broad strokes, in that genre labels which deal primarily with setting aesthetic i.e. fantasy, sci-fi, historical, are disconnected enough from the actual mode of storytelling to be largely non-useful as predictors of quality or what the book will be like. \n\nBut I certainly think he’s overstating it to say point blank “setting doesn’t affect the story,” because people can have preferences in setting aesthetic and is mostly looking to get a rise out of you.",
            "score": 6,
            "replies": [
                {
                    "author": "alibloomdido",
                    "body": "Well when you say \"quality\" you probably mean some criteria by which you could rate the book and that's what we expect to find in some \"quality\" review of a book but personal enjoyment is a bit different thing. \n\nI agree that different settings tend to produce different kinds of stories but that guy OP speaks of maybe meant \"a good story is still a good story but there can be many different good stories\".",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Averageplayerzac",
                            "body": "I get what you mean in the first paragraph but you’ve lost me in the second. To clarify my own position I’m saying that a given setting produces so many varieties of stories that setting alone is not a useful predictor of what kind of story it will produce.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Acrelorraine",
            "body": "I think I get it.  Setting is separate from genre though they absolutely do play in to one another.  A western is a setting and a genre, but so many different genres can be westerns.  Same with science fiction.  Blazing Saddles and Bone Tomahawk are both westerns but you are going to feel very differently about those films.  \n\nTo say ‘I hate stories set in the old west’ is the same as ‘I hate all stories set in cities’ or ‘set in space’.  Maybe you do but it’s such a breadth of stories and genres that it seems impossible to  have a blanket dislike.\n\nBut also, some people enjoy arguing for the fun of it and this seems to be the sort your friend is.  So there’s a good chance that there isn’t any real thought put into the argument, it’s just what he likes to do.",
            "score": 6,
            "replies": []
        },
        {
            "author": "queerandthere",
            "body": "This is a ridiculous take. Setting absolutely affects the story, and genre is more than just setting.",
            "score": 10,
            "replies": []
        },
        {
            "author": "LylesDanceParty",
            "body": "Sounds like this is less about books and more about you needing a new friend.",
            "score": 18,
            "replies": []
        },
        {
            "author": "biodegradableotters",
            "body": "Well first of all your friend doesn't seem to know what genre means. I guess I agree in the sense that you can like a good story even if it's in a genre you usually don't like, but that doesn't change anything about you not liking a genre. If I dislike 99% of a thing then I dislike that thing even if on very rare occasions the thing is irrelevant to my enjoyment.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Separate_Lab9766",
            "body": "To me, genre isn’t a thing inherent to books. Genre is a thing inherent to book *sellers.*\n\nWhen a publisher wants to sell you a book, they’ll put a genre label on it, because it’s similar enough to something they already know how to sell. They can slap it onto an existing shelf on their bookstore. They can fit it into their algorithm. Some books cross genres; some defy them. In a way, it’s like saying that all food containing mushrooms is a food group.\n\nThat said, if there are certain things you dislike about the way a genre reads to you — the expectations, the tone, the unspoken lore, the plot points — then you don’t have to like it.\n\nMe, I don’t like mushrooms. It’s a texture thing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ok-Truck-5526",
            "body": "You don’t  have to like everything. I realized early on that I favored  nonfiction, abd mysteries over general fiction, and felt bad about that for awhile, but… the heart wants what it wants.",
            "score": 3,
            "replies": []
        },
        {
            "author": "nyki",
            "body": "Setting is not genre, and atmosphere greatly impacts my enjoyment of the story. Genre doesn't necessarily determine if I'll like a book, but to say it's irrelevant is crazy. I definitely fallback on certain genres, especially when I don't know what to read next, because they've had a high success rate in the past.\n\nI do sort of see where he's coming from in the sense that writing style is the primary factor in how much I like a book, but I don't really consider that the 'core of the story'.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mean-mommy-",
            "body": "It annoys me when anyone tries to force me to like something that I don't like because of their own personal opinions on it. Your friend sounds extremely annoying. You're allowed to like or dislike whatever you want; he can STFU.  \n\n\nAlso he's completely wrong.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Kalashak",
            "body": "There are few more iconic pairings than \"habitual contrarian\" and \"does not actually know what they're talking about\".",
            "score": 5,
            "replies": []
        },
        {
            "author": "alibloomdido",
            "body": "You still say you enjoyed a book or two of that genre you dislike, what was there that made you enjoy them? Maybe it's not the story but something else. Anyway even if it was the story we have preferences for the kinds of stories book tell and usually a particular genre tells a particular kind of stories. It's ok to have preferences both for readers and authors even when those preferences are totally subjective. But sometimes an outstanding story or how it's told can attract us even if we don't usually like that kind of stories... and sometimes it's only \"outstanding\" in our eyes but it makes for our enjoyment. Sorry for being a bit banal but this whole thing is really quite subjective.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Anaevya",
            "body": "Genre is more than setting. Genres come with a bunch of storytelling conventions. In theory genres should be broad enough to appeal to everyone, but that's not really true in real life.\n\n\nLet's take fantasy as an example. In theory fantasy could contain all kinds of fantastical elements and could have all kinds of story structures, but it's often very tropey. I recently read/listened to three books with dragons (from different authors) in a row and I didn't even seek out books with dragons intentionally. They also all were set in fantasy Europe/almost Europe; one was more medieval and two were more early modern period inspired. One of them also had fantasy Asia. So there are quite a few similarities just in worldbuilding in those books from different authors. If one doesn't like the tropes or structure that's common in a genre then one won't like the genre.\n\n\nSo your friend's opinion doesn't really make much sense in reality. I'm curious about what genre you don't like. Would you mind telling us?",
            "score": 1,
            "replies": []
        },
        {
            "author": "rianwithaneye",
            "body": "I think your friend is onto something but they are conflating genre with setting. \n\nBut to their point: if you did set Julius Caesar in space and have all the conspirators kill him with ray guns, is that sci-fi? I think to a lot of readers it would be, and that’s where I think your friend makes a salient point. Genre is an idea that comes from the marketing of art, not from art itself. Songs are just songs, movies are just movies, books are just books.",
            "score": 1,
            "replies": []
        },
        {
            "author": "littlestbookstore",
            "body": "Wow, that's a hot take from your friend. Of course he's entitled to his opinion, but I'd counter him by brining up that in a vast majority of novels, the setting-- which people often use to define a book's genre-- (I have my own thoughts about this) is like an additional character.\n\nThe Southern Reach trilogy, for instance, hinges on setting-- that plot couldn't exist in that form if not for the setting. Then there's Wolf Hall by Hilary Mantel-- does he not believe in historical fiction? Or Gilead by Marilynne Robinson a theological meditation on a specific time and place in the U.S.-- none of those books could be what they are without setting.\n\nCloud Atlas by David Mitchell is an interesting experiment in genre-bending, though, but I think it's a novel that would prove this point. Setting is crucial, it's a character of its own.",
            "score": 1,
            "replies": []
        },
        {
            "author": "captainshockazoid",
            "body": "i dont share your friend's view, but i am curious about the genre you dont enjoy? i wont judge OP, there are some i have zero interest in, like period dramas and classic slasher films and Wimpy Sports Underdog Overcomes Adversity And Wins Big Game At The End.",
            "score": 1,
            "replies": [
                {
                    "author": "CrittersVarmint",
                    "body": "This entire post probably would have been simpler if I just came out and said what it is I’m talking about but I didn’t say it because I don’t want people yelling at me when it wasn’t the point. Haha!\n\nWhat I said to him is that science fiction and fantasy books are not my thing (for the most part). I have tried many times and just can’t get into it. I am NOT saying it’s a bad genre nor am I saying the writing of the books I’ve attempted is bad. It just isn’t my thing and that’s when he said I’m wrong. Lol. I enjoy plenty of sci-fi films. For some reason though, those books don’t land with me. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "captainshockazoid",
                            "body": "i see, i see. thanks for answering anyway, i wont shout you down over it lul. theres plenty of tropes IN those genres that can get tiring xP like in other media, theres lots of people who cant stand musicals even though its a broad genre. just not their thing, as you said.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vexonte",
            "body": "1st genre and setting may go hand in hand, but they are not the same.\n\n2 If you enjoy a story that is outside your useally genre, it's a testament to the stories quality, not a testament to genre having no purpose.\n\nThe first and foremost genre's central dynamic is about advertisement and projection.  Do you like space and robots? This sci-fi novel has space and robots. Does gore and cynicism make you uncomfortable? This is a horror novel, so you should probably just ignore it. A good story is useless if nobody reads it, labeling it as a genre will act as a foot in the door for getting it into the hands of select genre fans.\n\nSecond, there is a different milage you can gain out of a settings value to a story and the enjoyment of it. You can definitely enjoy stories of various settings, but some settings might do a good job attracting people out of novelty. History buffs will love to read a historical fiction book set in a niche period they like. Some locals will be more likely to buy a book that takes place in their city. \n\nSetting is also tangential to the story itself. A story that requires isolation can't take place on a crowded subway at rush our. A story about physical exploration can't take place entirely in ones kitchen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImLittleNana",
            "body": "People like this are emotional vampires. They can suck the life out of you because you’re constantly either questioning your choices and opinions on things major and minor or defending them. \n\nThe bare bones of a plot may be similar, but sometimes I want those bones in space and sometimes I want them rattling around with unicorns, or hiding in a closet of an isolated cabin. Sometimes I want really snarky gay bones, sometimes I want repressed bones vibrating with barely held back passion. \n\nYou’re perfectly fine to not enjoy specific genres. I hate the McFadden style domestic thriller. I don’t care if there are people that ONLY read that sub genre. It has zero effect on my life what other people are reading.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WhilstWhile",
            "body": "What does your friend mean by “setting”? And what does he mean by “core setting”? \n\nBecause I feel like a well-written horror novel set in modern day Minnesota isn’t gonna be the same as a well-written romance novel set in modern day Minnesota. I’m not gonna like one just because I liked the other.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dawgfan19881",
            "body": "I agree that setting is largely irrelevant to how a story is told. If your story explores an aspect of the human condition. Setting is irrelevant. Any trope can be told is any setting. However setting might have an effect on your enjoyment. Some people don’t want to explore these stories in secondary worlds with dragons. Some people don’t want them set in the 1850’s Deep South. So he’s right that the setting doesn’t matter in terms of the limits of storytelling but wrong that it’s irrelevant to your potential enjoyment",
            "score": 1,
            "replies": []
        },
        {
            "author": "Potatoskins937492",
            "body": "Stop engaging in these conversations. He's annoying and he'll only think it's ok to keep be annoying if people engage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThreeTreesForTheePls",
            "body": "Hey im sure they’re a nice person, but you’re friend sounds stupid as fuck. Genre/Setting is absolutely vital for a book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EffableFornent",
            "body": "Your friend sounds like someone I would avoid at all costs. What a bore!\n\n\nGenre is more than setting, this guy has no idea what he's talking about. Sounds like he just wants to make you feel stupid. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuestionableIdeas",
            "body": "\"All milkshakes are fundamentally the same, so if you like milkshakes you should like my asparagus milkshake!\" - I think your friend is going to find themselves arguing in favour of stupid things quite often if their goal is to just be contrarian and argumentative. I wouldn't take anything they say seriously if I were you",
            "score": 1,
            "replies": []
        },
        {
            "author": "villasv",
            "body": "Can anyone really say they don't like feces on their food? If the food is tasty, then it's irrelevant!\n\n(edit: didn't think I'd need to add /s to this, specially here)",
            "score": -2,
            "replies": []
        }
    ]
}