{
    "title": "2 months today!! Thank you all your beautiful people for your support here. I'm so grateful for this community ❤️",
    "author": "Brodermagne96",
    "subreddit": "stopdrinking",
    "rank": 389,
    "score": 34,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2fcrw/2_months_today_thank_you_all_your_beautiful/",
    "id": "1j2fcrw",
    "selftext": "I hit exactly 2 months today and I'm SO fkin proud of myself. I never ever imagined I could live a life without alcohol. It was my best friend, the love of my life, my life west. It was always there for me when I was too overwhelmed by thoughts and feelings. But it started to get worse and worse. And I found out my best friend was really toxic, didn't want the best for me, he manipulated me into thinking like this so I wouldn't leave him. But after 7 years in addiction I finally did!\n\nI have used this sub a lot. Sometimes so much i wonder if people get tired of me 😅 But it has been so helpful. I don't always reach out to my friends, because they have their own life and problems and they all understand this, like people do here\n\nThank you all for making this sub my favorite. I feel like I found my people",
    "comments": [
        {
            "author": "Alkoholfrei22605",
            "body": "Bravo on 2 months!",
            "score": 2,
            "replies": [
                {
                    "author": "Brodermagne96",
                    "body": "Thank you so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Minimum-Holiday-7750",
            "body": "You are amazing",
            "score": 2,
            "replies": [
                {
                    "author": "Brodermagne96",
                    "body": "Thank you!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Low_Peanut2644",
            "body": "Awesome for 2 months. Great work. This sub is amazing because of the people on it like you. Good luck on the next 2 months. IWNDWYT",
            "score": 1,
            "replies": [
                {
                    "author": "Brodermagne96",
                    "body": "Thank you so much for saying that!\n\nIWNDWYT",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "moon-child1234",
            "body": "Congratulations on 2 months! I am right behind you and looking forward to celebrating. IWNDWYT 🌟",
            "score": 1,
            "replies": [
                {
                    "author": "Brodermagne96",
                    "body": "Thank you so much! And congrats to you to for soon 8 weeks!\n\nIWNDWYT",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}