{
    "title": "Did you lose weight fast after stopping drinking?",
    "author": "brainyshark9",
    "subreddit": "stopdrinking",
    "rank": 332,
    "score": 51,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 120,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2l4go/did_you_lose_weight_fast_after_stopping_drinking/",
    "id": "1j2l4go",
    "selftext": "Trying to think of positive consequences that come with abstinence, feel free to tell me some other good things. \n\nI made it 3 days and relapsed. I’ve decided to give alcohol and ordering on DoorDash up for lent (even though I am not religious). I just feel like I need a concrete goal?? Like dry January, if that makes sense. Something that’ll allow me to see the light at the end of the tunnel so on days I want to drink, I can just think “you only have to make it until the end of lent and then you can drink again”. Obviously, I would like for sobriety to stick but I think I just need a start and end date, idk. ",
    "comments": [
        {
            "author": "shineonme4ever",
            "body": "> \"*Did you lose weight fast after stopping drinking?*\"\n\nNo.  I was overweight when I stopped drinking and then gained well over 20-lbs in my first year because I substituted food for alcohol. I had to be okay with that because eating kept me from drinking and drinking was killing me. I would be dead now had I not stopped.\n\nOnce I had a ***solid*** foundation of sobriety (into my second year), I tackled my diet. By my third soberversary I was the smallest and happiest I've ever been in my entire adult life and I've kept it off. I used many of the same tools and discipline I used to get sober but applied them to my eating habits.\n\nIt can be upsetting to feel \"food\" is a bit of a co-addiction, but I had to consider the bigger picture. I tackled one thing at a time but always kept/keep sobriety as my Number One priority.",
            "score": 85,
            "replies": [
                {
                    "author": "brainyshark9",
                    "body": "I can see this being me, i am hoping I get bored enough that it makes me want to go to the gym or do something active but not so bored and unmotivated that I relapse :/. Thanks for sharing!",
                    "score": 9,
                    "replies": [
                        {
                            "author": "wilt-oledo",
                            "body": "I’m still early in my journey but I find that not drinking has really helped me with the motivation to eat well. I’ve always had the stupid “all-or-nothing” mindset that I think a lot of alcoholics have. When I was drinking, this meant I would always drink to excess, and since I was already destroying my body, I may as well eat like shit too. And of course alcohol makes making other bad decisions much easier. \n\nSince I’ve been sober, that (still harmful) mindset has at least helped me to commit completely to eating better. Since I’m not drinking, I may as well not eat like shit either. I still have some nights, particularly weekends, where I replace alcohol with food, but by and large I’m eating much better and losing weight.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "RexBannerTheFourth",
                                    "body": "This is me as well. When I'm not drinking, I remember to take my meds, eat well, exercise, and get to bed at a reasonable time. Because the whole point of not drinking is to be healthier, right? So might as well have all that other stuff dialled in while I'm at it.\n\nWhen I am drinking, I'm killing myself anyway, so what does it matter? \n\nAnd writing it out like that really drives home which of those states of being I prefer\n\nIWNDWYT!!!",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SadisticBean",
                            "body": "I basically would drop what I was doing and just workout or go for a walk when I started to feel anxious or like I was craving, and it helps a shit load with that too. My body and mind were craving any sort of dopamine rush/stimulation that I could get, and if you can channel that into healthy things, you should be alright.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "thingsareodd",
                            "body": "I feel you on this. The first few times I tried to get sober, I was bored a lot. I was definitely a “dry drunk”. It wasn’t until this time around that it finally clicked for me that being sober isn’t the answer. You’ve got to replace all that time spent drinking, planning to drink, recovering from drinking, with other things like hobbies, reading, walking, exercise, classes. You have to fall back in love with real life. Then you don’t want to drink when you’re bored because you’ll be too busy doing other things or genuinely being able to relax and unwind. It’s sounds crazy, never thought I could be a person to actually relax but holy shit do I love my lazy sober weekends filled with tiny little joys like going on a hike or to a boxing class",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Prize-Leadership-233",
                    "body": "I'm in a similar boat. I've gained a little weight, but I don't really care because my eating sweets is better than alcohol.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "yjmkm",
                    "body": "I love you. Thanks for being supportive and here! \n\nI gained too, and am kicking it all and extra now. \n\nIWNDWYT.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "shineonme4ever",
                            "body": "Many Blessings to YOU, u/yjmkm!  It will all work out and I'm rooting for You!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "808champs",
            "body": "I dropped 10 pounds of pure bloat in a matter of weeks. It was wild seeing the scale drop. I leveled off at 20 pounds or so, when I switched it up and started daily walks. Slow at first, now 4 or 5 miles 4 to 5 times a week. I’ve dropped 40 pounds and have stayed here for a few months now. I look like a completely different person.",
            "score": 34,
            "replies": [
                {
                    "author": "darknightoftruth",
                    "body": "10 lbs in just under 6 weeks here. My face is thinner, less tired looking, and I feel so much better about myself. \n\nI crave sweets here and there but have tried to really focus on eating well and not over eating. I also have a lot more energy and motivation to cook instead of door dash and fast food like I was doing when I was drinking every day.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "808champs",
                            "body": "In the first few months, I ate everything chocolate. Cakes, cookies, brownies. All with milk like I was 8 years old again. I kept Pepperidge Farm in business. I didn’t even begin to think about what or how much I ate. I was focused on other things at the time and gave myself license to indulge. Those sweets cravings passed for me somewhere along the line, maybe around month 3.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Positive-Taste-1060",
            "body": "I replaced pints with pies",
            "score": 28,
            "replies": [
                {
                    "author": "error404wth",
                    "body": "😂",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "3_dots",
                    "body": "Mmmmmm",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "AllSadnShit1990",
            "body": "I have lost almost 60 pounds in 9 months (31m / 6’1 - from 245 to 185)\n\nThe lack of calories from the insane amount of beer I drank definitely helps lol but it’s also about having the time and energy to actually take care of my body- it definitely doesn’t just happen on it’s own, but is very possible!",
            "score": 23,
            "replies": []
        },
        {
            "author": "jakeology_101",
            "body": "No because junk food, specifically pizza, was fundamental in quitting alcohol for me. After about 6 months I corrected my diet in addition to sobriety and had incredible results",
            "score": 13,
            "replies": []
        },
        {
            "author": "VW_Fe2O3",
            "body": "I have lost weight. I think the key to the weight loss potential is be sure you don't replace the booze with high calorie drinks. Don't replace a 6 pack of IPA with a 6 of Coke or bags of bite size Twix and expect to lose anything.  Look for low and no calorie replacements. \nYou can do this. Consider a gym membership with the money saved not buying alcohol. ",
            "score": 22,
            "replies": [
                {
                    "author": "brainyshark9",
                    "body": "Thankfully I don’t drink any type of soda but my body is so used to all the sugar from alcohol that I bet it will be looking for a sugar source elsewhere",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Shilooooooooooooooo",
                            "body": "Try sparkling water. La Croix or Bubbly for flavored ones. You still get that throat hit and then replace your sugar cravings with fruit.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "bekkogekko",
                                    "body": "Throat hit! Thank you. I’ve been trying to describe this sensation for the past few days.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "a-little-onee",
                    "body": "Called me out with the bite sized candy bars😭",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "kait2131",
            "body": "I’ve actually gained some…but also quit smoking. Expected it. But feel way healthier and starting to exercise, which will help",
            "score": 9,
            "replies": []
        },
        {
            "author": "Reptar1988",
            "body": "No. Think of each cell and organ in your body as having been conditioned by your drinking to exist in a shitty environment. Exist, not thrive. We deprive the body of water, necessary nutrients and minerals, good sleep, and that's not even adding in the poisonous effects of the alcohol. Your body is waiting for you to relapse, and is maintaining a holding pattern.\n\nThree months your body will start trusting you, little by little. Six months you'll see the difference in your face, energy is higher, and if you do the work (aka therapy) you'll be able to deal with the stressors that used to drive you towards drinking. I'm just over a year and I'm down 50 lbs, despite my sugar addiction. It's such a strange and wonderful feeling when you give your body a chance to heal. Imagine it's a dog who you rescued from a bad home! You don't expect the dog to settle in and get comfortable for a few months, it has to settle into a routine.",
            "score": 8,
            "replies": [
                {
                    "author": "TinaGeneLouise1",
                    "body": "Thank you, I need this. I quit 1/1/25 and while I'm sleeping better, exercising, and eating better, I haven't lost any weight. While I'm bummed, I'm overall ok with it and have been telling myself that my body is healing and I'll see some weight loss and other improvements eventually.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Reptar1988",
                            "body": "I just got pictures back from an event that happened right at month three. Everyone was telling me how skinny I looked, and now the pictures look huge compared to me after 1 year. But you will start noticing differences, and even more importantly, you'll stop noticing the small changes until you look in the mirror and shock yourself . Youve got this.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Equivalent-Weight688",
            "body": "I stopped drinking alcohol but got insane cravings for sugar, so it’s been a net zero lol",
            "score": 6,
            "replies": []
        },
        {
            "author": "Manuntdfan",
            "body": "Yes Ive lost 10lbs in 30 days. Water weight, and I started IF 12pm-7pm.",
            "score": 6,
            "replies": [
                {
                    "author": "error404wth",
                    "body": "I suppose coffee with cream and sugar doesn't count as fasting, does it? 🤔",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Manuntdfan",
                            "body": "No",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BillTheConqueror",
            "body": "I went from 320 to the 270s just from quitting drinking and the better overall choices I was making along the way. In the past 8 months I got serious about exercise and improving my diet (upping protein and cutting down on sugar) and am down to 210. I’m 6’3” male and would like to get to 190 eventually. It would never be possible if I still drank. ",
            "score": 5,
            "replies": []
        },
        {
            "author": "o0PillowWillow0o",
            "body": "Nope gained weight. Even though I was drinking1500 calories of alcohol per day and eating at least the same, so 3000 calories daily it created some gastritis in my bowels so I don't have confirmation but it made me shit often and I assume making me not absorb all the calories. I gained 26 pounds after quitting but after diet and exercise I'm back below 150lbs after 9 months. \n\nNow that I'm healthy I have to consume no more than+1500 calories per day. Female 5'4\" 149 lbs",
            "score": 3,
            "replies": []
        },
        {
            "author": "dandychuggins",
            "body": "I did yeah, but only because a) I knew how to, b) I wanted to and c) I have experience in quitting and knew that the sooner I got my gut health back to 'nornal', the less I'd get cravings for junk food. \n\nGo at your own pace OP, this journey is yours",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ok-Side-3527",
            "body": "I lost 20 pounds in the last six months. This probably was partially because of the lack of calories from alcohol, but I also wasn’t a daily drinker. I think most of it was from having the mental space to engage in activities that I didn’t have capacity for one nursing a three day hangover during the week. Now that I have the energy, I work out much more and don’t feel like I need carb heavy foods to cope with the dopamine withdrawal after a night of drinking.",
            "score": 5,
            "replies": [
                {
                    "author": "brainyshark9",
                    "body": "Looking forward to some mental clarity and hopefully more energy 🤞",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "7_62mm_FMJ",
            "body": "Lost 15 pounds in January. Changed my diet and quit drinking. Still going",
            "score": 5,
            "replies": []
        },
        {
            "author": "HUP",
            "body": "I've lost 18 lbs in 55 days of active dieting.  My first week dry (this time), I let myself eat whatever in the heck I wanted.  Now I carb cycle, walk 10-15 miles / week and lift weight 3x week.",
            "score": 4,
            "replies": []
        },
        {
            "author": "purpleswordfish",
            "body": "When I went six-ish months dry a few years back, I was overweight and was eating a diet that was middle of the road from a healthy standpoint. It wasn't fast food, but it was home cooking that wasn't exactly the best in the quantity I was eating. I quit the drinking and was eating two king-size Twix a day as a replacement vice, if you will. I maintained my weight.\n\nIn the new year, I've been going a few days here and there with no drinking and tapering back a lot when I did drink, followed by my current complete abstinence. I've been pairing this with a high protein, low carb diet and really watching my caloric intake. Since the new year, I am down 28 lb. My hope is that my self-discipline on diet will translate to self-discipline with alcohol and I can be down another 30 lb. by mid-year. Here's hoping.\n\nGood luck on your journey. You can do it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "baxterhan",
            "body": "Don’t beat yourself up about relapsing. Getting the ball rolling for me was really difficult. I failed 100 times. I lost about 15lbs. But it’s an *obvious* 15lbs. My face looks so much less puffy now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Herald_of_dooom",
            "body": "I dropped about 30 pounds in the first 3 months. But I do not have a big sweet tooth which helped. Also I only drink sugar free soft drinks. Got a taste for sugar free tonic now!",
            "score": 2,
            "replies": []
        },
        {
            "author": "MoumouMachine",
            "body": "I didn't lose anything in the first month.\n\n\nI ate a lot of ice cream to combat the alcohol cravings.\n\n\nGetting sober was simply more important than dieting.\n\n\nAfter the first month, I started to care about my health more and now I'm 21kg/46lbs down and counting.",
            "score": 2,
            "replies": []
        },
        {
            "author": "godahi9660",
            "body": "I weighed 193 a week after I started. As of this morning, I weigh 188. I'm not sure if that's considered fast or not, but I'll take it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sober-Brother-33",
            "body": "Most people gain weight because alcohol is an appetite suppressant and early sobriety means trading drink for cookies.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jupiter_citizen",
            "body": "I never liked it when people say that *one of the benefits of quitting drinking is losing weight.* That’s simply not the case for many of us. Besides, weight loss should never be a main reason to quit—it’s too superficial and misses the bigger picture. Alcohol is so much more than just empty calories and a few extra pounds…\n\nIn my personal experience, not only did I *not* lose weight after quitting, but I actually gained some because I allowed myself more treats, justifying it with *at least I’m not drinking.* After a long couple of months, I’m finally shedding those extra pounds with a very conscious and disciplined diet.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wax_Lyrical_",
            "body": "Giving up alcohol and door dash at the same time? Sounds rough tbh. Perhaps try just alcohol for the time being and allow yourself a doordash while trying to get sober. \n\nIn terms of trying to think of positive consequences, think long term. I dunno how old you are so I’m going to guess at… 32. If you live till you’re 80 that’s 48yrs of positive health from not drinking poison ☠️ \n\nOther positives include financial savings (both from alcohol and from needless Amazon spending), weight loss (not at first if you’re like me, but it did come) and better skin, hair, breathing, sleep etc.\n\nGood luck",
            "score": 2,
            "replies": []
        },
        {
            "author": "jyow13",
            "body": "nope, i started eating too much vegan coffee cake because i felt empty inside. working it off now",
            "score": 2,
            "replies": []
        },
        {
            "author": "rhinoclockrock",
            "body": "Not yet. Chubby as ever. Which isn't terribly chubby but more than I want. I've been letting myself have sodas and ice cream when I want. Day 27. Will try to address the food and movement a little more next month but it's not the priority right now. IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "JealousCheek7265",
            "body": "I've lost just over a stone in 2 months. I also switched lunches to Huel (meal replacement) and started running during lunchtimes.",
            "score": 2,
            "replies": [
                {
                    "author": "MassiveMeatHammer",
                    "body": "How much is a stone in freedom units for us dumb Americans?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "brainyshark9",
                            "body": "A lovely 14lbs haha",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Bcruz75",
                            "body": "1.5 bald eagles.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "error404wth",
                            "body": "😂😂😂",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "brainyshark9",
                    "body": "Had to look up how much a stone was and wow that’s amazing! Congrats on your accomplishments with fitness and sobriety!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "abaci123",
            "body": "My start date is today and my end date is today. One day at a time, for me, is the way I’ve done this. I learned this by going to AA meetings where I found ‘my people’. Come join us on the DCI , the Daily Checkin Subreddit. 🥰\n\nYes, I lost weight, travelled the world, had relationships, creativity, peace of mind, great health, saved tons of money ! There is no area that didn’t improve. \n\nSobriety is the best life ever!! \n♥️The hardest part is the start. ♥️",
            "score": 2,
            "replies": [
                {
                    "author": "MaryjaneinPA",
                    "body": "I wish I had known once you get passed the first two weeks that it gets easier.  When in that cycle it's so so hard to break out.  It feels impossible.  Then the obsession lessons a little bit at the time.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "I'm still early on after a relapse, but in the 2 months or so I've been at least trying to stop I've lost 35 pounds from 320 when i was admitted to the hospital.  I'm not sure if it's more the cutback on liquor (was drinking almost 2k calories of liquor a day) or my new diabetes diet restrictions (used to eat a ton of fast food especially while drinking), but it's definitely going down.  I know it's very likely going to plateau at some point before i get to my goal weight...I've been there before and it's rough, but just going to try keeping up the healthy habits.  My blood pressure is definitely more of a concern to me than weight right now, but fortunately the better my weight gets the better that should be too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rich_Particular_4",
            "body": "I gained about 17lbs and couldn't stop eating sweets but I was able to reel it in over the past month and a half and am back down to my weight when I stopped drinking.  I have been going to the gym 5-6 days a week and never felt better.  Excited to continue this journey and hope you carve a path for yourself as well!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glittering_Bad_8011",
            "body": "Retrain your brain....\nThe only date you need is a sober today!!\nRinse, Repeat;)",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoqHolliday",
            "body": "Not drinking one day at a time is the most concrete and attainable goal there is! \n\nWeight loss depends. If you don’t replace the booze with another bad habit (hello dove chocolates here), somewhat improve overall eating habits (as you said, give up DoorDash/eating out for healthier, more balanced home meals) and replace some of that wastrel time with exercise, you should absolutely see some significant loss!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brodermagne96",
            "body": "I think this is a great mindset\n\nI did. But i also made a lot of life style changes besides quit drinking\n\nI have had times where it went the opposite way as well. Gaining weight because I just wanted some dopamine\n\nI will say. Let's just you're sober for 3 months and gain 10 kilos. Is this ideal? It's not. But is it better than drinking? Absolutely. One thing at a time!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gary_BBGames",
            "body": "Yes. Super fast for me. Was obese, 17 stone 10 and went down to 12 stone 11 lbs in 8 months. Weight loss was almost immediate and probably my biggest motivator. \n\nI did clean up my diet hugely when I stopped drinking, and started lifting some weights too. \n\nI wouldn’t have been able to do that though if I hadn’t stopped drinking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Relative_Trainer4430",
            "body": "I am a small framed person and I am ten pounds heavier when I drink alcohol regularly.  So cutting out the booze entirely meant ten pounds gone within the first 2-3 months without any other changes in diet or activity.  I guess every body responds in its own way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Formal-Working3189",
            "body": "I gained twenty pounds, bc I never ate. When I quit drinking I got my appetite back. I also started calisthenics and cardio six days a week. I'm in better shape now than I ever have been. Ok, maybe not right after basic when I was 17, but still!\n\nActually it's closer to 25 # now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PhoenixApok",
            "body": "Yes and no (two different sober attempts)\n\nThe time I didn't I wasn't really focused on fitness. The candy cravings hit HARD. I was fat but it was always because of liquid calories. I was not an overeater.\n\nBut man I could kill a family sized bag of Reeses peanut butter cups in a day. \n\nOther time was easy BECAUSE my main motivation for quitting drinking WAS fitness. Cravings were still there but I recognized them for what they were. Hit the gym twice a day (2 cardio session in the beginning and then on cardio, one weight after losing some weight)\n\nWent from 275 to 198 in 6 months. (That is a pretty extreme amount and did require a LOT of disciple. I don't think I missed the gym once in that run and had very very little junk food)",
            "score": 1,
            "replies": []
        },
        {
            "author": "midwestmindset",
            "body": "I’m down 8 ibs in 3ish weeks.. I bought a pretty good rowing machine and an Apple Watch. Figured that’s what I would be spending in the next month or so on alcohol. \n\nI’ve been hitting the rower frequently and have a cheat meal like pizza or Chinese on Friday nights.  Other than that, steak, granola bars and A-LOT of Sparkling Water!",
            "score": 1,
            "replies": []
        },
        {
            "author": "VardaElentari86",
            "body": "Nope, but then I wasn't overweight to begin with (I often basically replaced meals with alcohol - so I think eating properly when sober basically balanced out)\n\nI'm focusing on it a bit more now by trying to eat a bit healthier/exercise more so we'll see.",
            "score": 1,
            "replies": []
        },
        {
            "author": "psgrue",
            "body": "No.  30-40 days of no change.  Lost about a pound a week for the next 5 or 6 months by tracking every day and hiking a lot.  Your digestive system is typically a mess for several weeks before gut health stabilizes enough for steady improvement.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wasdfgg",
            "body": "I slowed down my drinking to weekends only for the past 6 months and during the week I would fast, exercise and work afternoons and then eat once as dinner. Probably unhealthy weight loss but I lost 15lbs and kept it off, hoping to abstain completely from booze during the spring and get to 190lbs, about 215 lb now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkMacaron493",
            "body": "Not quickly. I’ve been stuck down 5 pounds over 30 days but pretty flat. I think the issue is that one every two weeks or so I’ve slipped up and usually if I slip up then I’ll drink that Friday and Saturday, which erodes my gains. Aiming for 100% sobriety in March instead of the 85% in February.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wobs9",
            "body": "Yup. 10kg in 3 months.\nThe lack of a liter of rum a day + running 30minutes 3x a week does wonders.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZEN-AF_Official",
            "body": "Yes... but it's a bit more complicated and happens for various reasons.\n\nAlcohol causes lots of bloating from water retention (especially beer or sugary cocktails or wine). So you should lose a lot of water weight and look less heavy/puffy pretty soon after you quit. \n\nI think the big issue with weight gain from drinking is also from the fact that it makes us want to eat more junk food and move less. So Alcohol is already calorie heavy but the diet it makes us want to eat is also horrible. \n\nTo be honest my main reason for not drinking is to improve my appearance for my dating life so when I do drink I exclusively try to only drink Vodka soda drinks with zero sugar since it's about half the calories and causes less water retention than beer.\n\nPlus full disclosure my routine to cut Alcohol cold turkey is to get back into fasting so that also makes a massive difference in bloating and weight",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArickxEightOne",
            "body": "I gained weight because I was actually eating meals instead of filling up on vodka, oh and ice cream.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LinaZou",
            "body": "I lost 10 pounds the first month without trying and still eating poorly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tazed-Emu",
            "body": "Yes since January 2024 I lost 50 pounds then started gain weight again, not in fat but in muscle. \n\nRunning and other exercise have been as important to my sobriety as this sub, as, and other forms of support. Maybe more important",
            "score": 1,
            "replies": []
        },
        {
            "author": "CauliflowerMurky1614",
            "body": "I focused first and foremost on not drinking, that in itself is a feat. I gave myself patience and grace. Food tastes better without alcohol. Heck, I saved calories by not eating knowing that I’d get a better buzz and the empty calories would fill me up. Reframed that to: enjoy the taste of food, nourish my body and mind. Eat some sugar give yourself a break and stop drowning your body in poison. Stop the hangovers and beating myself up the next day. \n\n5 months later, I’ve lost weight, exercise 7 days a week. Absolutely look forward to the endorphin rush on my evening walk/run. Itchy skin resolving, negativity losing its strength and clarity of what I can do better. \n\nI also started saying, I have a choice to not drink. I’m not depriving myself. \n\nKeep trying, one day at a time! ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Koi-Sashuu",
            "body": "Last year I did Dry February and Dry March and started drinking again the day after Easter (which is also celebrated in my country). I had been doing Dry February for quite some years but this year I really started noticing weight loss after about 5 or 6 weeks.\n\nWhat helps is that when I'm not drinking alcohol every night, I also don't snack on these evenings and make healthier food choices overall. Maybe extra sleep also helps losing weight: I got really bored about an hour and a half after dinner and went to bed an hour earlier than I nornally did.",
            "score": 1,
            "replies": []
        },
        {
            "author": "awesome6666",
            "body": "I stopped drinking and started to eat healthier in the same month.  Went from 235 to 195 as a 6' male construction worker in about 8 months. Slowly I've eaten myself back up to 212, just started intermittent fasting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cobaltorigin",
            "body": "Substituting food for alcohol is the reason I buy a ton of veggies every week. Feeling hungry? Grab a carrot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dear_Salamander_4186",
            "body": "I replaced beer with near beer, jelly beans and ice cream so I’m a few pounds up",
            "score": 1,
            "replies": []
        },
        {
            "author": "MuntonWm",
            "body": "I’m just over 6 months; and only now am I getting control over my sugary food cravings, expecting some loss in the next few months. In fact, once past month 5 I’ve stopped thinking about not drinking - such freedom. Took a while tho! X",
            "score": 1,
            "replies": []
        },
        {
            "author": "winter0rfall",
            "body": "For me, i was a heavy binge vodka drinker racking up 2,000+ calories a day on top of eating and i gained around 50 pounds. Since having 10 months this time around ive lost all of it. I notice i lose weight when getting sober because im not chugging massive calories in my body every day and also when i got sober i had a ton more energy to do things and wasnt inebriated and passed out 23/7 in my bed blacked out. So being more active also probably had something to do with my weight loss. I think it can be different for others though!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bremertuckian",
            "body": "So far I have gained a little weight. Substituted snacking and treats and more coffee/tea with cream. Worth it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CryptoTipToe71",
            "body": "I wasn't overweight but it's been 3 weeks since I've had a drink and I feel way less bloated",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChairmanReagan",
            "body": "I’ve lost a little more than 30 pounds 5 months in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandoRenegade",
            "body": "I was sober for 3 months and dropped 30 pounds by exercising and having a calorie deficit. Unfortunately I relapsed and binged for a good 2 months and gained roughly 5 pounds back. I’m back on the wagon now and working out so I’m hoping it sticks this time around",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flaky_Bandicoot2363",
            "body": "I traded booze for food but I am a lot more active now that I’m not constantly hungover or sitting around drinking. Lost about 10-15 so far and I’ve been eating a lot of candy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "realitybites95",
            "body": "I’m tired of the push to lose weight when sober. \nMy sugar cravings are through the roof now and I have to give in sometimes or I’ll drink again.\nIf I stay sober that’s what counts.\nI haven’t lost, maybe gained a few. I’m working on building better habits but right now I’m just trying to survive everyday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RegalRaven94",
            "body": "It took a little bit of time, but I lost about 40ish pounds after 6ish months. I started exercising a lot too. Another thing is also seeing the brightness come back to your eyes - you probably have seen people on here talking about it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KaatELion",
            "body": "I’m only like 2.5 weeks in this time around, haven’t lost any weight yet, mostly because I am indulging my sweet tooth and not really worrying about that so much yet. \n\nBut in 2021, I (35f at the time, 5’9”) started at ~175lbs went down to ~160 over the course of 5 months alcohol free. I’ve lost and regained ~20 lbs since then, now I’m at 163 and I’m hoping by summer to be down at least 10-15lbs again. I am going to start weaning off sweets soon, focusing on healthier eating and walking more once the weather turns nicer, but even without making any other efforts, I expect I would lose some weight just by quitting drinking. But I do think it takes time for me to lose a noticeable amount of weight, and I could stand to lose more like 30 lbs before I will be at my ideal weight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Single_Remove6148",
            "body": "I'm 6 months alcohol free and haven't lost any weight BUT I haven't gained any either ☺️",
            "score": 1,
            "replies": []
        },
        {
            "author": "08ghosty",
            "body": "Yes, lost a lot of weight quickly when I ditched my daily beers. Upped my exercise game too. Piled it all back on again just as quickly when my sweet-tooth kicked in though! Did not appreciate quite how much the need to replace the sugar in beer would affect me..time to look at my diet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JD_Awww_Yeah",
            "body": "60+ days in and down 15+ lbs with minimal effort dieting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "itsthedogsforme",
            "body": "A) yes, I lost weight and mostly, bloat. That alcohol inflammation is real! Not everyone has the same experience with weight loss after drinking so gauge your expectations, but promise you, you'll lose bloat and feel so much better in your physical body when you stop putting poison in it. \n\nB) The short challenge I gave myself that stuck the third time I did it, and truly changed my life, was doing the *free* 30 day Alcohol Experiment via This Naked Mind. It's a free challenge to join and every day of the 30 days have videos with education, inspiration, answers to questions, a community of people you can connect with and more. Highly recommend the book This Naked Mind as well because it's a straight forward approach to what alcohol does to us when we consume it, and it flipped how I viewed alcohol completely so much so that I didn't want it anymore. \n\nGood luck and congrats on thinking about your relationship with alcohol 💗🙏🏻 it's brave and difficult in a culture that falsely glamorizes it, and it's one of the BEST things you'll ever do for yourself",
            "score": 1,
            "replies": []
        },
        {
            "author": "Highlander_18_9",
            "body": "Not really. Saw the bloat in my face go down pretty quickly. But didn’t notice a drop in weight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Pay9468",
            "body": "I did. I’m 62 days sober and I’ve lost 36lbs in those 62 days. 29lbs in January (it practically melted off) and 7lbs in February. I was drinking a fuck ton of beer. For the last 2 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Proof-Load-1568",
            "body": "It took me about two and a half years and three tries to finally quit drinking. But when I did I lost 70 lb in 8 months. I did this by a combination of counting calories, eating a lot of fiber and protein, avoiding fast food junk food added sugar and highly processed crap, and walking a lot.\n\n\nHowever until I accepted that I cannot moderate my drinking and I have to quit 100%, I was never able to do this. I encourage you to read a lot of the stories in this sub. You will find that almost universally people are only successful when they make a 100% commitment to quit.\n\n\nEveryone's journey is different and you have to figure out what works for you, however I encourage you to not try to reinvent the wheel.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZingingCutie97",
            "body": "On day 9 today, I never gained weight due to alcohol but I didn’t realize how bloated I was all the time, so I feel like I’ve lost weight due to no bloating! 😂 besides that, the biggest positive I noticed within like 5 days was that my skin was unbelievably soft. I can’t stop touching my face, I still can’t even believe it’s my skin lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bojangly7",
            "body": "Yes. Alcohol is a ton of calories not to mention the additional food",
            "score": 1,
            "replies": []
        },
        {
            "author": "acadianfrenchguy",
            "body": "Not a pound unfortunately, although I look better and less bloated I still weigh the same.",
            "score": 1,
            "replies": []
        },
        {
            "author": "moon-child1234",
            "body": "No weight loss for me and I am ok with it. I'm 47 F and losing weight at this point in life is not easy. But, I am healthy and happy! 😀",
            "score": 1,
            "replies": []
        },
        {
            "author": "erictho",
            "body": "I didnt start losing a bit of weight until a year and a half in. People tend to have high expectations on losing weight in just a few weeks by just dropping alcohol calories but losing weight isn't a fast and easy process.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hereandlistening",
            "body": "It took me about 3-4 months, then yes. I don't weigh myself regularly but I think I'm down maybe 20-30 so far.  I'd guess I packed on 50-60 lbs between Covid and drinking. \n\nI do know that my BMI is now around 26%, which is what I care most about. Not sure what that was before - I'd guess low to mid 30s.\n\nDaily activity & exercise has been critical to my mental health - especially during the lows. Spring is an awesome time to get sober. Days are longer and warmer - and our moods lift. \n\nGet out there! The weight and results will follow if you're taking care of yourself 😊",
            "score": 1,
            "replies": []
        },
        {
            "author": "United-Echidna-5958",
            "body": "I have not lost weight but my bloated stomach has gone and I have more muscle I think. I have not been exercising but I have been gardening and tidying the house as a distraction. I feel better about my body. The distended stomach made me feel horrible about my appearance because it was so clear it was from drinking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yjmkm",
            "body": "No, I did not. \n\nFirst I gained about 10-15lbs, now I’m down about 25-30 from that. \n\nThe most important thing, I think, is to go ahead and indulge any food cravings! Don’t try to control your diet too much (unless you’re diabetic!). \n\nBe kind to yourself. After about 90 days when it’s out of your system and the body is moving through the healing process, THEN start making changes you’d like to see physically",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikeyj198",
            "body": "i gained weight but after a while i found discipline to lose it and then some. Currently i fit in a suit i bought 17 years ago when i was in great shape.",
            "score": 1,
            "replies": []
        },
        {
            "author": "japanesedenim_",
            "body": "i lost about 10lbs of just bloating, have been slowly gaining it back because i eat a lot (and love sugary energy drinks especially) but like someone else said, it's something i'm trying to be okay with for now since sobriety is my priority! and imo i would rather put 100g of sugar into my body daily than 100g of sugar + alcohol daily",
            "score": 1,
            "replies": []
        },
        {
            "author": "Been1LongDay",
            "body": "Yea I did. I'm not all that far in but dropped 20lbs in just a couple weeks. The last 2 weeks have been slower going as far as weight loss. But I'm also actually eating 3 meals a day. I weighed more on my \"liquid diet\" than I do eating 3 a day. And it's not like I'm eating salad. Pork chops for supper. Some kinda biscuit for breakfast. Not healthy but also not necessarily unhealthy compared to liquor. If I really put my mind to it and actually went to the gym after work and picked something healthier to eat it's untelling what I'd lose.\n\nI would like to mention I work 6 outta 7 days and always on my feet moving so that probably does help me in a lot of ways as far as exercise goes. But removing alcohol really made a difference.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VeraFreya",
            "body": "I lost 30 pounds just from stopping drinking. But I didn’t replace my drinking calories with anything else, so it was an easy 1000-1200 calories cut per day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jax-A-Lope",
            "body": "I was pushing 200 when I went to rehab. I had been drinking and not eating. In rehab I ate like a horse and left 45 days later and 30 pounds lighter. Just my experience.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KittyKat1935",
            "body": "Yup, lost 10 pounds right a away",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fred_013",
            "body": "Yep! 25 lbs melted away in four months. All I did really was eat normal food that I like, no exercise to speak of. I guess that’s what happens when you suddenly remove 2500 calories/day of beer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "slayder6",
            "body": "I was 245 when I stopped. I went super strict on my diet and started walking 30 minutes daily and I dropped down to 215 in three months. I've stayed stagnant since then because I started allowing sugar again. Gotta have something \"substance\" to experience pleasure! I'd rather it be some B&J ice cream than the alternatives.",
            "score": 1,
            "replies": []
        },
        {
            "author": "electricmayhem5000",
            "body": "Didn't lose weight, but that was because I was actually pretty malnurished from all the drinking. But here are a few good things that you can look forward to in the just first few weeks.\n\n\\- Better, more consistent sleep. Can't overstate enough how life changing this can be.\n\n\\- Skin and eyes won't look dried out, red or puffy. Getting properly hydrated again helps this a lot.\n\n\\- Lower blood pressure which reduces stress which reduces blood pressure. A nice cycle to get into.\n\n\\- A properly functioning GI system. Again, life changing.\n\n\\- Everyday activities that seemed so daunting seem so easy. Getting groceries, folding laundry, doing dishes. OK - this stuff isn't fun. But it seems like a breeze now. Almost like a super power.\n\nMaybe if you start seeing this - along with an overall just better mood - it will motivate you to stop even once Lent is over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Positive-Rhubarb-521",
            "body": "Yep, lost over 50lbs / nearly 25kg in less than a year, from 188lbs /85kg to 135lbs/ 61kg.\n\nI did not focus on weight loss for the first couple of months, but then started to make small changes towards better health.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Honest_Crow9344",
            "body": "Not immediately. I replaced alcohol with going to the gym in January however, and since then I’ve lost 12 pounds and gone down a dress size! My face has lost the puffiness and overall my confidence has gone up hugely. I have been working on my health as a whole though and eating well also. \n\nFrom my experience, losing weight can happen but I think it’s a combination of getting exercise, eating healthily, and no alcohol rather than just the no alcohol for me. The biggest change however is the boost in confidence I’ve gotten and my mood since getting sober!! It’s definitely a journey and did not happen for me immediately but on the whole, my life is a LOT better now than it was before I decided to quit. IWNDWYT - you got this!",
            "score": 1,
            "replies": []
        },
        {
            "author": "lakevalerie",
            "body": "No. A pint of ice cream a day doesn’t allow for that",
            "score": 1,
            "replies": []
        },
        {
            "author": "viciouschicken99",
            "body": "I've lost over 10lbs so far from quitting booze this year...I wasn't overweight to begin with so it seems to have leveled out nicely now",
            "score": 1,
            "replies": []
        }
    ]
}