{
    "title": "Inspired by someone’s post yesterday - have an idea",
    "author": "whatdayoryear",
    "subreddit": "stopdrinking",
    "rank": 353,
    "score": 12,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2t2y0/inspired_by_someones_post_yesterday_have_an_idea/",
    "id": "1j2t2y0",
    "selftext": "Hi everyone, I’m once again on a mission to de-alcohol my life. I read this post https://www.reddit.com/r/stopdrinking/s/RulnqGkVwA yesterday, and seeing how much I related to so many peoples’ symptoms inspired me. So I made a list of every single symptom I’ve been dealing with lately, including both physical and mental health symptoms. I’m curious to see which symptoms go away once I’m farther away from my most recent drink. I’m only on day 2 at the moment so I think there will be lots to discover as time goes on! Has anyone else ever done this? If so, I’d love to hear about it! ",
    "comments": [
        {
            "author": "Prevenient_grace",
            "body": "Id add a second column..,  all the expected and unexpected benefits that accrue!\n\nI add to that list every day.",
            "score": 4,
            "replies": [
                {
                    "author": "whatdayoryear",
                    "body": "I like that idea!!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Low_Peanut2644",
            "body": "Haven't made that kind of a list but I hope you keep us updated as time goes on. For me the first things to go were the shakes, anxiety and crappy sleep. I got my appetite back after 3-4 days. IWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "whatdayoryear",
                    "body": "I will keep you updated for sure! It’s a LONG list lol. I’m confident that a large chunk of the symptoms are related to drinking, so hopefully that means a lot will change for the better. How long did it take for your anxiety to go away?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Low_Peanut2644",
                            "body": "About 3 days, still get little pangs now and then but they are gone in a minute or so.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}