{
    "title": "Just one glass",
    "author": "Living-Poem5982",
    "subreddit": "stopdrinking",
    "rank": 343,
    "score": 4,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j31wsu/just_one_glass/",
    "id": "1j31wsu",
    "selftext": "All I want is one glass of red wine… to sip and enjoy while I unwind and get ready for bed…\n\nIt’s so hard to break old rituals.\n\nIWNDWYT",
    "comments": [
        {
            "author": "tox1cTort",
            "body": "It IS hard. For me, creating new rituals helped. And there are some amazing NA drinks to help you unwind. IWNDWYT!",
            "score": 6,
            "replies": []
        },
        {
            "author": "alphabetsoup94532",
            "body": "The ritual is a big part of it for me. Especially only on day 3. Tonight I drank a few NA adaptogen drinks out of a wine glass and it wasn’t the worst. It definitely got me through. Maybe you can try something similar. \n\nIWNDWYT",
            "score": 3,
            "replies": [
                {
                    "author": "Living-Poem5982",
                    "body": "I’ll have to look into these! TY!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "alphabetsoup94532",
                            "body": "I’ve been grabbing Recess. They’re widely available where I am in the US and have a ton of mock tail flavors and CBD drinks if you’re into that.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "The problem is when that glass is empty, you're hit hard with the \"now what?\" feeling.  Easiest answer is always \"drink some more\".  I don't know how I can know this and still fall for the \"just one drink\" lie.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sound_of_the_sea43",
            "body": "IWNDWYT! For me, it’s never just one. You got this! 💪🏻",
            "score": 2,
            "replies": []
        },
        {
            "author": "takingit1dayatatime",
            "body": "I feel this in my bones! I was a beer drinker. That bottle to my lips, that satisfying swallow as the fizz kinda stung my throat. Man! I missed it. When I first quit drinking, I gained 20 lbs because I started drinking gourmet soda like it was my job. It filled that void. The cold bottle in my hand, the same motions. I figures “better fat than drunk.” And I was right. I eventually switched to sparkling water but those habits are hard to break!  Have a glass of grape juice. Hell, drink it at room temp if that helps. But you got this. IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "full_bl33d",
            "body": "It’s never just one for me tho. Even on nights I managed to keep it under a normal amount, I’d still think about it. My mind would get loud about when to get another one or calculating how many are left and when I have to wake up in the morning. If I was out with people, I’d think about if anyone notices or  if I have to do anything to hide the effects of the last couple I snuck. My mind was always on the next one even if I tried to sip and take it slow. I’d also make sure to reward myself handsomely in the immediate future for my “discipline” and I’d be right back to where I swore I wasn’t going anymore. When I play the tape forward for me, it’s never just one and off to bed. I have plenty of research to tell me where i go and what I’ll do and I know from that extensive research that it’s easier for me to stay sober than it is to get sober.\n\nI still catch myself staring at peoples drinks from time to time or I’ll think about having a drink when I’m just relaxing. I feel like I have a hand on the volume now and I’ve asked myself what I actually like to do for fun and how I like to relax. Connection plays a big role in my sobriety now and I try to not pursue the isolation I kept myself in as a drinker. When I’m connected to others who work on the Sam thing, I feel more connected to myself and I’m able to answer those questions more honestly. It’s a lot more fun with other people too.",
            "score": 2,
            "replies": []
        }
    ]
}