{
    "title": "Struggling to Quit Alcohol Before My Baby Arrives – Need Some Motivation",
    "author": "Kind_Round4333",
    "subreddit": "stopdrinking",
    "rank": 308,
    "score": 4,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j35n5v/struggling_to_quit_alcohol_before_my_baby_arrives/",
    "id": "1j35n5v",
    "selftext": "28M.\nSober streak for 7 days for the first time in around 2 years.\nI’ve been an alcoholic for over five years now, and moving to Japan only deepened my drinking habits due to the culture here. That said, I’m a highly functional alcoholic—productive at work, well-respected by my boss (who has no idea I drink), financially stable, own a house, have a wife, and we’re expecting our first child in May 2025.\n\nThe breaking point came last week. I downed 1000ml of whiskey in two hours, fully knowing I had to take my wife to the hospital early the next morning. I passed out at around 1 AM and had to wake up at 6. I felt like absolute shit the entire time at the hospital. And then, as I watched the ultrasound of our baby, all I could think was \"What the hell am I doing?\"\n\nThat moment hit me hard.\n\nI haven’t had a drink since, but it’s been rough.I always wanted to quit before having a kid, but it didn’t happen. Over the past year, I’ve gained 20kg due to excessive drinking. Back when I lived with family, I didn’t drink as much, but ever since moving in with my wife, it became an every-night thing. She doesn’t drink and has never been around heavy drinkers, so she never really saw my habits as a problem. I could finish a full 700ml bottle of whiskey by myself, and she wouldn’t even realize I was drunk—I just talked a bit more than usual, passed out without brushing my teeth, and overate. Because I was always “fine,” I never really had a reality check.\n\nI never drank and drove, but I did sometimes sit in my parked car after work and take a couple of shots before heading inside so that the amount I drank at home looked more \"decent\" in front of my wife. Now, she’s seven months pregnant, and we have a baby shower coming up next week—on my birthday. Friends and family are flying in from all over, and I don’t know how I’ll stay sober through that. I told myself I wouldn’t drink until the event, but deep down, I know that if I take even one sip, I’ll be right back in it.\n\nThis past week without alcohol has been tough. The first three days were brutal, I still think about drinking all the time, but my sleep is better, my mood is better, and I’m actually helping my wife with chores. I know life is better without alcohol, but I still don’t feel in control.\n\nOn top of that, I want to get fit again. I used to play football and had a great physique, but now I’m 90kg at 175cm, and I hate what I see in the mirror. Years of drinking have done damage, and I know I won’t magically fix it in a week, but I just need some motivation to keep going.\n\nTaking it one day at a time, but it’s damn hard. Any advice or motivation from those who’ve been through this?",
    "comments": [
        {
            "author": "yougococo",
            "body": "If you stop drinking, you'll be taking a huge step to make sure that you are there for as much of your child's life as possible.  You'll be taking a huge step to make sure you are present through your child's life.  You'll be taking a huge step to making sure you remember things that are happening in your child's life.\n\nMy grandfather died of a heart attack at 58 because he was an alcoholic his whole life.  90% of my cousins and I never got to meet him, and he never got to see my older cousins who did know him grow up.  My mom holds onto a little anger towards him for not taking better care of himself and leaving everyone so soon.  She desperately wanted that time with him, and now she'll never get it.  Don't do that to your family.\n\nIt'll literally never be any easier to quit than it is now.  It WILL only get more difficult as time goes on and you continue to drink.  I thought I would be fine but in reading some of the stories on here after I decided to quit, I've learned alcoholism is a progressive disease that WILL take everything from you, slowly but surely.\n\nYou can do this, and you deserve to live your best life!",
            "score": 3,
            "replies": []
        },
        {
            "author": "406er",
            "body": "Having a cause greater than myself was a turning point for me. You have a wonderful wife and will have a child soon, mine was a loving wife who was being crushed by my drinking. \n\nNot sure what you have done to help you in your efforts but many people here recommend useful books including Allen Carr’s “Quit Drinking Without Willpower” and Annie Grace’s “This Naked Mind”.\n\nI have recently finished Allen Carr’s book and found that for me it is helping a great deal.\n\nTwo quotes from the book I find particularly powerful are:\n\n“You hit rock bottom when you decide to stop shoveling”.\n\n⁠“ The craving is not relieved by the drug you’re addicted to, it is caused by it” •\n\nYou might want to give one or both a read.\n\nIWNDWYT",
            "score": 3,
            "replies": []
        }
    ]
}