{
    "title": "Feels like I've hit a wall and I'm in need of advice",
    "author": "DeepRooster8096",
    "subreddit": "stopdrinking",
    "rank": 238,
    "score": 4,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3lkbr/feels_like_ive_hit_a_wall_and_im_in_need_of_advice/",
    "id": "1j3lkbr",
    "selftext": "Hello all! New poster here but long time lurker. (this is a throw away account as I didn't want to post on my main) \n\nAnyway, on to my reason for posting:\nI've hit a wall in my recovery and I'm struggling to figure out how to get past it. \nFor some context, I hit a very rough patch in my life about two years ago, and drinking went from being an occasional way to let off some steam to a full blown daily problem. Thankfully I recognized it was problematic within a few weeks, but the damage was certainly done even though I remained \"functional\". I've been struggling since then with varying success until about 6 months ago when I started to really gain some ground and limit my habits. \n\nAt this point I have strict rules for myself. I drink no more than 2 tall cans of craft beer per night if I must drink, with the occasional successful day or three without drinking at all. I'm very proud of myself for getting to this point, and my partner is very supportive of me in my struggle. But I feel myself slipping recently and it's scaring me because I'm in a very dark place in general and I feel extremely vulnerable and worn down and unable to maintain.\nI have a family. A young daughter. A partner with recent health troubles and an inability to work with zero financial support available to us.\nI'm also extremely anxious about the state of the world and the future for my daughter. We're low income to boot, and I'm trying to pivot careers to make a better life for our family. None of this is helping my situation of course. \n\nThe meat of my current problem is, I feel my dependence has morphed into something new and unfamiliar. I can make it all day with minimal thinking about alcohol now which is great, but as my energy wanes and the day goes on it gets harder and harder. By the evening I desperately cling to my two beers like they're a life raft. The compulsion to drink in the has become EXTREME. Once I crack my first beer and take a sip, I almost instantly feel the weight of the world lift off me, if just for a moment. This is new. I never felt such a strong reaction before even when I was drinking more heavily and thinking about it on and off all day. \n\nI know this is in large part because these beers are quite simply the only source of dopamine for my already severely deprived mind. They literally feel like medicine which i know is hugely problematic. I'm 100% just self medicating at this point. \n(I have very bad but well treated ADHD. Meds and therapy, as well as a lifetime of Behavioural therapy.)\n\nI've tried to lean on other things that bring me even a sliver joy/dopamine, but in the ever increasing stress and anxiety I feel, I find my interests are... Well... Not interesting. They just make me sad these days. Even videogames and other escapism doesn't work anymore. \n\nI also am medicated for anxiety and depression, which has been helpful. I'm in talk therapy. I have ex-drinkers in my family supporting and advising me. I'm so lucky to have all this support and I know I'm in a WAY better place than most people with similar substance abuse issues. It's hard to fight off the guilt of all this considering my very lucky position in life... which also compounds on my troubles, lol. \n\nLately my thoughts are \"well it could be worse. I'll just accept I drink two tall boys a night and thats just my life for now until things get better.\"\nBut I feel that kind of apathy and resignation that will only make my problems worse, or set me up for a big fall should my life get any more stressful. I already feel the negative effects on my helath. That'll only get worse. \n\nI feel like I've tried everything to get over this hump all to no avail, and I'm left feeling defeated, disappointed, and above all very, very, scared. \n\nAnwyay, If anyone read all that, bless your soul. I hope that wasn't too much of a ramble and painted a clear picture of my struggles. \n\nThank you so much for taking the time to read. Much love to you all from Canada ❤️",
    "comments": [
        {
            "author": "AnargyFBG",
            "body": "I think that, judging by your whole situation, it’s a godsend you’re only drinking two beers. Honestly, we all know no one recommends you to drink alcohol, but if this truly is all you do right now then I think you’re doing alright. Yes, it’s not optimal, and preferably I’d tell you to examine the beer you drink; how it tastes, if it truly brings any relief, if it’s worth the side effects, etc. All I can say is you know there is a problem because you so desperately cling to your two beers, though taking into account the whole of your situation, you are indeed holding on better than some, yet worse than others. If and when you’re in the position you can take a closer look at your drinking without losing your crutch, maybe you will get to see the crutch is an illusion.",
            "score": 2,
            "replies": [
                {
                    "author": "DeepRooster8096",
                    "body": "Wow. Thank you so much for taking the time to reply. \n\nThat was all incredibly helpful to read. I'll try that thought experiment tonight with my beers and going forward too. Fantastic idea. \nYou've given me a lot to think about, that's for certain! \n\nI appreciate you a lot and wish you strength in your journey!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AnargyFBG",
                            "body": "Thank you. You as well. There is more to sobriety than just abstaining from alcohol itself.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fresh-Radio-8253",
            "body": "Dont  worry about the state of the world. It's a moving train and there's nothing you can do about it. Even though you might not agree with the things happening, just know that democracy requires an ebb and flow. It can not go all liberal or all conservative. The back and forth is what makes it all work in the end.\n\nKeep your eyes on the prize, your familys health and that beautiful baby girl of yours. Im on day one from a total binge last night, and im depressed all the time. But we gotta just keep trying.  Drink your 2 beers, maybe try and knock it down to one . Any progress is progress, friend.",
            "score": 2,
            "replies": [
                {
                    "author": "DeepRooster8096",
                    "body": "Thank you for this wisdom. You're very right. \n\nYou also reminded me of, and further reinforced something I'm slowly coming to realize which is:\nI need to fucking DETACH from social media a lot. It may be doing more damage to me than the beer at this point...\n\nAnd fuck yeah. We just gotta keep trying is damn right. Thank you for sharing and for showing me your strength in your own struggle. You got this. We got this.\n\nMuch love! ❤️",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "yuribotcake",
            "body": "Alcohol releases absurd amounts of dopamine. It also doesn't actually help with resolving anything that causes stress. It just makes me momentarily not care about it. When things cause stress, there's no dopamine. Resolving those problems, gives me feeling of accomplishment and it prevents those problems from causing more stress. When I drank to deal/cope with problems, it made the stress temporarily go away, yet the problems remained. And that dopamine made my brain assume that it was the \"correct\" way of dealing with those problems. If money was tight, drinking made me feel that I might as well enjoy the last of it. When problems caused anxiety and stress, drinking made me not care and then neglect became the \"correct\" course of action thanks to the dopamine. When I drank, I never jumped at trying to fix my life or come up with a strict plan to fix my situation, drinking just made say \"fuck it.\" And then when things got worse, it was easier to say \"fuck it\" than to actually face the reality. Because reality is tough, and it takes work to get that feeling of accomplishment. Alcohol is easy, gives me feeling that I can achieve anything. Then next morning I'd wake up only to dread to open the curtains to reality...and back to drinking I went. \n\nIWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "DeepRooster8096",
                    "body": "Damn. This is some real shit for me. I truly appreciate you taking the time to share. Really put a LOT of these new and unfamiliar feelings into words for me, and lent a lot of perspective to the rest...\n\nI very much feel my current problems are much of what you describe. I'm in this place where I'm desperate for something to just be fucking easy. \nBut taking that easy road and cracking a beer like it's fucking life support sure as hell isn't making my problems go away. I also very much doubt that the turmoil I feel the next time around is worth the momentary reprieve. I didn't mention it in my original post, but reading your reply reminds me that initial moment I wake up every day is getting increasingly rough. The urge to just crawl into the nearest hole anf hide is STRONG. \n\nI think that's part of my fear. I'm lucky enough to be self aware enough to know I'm slipping into a bad place if I continue as I am. I think I know two beer will turn to 3, 4, 6, etc. \n\nYou've very much re-enforced my instinctual thought that complacency isn't the path. I can have forgiveness and leeway with myself, but I can't just cave to the apathy. I have way too much at stake. \n\nThank you so fucking much for sharing. ❤️",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "GearKitchen929",
            "body": "Some of your worries sound familiar, and the restrictions you put on yourself definitely do. I also thought I'd just accept my alcohol consumption, as it was only 2 beers a day on most days, only drinking at night, after work. I also felt it's the only way to relieve worries and stress. I did that for many years. Until I thought that even though I don't drink that much at once, it's still not normal to drink every day. So I started restricting myself. Every second day, every third day,...but I would find excuses like \"I can drink a second day in a row and then I'll just stay sober for twice as long\", but somehow this often didn't work and my \"debt\" on sober days raised. So I started  bookkeeping\" 2 years ago. My goal was not to drink more than 50% of days in 2023. I almost failed, but somehow managed in the end. So it was time for a new goal: 66% (or two thirds, so to speak) of days in 2024. I ended the year with even 70% (or 69.95 to be exact). Next goal was supposed to be 75. What I realized during that year though was that I was far from drinking every day now, but on the days I did, it wasn't 2 beers anymore, but rather 4 or 5. By the beginning of this year, I had an argument with my spouse while being drunk. And with all filters removed, I verbalized my concerns in a very insensitive way. It was the day after that I had the insight that I cannot handle alcohol, no matter how much I control myself, it will somehow get out of hand one way or the other. So there I am now, on day 60 of my non-alcoholic phase, sitting here and drinking tea and the demons tell me that it's not so bad and I did so well restricting myself, that I prove in the last 2 years that I can do without so it's OK to have a drink sometimes. But the fact is that situations where I will regret what I have said while being drunk would definitely happen again. Or worse, situations where I am not completely sure the next day what I said and being afraid it was something stupid that can harm my relationship or employment. \nI've been frequently blurring my senses since I was 14. Not diagnosed, but probably also ADHD and thus often tried to numb the crazy amount of uncontrollable thoughts that just pop up out of nowhere day and night. In the end, it was alcohol that stuck to me. Not even because I liked the effect most, which I didn't, but probably because it was the \"medicine\" easiest to get. \nI don't know if I could live the rest of my life fully sober. But one thing I know, having had 1.5 liters of tea after a long day of work that actually called for a beer loudly: I'll go to bed now and IWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "DeepRooster8096",
                    "body": "God damn. Thank you for the candid sharing. Your strength shines through your words, friend.\n\nIt's \"funny\". As you were describing your initial plan to set goals (great idea even if it didn't necessarily get the results you expected)\nMy mind latched onto it like \"THIS IS MY SOLUTION!\"\nWithout any further thought or analysis, which is very unlike me and very telling to where I'm at lol... Then when you finished the story, It was a very telling moment for me... I'd 100% end up in a similar situation. I know deep down I really just need to cut it out of my life entirely. \n\nHonestly, if there's one big takeaway from your wisdom, it's I too just need to take my victories when I can get em, and just go the fuck to sleep sometimes. \n\nFrom the bottom of my soul, Thank you for sharing your strength. I hope you sleep well, friend. ❤️",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GearKitchen929",
                            "body": "I think the problem with my idea/failed solution is, that it looks at the drinking from not only one but two wrong viewpoints: One is that a lot of people in our society would probably think that consuming alcohol two times a week is not to be considered problematic drinking behavior. So what I did is restraining myself to fit into social standards, the view others would have, instead of reflecting on what drinking does to me. \nThe second one is that reaching my goals would automatically mean that I successfully fought addiction and don't have to worry anymore, not considering \"addiction memory\".\n\n\nSo no, it was not a great idea to begin with. Not with my history at least. But to see the positive sides: Restricting myself to 30% (still a lot actually) seemingly wasvenough to be able to go through 60 non-alcoholic days without my brain complaining too loudly. Looking back, 60 days in a row already is the biggest time span without alcohol I had in the last 15-20 years. And it'll be 61 tonight. 65 this next Sunday. That I'm sure about. \nIWNDWYT",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}