{
    "title": "Accepting yourself and the mistakes you've made",
    "author": "mick7x",
    "subreddit": "stopdrinking",
    "rank": 135,
    "score": 36,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3qpho/accepting_yourself_and_the_mistakes_youve_made/",
    "id": "1j3qpho",
    "selftext": "I am currently navigating through my absolute rock bottom, and have only now seen how bad my alcohol use is.\nI've done so many embarrasing, humiliating and stupid things in the past while drunk, but just 5 days ago i truly outdid myself. \nSince that day i've set my first goal- to stay sober for a month in over many, many years.\nBut since that night, the only thought that's been lingering in my head is:\n\"No matter what you do now, people will always remember you for your mistakes\"\nI can't change the past. What will help me to not crazily obsess over it? Obsess over how people now see me?\nWhat will help me to accept my mistakes and slowly start becoming the person i truly want to be?\n\nAll love 🫶",
    "comments": [
        {
            "author": "Weird_Presentation_5",
            "body": "Staying sober and exercise will help you immensely. That alcohol is just going to make you ruminate over those past mistakes as long as it's in your system. Put the drink down and go get some exercise.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Dry_Address_1597",
            "body": "I’ve found that the only way to move past my mistakes is just to be better in the present. I believe in you to do that",
            "score": 11,
            "replies": []
        },
        {
            "author": "electricmayhem5000",
            "body": "I did some really stupid, embarrassing, reckless things while drinking. If I think about it too much, serious cringe factor. And that's part of my story, but it was just a really bad version of me. Hopefully, sober me is a much better version.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Beulah621",
            "body": "If those mistakes lead you to quit drinking, you can look at them as blessings in disguise. \n\nYou are concerned how other people see you and I get that.\n\nPeople will see you as a person who had the strength to overcome an addiction and started living a good and honorable life. That is the truth.\n\nIWNDWYT 👍",
            "score": 8,
            "replies": []
        },
        {
            "author": "Spare_Answer_601",
            "body": "The Most Important Apology I made was to myself. I made amends to myself too. IWNDWYT",
            "score": 8,
            "replies": []
        },
        {
            "author": "Tshlavka",
            "body": "When those thoughts pass through my mind, I take a moment to ask myself if it’s something I can fix or not? If not, I tell myself to let it go. If it is something I can fix I do (apologies, acknowledging it, etc). Over time it becomes less and less likely for those cringe moments to come up. Forgive yourself. I just want to be the person who has nothing to run from. 🫶",
            "score": 7,
            "replies": []
        },
        {
            "author": "Hungry_Source_418",
            "body": ">\"No matter what you do now, people will always remember you for your mistakes\" I can't change the past. What will help me to not crazily obsess over it? Obsess over how people now see me? What will help me to accept my mistakes and slowly start becoming the person i truly want to be?\n\nI might think about AA, most of the program deals with exacty these issuses.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ecstatic_Tangelo8690",
            "body": "Getting time between you and your last drink episode will start to change the way you’re thinking. A lot of that shame and guilt is from drinking - it’s such an insidious cycle! Sure we can not erase the memories but getting that sober time changes the way we focus on them. Try to give yourself the same grace you’d give anyone else. The people that love and care about you will be happy to see you blossom as you become sober longer and longer. Anyone that chooses to view you thru the lense of the stupid drunken shit you did isn’t worth your time or thoughts! And also what other people think of you is none of your business. I’m routing for you! You got this!",
            "score": 3,
            "replies": []
        },
        {
            "author": "DoqHolliday",
            "body": "Hey, I was pretty much there 28 days ago. Sending hope, peace and love 💙🫂.\n\nCouple thoughts.\n\nReflecting and taking stock is/can be helpful. Obsessing, self-shaming and self-recrimination are definitely NOT.\n\nIt’s important to remember that as alcoholics/addicts, we are often wired towards negativity, recrimination, and self-pity/self-loathing. This is a toxic cocktail, and def doesn’t prepare us to healthily assess this sort of thing, especially early on.\n\nIt’s commonly recommended to focus on staying in the present early on. We can’t change the past, can only do so much about the future, and should primarily be focused on staying sober and surrounding ourselves with the support and resources we need to do so. Obviously kicking our own ass isn’t a huge plus here.\n\nGoing to recovery meetings can help a lot. It’s one place where we will be understood, accepted and surrounded by people with similar (or much worse) experiences to/than our own. The value of this really can’t be overstated.\n\nIt can help to recognize that those things weren’t done by the “real me.” This isn’t to give ourselves a pass, but to clearly articulate that the sober, present me would never have done that shit. The future sober me not only won’t do those things, but will actively try to amend them.\n\nMost critically perhaps, we have to give ourselves love and grace. Again, most alcoholics aren’t wired to do so (quite the opposite), so this may require effort, therapy, and/or talking to recovery peers/sponsors etc.\n\nBut we absolutely must approach ourselves as we would another suffering alcoholic, with love and acceptance and healing. Hope for the future.\n\nFinally, there is a tremendous relief in just letting go, at least for now. For me, part of it was wrapped up in hopes/expectations that people would forgive me, or worries that they wouldn’t. That’s not acceptance, it’s still trying to exert control over a situation way, way outside of our control (see alcoholism 101 😂). Again, easier said than done, but to consciously close the chapter, step up from the table and walk away (again, perhaps just for now, there will be time later for amends where appropriate) can be incredibly healing. It’s like setting down a burden that we realize is slowly breaking our back, and taking a few fresh steps unencumbered.\n\nProbably long-winded, and perhaps blather, but I hope this helps in some way.\n\nThis is one of the toughest things in early phase, and a prime cause of relapse. \n\n“I can’t fucking handle this so whatever, I’m just gonna numb it. I’m fucked anyways.”\n\nThis is an incredibly common response and excuse to go back to the bottle.\n\nFar better to accept, love, and begin to heal ourselves, starting NOW.\n\nIWNDWYT",
            "score": 3,
            "replies": [
                {
                    "author": "XQMi",
                    "body": "This was very nicely said. I’m currently dealing with a partner who moved me to another state and just kicked me out due to me coming home drunk and his daughters seeing it. I am horribly in despair right now humiliated and he is done with me after one relapse. I’m in a massive depression sober but I lost the love of my life to this disease.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Prize-Leadership-233",
            "body": "You can change the narrative though. You can give them a story about success by quitting drinking. Nobody that I've talked to about my alcoholism has brought up my past. They always just tell me how much better I look, how  happy they are for me, wish me luck, and then we talk about how much better my life has gotten because I quit drinking. \n\n  \nThe past is done. Can't do anything about it so there's no use stressing over it. The future is still waiting to occur. You can do something about that, and quitting drinking ensures that you have a better shot of making it a good story.",
            "score": 2,
            "replies": []
        }
    ]
}