{
    "title": "Emotional wreck?",
    "author": "YourMirror1",
    "subreddit": "stopdrinking",
    "rank": 200,
    "score": 6,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3s2yg/emotional_wreck/",
    "id": "1j3s2yg",
    "selftext": "I'm (40F) going to hit a month this Friday. For the past few days, my emotions have been ALL OVER the place. \n\nI have an anxiety disorder which I've been managing. So, I'm not a stranger to the deep, dark feelings a \"lucky\" few of us understand. But I've been angry, activated, depressed, uncharecteristically assertive, and plain ruminating about how I dont feel validated or seen by my husband, that work takes advantage of me, etc. \n\nI used to drink like a bottle of wine a night, then severely reduced for several months, and finally went to zero in early February. Except for the anxirty mental illness, my body is perfectly healthy. Every biomarker, cholesterol liver etc are all perfect. What gives? Is this my brain recalibrating? I was already drinking way way less. ",
    "comments": [
        {
            "author": "DoqHolliday",
            "body": "I believe this is pretty common, I am on day 27 and have not been the happiest camper. Good at times, anxious, irritable and depressed at others.\n\nBear in mind that our bodies and minds (and souls?) are undergoing MAJOR recalibration. Patience and not getting too caught up in any one feeling are the watchwords.\n\nMost people report improvement in months 2 and 3, with  a big leveling off around 4- 6 months.\n\nIn the meantime, therapy, exercise, meditation, reading/audiobooks/podcasts and hobbies (the more constructive/creative the better) all help me tremendously.\n\nOne day at a time!\n\nIWNDWYT",
            "score": 4,
            "replies": [
                {
                    "author": "YourMirror1",
                    "body": "Thank you. At times, the emotional volatility is unbearable. I'm thankful I have some therapy skills from anxiety to help manage. Maybe this is good for me, learning to live through pained feelings without pushing them down or away.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Papaverpalpitations",
            "body": "Totally normal, unfortunately. This is your brain recalibrating. It sounds like you may be going through post-acute withdrawal syndrome (PAWS) which is the clinical term for the brain recalibrating after substance abuse. The length of time PAWS lasts is different for everyone and dependent on a myriad of factors.",
            "score": 3,
            "replies": [
                {
                    "author": "YourMirror1",
                    "body": "Thanks. I'm not sure that it's very likely that I have that, but good to know I'm not alone on this ride!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "idonotwannapickaname",
            "body": "Sounds like what I went through at the beginning of getting sober.  But some of those symptoms have continued. Ends up some of it was the start of perimenopause.",
            "score": 3,
            "replies": [
                {
                    "author": "paintedvase",
                    "body": "Same here! I quit at 42 and once my drinking lifted those cyclical symptoms showed up even more glaringly. I’m glad I got to see a bit of my baseline before the major drop a couple years later.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "YourMirror1",
                    "body": "Lol I was thinking that but I literally JUST got my hormones tested during my annual physical last week and it doesn't look like that's it yet. But maybe... who knows?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fdrth77ui-",
            "body": "40m 119 days. The same thing happened to me for about 2 months and have gradually tapered off. I had no patience at all…it was not fun but I recognized it is all part of the journey. At 119 days it has gotten much better. But I think everyone goes through this. Good luck 🍀",
            "score": 2,
            "replies": [
                {
                    "author": "YourMirror1",
                    "body": "Thanks! This gives me a lot of hope for the months ahead. My first goal is to get to 100 days and I'm almost 30 percent there. I'll Reassess when the time comes.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}