{
    "title": "Gps interlock device question sorry if this is the wrong place just need help",
    "author": "Much-Association-897",
    "subreddit": "stopdrinking",
    "rank": 141,
    "score": 0,
    "upvote_ratio": 0.33,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j4aly2/gps_interlock_device_question_sorry_if_this_is/",
    "id": "1j4aly2",
    "selftext": "Interlock device with GPS michigan\n\nHello, recently been anxiety ridden and have a question for Michigan people. \n\nAfter a second DUI I was lucky enough to get into sobriety court and get a restricted license. I've taken my sobriety extremely seriously and I'm 100% not concerned about blowing hot. My question is what is the gps data used for? \n\nI have a small llc that Im starting to do jobs with as I'm laid off from my construction job right now. I got the ok to do that from my PO and I've been driving to and from work for the 1 job I do have on my restricted license with my interlock car. I've also had to stop at the hardware store a couple of times to get supplies and that counts under my restricted license as \"in the course of my employment\" \n\nI'm truly following everything to a T And I'm still so so scared of the SOS getting my GPS data and deciding that I've violated my restricted license somehow. I also drive to AA, church (my PO reassured me that church was okay to drive to as it counted for 12 step meetings), and to and from court appointments. \n\nDoes anyone have any info, and or stories about gps data being used for SOS to monitor movement on restricted license or what it's even used for. I'm terrified of getting a random letter in the mail saying I violated my license for stopping at a store or whatever else in the course of my employment. I'm probably overthinking it, they don't even have addresses for work or anything listed for me other than my home address. Any advice or info would be greatly appreciated. I'm so so grateful for the opportunity to drive again. Thanks ",
    "comments": [
        {
            "author": "Low_Peanut2644",
            "body": "No experience in this but I would take this post to your PO and get his/her advice. If you can get it in writing that would be great if there is some misunderstanding about your driving movements down the road. Hope this helps. IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "PhoenixApok",
            "body": "I can't say for SURE but it sounds like this is a pretty standard thing. Most POs aren't looking to actively screw you.\n\nIf they see a small variation (like a 10 minute trip takes 15 ) they aren't likely to care.\n\nYour post reads like you've already cleared your destinations with them.",
            "score": 1,
            "replies": []
        }
    ]
}