{
    "title": "Mocktails that hit the spot?",
    "author": "windintheaspengrove",
    "subreddit": "stopdrinking",
    "rank": 139,
    "score": 0,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j4b0ot/mocktails_that_hit_the_spot/",
    "id": "1j4b0ot",
    "selftext": "Hey all, I have three drinks that I absolutely love and am mourning: \n\n1. Extra spicy Bloody Mary’s…. God, I love them. \n\n2. Mojito… so refreshing. \n\n3. Sangria! I loveeeee white sangria, especially. \n\n\nNow, I’ve tried some bottled mocktails, but the flavors always seem to be off. I know without the liquor, of course it will taste different, but does anyone have great replacements for the liquor or recipes that provide a similar essence? \n\nAlso, how do we feel about mocktails? Are they triggering? I’m taking 1 month before doing anything alcohol related and a mocktail feels alcohol related. Like when I start to make a Virgin Mary, will I want to drink really badly? \n\nWould love to hear your thoughts. ",
    "comments": [
        {
            "author": "shineonme4ever",
            "body": "When I'm feeling wild and crazy, I mix Pineapple Juice with Coconut LaCroix for a bit of a tropical feel.\n\nAs for NA stuff, I won't touch them.  I won't pretend to do the thing I've completely sworn off.          \n*For me*, NA beer/wine/spirits are a throwback to a lifestyle that nearly killed me and took decades to get away from.          \nI needed to get rid of any mental bond to my previous drinking behavior to have any chance at long-term sobriety.",
            "score": 4,
            "replies": []
        },
        {
            "author": "prisoncitybear",
            "body": "Ginger beer and apple cider. \n\nIf your jam was Fireball, kind of gives that vibe. Not really a summer drink, but damn, it's good.   \nT",
            "score": 2,
            "replies": []
        },
        {
            "author": "moon-child1234",
            "body": "I'm a fan of NA beers, hop water, and am starting to try mocktails. So far my favorites are Shirley Temples and club soda with cranberry and lime. Best of luck to you! 🍀",
            "score": 3,
            "replies": [
                {
                    "author": "Feeling_Bat_3379",
                    "body": "Hop water is awesome. We call them \"Hop Pops\" too.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Even-Guava-1682",
            "body": "I I love extra spicy NA bloody Mary's, and i never even used to drink regular Bloody Mary's. I find that adding spice to any mocktail is a pretty good replacement for the alcohol. \n\nI love a mocktail. I don't find them triggering, but i also find that my comfort not drinking in drinking enviornments is more influenced by my glass than what is in it. I feel so much better drinking selzer in a short glass with ice, than drinking a mocktail in a regular juice glass.",
            "score": 2,
            "replies": [
                {
                    "author": "windintheaspengrove",
                    "body": "How do you order a seltzer water in an alcohol glass? I think I would also feel more comfortable doing this, so I feel that I’m still partaking in the rituals/social setting.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Even-Guava-1682",
                            "body": "I just ask for selzer in a short glass with ice and lemon. Or if you wanted it in a wine glass you can ask for that too. Ask for whatever you want!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PhoenixApok",
                    "body": "I've been drinking Spicy Bloody Mary mix since before I really drank.\n\nJust the mix over ice is tasty enough!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "blackheart12814",
            "body": "My favorite NA drink is a tried-and-true Diet Coke!  But since you mention Mojitos, I saw that Spindrift makes a mojito flavor.  Haven't tried it so can't vouch for it. I'd also love to taste their Cosmo flavor but cannot find it. Also, if you liked Negronis there are many NA brands out there that are great! And I've found that so many restaurants are now carrying them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Polymurple",
            "body": "\nVirgin michelada:  Clamato juice, hot sauce, lime juice, non alcoholic beer\n\nagujero de fuego (My signature cocktail): low sodium V8, lots of tapatio hot sauce, lime seltzer\n\nAny virgin daquori: daquori mix, ice (add seltzer for fizzy fun)\n\nBitter behemoth: tonic water, grapefruit juice\n\nMulled tea : steep hibiscus flower, cloves, nutmeg, and cinnamon in hot water for 5 minutes (good substitute for mulled wine)\n\nHibiscus tea (nice replacer for wine)\n\nHorchata: white rice soaked overnight with almonds, Mexican cinnamon, and water. It’s then blended and mixed with whole milk, sweetened condensed milk, and vanilla, and served over ice (nice alternative for mudslide, add chocolate, cayenne, or any other spices/flavors that sound good",
            "score": 1,
            "replies": [
                {
                    "author": "RealisticInspector69",
                    "body": "Oooohhhh - lovely 🌹🌹🌹",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Polymurple",
                            "body": "These got me through some tough times.  Enjoy",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RealisticInspector69",
                                    "body": "❤️❤️❤️❤️ My daughter calls these kinds of fabulous  things: \"ceremonial drinks\" which I love...and yours are truly fabulous 🤩",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sepiida69",
            "body": "I tried this drink at a restaurant once and loved it!! It was matcha, ginger beer, and lime with a mint garnish!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lucky_Best_Wash",
            "body": "I've started ordering Stappi Red Bitter soda from Amazon (or online Italian food stores) - it tastes a little like Campari - has a really nice flavor, not too sweet.\n\nI mix with club soda and a lime or orange - its like a NA negroni or spritz.",
            "score": 1,
            "replies": []
        }
    ]
}