{
    "title": "Struggling with Birthday Plans After Cutting Back on Drinking - Advice Welcomed :)",
    "author": "lukeaed",
    "subreddit": "stopdrinking",
    "rank": 88,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j4cx0m/struggling_with_birthday_plans_after_cutting_back/",
    "id": "1j4cx0m",
    "selftext": "Hey everyone,\n\nI’m feeling really anxious about my upcoming birthday and could use some advice. I’ve been working on having a healthier relationship with alcohol, and as part of that, I no longer feel comfortable in bars or clubs. The problem is, before I started my sobriety journey (I’ve had one slip since January), I’d already set up a birthday group chat with the intention of planning a big night out. Now I feel stuck because I don’t want to do that anymore, but I also don’t want to disappoint people or make it a whole thing.\n\nI’ve decided to change my plans to something smaller and more in line with where I’m at, but I’m worried about how my friends will react. A lot of them still enjoy drinking, and I don’t want to seem boring or like I’m judging anyone. At the same time, I know I need to prioritise what’s best for me.\n\nHas anyone else been in a similar situation? How did you navigate changing plans or setting new boundaries around drinking without making it awkward? \n\nAny advice would be massively appreciated!",
    "comments": [
        {
            "author": "SallyCook",
            "body": "In everything I do, every decision I make, my sobriety comes in above all else. The people who love me and care about me understand this. Everyone else can get stuffed. If my health, i.e. sobriety, is not important to them then they are not important to me. Full stop.\n\nSo what would I do if i were you? I'd tell my mates that at this point in my sobriety recovery journey I am not comfortable around alcohol. I would ask for their understanding and help. I would invite them over for pizza and a movie and some games like Scrabble or Pictionary. Explain how helpful this fellowship will be to my recovery health and how much I want them to be a part of my life and how right now I am feeling scared and vulnerable, so their understanding is appreciated deeply. \n\nBirthdays do not have to be a massive blowout. Real friends know this. \n\nIWNDWYT and Happy Birthday. Sobriety is a great gift!",
            "score": 2,
            "replies": [
                {
                    "author": "cutecreep_92",
                    "body": ">The people who love me and care about me understand this. Everyone else can get stuffed. \n\nEXACTLY THIS.\n\nOP, listen to this sentiment, but the whole comment hits the nail on the head. Your TRUE friends will be down for whatever you want to do, and there will be no judgment or perception of judgment present. I promise.\n\nHappy [almost] birthday. You're giving yourself a great gift. You've got this. IWNDWYT! 🤍",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "abaci123",
            "body": "I can’t have a healthy relationship with alcohol. I have to break up with that completely. The good news is that birthdays sober are the best birthdays ever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "prisoncitybear",
            "body": "I highly recommend googling \"The Pregnancy Principle\" and let that be your guide. \n\nYOU come first when it comes to your journey.   \nT",
            "score": 1,
            "replies": []
        }
    ]
}