{
    "title": "What did you become?",
    "author": "ZestycloseNature1860",
    "subreddit": "stopdrinking",
    "rank": 79,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j4hdhh/what_did_you_become/",
    "id": "1j4hdhh",
    "selftext": "What did alcohol do to you? Who did you become? How did you escape? Who are you now? ",
    "comments": [
        {
            "author": "sittingontheroofjust",
            "body": "i became a person that i wouldn't want to hang around\n\nbecame mean and angry got sober and now just into recovery a lot but still struggle",
            "score": 5,
            "replies": []
        },
        {
            "author": "Prevenient_grace",
            "body": "Alcohol delivered me to misery.\n\nI became more self-centered and ever more isolated.\n\nI walked into a free recovery group and listened and I've never looked back.\n\nI became authentic me.\n\nHow about you on those 4 questions?",
            "score": 2,
            "replies": [
                {
                    "author": "ZestycloseNature1860",
                    "body": "Well I haven't escaped. I don't know who I am.... I just know I need to quit. It's so difficult, it's had a grip on me for so long, I'm actually don't know how the future is going to go ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Prevenient_grace",
                            "body": "Well, no one knows how the future is going to go.\n\nWhat I do know is what \"I do next, right now\".\n\nIf I do that which forwards my intentions for a purposeful life, then I've done the right thing.\n\nThen I do it again right after that.\n\nAnd again...\n\nPretty soon I've a got a strong track record and making remarkable progress.\n\nWhat do you want for yourself?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GenevieveSapha",
            "body": "Alcohol made my life unmanageable.\n\nMy late Wife said I became \"*someone she didn't like very much*\".\n\nMy escape... I just made the decision that '*Enough is Enough'*.\n\nI am now the person that I haven't seen in a ***very*** long time... just getting re-aquainted with them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GenevieveSapha",
            "body": "Alcohol made my life unmanageable.\n\nMy late Wife said I became \"*someone she didn't like very much*\".\n\nMy escape... I just made the decision that *Enough is Enough*.\n\nI am now the person that I haven't seen in a ***very*** long time... just getting re-aquainted with them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "full_bl33d",
            "body": "I’ve heard it said that sobriety delivers what alcohol promises and that’s been pretty true for me even tho I still fight it. My mind would trick me into thinking the next drink was going to be the start of some adventure, or I’d be more funny and have more fun. But the reality was that I wasn’t going anywhere and i certainly wasn’t making me more charming. I can tell things have changed by how people respond to me and the types of conversations and relationships I have now. I’m no longer chained to a bottle and I’m not too drunk or too hungover or too fucking weird to go out and do stuff. I realized I became a stick in the mud about a lot of things. Coming up with the conclusion before I’ve done any of the work is still something I’m working on but it’s gotten much easier to say yes to things and experiences I normally would’ve shit on in order to continue drinking. It’s work sometimes but it’s worth it.",
            "score": 1,
            "replies": []
        }
    ]
}