{
    "title": "Anyone got suggestions?",
    "author": "Spaants",
    "subreddit": "headphones",
    "rank": 9,
    "score": 1404,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 225,
    "url": "https://i.redd.it/8bwephdhg9pe1.png",
    "id": "1jde36b",
    "selftext": "",
    "comments": [
        {
            "author": "GooseEntire1705",
            "body": "It exists, it's called HE1...",
            "score": 336,
            "replies": [
                {
                    "author": "Dear_Studio7016",
                    "body": "you got an extra one lay around lol",
                    "score": 143,
                    "replies": []
                },
                {
                    "author": "Zernium",
                    "body": "HE1 actually measures more like a hifiman than hd600 lol. 2k dip.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "elsico96",
                            "body": "Which hifiman headphones for example? Just asking",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "PiotrekPL18",
                                    "body": "On graph like HE1000 V2. But sound is quite different though (I listened to both).",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Pokrog",
                            "body": "Because even Sennheiser has to admit Hifiman did it right with that dip and they did wrong with the 6X0 line. If there was an HE-1 tube like a 6XX, nobody would be impressed because it wouldn't have any clarity, even as an estat.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "EllieBirb",
                                    "body": "I dunno about that, that dip is something I always EQ out because it makes things sound hollow to my ears.\n\nMy Arya have a nice wide bump at 1.7 khz and 4 dB, makes the timbre almost flawless to my ears.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "AA_Watcher",
                                    "body": "Harman research says otherwise, dude. Average preference and all that. There isn't really a wrong or right in this case.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "youpeoplesucc",
                                            "body": "Isn't the harman target smoothed out though? I don't think it would account for subtle dips like that",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "AA_Watcher",
                                                    "body": "There is also a 'high resolution' OE Harman target out there that uses the KB501X pinna DF as a base. Harman didn't just throw the pinna gain in a random spot, the place of the rise and amount is based on DF. It's why you won't see a real difference in where the pinna gain starts and the amount of gain between JM-1 and Harman. You'll see some differences right after the peak but the shape and peak itself matches well. \n\nIt won't be perfect for everyone's ears but that was never the goal of Harman. For most people a more filled in upper midrange will sound more natural because it more closely aligns with their own HRTF DF. A lot of people enjoy the effects that the HiFiMAN dip has but it does come with a penalty to midrange timbre. For some it will be smaller or bigger than for others. A lot of people remove the dip with EQ either completely or partially. I'm personally still experimenting with this on my HD800S and HE6se v2. I do notice that a more filled in upper midrange does sound more natural but I do also enjoy the spaciousness effect of having a dip, but my ears aren't that picky so I don't really have a strong preference for either and can enjoy both for what they are.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Zernium",
                                    "body": "I mean, the new unveiled products kind of fill it in. I personally find hd600 midrange much more natural than 2k dip hifiman, but to each their own.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "rodiobobo",
                                    "body": "Hifiman is filling the dip in recent models. And people love that.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "casper_wolf",
                    "body": "You just have to pay senny $75k to make a headphone with bass. I think it’s crazy how much love senny gets for headphones that are simply bright and expensive.",
                    "score": -23,
                    "replies": [
                        {
                            "author": "SirMotherfuckerHenry",
                            "body": "The HD600/650 isn't bright at all. Hell, those headphones were the cause of the dreaded and memed upon 'Sennheiser veil'.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Joulle",
                                    "body": "They can be both veiled and too bright, meaning they miss some high frequencies while having some others overemphasized. We mustn't forget that people hear differently. It's not only bad hearing or hearing loss.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "FungiStudent",
                                            "body": "Darkbright",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "cheblhndi",
                                                    "body": "reminded me of Dark/Light by John Frusciante, fire song as well.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fUSTERcLUCK_02",
                            "body": "Being bright isn't a negative trait for plenty of folks.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "I_Main_TwistedFate",
                                    "body": "I don’t know why people hate bright headphones. I prefer it being bright. I extremely hate dark headphones and super veil like hd600-650",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Joulle",
                                            "body": "I think people seem to forget in their comments about audio that we all hear differently, headphones fit differently on our heads and we even listen to different kinds of music, all of which affect what our brains receive. We even like different kinds of melodies. Someone even pays more attention to melody than lyrics.\n\nThat being said, I love deep bass but not overwhelming fatiguing type. For example Hifiman Arya stealth doesn't have enough bass out of the box for me but with some EQ it does. Then again, with some songs I want even more bass, with some I want less.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "dylondark",
                                            "body": "same. treble being (considerably) above neutral is a requirement for anything I buy. I feel like treble enjoyers are underrepresented",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PiotrekPL18",
                            "body": "Ok this is slightly exaggerated but I have to admit I agree with part of it. Sennheiser just needs to have some open back audiophile headphones with proper bass extension. Something like focal achieved with hadenys (I mean the graph, not the sound as I haven't listened to them)",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "dylondark",
                            "body": "bright? what? Sennheiser has like 2 headphones that can be considered bright",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LArule19",
            "body": "Depending on how much more subbass you want, HD660s2. It's not a ton more subbass by any means, but it does bring the hd600 DNA into a much more balance territory.",
            "score": 258,
            "replies": [
                {
                    "author": "asixdrft",
                    "body": "i got the hd660s but i sadly dont have hd600 to compare",
                    "score": 33,
                    "replies": [
                        {
                            "author": "STG44_WWII",
                            "body": "From what I’ve heard only the S2 got sub bass like that.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "asixdrft",
                                    "body": "well it also has an even bigger dip at 3khz",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "STG44_WWII",
                                            "body": "You need to hear them",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "asixdrft",
                                                    "body": "Would love too but im broke got my hd660s for 180€ on ebay ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "STG44_WWII",
                    "body": "The best headphones my goat",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Employee7379",
            "body": "The Audio Technica ATH-R70X. \n\nLoved the sound. Sadly my ears are too big for the pads and they got uncomfortable quickly, so I'd recommend buying from somewhere with a good return policy in case you have the same issue.",
            "score": 81,
            "replies": [
                {
                    "author": "Jshel2000",
                    "body": "I will say the new r70xa is a better option for someone wanting sub bass. I’ve had both the r70x’s and now the r70xa, and one of the big thing I notice on the new pair is a lot more sub bass. Don’t get me wrong the r70x’s had no issues with bass, but they sort of had a quiet sub bass in comparison. It’s not overblown on the new ones, and the mid range and treble seem clearer on the new set. I’m still getting used to them though. So far these have the most sub bass I’ve ever heard on open back headphones",
                    "score": 33,
                    "replies": []
                },
                {
                    "author": "lightcash",
                    "body": "I've thought about getting these but I hate how big my Sundaras are and I feel like the R70X is gonna be equally big and uncomfortable and also not fit my ears 😭",
                    "score": 7,
                    "replies": [
                        {
                            "author": "No-Employee7379",
                            "body": "Well they're definitely not large - they're the smallest high end headphones I've owned. Substantially smaller than the HE-4XX/Sundara. The headband is also the most comfortable I've used - the \"floating\" design is great, and the R70X is extremely light. Not a lot of clamp force, but they're open backs so it's not like you're going to be running with them.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "_OVERHATE_",
            "body": "INB4 people be like \"You can EQ it!\"\n\nNo you cant. Try oratori eqs or anything, those senns cant make subass to save their life",
            "score": 133,
            "replies": [
                {
                    "author": "Destruckhu",
                    "body": "It would be more successful to get a planar and try to eq it to HD600 midrange and treble.",
                    "score": 59,
                    "replies": [
                        {
                            "author": "ThisGuyFrags",
                            "body": "Idk why I haven't attempted this yet, I'll try it later this week if somehow possible",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "LichClaev",
                                    "body": "I’d argue the LCD 2C would be a good contender. Low distortion and it has similar attributes as far as subjective appeal goes. It has similar 3 blob like imaging which lets it be both wider than a 6 series and super personal just like one. It would seem that if it had the same sound profile, you could look at it as a step up with its better instrument separation as well.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "thechopperlol",
                                            "body": "This is the way. Although the massive boost needed at 1300Hz never worked well for me, I had to tune it down slightly to not sound off.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Destruckhu",
                                    "body": "It is, but depending on the headphone you might need to really nail the settings to match your perceived response",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "dr_spam",
                                    "body": "I haven't had good luck EQing planars for whatever reason. They always sound better stock to me. I usually just add a tiny bit of sub bass. Whereas I use my 650 with the oratory and it sounds great.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "trash-_-boat",
                                            "body": "Have you tried AutoEQ?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Project_Ok_1001",
                                    "body": "I was also thinking that the  LCD-X could be a contender here.   You seem to have both this and 600.   It's been a while since I've owned the LCD-X.   Any thoughts on the comparison?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ThisGuyFrags",
                                            "body": "I listen to primarily metal, some EDM, some rock, and mostly just that. LCD-X is nearly perfect for those whereas 600 isnt.\n\nHowever 600 is fantastic for the once in a while I listen to orchestra / acapella / other vocal-oriented music. \n\nAlso, I have my desk + pc in the corner of our living room with a primary UW monitor and another smaller secondary monitor. My JDS stack and LCD-X  are hooked up to that, then I can plug in an hdmi into the back of my TV and then that deactivates the monitors and moves the display to that TV instead. When I sit at the couch for TV watching / gaming / etc I prefer hd600 here for comfort, keeping the lcd-x away from the couch fibers, etc.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AyeYoYoYO",
                            "body": "Focal is flirting with such FR territory, over the last few years.   With mids somewhat comparable to the Sennheiser sweet mids, and accompanying veil, but with bass extension more akin to the AKG K812 or most good planars.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Awkward_Network4249",
                            "body": "It's not so easily done imo, most planars got quite spiky treble",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Destruckhu",
                                    "body": "But you can do, especially dialing it in by ear",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Awkward_Network4249",
                                            "body": "Yeah sure, just saying it's difficult.\nChanging one area changes the perception of the rest as well. You have to have a pretty good ear to get it even close to your target headphone.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Destruckhu",
                                                    "body": "I mean i don't agree because i only use target as reference, as i don't have an HRTF measurement of my own ear/head. The thing is you can simply boost an area of a frequency band and see if it's better, worse or indifferent for a few songs an dial it in while using the same negative pre amp for all profiles switching on the go.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Spaants",
                    "body": "Hard agree. It doesn't matter how much db of bass you add, it doesn't have the impact or extension of any of my other headphones",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "I_Main_TwistedFate",
                    "body": "This sub believes EQ solves everything here",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Livestock110",
                            "body": "Yeah dude you can EQ LCD-2 into a HE-1 you just need to dial it in right /s",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AntOk463",
                    "body": "Oratory's EQ did add bass to the HD6XX, but it was also +14db of bass. I don't remember how deep the bass was.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "No-Desk-1808",
                    "body": "But I can! I recently pulled the stick out of my ass and added a +15dB bass EQ as a speaker EQ on my Qudelix, in addition to the Oratory Harman EQ. Plus, I’ve got iFi xBass on top. With these settings, even my HD 800S turn into ear massage devices without any major loss in sound quality.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "_OVERHATE_",
                            "body": "Only that they dont. I have tried the Oratory EQ and other variations on HD 800S before i sold them and no matter the settings, they can do Bass, sure, but Sub-Bass? Not even a slight minor drop of it. \n\nTH-900, Z1R, Atriums,  now those can rattle your brain inside your skull properly",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "No-Desk-1808",
                                    "body": "https://preview.redd.it/00mwew3gpipe1.jpeg?width=1143&format=pjpg&auto=webp&s=ff8761c521bc0a83661680c87d90a55c2d2aaf5f\n\nThey do but you have to go nuts on eq.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AyeYoYoYO",
            "body": "None of the Sennheiser phones since the HD600, have their “perfect ascendant climb, curve & presence from 200hz - 3.5khz”\n\nAll they needed was a little more subbass, a little less veil in key treble ranges, and a little more air above that, and keep the speckled housing … a little lower impedance …. and we would have a perfect relatively compact open back.\n\nBut no, they just haven’t been able to beat the HD600’s mids, in a more complete headphone, to date.",
            "score": 40,
            "replies": []
        },
        {
            "author": "ThatRedDot",
            "body": "Audeze MM 500 says hi",
            "score": 26,
            "replies": [
                {
                    "author": "SupaDupaKupaTrupa",
                    "body": "Seconded. The only pair I use now",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Ok-Tomorrow-6032",
                    "body": "Jup, although they also need eq they just are able to actually produce bass that can be boosted",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "GnusNat",
            "body": "This, soooo much.... Honestly think it's the perfect headphone just needs some bass.",
            "score": 18,
            "replies": []
        },
        {
            "author": "DJ_Firth",
            "body": "Focal clear? Not perfect but ‘more’ sub bass I’d say. That’s the route I went down anyway",
            "score": 20,
            "replies": [
                {
                    "author": "Odd-Spend-8757",
                    "body": "When I had a clear og pro, I had a lot of distorsion issues on heavy bass tracks.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DJ_Firth",
                            "body": "Thankfully never had that problem with an EQ setup well, it can only go so far before having distortion but certainly goes to a really nice level (for me anyway)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "phil0phil",
            "body": "Didn't they include a complementary set of LCD-X for a while?",
            "score": 9,
            "replies": []
        },
        {
            "author": "ScottBlues",
            "body": "I mean I’ve recently gone from 600 to edition XS and while you do lose a bit of that natural sound (although EQ makes the difference VERY minimal to my ears), it addresses exactly what the 600 was lacking for me.\n\nSoundstage, bass, detail and layering. Especially in busy passages.\n\nAnd all that for 300$ ish + EQ hardware (in my case a 70$ Fiio BR13 with 10 band PEQ)\n\nOf course if you MUST have those vocals always upfront, the XS doesn’t do that. It’s on a per song basis depending on the mix.",
            "score": 13,
            "replies": []
        },
        {
            "author": "LichClaev",
            "body": "Enter: ZMF Atrium with BE2 suede pads.",
            "score": 5,
            "replies": [
                {
                    "author": "Spaants",
                    "body": "I'm looking forward to trying this",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CodaTrashHusky",
            "body": "660s2",
            "score": 42,
            "replies": [
                {
                    "author": "chakobee",
                    "body": "I have these and they have no bass to my ears",
                    "score": 30,
                    "replies": [
                        {
                            "author": "NaZul15",
                            "body": "Fully agree with you. Many audiophiles don't know what bass is. Below neutral is NOT bassy. Neutral even isn't all that bassy. And don't say i must be used to beats, bc beats is the other end of the extreme obviously",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "oballzo",
                                    "body": "If you go above neutral, you are sacrificing natural timbre for more bass. It’s a trade off.\n\nYou’ll never get the physical sensation of subwoofers on headphones with a massive bass shelf that will really sound unnatural. I just accept that’s part of listening to headphones",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "NaZul15",
                                            "body": "i agree and disagree at the same time. i eq'd my he6 with a +5 sub bass shelf starting at 100hz. the bass increased but nothing else changed. It really depends on where the bass shelf starts, bc if it starts at mid bass it does indeed affect the timbre and mids.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "oballzo",
                                                    "body": "Idk, even below 100hz you have fundamentals for bass, kick, left hand piano, etc. I’ve never been able to create a bass shelf that doesn’t impact timbre (I notice it most on piano because I know what the low notes on a piano are supposed to sound like)",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "NaZul15",
                                                            "body": "fair enough. i'm definitely enjoying that extra sub bass for edm tracks etc. try out Zeus by Hi-Lo with your bassiest set. i bet you'll enjoy it",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DivineCurrent",
                                                    "body": "Using a bass shelf with the HE6SE (I have the V1) is such an awesome experience. I haven’t heard many planars, but it’s probably the best bass I’ve heard in a headphone.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "NaZul15",
                                                            "body": "I agree",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "AntOk463",
                                    "body": "I have the Sony MDR XB700, I was expecting some crazy bass from them, but it's only a but extra. But the bass on that is so good, that's what neutral bass should be. It's a good amount of bass, but it's a good overall headphones. Perfect headphone if you think other headphones just need a but more bass. \n\nNow if you do want extreme bass like nothing else, Sony MDR XB950. You will laugh when you use them for the first time.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "NaZul15",
                                            "body": "oh i know, but bro, that's definitely not neutral lol. as much as i enjoy good (not boomy) bass, that's not neutral",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "AntOk463",
                                                    "body": "Have you tried them or did you somehow find a graph? Because anyone who likes more bass says they're perfect in the bass region. \n\nThe Beyerdynamic DT770 measure neutral bass, and I would consider them as low bass headphones. Currently I don't own the DT770, but I have 2 Sony MDR XB700",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "NaZul15",
                                                            "body": "Liking =/= neutral",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AntOk463",
                                                                    "body": "What part of my statement made you say that? About the DT770? Those measure neutral in tye bass region but have very little bass. And I know this because my Arya also measure neutral in the bass region and they have way more bass, even people not into headphones noticed that. Also my AKG with bass roll off have deeper bass than the DT770. \n\nLook at the Drop DCA AEON Closed X, they are also close to neutral in the bass region. And everyone who has them will tell you they have no bass. \n\nAnd if you don't think that's true, just look at previous posts on this sub, there's countless posts saying the DT770 have no bass or they're disappointed by the headphone. That's because the graph makes them look like they have bass, but they don't have much. Same with the AEON Closed X.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Joulle",
                                                                            "body": "DT770 like many closed backs have this issue where bass leaks out when you have a bad seal with them. As in there's a too big air gap between your head and the earpads and due to the design of the headphones, bass sounds noticeably quieter for some listeners due to their head shape, hair or the fact that they wear thick arm glasses.\n\nSee the frequency response consistency section here for example: https://www.rtings.com/headphones/reviews/beyerdynamic/dt-770-pro\n\nSee for comparison the Hifiman Arya stealth's frequency response consistency graph here: https://www.rtings.com/headphones/reviews/hifiman/arya-stealth-magnet-version\n\nAs you can see, the Arya is pretty much immune to inconsistencies when it comes to fit issues on one's head while the DT770 does have that issue. It's possible that 2 people hear a whopping 6dB difference in the lowest frequencies on the DT770.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AntOk463",
                                                                                    "body": "This issue should be discussed more. That's like when Apple made an issue with their antenna and said the users are holding the phone wrong.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Joulle",
                                                                                            "body": "Indeed it should be. Unfortunately far too many here don't seem to read these things. They just look at the first frequency response graph and parrot its readings without considering the numerous variables related to sound",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "NaZul15",
                                                                            "body": "The xb700's don't measure neutral in the bass region.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AntOk463",
                                                                                    "body": "I never claimed they do",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "NaZul15",
                                                                                            "body": "You said xb700 bass should be neutral",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "AntOk463",
                                                                                                    "body": "I said their amount of bass is what people who like bass would consider baseline for headphones.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Odd-Spend-8757",
                            "body": "No bass? Are you used to Beats by Dr. Dre?",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "NaZul15",
                                    "body": "dude come on.... some of you audiophiles are so used to having no bass that a slight increase but still below neutral is a lot of bass. It is factually still below neutral. If you want bass in an openback you gotta go the planar route or get focals. And neutral STILL isn't a lot of bass.\n\n  \nSo no... the 660s2 does not have bass, even if it is slightly better than a hd600/50",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "Odd-Spend-8757",
                                            "body": "Phil eats very salty food. People tells him \"hey Phil, salty food is not healty, you should reduce the amount of salt that you put in your food... you are not even feeling its real taste\"\n\nPhil: \"dude come on... Some of you normal people are so used to eat with less salt that you perceive a slight increase of salt as too much.\"\n\nOK DUDE, basically YOU decide what is neutral and what is not. Cool Mr Professor Nobody.\n\nEdit: Yeah keep downvoting without even trying to figure out what is happening here. A guy that claims that he6sev2 have nEuTrAl bAsS and that hd660s2 has no bass at the same time, while graphs shows that up to 60Hz Sennheisers have more bass than the HE6. He doesn't even know that graphs are compensated and that you can't compare measurements that are taken differently. \nBut hey, the majority of human beings is unable to understand a written text, so what we have to expect?",
                                            "score": -18,
                                            "replies": [
                                                {
                                                    "author": "AntOk463",
                                                    "body": "Alternatively, people treat Sennheiser like the headphone king and get used to that sound and want something similar. Live thinking that's what headphones are supposed to sound like, think the DT770 have a neutral flat bass response. And then when people try to explain that more bass headphones exist and more bass can sound better, they don't listen. \n\nWhy do you think non audiophiles think \"the audiophile sound\" is boring. Why do you think they say they need a break after listening to high end headphones. It's because you guys think the correct sound is only one specific thing, but in reality audiophile headphones can be a huge range of products and sounds.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "NaZul15",
                                                    "body": "No? neutral is based on factual data, not opinions....",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Odd-Spend-8757",
                                                            "body": "Ok, tell me what is scientifically neutral then.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "QuadraKev_",
                                                                    "body": "Harman probably",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Odd-Spend-8757",
                                                                            "body": "Most of the people likes harman. That is all what that target is about. Not all the world likes Harman. Neutral is a preference, and is not the same for everybody.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "NaZul15",
                                                                    "body": "Something that is flat in the frequency response... obviously? You should know if you're so deep into this hobby. For one, the he6sev2 i own is neutral as can be in the bass region",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Odd-Spend-8757",
                                                                            "body": "https://preview.redd.it/n1vhg3um1ape1.jpeg?width=1080&format=pjpg&auto=webp&s=b5b41feef08605d1f0c14e6663b7abf0980dbfb7\n\nYou are putting words that I never said in my mouth. You accuse me of claiming that a few dB of bass shelf is already too much, when I never said that.\n\nI disagreed with the statement \"the HD660S2 have no bass,\" and this is where you contradict yourself: the HE6SE V2 are neutral because their FR is flat, right? So how can you say that the HD660S2 have no bass if, according to graphs, they have more than the he6sev2, which is (you said that) flat? (except below 50-60 Hz)\n\nI'm attaching a picture of the HE6SEV2 vs the HD650, which, by the way, have less bass extension compared to the HD660S2.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "NaZul15",
                                                                                    "body": "you really cherry picked that image. the majority of tests show negative bass: \n\nhttps://preview.redd.it/eticie9zaape1.jpeg?width=1080&format=pjpg&auto=webp&s=ce01d4f3b5e22ce01bf493d7be7e025489259848",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Odd-Spend-8757",
                                                                                            "body": "You don't know how to read a graph. Every measurement is different because it depends on the coupler. You just showed me a different coupler and a different target, not a different headphone.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "NaZul15",
                                                                                                    "body": "i don't know how to read a graph? you can clearly see the bass going under neutral in both cases, even if yours is not as bad as mine, it still goes under neutral. the he6 is just a straight line",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "GiveMeGoldForNoReasn",
                                                                                                            "body": "you can't compare those graphs, they're taken with different systems and compensated to different targets.",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "Odd-Spend-8757",
                                                                                                            "body": "Mid bass, upper bass and lower mids of the he6sev2 would be below the red line if you compare them side by side. You can't compare measurements that are taken differently.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "NaZul15",
                                                                                                                    "body": "doesn't change the fact that the 660s2 is not neutral",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Odd-Spend-8757",
                                                                                                                            "body": "WHO THE F HAS EVER SAID OTHERWISE? idk man... This really sound like a troll",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "NaZul15",
                                                                                                                                    "body": "you did?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "GiveMeGoldForNoReasn",
                                                            "body": "What factual data? Which neutral are you talking about?\n\nIf you're talking about diffuse field neutral, prepare to be disappointed because most people need way more bass than that. Harman neutral? That's a preference curve.\n\nThere's no objective neutral for headphones. Even if there were, we wouldn't perceive it the same way, we all have different pinnae and HRTFs.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "NaZul15",
                                                                    "body": "just straight up flat. not harman bc that isn't actually neutral",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GiveMeGoldForNoReasn",
                                                                            "body": "You do realize that every FR graph you've ever seen is compensated to a target, right? Do you mean free field? Diffuse field? Neither of them apply to headphones.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "NaZul15",
                                                                                    "body": "not all of them. most of them yes, but i've also seen ones that are flat. i can't exactly recall where to find one tho. and fields are not really relevant. you can just read any graph to see what a headphone might sound like. don't need all that jargon",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Eragaurd",
                                                                                            "body": "The other problem is that a totally flat headphone isn't neutral, compared to a flat pair of speakers. Our ears need more bass and treble on a headphone for them to sound the same",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "VerneUnderWater",
                                            "body": "Too much bass can easily destroy headphone balance, but I agree there just isn't quite enough on the HD600, which is one of my favorite headphones.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "chakobee",
                                    "body": "No, I have a fairly upgraded stereo in my truck, so I’m a bit biased because of that. But even when it comes to headphones, many cheap options have more bass than these audiophile headphones that I’ve tried. EQ or not they are still lacking. \n\nNot sure why that is but it always leaves me wanting more bass. I listen to a lot of EDM and listening to EDM without a good amount of bass drastically changes the songs",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "oballzo",
                                            "body": "If you are used to good subwoofers, headphones will never be able to recreate that. \n\nIf you EQ a crazy bass shelf to get that same feeling, the proportion of low fundamentals to their overtones will get thrown off. Bass instruments will have the impact, but they won’t sound right.\n\nIf you EQ for them to sound right, they won’t have the physical impact you’re used to.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Spaants",
                    "body": "I may have to try these one day",
                    "score": 3,
                    "replies": [
                        {
                            "author": "dr_wtf",
                            "body": "Tuning is a bit different to the HD600. I prefer them for music but the HD600 & 650 have more midrange clarity. The S2 is darker & sounds a bit better extended in both bass and treble. But the objective difference in sub-bass extension is quite small (definitely there but it's not huge). Mostly they sound bassier because they're darker, so there's more bass & low mids relative to the upper mids.\n\nI've seen ZMF recommended a lot as an actual HD600 with bass extension. I haven't heard any ZMFs myself and IDK which specific ones(s) have that sound. They get a bit complicated with all the different pad options etc.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "NeverGrace2",
                                    "body": "Z reviews? that guy gets so many things wrong. He said the 58x Jubilee were basically a much more expensive Senn just in a cheaper container which everyone said wasn't true. And no, Im not talking about the 6XX/650",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "dr_wtf",
                                            "body": "That's Zeos, not ZMF.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "0cchan",
            "body": "HD600 + Zen Dac XBASS \\*chef's kiss\\*🧑🏼‍🍳",
            "score": 17,
            "replies": [
                {
                    "author": "deividcito",
                    "body": "Some neutral dac + zen can with seXBass is the job",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "cinic",
                    "body": "You just reminded me to try the HD600 with the Gryphon and xBass enabled.\n\nDefinitely adds what it was missing!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "0cchan",
                            "body": "I didn't know about Gryphon until you just mentioned it and I looked up online.\n\nHoly these amps look absolutely sick!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "da_wizard",
            "body": "I don't think they're as good as the HD600, but the AR5000 has been doing it for me. This agrees with how I hear them:\n\nhttps://preview.redd.it/qer6sfzlfape1.png?width=746&format=png&auto=webp&s=d28112fd63b288e635ac8db11dc19c56e1ea86f1\n\nThere's enough differences that it's not a HD600+, but the overall midrange tuning and lower treble presence reminds me of it quite a bit.\n\nThe bass isn't as impressive as it measures though. It has actual sub bass unlike the Senns, but the flat response means that without EQ it has pretty much zero kick. End result is that I EQ the bass roll off in the Senns, while the AR5000 just needs more bass in general.",
            "score": 5,
            "replies": [
                {
                    "author": "Spaants",
                    "body": "I've never looked into Aune products but this graph looks like perfection",
                    "score": 1,
                    "replies": [
                        {
                            "author": "da_wizard",
                            "body": "I'm cherry picking hard, most graphs don't match up with how I hear them and have them looking warmer and bassier than the HD650.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rusch1991",
            "body": "Custom Cans UK has a modding kit tor the Sennheiser HD 600 series. It can reduce mid bass & flatten the roll-off a bit. The bass is perceived as cleaner & deeper then, but it's not slammy & engaging (a quality over quantity approach kinda).",
            "score": 3,
            "replies": [
                {
                    "author": "Spaants",
                    "body": "Interesting, I'll look into this",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Bleualtair",
                    "body": "I have this, definitely more bass but not insane amounts",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jermo_grellaudio",
            "body": "What if it comes in the 500 chassis?",
            "score": 5,
            "replies": []
        },
        {
            "author": "bdrayne",
            "body": "Aune AR5000?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Haywood04",
            "body": "If you are in the US you could try the HD58X Jubilee... I've never heard the HD600, but when comparing the HD650/HD6XX vs the HD58X Jubilee, I noticed a little more sub-bass in the HD58X.\n\nThe only downside is they are only available on Drop, buuut they are inexpensive and easy to drive.",
            "score": 6,
            "replies": [
                {
                    "author": "NeverGrace2",
                    "body": "OR...or... The 660S2 which is the 58x with much better drivers",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Haywood04",
                            "body": "Oh yeah, I've heard the HD660S2 is Sennheiser's attempt to give their HD600 series lineup more bass. I almost mentioned this in my comment, but decided not to since I've never heard them personally. Seems like a solid option though!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fighterboy89",
                    "body": "I have owned the 58x. 600 has more clarity. Not a great replacement.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Haywood04",
                            "body": "Good information, ty!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ccGLaDOS",
            "body": "I have my headphones connected to a splitter with my speakers system. Sometimes I turn on the system but unplug everything except for the subwoofer :D\n\nThat way I get normal sound from the headphones and also the bass from the sub under my table :)",
            "score": 3,
            "replies": []
        },
        {
            "author": "Project_Ok_1001",
            "body": "I went with the Focal Elex route on this path.",
            "score": 4,
            "replies": [
                {
                    "author": "sregora2",
                    "body": "Thoughts?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Project_Ok_1001",
                            "body": "Elex has better extension on the ends.  Better staging, imaging, airy, and can definitely provide more slam on the low end.   HD600 (and 650) still best in the timbre and midrange.   But Elex is no slouch in this area.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "sregora2",
                                    "body": "Fantastic, thank you.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "squidparcelmegalith",
            "body": "Use a pair of HD600s with a Woojer vest?  That'll at least give ya the bass sensation and the HD600 sound.",
            "score": 7,
            "replies": []
        },
        {
            "author": "NeverGrace2",
            "body": "Another vote to the 660S2 which are my babies. They do take a small amount of eq just fine if you want even more bass. Honestly, Im so happy with these, and I love bass",
            "score": 2,
            "replies": []
        },
        {
            "author": "lmrtinez",
            "body": "I got Sundaras they have some sub bass I enjoy. Unfortunately lacking on the mids compared to my hd6xx. I feel as though it’s so close though, that the right tube amp could fix it",
            "score": 2,
            "replies": []
        },
        {
            "author": "frank_nada",
            "body": "I’ve gotten great results EQing my Neumann NDH30’s to add slamming bass to an already fantastic mid-range. Better performance than my Aria Organics and LCD-X in my opinion.",
            "score": 2,
            "replies": []
        },
        {
            "author": "takanaroprime",
            "body": "I want a HD700 with a better tuning. This design is just gorgeous.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lunairetica",
            "body": "Its 660S2. \n\nI was expecting some real flatter and knowing that open headphones won't give me that a bigger depth compared to closed headphones or IEM's with pretty much harman perfect subbass to mid bass but holy shit I was surprised that even for open headphones there was a presence of rumble, kick and thump along sounding very linear, \"clean\" and tight at the same time.\n\nTechnically its still \"less\" bass compared to closed headphones BUT at the same time More Quality Bass, natural timbre and some people may forgetting: Dynamics.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Deckard01_01",
            "body": "sub-bass and a little bit of open soundstage and us and next generations are done with headphones",
            "score": 2,
            "replies": []
        },
        {
            "author": "Muscletov",
            "body": "Closed headphones",
            "score": 2,
            "replies": []
        },
        {
            "author": "Raiden_Of_The_Sky",
            "body": "DCA Expanse",
            "score": 2,
            "replies": []
        },
        {
            "author": "_____michel_____",
            "body": "I've got the HD 560S, which are cheaper, but also a pretty good option. \n\n[Here's a detailed review comparison with the HD 600](https://www.rtings.com/headphones/tools/compare/sennheiser-hd-560s-vs-sennheiser-hd-600/18492/325).",
            "score": 2,
            "replies": []
        },
        {
            "author": "AffectionateGrowth25",
            "body": "APOeq",
            "score": 1,
            "replies": [
                {
                    "author": "villacardo",
                    "body": "Not enough, they're designed neutral.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "tachyon8",
                            "body": "Not enough what ?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lazyghostradio",
                    "body": "That wasn't OP's question",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SupaSaiyan9000",
            "body": "Sennheiser give me a great IEM in Neckband format .",
            "score": 1,
            "replies": []
        },
        {
            "author": "jjfosh",
            "body": "Zmf. Auteur or something else from them.",
            "score": 1,
            "replies": [
                {
                    "author": "Spaants",
                    "body": "My Atrium gets pretty close, but the 6xx sounds so much more open to me. I haven't tried suede pads yet though",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jjfosh",
                            "body": "I find hd series line to be congested.. interesting. I believe the suede pads would make them even less spacious.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Spaants",
                                    "body": "There must be a difference between open sounding and wide sounding. When I listen to the 6xx I get the feeling that there's open space on the other side of the music, while with the atrium it sounds like the farthest sounds are up against a wall, but there is more space within the stage and between sounds",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jjfosh",
                                            "body": "Well technically i haven't seen headphones that sound like Sennheiser being completely 100 open (maybe the audio technica r70x or whatever it is will be open but not have the same sound) the hd 6 line is unique.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Zernium",
                                            "body": "Yeah, atrium is only semi-open. Totally agree 6x0 series sounds more open, maybe it is confirmation bias but I had the same impression when I owned it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "albertofp",
            "body": "Aeolus with suede pads sounds like a \"better HD600\" to me, solves most of my issues with the HD600.  \n\nStill not a ton of detail or soundstage tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "Equivalent-Hyena-605",
            "body": "How about an HD600 with a Loki+?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MethodUnable4841",
            "body": "I have an amp which has bass boost knob so......",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeyCharmz_",
            "body": "It exists. It’s called the Focal Clear OG. Enjoy! 🥂",
            "score": 1,
            "replies": [
                {
                    "author": "Spaants",
                    "body": "I did not like the clear at all unfortunately. It sounded extremely harsh and fatiguing with basically the same bass performance",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HeyCharmz_",
                            "body": "The same bass performance? It sounds significantly punchier and more impactful than the 6xx and most of its peers.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "theSWBFman",
                            "body": "Have you tried the Clear MG? They're a warmer bassier version than the OGs. They also scale VERY well with EQ. Try oratory's EQ profile for it",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Spaants",
                                    "body": "I tried the MG briefly in a store and really liked it. It had a hard hitting bass with no treble fatigue whatsoever",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "theSWBFman",
                                            "body": "Hey we have similar ears then. I upgraded from the HD6XX directly to the Clear MG. I only wish they had wider soundstage. I also upgraded the earpads from the stock cloth ones to perforated sheepskin which enhanced the bass even more. I have to say though, the stock pads are a ripoff at $100-120 and I will only ever buy cheaper 3rd party ones as a replacement. I also got a cloth band sleeve since the headband can't be replaced",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ConstructionRude3663",
            "body": "Only mildly related ignore me, lol but I got the 6xx a few days ago, and frok a shirt listening impression there seems to be more texture in the mids than most of my other headphones, def not a lot of bass kick or thump though. I am curious if it's because it's a mid and upper mids tuned headphones or if there is a driver trait that shows itself by more texture in vocals and some guitars. Ramble over",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wyllio",
            "body": "I would say the Hifi For All Dahlia gets pretty close at the cost of some mid-range vocals due to a bigger soundstage and loss of intimacy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Folthanos",
            "body": "Look into the [TAGO STUDIO T3-01](https://tagostudio.com/headphones/en/t3-01.php) headphones from Japan, they're often compared to the HD 600 due to their similar tonality. They're closed-back, so soundstage will be less spacious in exchange for not having a rolled off sub bass.\n\nWearing comfort isn't quite up to par with Sennies either, though nothing that can't be fixed with some extra headband padding etc... Also note that their ear cup size is on the smaller side.",
            "score": 1,
            "replies": []
        },
        {
            "author": "finitemike",
            "body": "Fostex TH900 with different pads is [very ](https://sai.squig.link/?share=Harman_OE_2018_Linear_Target,TH900mk2_OG_Red_with_Accessory_House_Denon_pads,HD600)close. You even get great resolution, instrument seperation, and top tier bass impact.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BC_LOFASZ",
            "body": "Maybe try to EQ it? I don't have the hd600 anymore, so I don't know how effective it is, but I think worth a try",
            "score": 1,
            "replies": []
        },
        {
            "author": "shakakhon",
            "body": "This is the vision of the DMS Omega, and I think it largely achieves that vision.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dingsala",
            "body": "I wrote the same message to AKG - so far no response.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ragecndy",
            "body": "I've had all the 600 line at points and the edition XS with velour pads ended up being my replacement",
            "score": 1,
            "replies": []
        },
        {
            "author": "theSWBFman",
            "body": "Focal Clear MGs are a pretty good upgrade, although you lose a lot of the soundstage. The bass is great and I love the sound stock, and then even more after using oratory's EQ profile. These would be incredible with more soundstage.\n\nHifiman Anandas or Aryas are also a good upgrade, although they can be a bit bright depending on source. I'd EQ them down to reduce the sibilance. Edition XS are great too but I'd say it's more of a side grade from HD6XX.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alper4458",
            "body": "Use hd600 with subwoofer",
            "score": 1,
            "replies": []
        },
        {
            "author": "vinsent_ru",
            "body": "the only right answer here is HD25",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alekstheadidasguy",
            "body": "They sell one. The HE-1",
            "score": 1,
            "replies": []
        },
        {
            "author": "EntelPortakal",
            "body": "Just buy 660S2.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deals_in_absolutes05",
            "body": "From least expensive to most expensive: LCD-X with EQ, ZMF Atrium, Meze Empyrean II, or Meze Elite. You might even be able to achieve this with an LCD-2 or 2C with EQ.",
            "score": 1,
            "replies": []
        },
        {
            "author": "njrajio",
            "body": "HD599",
            "score": 1,
            "replies": []
        },
        {
            "author": "bliao8788",
            "body": "ADI-2 DAC",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pity_Pooty",
            "body": "HD600 with subbass is not what you want. It will stop being HD600 because of collective effect of FR",
            "score": 1,
            "replies": []
        },
        {
            "author": "cqbchase",
            "body": "Aurorus Audio Borealis",
            "score": 1,
            "replies": []
        },
        {
            "author": "Energia91",
            "body": "Zmf atrium is your answer\n\nActually there are probably a lot of headphones that fit in this category (HD600 signature, but more ballanced), more affordable, but doesn't get hyped as much as the HD600. It was a damn good headphone for its time. But they're too gendre specific by modern standards. Much like the HD800S.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WingsOfParagon",
            "body": "Couldn't you just EQ the HD600 to HE1 curve?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlexWIWA",
            "body": "HD 650?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dj4m1234",
            "body": "I was in the same predicament as you were, craving sub bass on the hd600. I was finally satiated when I got the Hifiman Edition XS EQ’d with oratory1990. All I can say is they sound PHENOMENAL. To my ears they sound so much better than the hd600 with a wider sound stage and better imaging to boot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cinic",
            "body": "Just get the iFi Gryphon and turn on xBass.\n\nA poster just reminded me to try this and it works!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ahloiscreamo",
            "body": "[JAR HD600](https://www.jupiteraudioresearch.com/d4ac47b3-4cf4-4f15-878e-5abdbb76f239) \n\n1000 USD 💲💲💲💸💸💸 Take it or leave it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silverjerk",
            "body": "Look at ZMF sets; several headphones in their lineup are like spiritual successors to the Axel Grell era of Sennheiser.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sell_Chemical",
            "body": "copper mod with ZMF earpads maybe?",
            "score": 1,
            "replies": []
        },
        {
            "author": "tachyon8",
            "body": "Just EQ it, they can take it just fine and sound great.",
            "score": 1,
            "replies": [
                {
                    "author": "Spaants",
                    "body": "\\+9db bass shelf still doesn't do it for me with these unfortunately",
                    "score": 1,
                    "replies": [
                        {
                            "author": "tachyon8",
                            "body": "What frequency are you setting the shelf at ? Is there a headphone that does satisfy you ?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Spaants",
                                    "body": "Arya Stealth and LCD X both have perfect bass with a 4 to 7 db low shelf around 100 to 160 hz. I've been trying with a lower frequency with the sennheisers to avoid muddying it, but I find it's better with just a peak filter at 40 hz, 7db 1Q",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "tachyon8",
                                            "body": "Oh, then it really isn't a matter of levels at this point, its the nuance between the DD and the larger planar drivers.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mayor_Zedar",
            "body": "Oh yes the hurr durr six hungeos from ol mate Senny",
            "score": 1,
            "replies": []
        },
        {
            "author": "pydr",
            "body": "just EQ 'em. It's not that complicated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LiveZumbi",
            "body": "HD58x",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrBill_-_AlephNull",
            "body": "and out of nowhere the hd550 appears…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dr_Disrespects",
            "body": "HD600 are my dream headphone as is. Mine are a 2023 model, and they’ve produced sub bass that has made me feel uncomfortable, so I guess I’m lucky that they produce enough for me personally.",
            "score": 1,
            "replies": [
                {
                    "author": "VerneUnderWater",
                    "body": "This somewhat. The HD600s need distortion free bass, but only in certain ranges. Too much sub bass or bass in the kick drum area can really mess up the balance with your ears.\n\nSub bass is made for subwoofers people. Not every headphone needs exorbitant amounts of bass.\n\nYes, in a perfect world there would be a bunch of headroom on the HD600, and it wouldn't be causing any issues. But there is not. Yet I still love the things more than some headphones nearing 1000 ffs.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AggressiveDoor1998",
            "body": "I've been enjoying my HD600 for long enough not to care anymore about woofy bass. i realized that it makes music muddy, and 600's bass is enough.\n\nI haven't tried any high end HD600 level headphones that don't destroy the music, so my opinion is a bit biased.",
            "score": 1,
            "replies": [
                {
                    "author": "finitemike",
                    "body": "For acoustic music, yes the HD 600 is hard to beat. But electronic music is not reproduced well on the HD 600.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "villacardo",
            "body": "Man this is so real I was so disappointed with the absolute neutrality of the HD599... Way too plain, not even a good amp could make them properly punchy. Still great headphones for overall music, movies and games.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic-Farmer275",
            "body": "depends on your budget and design choices. \nFor sub300 dollars fiio ft1 or ft1 pro, just pray that fiio sends you a properly built one. \nSub400; hifiman edition xs, easy, if you can eq it they'd be your default option up until sub 2k bucks.\nSub 1k; Auribus Acustics Sierra; it's essentially a bridge between the hd6x0 line and the next big iteration of dynamic driver headphones; it has not only subbas extension it's BOOSTED, this thing has more bass than most planars and all of it is tucked below 200hz. İt's mindblowing. (Auribus Acustics if you have any spare units please let me borrow it for a review) \nAlso aside from the Sierra there's also DMS's Project Omega and one more one man brand, these 3 share the same driver but they have different tunings, I'd choose either Sierra or Omega but preferebly I would like to have the sound quality of Sierra and built quality of Omega.\nThere's also focal clear, Meze Audio 109 pro and AER.\n\nSub 3k; DCA E3",
            "score": 1,
            "replies": []
        },
        {
            "author": "PinkyPowers",
            "body": "HIFIMAN Sundara. Extremely linear and natural, with excellent bass extension.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReptheNaysh",
            "body": "LCD-2 pre fazor :-)",
            "score": -1,
            "replies": [
                {
                    "author": "Raiden_Of_The_Sky",
                    "body": "Sound nothing like HD600",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheMelancholia",
            "body": "Why not just buy an IEM or get a Hifiman?",
            "score": 0,
            "replies": []
        },
        {
            "author": "VerneUnderWater",
            "body": "You can hear pretty good sub bass on these when amped through a few notable tracks. But it has limits for sure. I mean all headphones do. Never been realistic, but it's a 300 dollar headphone. And no headphone is ever going to come close a proper subwoofer.",
            "score": 0,
            "replies": []
        },
        {
            "author": "frankensteinace",
            "body": "Not sure if it will work for you, but this is the exact reason as to why I got my X2HRs. Their profile is very similar to the HD600s but with a nice bass boost essentially. Maybe worth trying some out and see if you like em? \n\nhttps://preview.redd.it/hpektqybr9pe1.png?width=1389&format=png&auto=webp&s=baaeb72a66df9d79983294ea6813812be0224214",
            "score": -5,
            "replies": [
                {
                    "author": "SireEvalish",
                    "body": "Bro these aren't similar at all lmao.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Spaants",
                    "body": "Am I crazy or are these nothing alike",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MadMakIII",
                    "body": "These are similar only in low-mid and mid-mid…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Abject-Confusion3310",
            "body": "Try some closed back headphones like the Audio Technica ATH M50x's",
            "score": -11,
            "replies": [
                {
                    "author": "godfrey1",
                    "body": "can we leave M50 in 2015 please?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "chance_of_grain",
                            "body": "More like 2010 lol I remember when the first gen was all the rage on headfi",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Adrian1616",
                    "body": "No thanks",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}