{
    "title": "Does Anyone have personal experience using this headphone cable? Revelation Audio Labs HD650",
    "author": "jamonz1",
    "subreddit": "headphones",
    "rank": 13,
    "score": 0,
    "upvote_ratio": 0.33,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/gallery/1jejxvk",
    "id": "1jejxvk",
    "selftext": "Yeah, so long story short, back in I think 2012-13ish when I first started down the whole audiophile rabbit hole, I  naively posted to my local facebook page if anyone had some equipment to sell.  I got a message about a pair of H650’s. It was an older fella, and amazingly he had kept everything - it was an Irish produced 2010 release, receipt, box everything. I immediately said yes. When I went to pick it up, he told me he had included every cable he had bought for it, even though he had barely 50ish hours on the headphones. This was one of the pairs. Aside from a couple internet posts there’s not any personal/non-reviewer opinions about them. \n\nSo, for those that have actually listened or used this cable, what do you feel about them? Any opinions, good or bad?",
    "comments": [
        {
            "author": "blargh4",
            "body": "From looking at the manufacturer's site, I would assume it's a custom job\n\nThe guy who makes them seems like a serious crook too, lol, you'd think selling $1500 cables would be scam enough",
            "score": 4,
            "replies": []
        },
        {
            "author": "TryToBeModern",
            "body": "cables are cables bro",
            "score": 8,
            "replies": [
                {
                    "author": "jamonz1",
                    "body": "Thanks for the very informative response!👍👍👍\n\nThey came with a balanced Cardas cable that I’m partial to as well as the standard 10ish ft standard cable that sounds quite well to me. \n\nI was just wondering if this cable was something to be giving a second look at since it’s been sitting in a drawer unused for 10ish years.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Context5479",
            "body": "it is a cable... all to look for is if it is the right termination and it doesn't have channel imbalance. also make sure it is decently built and this looks decently made. that's all there is to cables... nothing magical to be had",
            "score": 2,
            "replies": []
        },
        {
            "author": "lr_science",
            "body": "I have a cable that sounds just like this one. It's good.",
            "score": 1,
            "replies": []
        }
    ]
}