{
    "title": "Highend Planar Advice",
    "author": "AutismusPrime21",
    "subreddit": "headphones",
    "rank": 5,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/headphones/comments/1jelego/highend_planar_advice/",
    "id": "1jelego",
    "selftext": "Wanted to get a pair of higher end planars this year but simply can not decide what to go for.\nMy favourite headphones are:\n1. Fiio FT1 Pro\n2. AKG K240 Sextett\n3. Sennheiser HD660S2 \n\nBeen eyeing the following:\nMeze Empyrean/Empyrean II\nAudeze LCD-2/3\nOr wait a bit longer until Fiio release the FT7? Since I have been blown away by both the FT1 and the FT1 Pro! \n\nThanks in advance for any advice/pointers :)\n",
    "comments": [
        {
            "author": "A_Kite",
            "body": "If you go Audeze, wait until the black friday open box sale.  Got my LCD 2 for $600.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ballin095",
            "body": "If you're okay with the unveiled concept, Arya unveiled bro. Literally is a high end HD 600, and if you love the 660 S2, you'll love those.\n\n\nEdit: If you're looking at Empyrean 2, also check out the HE1000 unveiled, literally the best headphone you can buy under $6k imo (and may even be better than the susvaras tbh depending on your preferences). ",
            "score": 2,
            "replies": [
                {
                    "author": "J05H5M1TH",
                    "body": "Wait a few years for the next hifiman to release and buy it for half price or less. Older hifimans are always a great value, newer ones...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hebolo",
            "body": "You might be able to find an Audeze LCD-5 in your price range somewhere (I am saying because you have Empyrean there), and it's arguably the best planar.",
            "score": 1,
            "replies": [
                {
                    "author": "J05H5M1TH",
                    "body": "Yeah lcd5 is fantastic, needs some eq tho. I really want someone to compare the mm-500 to see how close it gets to the flagship",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ballin095",
                    "body": "Not anymore bro",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Forensic2233",
            "body": "Check out the Abyss JOAL. I would take it over any of the current Audeze offerings for the comfort difference alone.",
            "score": 0,
            "replies": [
                {
                    "author": "J05H5M1TH",
                    "body": "Or buy their snake oil!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nubster44",
            "body": "Can’t speak on some of the other ones there but I got my pair of LCD-3 a few weeks ago and they’ve been amazing. They don’t have the widest soundstage ever but they’re fun to listen with. Fast bass that slams paired with great detail and they do relatively well with EQ.  They’re bulky for sure but I think most ppl are overplaying how uncomfortable they are. They’re by no means HD600 or HD800S levels of comfort but they’re fine.",
            "score": 0,
            "replies": []
        },
        {
            "author": "csch1992",
            "body": "The 660s 2 is good enough. Better get a nice amp and aave the money",
            "score": 0,
            "replies": []
        }
    ]
}