{
    "title": "3D printed stamp for printing Tshirts",
    "author": "AxisFlip",
    "subreddit": "3Dprinting",
    "rank": 4,
    "score": 1035,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 41,
    "url": "https://www.reddit.com/gallery/1je6ii5",
    "id": "1je6ii5",
    "selftext": "Needed some branded shirts for an event of my company, but all online printers would have taken too long to deliver the shirts. So I bought fabric paint, 3D printed this stamp and made the shirts myself over the weekend 😊\n\nWith the help of the ring I was able to apply color multiple times to get a nice result. Under the ring there's a round piece of plastic, so that the fabric is fixed in place. ",
    "comments": [
        {
            "author": "losingmymind101",
            "body": "That’s awesome! Great idea",
            "score": 34,
            "replies": []
        },
        {
            "author": "Friendly_Guarantee88",
            "body": "What filament did you use for this?  I've been wanting to do the same for my business",
            "score": 30,
            "replies": [
                {
                    "author": "AxisFlip",
                    "body": "I just used my standard filament - Polymaker Polyterra PLA. \n\nMaybe a TPE would work nicely too, but I never printed it and didn't have it readily available.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Cyborg_rat",
                            "body": "You can actually print TPE (I think it's that) on Shirts. Theirs a few videos on YT about it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SelloutRealBig",
                                    "body": "3D Printing directly to a shirt is a gimmick that isn't dryer safe and is uncomfortable. It also looks childish in person seeing plastic logos melded to cloth. Might be good for cosplay but that's about it. Stamping a print like OP did is the way to go.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "kcox1980",
                                            "body": "Somebody's not old enough to remember puff paint shirts, lol",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Cyborg_rat",
                                                    "body": "They are still around.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "WorkingInAColdMind",
                                                    "body": "Are people downvoting your comment or puff paints? 🤣",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "kcox1980",
                                                            "body": "🤷‍♂️",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Cyborg_rat",
                                            "body": "Oh I had my reservations about it and never tried it since I've got a vinyl cutter. And sublimation Ink setup on a printer. But I like the simple ink stamp idea almost not work involved.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChasingTheNines",
            "body": "I was going to try and make a bleach print shirt and all the guides I have seen basically had you awkwardly stretch the shirt over a piece of plywood and hopefully get it taught enough for a good result. That framing ring looks like a much better method.\n\nDoes the paint easily wash off the PLA?",
            "score": 23,
            "replies": [
                {
                    "author": "AxisFlip",
                    "body": "yes, it washes off very easily. \n\nOne problem with bleach was that it beads up like crazy, so it was quite hard to make good prints with bleach as it coated the stamp very unevenly. \n\nI cooked up some starch slurry and mixed it with bleach (after it cooled down ofc) to make the bleach a bit more easy to spread, that helped a bit.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "ChasingTheNines",
                            "body": "That is a very good tip for a bleach method. I have been seeing other people get pretty crisp results but they more mentioned drying it right away or neutralizing. I didn't see how they actually applied the bleach to the stamp. I assumed press it against a bleach soaked paper towel and then press to shirt?\n\nNow that I see your method which would guarantee exact placement for multiple stampings I am intrigued by the idea of using multiple stamps each with their own pattern for a multi color image.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Proximal13",
                                    "body": "Mist with a spray bottle.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ChasingTheNines",
                                            "body": "OP did say bleach really beads up so I guess I will try a very fine mist to start and hopefully get enough coverage. I'm thinking a rougher top surface like frosted glass texture for the stamp might prevent any beading and also help with paint retention.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AxisFlip",
                    "body": "and both the color / bleach need to be applied with a roller to get a good result. Just dipping the stamp in either will lead to bad edges",
                    "score": 13,
                    "replies": [
                        {
                            "author": "ChasingTheNines",
                            "body": "That makes so much sense. Those prints look crisp!",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shoddy_Ad_7853",
            "body": "Natural fiber arts represented!",
            "score": 6,
            "replies": []
        },
        {
            "author": "Timeillspent",
            "body": "r/woodblock would be in awe of that ink coverage. How’d you apply the ink to the stamp? The clamp to hold the shirt taught is genius as well",
            "score": 8,
            "replies": [
                {
                    "author": "AxisFlip",
                    "body": "Thanks!\n\nGetting the best coverage is what made me think of the clamp. This way I can print multiple times (3-5 times) to get a clean crisp look. I applied the color with a foam roller, this worked great. Merely dipping the stamp in color doesn't work at all.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Timeillspent",
                            "body": "Traditionally you roll ink onto a stamp or block so you figured out the tried and true method",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Snwspider",
                    "body": "OP mentioned using a roller to apply the paint onto the stamp for crisper designs as opposed to dipping the stamp into paint",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "MT_Cubes",
            "body": "How did the lower ring look.? Super cool method",
            "score": 5,
            "replies": [
                {
                    "author": "AxisFlip",
                    "body": "It's just a round piece of plastic, 4mm high",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Americanuu",
            "body": "How can you use the stamp with t-shirts? what other tools would you need? im interested in making a stamp and using it on the t-shirts too :D",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ecstatic-Internet-14",
            "body": "🔥🔥🔥🔥",
            "score": 2,
            "replies": []
        },
        {
            "author": "Underwater_Karma",
            "body": "I assume you work for \"The Juicy Fly Swatter\" company?",
            "score": 2,
            "replies": [
                {
                    "author": "AxisFlip",
                    "body": "ha, no, the logo shows a stylized version of Aspergillus Oryzae, a mold that's necessary for making miso and soysauce, which we produce.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "xerman-5",
            "body": "That's a great use of 3d printing. Is the ring that supports the fabric available?",
            "score": 2,
            "replies": [
                {
                    "author": "AxisFlip",
                    "body": "not really, the file's a mess as I didn't plan to pass it around. But I can share the diameters I used:\n\nlower circle (not pictured, below the fabric): 120mm\n\nouter ring, inner diameter: 120,3mm\n\nstamp diameter: 119.5 mm",
                    "score": 3,
                    "replies": [
                        {
                            "author": "xerman-5",
                            "body": "cool, thank you",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Holiday-Honeydew-384",
            "body": "What fabric paint did you use? ",
            "score": 2,
            "replies": [
                {
                    "author": "AxisFlip",
                    "body": "Just standard fabric paint from the office/crafts supply store",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "BarryTice",
            "body": "That registration ring pairing would be great for creating a multi-color print, too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "floormat2",
            "body": "This is sweet! Way to hustle!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brief_Fly_6145",
            "body": "Khmmm what happened to all the comments??\n\nedit: a refresh brought them back, lol\n\n\n\nMy question is: did you use plain PLA?\n\nLooking good, i wanna make some too now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jcrckstdy",
            "body": " Got great wave off kanagawa stl?",
            "score": 1,
            "replies": []
        },
        {
            "author": "baconfriedpork",
            "body": "That’s a great idea!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ctjameson",
            "body": "What paint did you use for this? It looks like a really high print! I’m going to have to do some of these now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "matthew7s26",
            "body": "Next time I'd recommend concentric layers for tops and bottoms, that way the lines you get when you lift will look better.  Looks really great though, I'll have to try this sometime!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Real_Boom_235",
            "body": "Stl file pls",
            "score": -4,
            "replies": []
        }
    ]
}