{
    "title": "Overwatch 2 x LE SSERAFIM Livestream Event",
    "author": "SpriteGuy_000",
    "subreddit": "Overwatch",
    "rank": 1,
    "score": 130,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 41,
    "url": "https://www.youtube.com/live/PPOd6Ssx_Wc?si=KID3dLqEjnXdoOb1",
    "id": "1jdv8ht",
    "selftext": "",
    "comments": [
        {
            "author": "Jatmahl",
            "body": "They managed to make the skins better in game compared to the promo material. I know that Mercy skin is going to sell like hotcakes.",
            "score": 35,
            "replies": [
                {
                    "author": "shtoopidd",
                    "body": "Glad it happened. I was so hyped for the Colman agin but when I saw the trailer I was really disappointed. Now I might consider getting some of them",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Akimbo_Zap_Guns",
            "body": "So let me get this right you have a event with a K-pop group and you don’t even let them preform the song live?  I don’t understand lol",
            "score": 68,
            "replies": [
                {
                    "author": "skylanderboy3456",
                    "body": "I mean there is no one there besides like 10 people max it would be kinda awkward",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Skoll_135",
                            "body": "It already was when the host was asking for applause 😆",
                            "score": 24,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "The_Nitsch",
            "body": "Super bummed we're not getting a collab MV or a bonus free earnable skin this go around. By all accounts this collab is worse than the original but will probably cost much more since technically there are 10 new skins for sale this time.",
            "score": 46,
            "replies": [
                {
                    "author": "HysteriaL4D",
                    "body": "10 new skins? What?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "The_Nitsch",
                            "body": "5 new skins and 5 recolors of the original skins.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "HysteriaL4D",
                                    "body": "OH? That’s interesting I didn’t see the recolours since I just skimmed through",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nyoteng",
            "body": "I told you Sakura was a massive Sombra fangirl, no one believed me :(",
            "score": 31,
            "replies": []
        },
        {
            "author": "kelppforrest",
            "body": "Well that was a trainwreck",
            "score": 31,
            "replies": [
                {
                    "author": "Tee__B",
                    "body": "What happened? I watched like 2 minutes of it and they were doing some weird AR model runway thing lol.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Jinxiee",
                            "body": "it was just horribly produced, host kept asking people to make some noise but the room was full of the people LSF were playing with and most likely Blizz employees so there was long moments of awkward silence, they got the girls to go against content creators instead of mixing and matching the teams so it was just like 5 games of the girls getting steamrolled unless they were handed victories on a silver platter. On top of them having a Q&A where only 1-2 of the members got to answer the question before the host moved on and then they didnt even perform so it was a big ?? stream from start to finish",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "SwankyyTigerr",
                                    "body": "Aww I thought it was cute and wholesome, especially the girls playing games. It was clear everyone was having a good time on both teams and just being silly. Sakura can clearly play more than the others and she was like yelling out instructions and telling her team where to go haha. \n\nThe girl who was playing Mercy (can’t remember which) was sooo cute. I don’t know if she’s ever touched WASD or even a video game in her life. Her little scream and standing in place when the enemy Reaper came up to kill her took me out lol. It reminded me of being new at the game again and I thought all of their vibes were adorable. Also super cute seeing Aspen and Yun Jin yapping the whole time lol.\n\nAnd the lack of applause was awkward at first too but then I realized the sound just wasn’t picking up the applause from the tiny audience there. You could hear them better later on. \n\nThe most disappointing part was not all of the girls getting to answer the questions but I’m guessing they were on strict time constraints so that’s just the way it goes. I’d rather they just get all the answers to one question though.\n\nIdk overall I was very happy I watched. I’m not a K-pop person but I thought it was all pretty cute and fun.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "theunicornsquisher",
                                            "body": "Chaewon was playing Mercy!",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Jinxiee",
                                            "body": "I enjoyed it a lot I just think Blizz didnt do much rehearsing or crash testing before the stream to try iron out the kinks, in the end its just an ad for the skins anyway but I think Id have enjoyed it more if there was more effort or care put in to the production quality. Anything to do with the fimmies is a joy to watch though. Kazuhas Mercy might have left me with the biggest smile on my face in a long time. \"E E\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "monkeymugshot",
                                    "body": "I wanna see it even more now 😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kelppforrest",
                            "body": "Nothing happened, it was just horribly formatted and extremely awkward.",
                            "score": 26,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WozzyMH",
            "body": "what time do the skins drop ?",
            "score": 2,
            "replies": [
                {
                    "author": "MeiMeiMuqing",
                    "body": "11AM PST March 18, aka the shop reset today",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "RustX-woosho",
            "body": "SO HYPEE",
            "score": 7,
            "replies": []
        },
        {
            "author": "Krazylol_",
            "body": "They messed up Juno’s hair badly",
            "score": 1,
            "replies": [
                {
                    "author": "hellok1tty5",
                    "body": "The black hair and eyebrows are so harsh and the front strands are too thick",
                    "score": -10,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comfortable-Cold433",
            "body": "I have to be the only person who doesn’t feel hype about these skins and actually disappointed I bought the last one as I’m not a big fan 😭 I’m a girly girl but I’m gonna wait for DokiWatch",
            "score": -8,
            "replies": [
                {
                    "author": "ghosttnappa",
                    "body": "the skins look good but half of the characters feel out of place thematically. but again still looks good",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cougar572",
                            "body": ">  half of the characters feel out of place thematically\n\nBecause the members of Le Sserafim picked which heroes got skins this time around.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thot_bryan",
                    "body": "yeah the skins are nice but…. knowing what’s coming next season I feel like this is an easy skip for me 😫 i was worried i wouldn’t be able to resist but i don’t feel like they’re AS good as the first set of skins",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Damarou",
                            "body": "Omg wait what is coming next season..?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ramsen85",
                                    "body": "Magical girl (i.e. Sailor Moon, Cardcaptor Sakura, etc.) Inspired theme for the next season.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "LightScavenger",
                                            "body": "Worth pointing out, Juno gets a mythic hero skin and Mercy gets a mythic weapon!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "brandnewchemical",
                    "body": "It’s because they all look shit and kpop is cringe af.\n\nThis whole event appeals to a small amount of cringelords and that’s okay, not everything has to be for everyone.",
                    "score": -34,
                    "replies": [
                        {
                            "author": "RocketBrian",
                            "body": "Small amount? I think the OW team have even mentioned in the past that the (first) LSF collab has likely been their highest selling event to date. So yeah, I get the feeling the draw for kpop is far *far* higher than you’re giving it credit for.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "brandnewchemical",
                                    "body": "😂 cringe",
                                    "score": -15,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Damarou",
                            "body": "You remind me of the emo kid in south park that just makes fun of everything fun and calls it cringe",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "brandnewchemical",
                                    "body": "😂",
                                    "score": -10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SwankyyTigerr",
                            "body": "I don’t care about K-pop and I’m buying all of them bc I think they’re adorable.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "try_again123",
            "body": "Was this advertised in any way? I would have not caught it if I wasn't planning to play D4 tonight and checked out the OW page for any news before getting in game.\n\nEdit: No one at the band plays OW at all, they can't even walk forward well enough. All the funnier that they won the first round.",
            "score": -24,
            "replies": [
                {
                    "author": "stando98",
                    "body": "It was on bnet page, overwatch socials and lesserafim socials over the last couple of weeks",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "ilmikhail",
            "body": "8 years and the characters cant walk like a regular human lmao",
            "score": -13,
            "replies": []
        },
        {
            "author": "TrueDamage92",
            "body": "How old are overwatch players ? I can't imagine grown ass men being excited by this event 😭😭",
            "score": -23,
            "replies": []
        }
    ]
}