{
    "title": "This is Kalb-Sayaad, an Overwatch Hero I designed.",
    "author": "SeeYouInValhalla-",
    "subreddit": "Overwatch",
    "rank": 4,
    "score": 1726,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 238,
    "url": "https://www.reddit.com/gallery/1je2nud",
    "id": "1je2nud",
    "selftext": "You can check the HD version here :)\n\n[https://www.artstation.com/artwork/XJz4gR](https://www.artstation.com/artwork/XJz4gR)",
    "comments": [
        {
            "author": "Optimal_Question8683",
            "body": "Ok but the hunter design. I would die for that to be official. Sir william has the drip",
            "score": 278,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Hahahaha Yes! I loved how he came out.",
                    "score": 46,
                    "replies": []
                }
            ]
        },
        {
            "author": "humanobjectnotation",
            "body": "I think the coolest thing about this is the tracking passive. That's _very_ interesting.",
            "score": 96,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Yes! I thought about this passive from the start. I think it's perfect for a doglike hero.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "GreyStainedGlass",
                    "body": "OW already has a bit of visual pollution so im not too sure how effective the tracking would be",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "bruhmomentos_",
            "body": "Easily one of the best concept characters I've ever seen",
            "score": 174,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I really appreciate your kind words. Thank you so much <3",
                    "score": 34,
                    "replies": []
                }
            ]
        },
        {
            "author": "MyCatsNameIsKlaus",
            "body": "Small edit but I noticed \"bloking\" in the move descriptions.",
            "score": 51,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "You are right! Thank you so much for letting me know :)",
                    "score": 27,
                    "replies": [
                        {
                            "author": "OW_RoleQ_Casual",
                            "body": "I really don't mean to be rude, but I think you're also missing a \"c\" in paragraph 4, line 3 of the lore text on page two: \"omnis\". Or is that the plural form of omnic I'm not familiar with? However great concept art!",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "You are fine! You are helping me a lot.\nAgain, thank you so much for letting me know 💜",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "humanobjectnotation",
                    "body": "Don't judge. Some people like blokes.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "probablymojito",
            "body": "Blizzard, hire this man immediately",
            "score": 137,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I wish they would listen to you. I am having a really bad time finding a job as Concept Artist :(\n\nThank you so much for your words <3",
                    "score": 86,
                    "replies": []
                },
                {
                    "author": "PrincessDiamondRing",
                    "body": "i hope they do",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "maybeImportantFella",
            "body": "Amazing. Im an arab and i loved that you named it \"dog hunter\" lol",
            "score": 56,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Yes! I love to give the characters I design some lore or \"hidden\" meanings in their names :)",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "justaguychill",
            "body": "this just looks like official art. so good !",
            "score": 44,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you! I tried to do it as faithful as the official work from Blizzard.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "justaguychill",
                            "body": "if you didnt tell me i would 100% believe thats its official hahaha",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Asb0lus",
            "body": "This goes hard af. Could genuinely be an official concept.",
            "score": 49,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much for your words :)",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "sadra-the-legend",
            "body": "Hunter dog actually goes hard. The design makes him scary and gives him reaper-esque personality, but mythical (that's how i was reading the lines). \n\nEdited: Im dumb in art, but I love how the legs give the feelings of dog and human at the same time. I mean, him being bipedal suits the design.\n\nThis is soo amazing well done bro.",
            "score": 12,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "You are totally right. I'm glad you like it!\n\nThank you so much for your words :)",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "NickVersus",
            "body": "I’d play him.",
            "score": 16,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": ":D",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Weary_Transition_863",
            "body": "This is a really cool and unique idea",
            "score": 8,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Effort-Solid",
            "body": "Overwatch do need a werewolf/claws character, now I wish this design would be a reality",
            "score": 7,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much for your words!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "RareD3liverur",
            "body": "So we have just said f-k it to those old claims of 'no magic' in Overwatch, no offence",
            "score": 4,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I don't know. I am just having fun drawing and creating :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RareD3liverur",
                            "body": "Well you are the first fan artist I've seen lean more into it since Kiriko came out and made people go crazy",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "Then I am happy to be the first one haha\nI don't know. I thought it looked cool, that's it!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Just-a-tush",
            "body": "I really want to applaud you for making a hero design that uses ancient weaponry, but also marries it with high tech future of Overwatch.\n\nThat's something a lot of fan-made designs fail to do and you absolutely nailed it!\n\nAlso I kind of love how they're the gnoll archetype from Warcraft seen through Overwatch lens, which is honestly a really cool way to have that Blizzard feeling edge.\n\nAlso as a furry I'm partial to fun animal characters, so this is really cool.\n\nWhen it comes to invisibility effect, I imagine them being shrouded in see-through sand as a contrast to Sombra's purple hologram haze.",
            "score": 33,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much for you kind words <3\n\nOne thing I love of Overwatch designs is what you said, the mix between \"old\" and \"scifi\" themes.\n\nWith only Winston, I wanted know how another animal character would fit in the heros lineup. And yes, the gnolls from WoW were a big inspiration fro Kalb's design.\n\n  \nYou are absolute right about the effects, I always imagined a cool mini sandstorm while thinking about his abilities.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "joenforcer",
                            "body": "> With only Winston, I wanted know how another animal character would fit in the heros lineup.\n\n\n*cries in Hammond*",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "Oh no! I forgot the hamster D:",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Junabuna",
            "body": "This is really awesome, but I do not think we should introduce more invisibility in the game, especially not paired with critical dmg backstabs and what seems to be pretty hefty combo material for one shots. But he’s still damn cool and you did a great job",
            "score": 10,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Oopsie! I might have made him a bit broken hahahaha",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Junabuna",
                            "body": "Keep making designs though!! I think I speak for everyone when I say they’re super cool as well as really interesting.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "I will try, I need a job asap hahaha\n\nThank you so much, I really appreciate your words :)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SBoyo",
            "body": "Welcome to overwatch Warwick",
            "score": 4,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Finally one said it! Hahahaha",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SunFoxGod",
            "body": "I like his concept just wish his story had anything to do with the Overwatch lore/universe",
            "score": 3,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I mean… It does in some way? Hahahaha\n\nIt IS in the same universe tho.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "L0rd_Hircine",
            "body": "\"Thou, who approacheth Destined Death\"",
            "score": 4,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "“O Death. Become my blade once more”.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ambitious-tails",
            "body": "this is furry bait istg",
            "score": 4,
            "replies": []
        },
        {
            "author": "Dswim",
            "body": "Very cool concept. I think this would hero would have an instant cult following like doom. Also, I think Overwatch needs a dagger/spear melee hero so this fills that niche very nicely.\n\n\nA couple things on the kit concept:\n\n- I’d like to see melee be the primary and throwing the knife as a secondary or vice versa. The kit seems to suggest that getting in there and brawling/assassinating is the playstyle, so the weapon should reflect that\n\n\n- Kalb has no disengage tool besides walking away with block. In theory block could be used to kite/slow, but in practice I imagine the play would be to just walk forward/follow and murder him when the block ends\n\n\n- Kalb’s mobility is tied to hitting a skill shot. I think this would be kind of difficult to play in practice. If you use it to engage, you’re leaving yourself with no escape options but block unless you kill the enemy. I think it’d be a lot more flexible if you could just throw it somewhere and tele to it as a setup or disengage tool that disappears after X time. Could have a cool sand disappearing effect upon activation too\n\n\n- To solve the mobility issue, I think adding a passive to bleed could help. Add a small but long bleed on knife melees/throws and increase move speed for any bleeds applied up to X% (15?). call it something like “scent for blood” or “Sanguine fixation.” That way, if you’re hitting shots you can hunt them down/kite away easier with block\n\n\nLove the design overall and wish you luck! Hopefully blizzard sends you an offer lol",
            "score": 7,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Wow, thank you so much for taking your time thinking all of this.\n\nYou are totally right tho!\n\nI thought about a hard hero engager. Basically killing an enemy or be killed is a coin flip.\nI wanted Kalb to be hard to master and to know well how to positionate yourself and when to engage, kill and ran away with the invisibilty passive.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Old_Preparation9838",
            "body": "cool in concept but would be really annoying to deal with\n\njust don't like invisibility in hero shooters. we already have one menace from Mexico :D",
            "score": 5,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "That's why he's only invisible in his ult hahaha\n\nBut yes, the mexican hacker is a menace :D",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Xechwill",
                            "body": "and his E lol",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "Only if you kill an enemy with it :P",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "unkindledphoenix",
                                    "body": "maybe could be very short lived like 1.5-2.5 secs and be more like a reposition and disengage effect rather than just going straight to the backline. if the fade out also takes a small cast time like sombras and if he cant do other actions meanwhile would mean he could be focused down as he cant combo it something else.\n\notherwise i agree even with number adjustments he sounds a little too obnoxious though i think it comes mostly down to the backstab and shield part. Sombras stealth is really obnoxious i feel because of the hacking part of her kit and a lot of factors in her history. right now its in part due to single tanks having weaker backlines.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TCB_Xander",
            "body": "These designs are absolutely marvellous. You're a fantastic artist!",
            "score": 3,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much! I really appreciate your kind words 💜",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Danominator",
            "body": "You guys all think this looks cool as hell but do you have any idea how obnoxious it would be to play against this guy?",
            "score": 3,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I gotta admit is a bit broken hahaha\n\nBut also made him so difficult to run away from a failed ambush.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "unkindledphoenix",
                    "body": "i still think it could work with adjusted numbers and maybe something to replace the shield. his stealth should definetly be much more shortlived than sombra and maybe the backstab mechanic could be removed + tracking only working for very recent pathways enemies took, similar programing that tracers recall has maybe with footsteps on the floor or a visible stripe for floating and flight, but on less time than 3 secs, maybe 2 secs? can still catch some fleeing and cover enemies or even identify flankers and even sombra if it still works if shrs invisible. and specially if 6v6 was back, you might remember if youre an old time player sombra was for the longest time a very niche pick that found very little success until blizzard went back and fort into reworking and drastically buffing her, as before she was annoying at best, as much as she was unfun to play against. right now her success to me feels mostly down to 5v5 having much weaker backlines and all DPS thats were good for holding backlines with CC just dont have their tools anymore.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Danominator",
                            "body": "I think invisibility is extremely unpleasant to play against. Zero fun from the opponents perspective.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "unkindledphoenix",
                                    "body": "sure, just wish there were more ways to catch the invisible enemy, only the very few instances of see through walls can do it, but the heroes that have it are hard to use in the first place and for valid reason. sombra should never have been a DPS but a support with a lot of diferent stuff, she was the second released hero to the game when more than half the cast was already DPS and supports only really had 4 with sym not really counting at all.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Miars01",
            "body": "Love how his name means \"hunter dog\" in arabic! Nice job",
            "score": 3,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Yep! Thank you so much!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "toph_man",
            "body": "Looks like a horror version of goofy thats all I can see lol",
            "score": 4,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "You are kinda right hahahaha",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "unkindledphoenix",
                    "body": "goofy after experience the pharaohs curse (he became a servant of the old gods)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Valefree",
            "body": "Are you by chance a Darkstalkers/VSav fan? I think you'd like a character in there a lot :3\n\nThis concept work stole my attention, and then some! Absolutely stunning. PLEASE BE HIRED we need designers like you making actually unique heroes on the roster!!",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much for your kind words 💜\n\nYes, I love Darkstalkers designs so much!\nI hope one day (not too far from here) to be able to work in companies like Blizzard.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pwnagekitten",
            "body": "Would be cool to get another animal character.",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Right? :D",
                    "score": 2,
                    "replies": [
                        {
                            "author": "pwnagekitten",
                            "body": "Yes! It would be cool to get more. Were you inspired by Charr from Guild Wars 2?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "Nope, I just thought of an assassin/stealth hero who wasn't human. And then I used all the egyptian symbolism coz Ana is my main.\n\nThen all came together :)\n\nI also used the Gnolls designs of World of Warcraft. They are more like hyenas. Kalb is a jackal but I like their bulky shapes a lot.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "pwnagekitten",
                                            "body": "Ah that makes sense. Reason why I asked is because the shape language and body proportions remind me of them a lot. It was a genuine compliment. Look them up if you're curious haha.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "SeeYouInValhalla-",
                                                    "body": "Yes! I will totally check it :D",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ThelostDM",
            "body": "This looks awesome! I’d love something like this",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dldietlin",
            "body": "I found my new dps main",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "🔥",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Timely-Estimate-3611",
            "body": "Sir Willem is amazing ! I miss a character like that in overwatch",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Right? Tiny oldman with big gun.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Leopard-Secret",
            "body": "My favorite part is the tracker passive and the backstab. So cool!! I love how his kit really fits his personality, I think Blizzard tries hard to achieve that with their heroes so you’ve done well on that",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much! I always try to design a solid character with lore and a kit that fits it's personality and looks.\nI'm glad you like it :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vested1nterest",
            "body": "Would never happen\n\nBlizzard now only makes cute/sexy characters",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Sigh…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TawnyFawn",
            "body": "we need a Kalb-Sayaad User Flair for this community. I'd rock it sooo hard.",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so so so much for your words 💜",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pretend_Fisherman_70",
            "body": "Looks really cool",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "commffy",
            "body": "Imagine getting headshot around a corner cause your fucking nose jets out 10 feet.",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "LMAO",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adg01",
            "body": "Who's a good boy? Who's a gooood booooy??",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I like to think that's what Tracer/Sombra/Kiriko said to him hahahaha",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AcolyteNeko",
            "body": "passives and E in terms of balance look great, E has a restriction and a condition for full realization, because of that it is forgivable that it has 2 effects.\n\nbut the secondary attack and shift look bad, I'll start with the shield as it's easier to explain, and the thing is that it's a shield on dps, like he already gets survivability due to E's invisibility, and there is a shield... but besides that there are no problems, if it was just a speed slowdown + blinding enemies, sandstorm after all, it would be just good.\n\nnow the shift... well let's have a little theory, the condition \"hit the enemy\" is something that will be fulfilled very often, in fact it deals damage and gets free teleport, yes it can be useless for example when you throw a spear into a team of enemies, but against flankers it's just the perfect ability, reaper and symmetra are crying as they have teleport does not deal damage, in general you can just leave the spear with only damage or pure teleport.\n\nbtw ult is weak, basically you lock your abilities, take position and... you get a buff from kiriko's ult, but no movement speed, sounds very weak, you need to either add an effect or two or completely redo the ult.",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thanks for the many advices, I am not a game designer after all haha\n\nAnd thank you so much for your time to comment :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "keaka1999",
            "body": "This is my favorite concept character ever. great work!",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so so so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Popular_Project8987",
            "body": "this looks  amazing",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SlightAnimator2268",
            "body": "this is awesome",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "soy1bonus",
            "body": "A bit noisy? I would say it's because the yellowish arm and leg it's too bright and it's also big. Usually, you can have colored highlights pop if they're small, but if they are big on screen, you should tone the color down a bit.\n\nThe techno-hunter skin looks better, a more toned down palette with red highlights that pop out (I would even make those a bit bigger!).\n\nThe drawing itself looks great!",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Muchas gracias por el feedback, Miguel!\n\nLo tendré en cuenta para la próxima :)\n\nSi necesitáis un Concept Artist para Milkstone, pegadme un toque!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "soy1bonus",
                            "body": "¡Anda! no me esperaba una respuesta en español y menos que nos conocieras 😅",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "He hecho un poco de investigación jajaja",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LegendLynx7081",
            "body": "I do really like the character but I just never understand when Blizzard implements magic into the lore. Like with Genji and Hanzo the dragons are made of hard light but Kiriko can just *do that* and I don’t understand why they put that in a science-based game.\n\nStill cool concept tho",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I think it's fun, but I understand what you say.\n\nThank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HearTyXPunK",
            "body": "i can see this as a hazard skin",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeleteOnceAMonth",
            "body": "I can finally respectfully call me teammate a “Kalb” 🤭",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": ":P",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "True-Office-9784",
            "body": "pretty cool design, tbh",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Comfortable-Summer50",
            "body": "That's a cool ass digimon",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Lmao",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CamdenAndAlex_",
            "body": "Yes! A monstrosity/monster-like hero! That's what I wanted Hazard to be, I'm still happy with Hazard but I reaaaally want a hero that has a more monstrosity kind of look to them, and this is totally it!\n\nAlso saw your reply about the hiring thing... Sucks that you're having trouble getting hired, because this is totally worthy of a job position as a concept artist ♥\n\nAlso the abilities are cool, and the tracker passive is a really cool idea.",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so so so so much. I really appreciate your kind words 💜\n\nI'm happy you like my work :)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AppleSatyr",
            "body": "Furry spotted\n\n\nI love them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Raknarg",
            "body": "This game needs more cool designs instead of sexy designs",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Speaking facts 💜",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Raknarg",
                            "body": "goes for you too buddy, farming the monsterfuckers over here",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bruisedmilk",
            "body": "It's a shame we won't see interesting designs like this in OW. Even if we did, they would soften it and make it more Disney-esque like they did my boy Mauga. Really good work.",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much. I really appreciate your words 💜",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "manman43",
            "body": "I love that design, and kit is super creative, I just don't think he fits in Overwatch. I mean specifically that He is basically just and an ancient *magic*  warrior. Overwatch shouldn't (and wouldn't have had, if not for kiri) its more of a sci fi techy world. \n\nBut on another note you really cooked with that kit, looks fun as hell, just doesn't fit into the world IMHO",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Some people said the same thing as you. And yes, you all probably right.\n\nI just tried to push myself in order to design an animal-magic-techno hero and made it fit visually in the game. I don't really care much about the canon thing with magic.\nI just had a lot of fun designing this guy :)\n\nThank you so much for your words tho!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BazookaOrangutan",
            "body": "Awooooo baby I'm preying on you tonight",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "WOOF WOOF",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lynxerious",
            "body": "It's about time Blizzard invest in the furry community to reivive OW. Nice design.",
            "score": 2,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Hahahaha\nThank you so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpaceCatTitan",
            "body": "Why do you not make it an corruped omnic guard of anubis the god AI? So we have another robot becouse for an game about the struggels between human and omnic there are not al lot of omnics",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "You are right!\nI will think about it hehe",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "xLavaFlame",
            "body": "Looks kinda weird cuz the guy is legit full animal, unlike Winston he looks out of place in the game, but the techno hunter skin looks dope and should be the default since this guy could be Ana’s counterpart that’s from Null Sector",
            "score": 4,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I wanted to make a “Winston-made” but with magic instead of science.\n\nI thought it would be cool :D",
                    "score": 2,
                    "replies": [
                        {
                            "author": "xLavaFlame",
                            "body": "I see the vision, but look at all the animal like characters in overwatch, Winston and ball are more scientific and the magical characters are either full human or full omnic, this one is animal and tech but magical so it doesn’t make a lot of sense you feel me? Maybe replace the tech arm with something full on fleshy and magical and it would look fitting",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "Futuristic/Scifi is the main visual theme in OW. This mixed with “old” staff: Cass for example is basically a scifi cowboy.\n\nThat's why I designed Kalb with tech parts. Also, if you read the lore, it says that Kalb needed to adapt as a hunter he is and embarace the technology. \n\nYes, the animal-magic-tech mix might be a bit weird but I like it :)",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "xLavaFlame",
                                            "body": "He looks like a genetic testing failure instead of a hunter don’t you think? Instead of like an ancient god he looks like a guy was fused with a hyena or dog through a machine hence the eye tattoo and the goatee (I think), I understand your idea and it’s so dope especially now when I read the abilities, but he looks too much like a human",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "SeeYouInValhalla-",
                                                    "body": "I mean he is not an Ancient God, he served them as a dog serves a human.\n\nThe Gods give him this “gifts” and made him more antropomorphic. That’s why he looks like a werewolf.\n\nHis design is based on a jackal and the tattoo eye is a reference to Ana who has the same one for both of them are from Egypt.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Odone",
                    "body": "Is Winston not full animal ?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "xLavaFlame",
                            "body": "Yeah he is, but Winston just looks like a gorilla in clothes, this one feels some kind of Disney villain, I dunno but the eye tattoo and mustache just feels off",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pwnagekitten",
                    "body": ">the guy is legit full animal, unlike Winston\n\nAnd a hampter rolling around in a ball doesn't feel out of place? 😭",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Massive-Eye-5017",
                            "body": "No, because Hammond is still a proportionately correct hamsters who was simply experimented on, much like Winston.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "pwnagekitten",
                                    "body": "Hammond is an anthropomorphized hamster, he isn't proportionally correct",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Geeseareawesome",
            "body": "I can already picture the dark and sinister voice he would have",
            "score": 1,
            "replies": []
        },
        {
            "author": "cleansleight",
            "body": "I’d love to have more monstrous heroes like yours. I like Hazard but this one is even better.  \n\nThis looks amazing.",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much for your kind words :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SystemAdminX",
            "body": "the art is really nice but the hero gameplay design itself reminds me of a 200 years champion lmafo",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SystemAdminX",
                            "body": "U play any mobas? The whole kit feels very moba esque",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "Yes, I have played some.\nI know what you mean haha",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SystemAdminX",
                                            "body": "Yeah his entire kit looks so overloaded even in a moba, let alone a fps lmao",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "SystemAdminX",
                                            "body": "Yeah his entire kit looks so overloaded even in a moba, let alone a fps lmao",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SeeYouInValhalla-",
                                                    "body": "Hahahaha Sorry!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mavenmain92",
            "body": "Did you Google translate “hunter dog” into Arabic? Otherwise great design.",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I am familiar with Arabic (I'm from Spain), so I just made some research and name him before what he is.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MagyTheMage",
            "body": "Awesome design.",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LordDiddlyWinkle",
            "body": "Would honestly be so down for a Warwick style werewolf character for overwatch! Only issue I'd see is though the world certainly has the tech to justify a science made werewolf (we have a science made sapient genius hampster), the backstory implications of science tuenibg someone into a wolf like monster is morally dubious at best and rather fucked up lol. If they did tho, the Faoladh of Irish folklore would be another great source of inspiration and could justify a Moira connection",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fragrant_Temporary_7",
            "body": "close enough. welcome back guild wars 2.",
            "score": 1,
            "replies": []
        },
        {
            "author": "djupsjofisk",
            "body": "Cool concept! Feels like a much more OP version of doomfist with some Sombra mixed in. All enemies would immediately hate playing against him - I like it.",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Yup! That’s the mix :P\nThank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kindly-Dealer-6818",
            "body": "Love the passives",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I'm glad you like it :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "forgedimagination",
            "body": "I love the \"materialize next to hit,\" that's an awesome idea.",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you! I like to imagine it with sand effects.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Neighborhood_Budget",
            "body": "Honestly I personally like this more than some of the recent heroes they've been releasing, not that I don't love the recent heroes but this is so unique and out there I would love to see Blizzard get more daring with designs",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much. Your words mean a lot to me :)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LVbyDcreed72",
            "body": "This is a really cool concept, and he'd certainly be a character I'd play. I'm in love with assassins, and especially the concept of backstabs that reward good positioning with a big payout.\n\nRight now, Sombra is sort of supposed to be the stealth assassin, but her damage comes from stacking hack, virus, and primary fire, not a backstab.\n\nAnd Genji is more aesthetically inclined to look like he'd be a backstabber, and sure, he's got good burst damage that can take out squishies, but it still doesn't quite fulfill that fantasy.\n\nKalb is pretty close to scratching that itch. Love it!",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much!\n\nYes, I love his two passives, makes the positioning very important.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alkaliner_",
            "body": "This reminds me of Warwick from League. Rip and Tear sounds a bit broken though, 5 second invisibility is crazy",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Yes, I took inspiration from Warwick.\nThe invis passive works only if you execute with the ability.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "unkindledphoenix",
            "body": "this looks awesome, always loved egyptian themed stuff, their mythology and history always makes for great mystic themed stuff. The art really looks close to the concepts we get officially, your talent in there is really exceptional.\n\nalthough some abilities sound a little too obnoxious to deal with, but maybe some number adjustments could make it bearable. although we kinda know Sombra history when it comes to assasins/stealth chars, and this one has a shield which... yeah. i could see this working great still if the game was more casual oriented like the hay days, but since blizzard is cattering to esports tryhards and tbeir boring streamlined stuff now....\n\none final little critique; i know i just said i love magic, but OW itself cannonically doesnt have any magic. Everything that looks magic is actually just advanced technology. So i dont think this character being an actual spawn of the egyptian gods or something would actually fit.",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much for taking your time to write :)\n\nYeah, I know it’s a bit broken, I am not a game designer after all haha\nI try to create abilities that look cool and match the character's personality.\n\nYes, I know the thing with the magic. I just like to create and design original characters.\nIn the end, this is not official so, let's get creative!\n\nAgain, thank you so much!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "unkindledphoenix",
                            "body": "thanks for replying.\n\ni personally like when fan made stuff also try to be a little bit closer to the game balance. sure its never gonna be perfect, but maybe just feel like it wasnt over the top. i sill really want a true melee oriented DPS but one thats not a one shot spammer like DF, i know its really hard to design specially now, but i feel like there are ways to make it work. same with stealth, although a little bit of it would require going back to 6v6. which is till am on board with, but alas.\n\nfunnily enough, one way to fit him with the lore without being trully magic would be if he was like an cyborg animal created when the Anubis god-program went rogue, and he was an specific experiment from the program to try and have living beings also under his control by giving them extensive cybernetic enhancements. now that Anubis is sealed he has free will but with his newfound intelligence and knoledge he got attaches to his homeland and its history, and is now frequently protecting it from things like terrorists, tomb looters, and other stuff, but since he is kinda ruthless and brutal, rarely not killing his targets, he is ultimately a vigilante that became an urban legend and a threat to the official corps that think he is real but maybe dont know ehat he trully is, just think he is again, a brutish vigilante.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "Yep, that’s it. I draw, you write hahahaha\n\nThat’s a great backstory, man! Next time I design a hero, you write the lore ok? :P",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "unkindledphoenix",
                                            "body": "i mean, are you being sarcastic or did you really like my take? dont get me wrong i dont want to bash your creativity or anything, just saying one way to fit within what we know the game usually does, but since its fan made sure bring magic.\n\nbut hey if you wanna hear a pitch for another beast character... few days ago as i just returned to the game with S15, i thought about one that would also be a melee oriented DPS, and he would had been a lab grown experiment from the Oasis scientists that eventually escaped and allies himself with Null Sector becoming its only non human official member, and a high ranked commander in that, simply because he sympathized with Ramattra and vice versa as they would be both \"rejects\" from humans, and just like the Omnics, he also wants his own place in the world.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "SeeYouInValhalla-",
                                                    "body": "I really like it! \nI am not into OW's lore as much as you do. I just know the basics: the good guys and the bad guys hahaha\n\nAny backstory you write will be better that mine.\n\nAn assassin cyborg from Null Sector would be badass!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "unkindledphoenix",
                                                            "body": "im not really super buffed in the lore either but i do know most of the basic settings of the characters and most of the maps. i read some of the comics and summaries of some of the novel stories though. Oasis in this case is a city founded and ruled mostly by scientists, although technology advanaced and even peacefull, they also believe in science without any barrier including most ethics, which is where Moira settled after blackwatch until eventually joining Talon. Hence its implied they have a lot of things undercover from the public mostly dark experiments. this idea i gave is based on that, an experiment of what would be an \"ultimate lifeform\" (no, he is not Shadow the Hedgehog) created in a lab, highly adaptable, inteligent and obviously strong, anthropormorphic to an extent with beastly traits but not really belonging to any species. one trait i imagined for hum was that he would have a third eye on top of its skull thats elongated like most predators, but would only open in certain circunstances. he wouldnt really be a cyborg, as the scientists wanted to make something without relying on cyber enhancements, but he would have gotten tech gear with null sector, some exo suit with weapons and stuff, i imagined like energy claws and electrified tail, and a grapple hook that would be reverse of roadhogs, to propel himself into a target.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "c0ffeeandeggs",
            "body": "This guy scares the heck outta me!\n\nHe's so cool!!!\n\nI hear what everyone is saying about the invisibility factor being annoying (and I agree, I have enough problems with Sombra), but still I think that this fella's ult needs a bit more spice. I'd hate to finally work my way up to an ult and only get to sneak attack someone with my sped-up normal moves.\n\nWhat if the ult is the same but he can attack while invisible, and is consequently only revealed to the player(s) taking damage from him? Kind of like a \"Big Bird trying to convince people that he's seeing Snuffleupagus\" situation. Maybe the only attack he can use while ulting in this instance is a Hyper Quicksand sort of freeze-the-enemy-in-place (like Mei)?\n\nMaybe I have had too much coffee this morning.",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "That sounds cool!\n\nThe thing with the ult is, while invis, you can jump on an enemy from far. Like a cat hunting.\nThen you can blast the ambushed enemy with the E. If you killed it, you gain invis again for 5sec and can ambush another enemy or run away.\n\nThank you so much for taking the time to comment :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Confused_Rabbiit",
            "body": "\"Bloking enemies\"",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I know! There is a couple of typos :(",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Confused_Rabbiit",
                            "body": "I just thought it was funny, since people in the UK call their friends \"blokes\".",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sparkK311",
            "body": "Voice lines/character interactions are actually fire 🔥🔥 (esp Ana, Winston, Sombra, and Illari)",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much!\n\nI had a really fun time thinking about those :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "upcomingcorpse",
            "body": "I loovvveeeeeeee Sir William 😋",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I love him too hehe",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Starscream2000",
            "body": "Looks dope! Another invisibility gets a firm “HELL NO” from me tho",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Hahahahaha Thank you so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "woofwoof38",
            "body": "OUPPIE",
            "score": 1,
            "replies": []
        },
        {
            "author": "DJZillah",
            "body": "How much health he got",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "235?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Razzmatazz8557",
            "body": "Nah",
            "score": 1,
            "replies": []
        },
        {
            "author": "Affectionate_Set9699",
            "body": "Let's be honest this looks more like a paladin character because it actually looks cool",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much! I appreciate it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sad-n-rad",
            "body": "Yay I can be a furry in game",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaveySan7",
            "body": "Looks pretty neat, but his color scheme reminds me a lot of Junker Queen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spare-Shallot-3868",
            "body": "I think the legendary skin should be the main design.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Plus_Guide_8431",
            "body": "this is AMAZING the tracking passive is the coolest idea i've ever heard",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much!\nI thought this passive would be perfect :D",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "N-Freak",
            "body": "The kit looks a little broken, I would take out the shield, change the spear to right click and move the tracker passive to a left shift cooldown. That would make it more intentional to start hunting the enemy.",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "You are right! Thank you for your comment 💜",
                    "score": 1,
                    "replies": [
                        {
                            "author": "N-Freak",
                            "body": "Also the design and voice lines are really cool. I forgot to mention that",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "Thank you so much :)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dominus786",
            "body": "I don't see why tracker is necessary when overwatch footsteps are the already so high",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I think it fits the character and it's an original passive.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "unkindledphoenix",
                    "body": "maybe it counters sombra and he can see her invisible footsteps? could also be better at spotting flankers maybe.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zealousideal-Past681",
            "body": "hell no the design is amazing but I love that there are no tf2 spy-like one shot classes in overwatch",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Hahahaha Yep, it’s a bit broken :P\n\nThank you so much!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Zealousideal-Past681",
                            "body": "ofc man, love seeing new character ideas on the sub",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SeeYouInValhalla-",
                                    "body": "💜",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Emerald_ivy222",
            "body": "I might even come back to OW for something like this 😂 hazard design is god awful. Freja looks great but where’s the wonder ? Just another Ashe/Widow reskin",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I am kinda dissapointed about Freja's design. Is very simple? Boring? I don't know…\n\nThank you so much for your words tho :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aem_2512",
            "body": "These looks like from Ben 10 omnitrix heros",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vel_Cosby",
            "body": "This is what happens when your warwick builds duskblade.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FordRockefeller",
            "body": "Ayo what the dog doing",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaxPotionz",
            "body": "Tracking passive would better fit the ult I think. Being able to perma-stalk opponents seems a bit much. Cool design though it’s interesting and not in a “look I made something uber broken” way.",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Yep, that would work too.\nThank you so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SexWithFirefIy",
            "body": "Brother in christ that's literally Hoolay from Honkai Star Rail 😭😭\n\nLike the kit tho",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Never play that game. I will check it out.\nThank you tho!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Exciting-Marketing14",
            "body": "Id love this. Amazing design ow2 really needs some more amazing heros like this",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Thank you so much :)",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "CountTruffula",
            "body": "Siiiiiick, hazard was disappointing with the actual release Vs concept art. I always wanted a more monstery looking hero, the new characters are starting to look pretty homogenous. Would love to see something like this in the game",
            "score": 1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Yup, I love the original ideas and iterations for Hazard. I hope we get some monstery heroes in the future.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AgreeablePie",
            "body": "plz keep the furries away",
            "score": 0,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Should we tell Blizzard to also delete Winston, Hammond and Orisa?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DoomedOverdozzzed",
            "body": "this guy is so peak, can we have him in a good game instead?",
            "score": 0,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "Hahahaha Thank you so much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Massive-Eye-5017",
            "body": "I'm gonna play devil's advocate a bit here and say that while you've got talent as an artist, I think this is a bad design for Overwatch. \n\nThis leans too heavily toward fantasy-supernatural than it does the sci-fi elements associated with OW. It makes me think he'd fit in more in a game like Smite or Paladins, maybe even Zenless Zone Zero or Dislyte, just games where it's common to see anthropomorphic animals.\n\nIf they weren't wearing clothes or interacting with people, you could look at Hammond and Winston and not be aware of how hyper-intelligent they are (let alone Winston's ability to speak English). \n\nDingo and Sir William, however, would fit perfectly.",
            "score": 0,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I kinda understand.\n\nThank you so much for your words!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "blitzer73",
            "body": "cool concept but Kalb-Sayad? \n\nyou mean like a hunter dog or a dog hunter?\n\neither way the name is wrong and doesn't make sense.",
            "score": 0,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "It means “dog that hunts”.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RipGojo-L-Bozo",
            "body": "Kalb-Sayed ultimate is spontaneous combustion after yelling out “allahu akbar”",
            "score": 0,
            "replies": []
        },
        {
            "author": "GIJobra",
            "body": "On the one hand, don't like magic being brought into the lore, but I guess that ship sailed with Kiriko.\n\nOn the other, this is better than the last few official character designs. Better than Venture, Lifeweaver and Freya, at least.",
            "score": -1,
            "replies": [
                {
                    "author": "SeeYouInValhalla-",
                    "body": "I know what you said. I like “magic” in Overwatch when it’s subtle like Kiri or even Zen.\n\nThank you so much for your words tho :)",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "unkindledphoenix",
                    "body": "lifeweaver was cool actually. freya could had been much better and venture is a miss indeed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "yamatego",
            "body": "this is haram i wont buy",
            "score": -1,
            "replies": []
        }
    ]
}