{
    "title": "LE SSERAFIM collab part two art vs. in-game models",
    "author": "Neo_Raider",
    "subreddit": "Overwatch",
    "rank": 6,
    "score": 777,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 143,
    "url": "https://www.reddit.com/gallery/1je344h",
    "id": "1je344h",
    "selftext": "",
    "comments": [
        {
            "author": "LEboueur",
            "body": "I'm sorry but this is Lifeline not Illari. Must be a typo.",
            "score": 307,
            "replies": [
                {
                    "author": "TakaSol",
                    "body": "healing drone and everything 😂 I love it",
                    "score": 50,
                    "replies": [
                        {
                            "author": "LEboueur",
                            "body": "It's like an Apex collab got cancelled and they recycled the skin",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "RendolfGirafMstr",
                                    "body": "Now you’ve got me thinking about what would be in an Apex collab. Junkrat Fuse seems apt, but idk how it would look, and obviously Queen Maggie makes sense.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Realistic-Delay-4780",
            "body": "That's why I wish they didn't show us only the art for like two weeks. Juno and Illari look off, and even something about Mercy doesn't exactly look right....\n\nETA: tldr - The art is gorgeous, but it sets the standards too high for how the outfits translate in game.",
            "score": 291,
            "replies": [
                {
                    "author": "theArtOfProgramming",
                    "body": "I honestly couldn’t even identify who was who without the labels. I tried and had to go back and check.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "dragonbornrito",
                    "body": "Yeah I was considering the Juno skin because it looks fantastic in 2D but *what did they do to her hairrrrrrr*",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "MyNameIsntYhwach",
                    "body": "Mercy looks like she’s 21 when she’s supposed to be what in her 40’s?",
                    "score": 62,
                    "replies": [
                        {
                            "author": "cripplinganxietylmao",
                            "body": "She stopped aging canonically in her 20s due to her tech and being 39 does not magically make you stop liking things you’ve liked for years or unable to get into things that are mostly associated with people in their younger 20s. Kpop isn’t age-restricted.\n\nAlso Ashe is older. She’s 41.",
                            "score": 148,
                            "replies": [
                                {
                                    "author": "KellySweetHeart",
                                    "body": "The wiki says shes 41. Where does it say shes 49?",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "cripplinganxietylmao",
                                            "body": "My bad I’m dyslexic and put the numbers together. I’ll edit my comment",
                                            "score": 17,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Realistic-Delay-4780",
                                    "body": "wait is it actually lore confirmed that Mercy stopped aging? I guess I missed something - I always assumed that since she's a doctor, she just knows how to take care of herself lol.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "cripplinganxietylmao",
                                            "body": "Yea it’s at least hinted at that her using her tech stops her from aging. Ofc this is Overwatch. The lore is never consistent and the ages don’t matter.",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "tenaciousfetus",
                                    "body": "Where in canon does it say she stopped ageing? I thought that was a fan theory about why she looks so young",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "cripplinganxietylmao",
                                            "body": "It’s hinted at with voice lines but we both know blizzard never confirms anything and even when they do they retcon. Kiriko was my last straw for Overwatch lore. Makes zero sense given the ages.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MyNameIsntYhwach",
                                    "body": "I must’ve missed that obscure lore buried somewhere that isn’t in the game, excuse me for that.. also I said nothing that says she shouldn’t like kpop just because she’s older, I’m only pointing out how this skin makes her look way younger than normally.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "cripplinganxietylmao",
                                            "body": "It’s not really “buried” somewhere not in the game tho and it’s def not obscure. It’s in the official material they release. Like the comics which they also advertise in game when a new one comes out. She also doesn’t look younger to me like her skin isn’t less wrinkly or anything. The fashion is just more like “hip” compared to what she usually wears. I’m not sure why you’re being so hostile about this tho.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "MyNameIsntYhwach",
                                                    "body": "It’s a couple pages in a comic, this just comes back to me missing pve, all this lore is stuff that should be in the game. Anyway to me she does look younger that’s all, not sure how I’m being hostile?",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "cripplinganxietylmao",
                                                            "body": "Your comment above came off as hostile in the first sentence, it reads as being passive aggressive. Apologies if I misinterpreted it. But yea I think the skin makes her look younger because of the fashion and accessories. But her base model hasn’t changed. I do agree the lore needs to be easier to access in game.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SeeShark",
                            "body": "Mid-late 30s. Don't question it; the OW timeline never made sense.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sesemebun",
                    "body": "Remember the spike skin lmao? They really need stop showing the art, it always just leads to disappointment ",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "T8-TR",
                    "body": "Ashe and Mercy look the worst to me. It's not completely awful, far from it, but they definitely look like older women trying to be hip w/ the kids compared to the art, where they look slightly more mature than the 20 year olds.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Realistic-Delay-4780",
                            "body": "I actually like Ashe's, aside from the in-game model making her bangs look like wet chunks of clay lol",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "T8-TR",
                                    "body": "I like Ashe's skin, too. It's my favourite of the bunch! My point was just that the art had her looking like Akali from KDA when her in-game model definitely resembles a far older woman (which she is, I get that). It gives off a bit of that \"hello, fellow kids\" vibe.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Realistic-Delay-4780",
                                            "body": "ahhh I see, that makes sense!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dahvikiin",
                    "body": "Mercy looks like an e-girl looking attention... looks like belle delphine",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OwnPace2611",
            "body": "Illari's face card is so pretty what did they do to her???\n\n\nEdit: in the last one she looks like that one girl who says \"that sounds really familiar\" in reference to Ariana 7 rings song and goes on a rant",
            "score": 158,
            "replies": [
                {
                    "author": "KeelanS",
                    "body": "well tbh the artworks of her look like she's a completely different character. Skin is darker and she has a different face shape than her in game model.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "Spreckles450",
                            "body": "People aren't used to seeing Illari smile.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "wsawb1",
                                    "body": "Now that I think about it you are absolutely right. She mostly remains stoic in her expressions. \n\nAlso for me it's the hair that makes her look like Lifeline. That said I still like it and it looks more like Illari in game",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BunnyBoom27",
                    "body": "I love her bc we have the same face-shape. Let's just say I avoid hairstyles like that to not look like... that lol.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Philomelos_",
                    "body": "she looks so bad omg, I was looking forward to her the most",
                    "score": 24,
                    "replies": [
                        {
                            "author": "OwnPace2611",
                            "body": "Same I bought coins and everything witch I never do... well sombra skin it is 💔",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "Murky-Material-1065",
                                    "body": "You bought coins before seeing the skin ingame?",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "mrBreadBird",
                                            "body": "This is why we can't have nice things",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Ok_Digger",
                                                    "body": "These whales bruh",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nt96",
                    "body": "Oh you’re thinking of Princess Nokia lol\nI can slightly see the resemblance",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TrueKokimunch",
            "body": "Juno's hair looks weird",
            "score": 111,
            "replies": [
                {
                    "author": "cripplinganxietylmao",
                    "body": "It’s to keep her silhouette similar so the hitbox isn’t drastically “off”",
                    "score": 28,
                    "replies": []
                }
            ]
        },
        {
            "author": "bbputinwork",
            "body": "The 2D art was always gonna look better. But man these look a little rough.",
            "score": 56,
            "replies": []
        },
        {
            "author": "RandomBozo77",
            "body": "Well, I guess as long as people will spend $$ it'll keep the game f2p for me lol",
            "score": 104,
            "replies": []
        },
        {
            "author": "ihvanhater420",
            "body": "I kinda like the juno one, every other one is kinda boring though. Is midriff like the thing for the group they're collabing with?",
            "score": 49,
            "replies": [
                {
                    "author": "Brocacoochi",
                    "body": "Belly fetish Best fetish ❤️",
                    "score": -57,
                    "replies": [
                        {
                            "author": "SeeShark",
                            "body": "Please don't",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "Murky-Material-1065",
                            "body": "Brother did not deserve all these downvotes 😭🙏",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Brocacoochi",
                                    "body": "Inmature people downvote a simple opinion, that we all know it sells, and that is a fact. A female skin with less clothes will sell more than a male skin with armor 🤷🏻‍♂️",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Murky-Material-1065",
                                            "body": "Only solution is for blizzard to simply make more gooner skins for both sexes 👀",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ihvanhater420",
                            "body": "I respect it",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Brocacoochi",
                                    "body": "It sells, always have been 🤷🏻‍♂️",
                                    "score": -12,
                                    "replies": [
                                        {
                                            "author": "T8-TR",
                                            "body": "Downvotes won't stop my cynical ass from assuming that Blizzard very likely designs skins around stuff like that.\n\nAt the end of the day, it makes them money. There's a reason why all of the most popular skins in Marvel Rivals are the \"gooner\" skins lmao",
                                            "score": 17,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "_jackychain",
            "body": "I’m not really a fan of any of these? Not really my thing but I bought the sombra and kiri skins from the first wave, I thought that those skins were better maybe I also just don’t play any of these characters either really",
            "score": 40,
            "replies": []
        },
        {
            "author": "AgentDigits",
            "body": "With the last collab, everyone looked instantly recognisable and amazing... These just look off. \n\nI need to see them in-game for myself to fully judge but I don't like how they look in that render at all",
            "score": 33,
            "replies": [
                {
                    "author": "AgentDigits",
                    "body": "I checked. I still highly prefer the last collab but...\n\nMercy and Illari look better than they do in the render imo. Illari looks the best, but the green colour scheme bugs me. Mercy kept her signature orange, and the skin looks better ingame than it does in any of the renders or art imo. So I'll give them props for somewhat maintaining  her character identity... Even if it didn't translate well in renders or art.\n\nAshe just doesn't feel like Ashe. Bob looks cool, but they should have given her white hair and chose a red colour scheme instead of purple. I also dislike the hood and cat ears. Her character identity is out the window.\n\nJuno's model looks really off imo. Her weapon is really cute though.\n\nD.Va's Mech uses same model as the other Le Serrafim skin, and her outfit in the other skin appeals to me more as it maintains D.Vas character identity more. So idk why I'd buy this one. It's not bad though, I just prefer the other one.\n\nThe SFX this time are honestly almost non-existent. I had the same issue with the last Le Serrafim skins, but the skin designs kinda carried the last collab anyways so it never bothered me. These ones don't even have good SFX.\n\nThe dance emotes are reused for the victory poses, I'd have preferred they have victory poses similar to the heart poses from the last collab. Would have been cute to see all the girls do a similar little pose at the end of a match, oh well.\n\nAside from Mercy and Illari ones, this collab is meh imo.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "veganquiche",
            "body": "What did they do to my girl illari 😭😭",
            "score": 42,
            "replies": [
                {
                    "author": "dldietlin",
                    "body": "Who? I’m sorry all I see is Lucio.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Rikuddo",
                            "body": "I had no idea that she was *not* Lucio until just now. This collab looks really off, the first one was really exciting and you could see the amount of effort, love and dedication they put into it.\n\nThis one just feel like hastily put together even in desperation :/",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sagnikk",
            "body": "Okay everyone is complaining. Good, almost had me scared that I was on the wrong subreddit.",
            "score": 60,
            "replies": [
                {
                    "author": "Necronaut0",
                    "body": "The artwork gets revealed: \"these skins suck, they look unrecognizable!\"\n\nThe ingame models get revealed: \"these skins suck, they don't look like the artwork!\"",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chedder1998",
            "body": "I was reserving judgement because I knew the art was going for a specific style and wouldn't exactly represent what we get in game. That being said, this is the first time I legitimately thought a Dva skin was Kiriko.",
            "score": 28,
            "replies": [
                {
                    "author": "Kekeripo",
                    "body": "I had hope they'd adjust the models slightly and give em the youthening treatment some heroes got like ana with the captain amari skin opr soldier with his commander skin.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NateDizzle312",
            "body": "Only D.Va turned out the best imo\n\nDon’t know how Juno turned out meh because I was really looking forward to her skin the most 🫤",
            "score": 38,
            "replies": [
                {
                    "author": "hellok1tty5",
                    "body": "The hair (specifically the two front strands)",
                    "score": 16,
                    "replies": [
                        {
                            "author": "MidwinterSun",
                            "body": "The two front strands are so... stiff and unnatural. But the even bigger offender for me are the hair loops. Why does the inside look like plush? Where's the texture? The art shows it as blond hair but the in game model couldn't be further from that idea.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "erktle",
                            "body": "yes, theyre too heavy and solid, they dont have that nice taper shape. i also think her two knots in the back are way too large on the in-game model. they really should've done better for such an important collab </3",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "hellok1tty5",
                                    "body": "Someone notify OW 😟",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Slight_Ad3353",
            "body": "Ngl Mercy's is the only one that's really comparable to the ogs. \n\n\nThe others look cool, but they're just pretty average overall.",
            "score": 12,
            "replies": []
        },
        {
            "author": "HyPn0MaN",
            "body": "Illari looks jaundiced",
            "score": 12,
            "replies": []
        },
        {
            "author": "BonWeech",
            "body": "I quite like the skins. I won’t buy them, I don’t have any interest in but they’re good",
            "score": 4,
            "replies": []
        },
        {
            "author": "Key_Hunter5182",
            "body": "Mercy the only one recognizable , they done colonized illari. She looks like she about to dance bachata.",
            "score": 9,
            "replies": []
        },
        {
            "author": "SunFoxGod",
            "body": "Symmetra watching from the sidelines 😭😭",
            "score": 3,
            "replies": []
        },
        {
            "author": "toldya_fareducation",
            "body": "ngl, in the 2nd image i don't think i could have told you who is who with 100% certainty. i guess that just says more about how similar their faces are in general. Ashe's chin kinda stands out at least.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Proudnoob4393",
            "body": "Its gonna be really hilarious listening to Ilari’s depressing and edgelord voice lines when she is dressed as a K-pop singer",
            "score": 3,
            "replies": []
        },
        {
            "author": "Minaxbe",
            "body": "They don’t look like the characters",
            "score": 17,
            "replies": []
        },
        {
            "author": "GIJobra",
            "body": "When the trailer dropped, people were going \"How did they make Illari look so cute?\" That's the great part - they didn't! She looks like one of those tiktoks where a teen dresses their mom for a day.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Overall-Ad-7318",
            "body": "who allocated Juno's model to some unpaid intern",
            "score": 16,
            "replies": []
        },
        {
            "author": "RedCometZ33",
            "body": "DVAs is the best, Juno is ok.. Mercy looks like a Hongdae Girl",
            "score": 4,
            "replies": []
        },
        {
            "author": "OG_Yaya",
            "body": "Not sure what happened with Juno hair but it made me think of that ankh dance meme",
            "score": 2,
            "replies": []
        },
        {
            "author": "hailfire27",
            "body": "Which one is supposed to be chaewon?",
            "score": 2,
            "replies": [
                {
                    "author": "Key_Hunter5182",
                    "body": "Mercy’s outfit resemble Chae but…dva look like her the most.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "BobaEverythingBagel",
                    "body": "D.va, I think. Centered and looks the most like her. I can’t tell who the others are supposed to represent, hero and Le Sserafim-wise.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fantastic_Snow_9633",
            "body": "Actually liking how Ashe, Mercy, and D.Va turned out. \n\nIllari looks out of place somehow... even Ashe, with her more serious expression and demeanor, fits well with the style of clothes.\n\nOthers have already brought this up repeatedly, but Juno's hair didn't transfer well from 2D to 3D.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SunFoxGod",
            "body": "Why’d they switch Juno and Dvas hair 😑",
            "score": 2,
            "replies": []
        },
        {
            "author": "_Sawssan",
            "body": "The 3d models look so weird idk.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Medusa-Lunula",
            "body": "Was excited for Juno, but the hairstyle looks aweful and the hair looks like it's glued to the face and what are those buns man? They look like ears or something, Idk man ...",
            "score": 2,
            "replies": []
        },
        {
            "author": "TimeRed1821",
            "body": "Wait I thought the Dva skin was Juno o_O",
            "score": 2,
            "replies": []
        },
        {
            "author": "CouchBoyChris",
            "body": "I thought Ashe was Kiriko in the trailers because of the cat ears.\n\nYes, I forgot she already got her skin",
            "score": 2,
            "replies": []
        },
        {
            "author": "BlackGhost_93",
            "body": "D. Va looks so good.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LowerObjective4500",
            "body": "DAMN JUNO",
            "score": 2,
            "replies": []
        },
        {
            "author": "LordPorra1291",
            "body": "This might be the first time I pay for a skin!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Time-Adhesiveness-20",
            "body": "it’s so weird seeing my girl Illari look so joyful. good for her though!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stone67",
            "body": "My husband pointed out the Ashe skin is reminiscent of Saint's Row gangsters and now I'm tempted to buy 🥲",
            "score": 2,
            "replies": []
        },
        {
            "author": "FuriousPenguino",
            "body": "Some of y’all are tripping, these look great",
            "score": 9,
            "replies": []
        },
        {
            "author": "Seven0Seven_",
            "body": "Just love how back when they still made lots of comics etc and specifically the one Halloween event where genji was depicted in a wide hat and a cloak people wanted that skin and they said they weren't gonna release that as a skin because it makes the character unrecognisable in game. And now they come along and do this shit. Who are these even? Like I had to look at them for a hot minute (in a clip I saw about their emotes) to even recognize them and literally had to google who the girl with the space buns was... She looks fucking weird they butchered her. The only one I like is dva and she's also the only one that fits the theme. The others are all completely out of place.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Bombssivo",
            "body": "Pretty good skins",
            "score": 3,
            "replies": []
        },
        {
            "author": "FiresideCatsmile",
            "body": "they nailed it I think.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Omadany",
            "body": "meh",
            "score": 2,
            "replies": []
        },
        {
            "author": "JellyfishAway1552",
            "body": "Boooooo this shits garbage and so are the others. \n\nBoooooo",
            "score": 2,
            "replies": []
        },
        {
            "author": "Somnolent0ne",
            "body": "Thank god i can save my money! Thanks blizzard\\~",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bootsypants",
            "body": "Illari 10/10 should be Lucio. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "IM-2104",
            "body": "I still can’t tell who is who, this was an L",
            "score": 2,
            "replies": [
                {
                    "author": "JellyfishAway1552",
                    "body": "I hate the LSF skin collabs but bruh there’s names underneath them. Use eyes.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DarkWindB",
            "body": "dva is the only one who looks good, wtf",
            "score": 2,
            "replies": []
        },
        {
            "author": "bukbukbuklao",
            "body": "Ashe turned into kiriko",
            "score": 3,
            "replies": []
        },
        {
            "author": "probablymojito",
            "body": "Mercy looks horrendous, what did they do to her? Looks like she's having a midlife crisis with that getup",
            "score": 2,
            "replies": [
                {
                    "author": "Kekeripo",
                    "body": "It's the side profile of her face. Always looked off compared to her artworks, be it now or from the og OW1 hero portraits. :(",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nightstalkerin",
            "body": "Why does ashe has to have always that femme fatale lipstick. Could look better with less of that dark shade",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jakeremix",
            "body": "[Illari said:](https://i.kym-cdn.com/photos/images/newsfeed/002/295/597/d89.png)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fernernia",
            "body": "The ashe skin looked so good in the art and then in game shes just-",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThisTooWasAChoice",
            "body": "The in-game models look like theyre cosplaying the artworks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BigHeadDeadass",
            "body": "Ashe's in-game model makes her look like a gender bent Slim Shady",
            "score": 1,
            "replies": []
        },
        {
            "author": "PhiPhiAokigahara",
            "body": "DVA’s arms looks so bad.. what are those elbows?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "oxMugetsuxo",
            "body": "Maybe its the hair but everytime i look at dva i see juno",
            "score": 1,
            "replies": []
        },
        {
            "author": "oxMugetsuxo",
            "body": "Maybe its the hair but everytime i look at dva i see juno and i look at juno and i see dva",
            "score": 1,
            "replies": []
        },
        {
            "author": "javenthng12",
            "body": "Low-key prefer the in game models",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Dirty-Wizard-",
            "body": "I can’t with illari or Juno. Illari looks like some feminine, zombified Lucio. And Juno looks like she’s a vampire doing that goofy ass SpongeBob smile",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rethtalos",
            "body": "Makes me pray we one day get Mei in cut off shorts and a tube top/crop top",
            "score": 1,
            "replies": []
        },
        {
            "author": "tenaciousfetus",
            "body": "hmm. Disappointing",
            "score": 1,
            "replies": []
        },
        {
            "author": "sexypingu",
            "body": "Are they more expensive this time too or am I misremembering?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kekeripo",
            "body": "Yeah... i knew this would happen. Their heads just... look wrong. Leaving the fact asside that the art had me expecting a much younger looking cast, but also much different looking faces.\n\n\\- Ashe: looks like she might sell me illicit goods at a party\n\n\\- Mercy: She bought a wig oversized enough to fit winstons head (you can see what i mean between pic 2 and 3)\n\n\\- D.Va: Just why do they always give d.va a odd looking hairstyle, wastly different from the promo stuff, plus no baby dva dance emote AGAIN\n\n\\- Illari: I swear i've seen her in other games...\n\n\\- Juno: The best of the bunch, but looks like she had an allergic reaction?\n\nYeah, liked the last sserafim wave better and i was really looking forward to this new wave :( The promo art really hyped me up for something much more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nub_Salad",
            "body": "Fortnite skin Ashe",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScyllaIsBea",
            "body": "Ashe and Mercy being here is like the chaperone moms got dressed up for the concert.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Astro-Pegasus",
            "body": "So the new free challenge rewards is… the junkrat skin we got last time ? Okay",
            "score": 1,
            "replies": []
        },
        {
            "author": "bipolarbear_1",
            "body": "Perhaps they should draw the artwork to be more representative of the in game models in the future. They are beautiful but translate goofily as 3D models in the particular style of overwatch which is something I've noticed with other collabs as well. I think Mercy looks alright though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoomedOverdozzzed",
            "body": "illari's color palette makes me want to spill my innards",
            "score": 2,
            "replies": []
        },
        {
            "author": "caslumarques",
            "body": "Mercy’s hair looks so ass, Illari’s face looks lile she did a little bit too much hyaluronic, Juno’s front hair strands looks weird. Let aside the fact that they’re all almost unrecognizable and too much off of their original design… Tf is this bundle.",
            "score": 1,
            "replies": [
                {
                    "author": "hellok1tty5",
                    "body": "Real, we need to pressure OW to fix it and if they don’t then we aren’t buying them",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "meganwiddy",
            "body": "Ashe looks more like herself but dva and Juno look like the same person here lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "ColorlessTune",
            "body": "I had no idea that was Juno and DVa. These designs are so indistinguishable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "toppestsigma",
            "body": "Dva gets a second skin for the event?",
            "score": 1,
            "replies": [
                {
                    "author": "xKnightlightx",
                    "body": "Well for one she is Korean but also Le SSERAFIM themselves chose who they wanted skins for.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Jakeremix",
                            "body": "Someone should have told them the characters’ ages",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Any_Thanks4414",
            "body": "these look dog😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raxelle",
            "body": "no thank you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Demonfr34k",
            "body": "Maybe I am alone but I am not a big fan of the face paint on Mercy or DVA. Something about it just looks weird.",
            "score": 1,
            "replies": []
        },
        {
            "author": "marriedtomothman",
            "body": "ashe and mercy lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "3000Chameleons",
            "body": "Shi looks ass",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blaky039",
            "body": "Nice Lucio skin",
            "score": 1,
            "replies": []
        },
        {
            "author": "TiraMelsu",
            "body": "I mean, i don't like LE SSERAFIM to begin with so at least  i wont be supporting them",
            "score": 1,
            "replies": []
        },
        {
            "author": "timoshi17",
            "body": "They're cool. Can't wait to see fan animations",
            "score": -5,
            "replies": [
                {
                    "author": "Kekeripo",
                    "body": "Atleast those artists will make good models :)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "timoshi17",
                            "body": "yeah, they will make great models. They always do.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}