{
    "title": "I don't get it 😭",
    "author": "Odd_Instruction_227",
    "subreddit": "ExplainTheJoke",
    "rank": 14,
    "score": 1333,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 73,
    "url": "https://i.redd.it/lmnzom30fdpe1.png",
    "id": "1jdwel2",
    "selftext": "",
    "comments": [
        {
            "author": "Dinok1ng583",
            "body": "The joke is that a woman complained that the man had the toilet seat up. Meanwhile, she has a whole bunch of stuff all over her bathroom.\n\nSo like she's super disorganized, yet she complains about the toilet seat being up\n\n(Im really bad at explaining lol)",
            "score": 353,
            "replies": [
                {
                    "author": "MysteriousTBird",
                    "body": "Of course I left the seat up. It'd be dangerous to pee in the sink in a state like this!",
                    "score": 63,
                    "replies": [
                        {
                            "author": "PorkTuckedly",
                            "body": "I mean, it's common sense to not pee on people's stuff(the makeup stuff, not the sink itself).",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "MysteriousTBird",
                                    "body": "In the worst case there's always the window. Never the shower though. I'm not a barbarian.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Colonel_Cat_Tumnus",
                                            "body": "I go in the shower all the time, though it is getting increasingly difficult to push it down the plughole.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "poppywashhogcock",
                                                    "body": "🦶🧇",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Grazzhopper1979",
                                                            "body": "Was not expecting to be upvoting stomp waffle emojis this morning.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "UnityJusticeFreedom",
                            "body": "Take my upvote",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Doodles_n_Scribbles",
                    "body": "You gave a good, succinct definition",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "PeanutButterBumHole",
                    "body": "That’s a perfect explanation, this joke is literally me and my wife lol",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "thattpsuucks",
                    "body": "Hey you explained it pretty well!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Digi-Device_File",
                    "body": "This is sadly the norm.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "LauraTFem",
                    "body": "To maybe clarify, the joke revolves around the word ‘left’. Normally, when you say someone (almost universally a man) left the toilet seat up you’re pointing out a simple mistake. Her having stuff in the bathroom isn’t a mistake, so OPs question is valid because there is a hidden dialog that the creator of the image is hinting at but not saying:\n\n“Men (occasionally) leave the toilet seat up. Whereas women (constantly) leave all their makeup paraphernalia in the bathroom.”\n\nThat’s it. Doesn’t work perfectly, and it’s a very tired man v. woman observational joke.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "canuck1701",
                            "body": "Leaving the toilet seat up isn't a mistake.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "LauraTFem",
                                    "body": "How so? People don’t do it deliberately.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "canuck1701",
                                            "body": "Mistake means it's wrong. It's not wrong.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "LauraTFem",
                                                    "body": "How so?",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SarcasticIndividual",
                            "body": "I know a few women that, if they have to pee. They can't bend down or they'll pee themselves.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Oni-oji",
                    "body": "That issue was solved by having two bathrooms.  She was free to leave her crap strewn about in hers, and I could leave the seat up in mine.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "yousmellandidont",
                    "body": "*(I'm really bad at explaining lol)*\n\nKinda in the wrong sub then, aren't you??",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dinok1ng583",
                            "body": "Well, it was good enough to explain it but it wasn't perfect is what I meant",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "yousmellandidont",
                                    "body": "I know, I'm just teasing you 😋",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mea_monte",
                    "body": "I thought it was that the person complaining puts stuff on a closed toilet seat",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Infinite_T05",
                    "body": "My interpretation was that this is her retaliating to him leaving the seat up. Sort of like a \"you can't clean up after yourself? Well if that's allowed, here's what it looks like when I don't clean up after myself.\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ka_i_",
            "body": "woman complains about man leaving toilet seat up but makes mess of bathroom sink",
            "score": 64,
            "replies": [
                {
                    "author": "bronzeorb",
                    "body": "Wow, these NYT headlines are getting wild.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "Schlachthausfred",
                    "body": "Florida Man Lost Argument With Girlfriend -\nThat should be the title of the picture",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Infinite-Recording10",
            "body": "I still don't get the whole seat controversy. Leaving up and down are both nonsense, instead the seat and lid should always be shut. That way you don't get toilet spray all over and the next person using the toilet can lift whatever part they feel necessary. That's gender equality right there.",
            "score": 47,
            "replies": [
                {
                    "author": "UnityJusticeFreedom",
                    "body": "Yeah. I always put the lid back down so the toilet is completely closed. I don‘t get why people don‘t do it",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "mjordan73",
                    "body": "'Seat up' at least suggests they didn't just trust their aim with it down.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "trickyvinny",
            "body": "Sigh. Then you're lucky.",
            "score": 13,
            "replies": []
        },
        {
            "author": "ztullaub",
            "body": "Flushing when the seat is up is disgusting, she has a point",
            "score": 7,
            "replies": [
                {
                    "author": "NWinn",
                    "body": "The seat being down will do functionally nothing to prevent this.. the *lid* will however. \n\nThe argument has always been odd to me. Seat up or down is irrelevant if the lid isn't used.. but it's never mentioned.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "PappyClappy",
            "body": "Lol typical 😭😭",
            "score": 5,
            "replies": []
        },
        {
            "author": "Panazara",
            "body": "I'm positive that you already know the joke. But, I'll give you an upvote anyway.",
            "score": 9,
            "replies": [
                {
                    "author": "Reedo246",
                    "body": "I’m positive that you already know that we know that they know the joke. But, I’ll give you the upvote anyway.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Embarrassed-Weird173",
                            "body": "Give me either upvote or downvote. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vertags",
            "body": "How do you not get this bruh...",
            "score": 3,
            "replies": [
                {
                    "author": "HepatitisBBQ",
                    "body": "Karma bait",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Doodles_n_Scribbles",
            "body": "This is literally my brother's bathroom counter with all his stupid beard care products.",
            "score": 4,
            "replies": []
        },
        {
            "author": "gurvyducker",
            "body": "Staged photo, the sink bowl is clean, rings from hair dye, toothpaste smears, undefined goo.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sheeshmaster_",
            "body": "bait used to be believable",
            "score": 5,
            "replies": [
                {
                    "author": "ImLonenyNunlovable",
                    "body": "True, no person has ever told anyone to put down the toilet seat and been disorganized with their cosmetic products.\n\nThis is not just a mere meme, its a gateway to misogyny.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Code_Loco",
            "body": "Ha women",
            "score": 3,
            "replies": []
        },
        {
            "author": "Primo0077",
            "body": "The hell is the issue with the seat being up anyway? You have hands you can put it down.",
            "score": 3,
            "replies": [
                {
                    "author": "doodliellie",
                    "body": "I'm the only girl at my office with a single shared bathroom so the seat is up by default. I always have to put it down 😭.\n\nbut i don't get why people aren't automatically putting the cover (and seat) down when they flush anyways? they say bacteria fly out of the toilet when you flush without the cover.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Helpful_Goblin",
                            "body": "Most people don’t think about it (or don’t know what happens when you flush), they do however think touching a public toilet seat is disgusting. \n\nUnfortunately if you are the only woman, the men (who will mostly only be using it standing up during the work day) will find the seat up and leave it up. Minimising touching. Unfortunately that means you have to put it down for you and then one of them puts it up. This is ideal in their minds as it’s only 2 people touch it once rather than everyone touching it twice per visit. \n\nI’m not saying this is correct, everyone should be putting it down for hygiene in an ideal world, it is however the logic (if it’s not just a case of them not thinking at all which is more likely than not).",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Lord0fPotatoes",
                            "body": "Everybody is leaving the lid up. You’ve gotta out that toilet seat lid down when you’re flushing. If the lid is down everyone has to lift something and then it all fair.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "doodliellie",
                                    "body": "but that only happens if I hypothetically went to the bathroom between every other person... which is don't lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "StockMap8281",
            "body": "What in the exaggerration is going on",
            "score": 2,
            "replies": []
        },
        {
            "author": "Coastkiz",
            "body": "This is LITERALLY two of my roommates. She has makeup/skincare/haircare products EVERYWHERE in the bathroom and he leaves toilet up + can't aim and they both get upset at eachother. Meanwhile I just go pee at school because lordy it's a mess",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chakasicle",
            "body": "Some people just can't accept that they don't have a bathroom counter",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_gay_grenade16",
            "body": "My sister does I hate it so much",
            "score": 1,
            "replies": []
        },
        {
            "author": "NewbyAtMostThings",
            "body": "Yeah, but flushing with the seat up sends urine and fecal matter into the air. So it’s all over the make up, and probably everything else (including the tooth brushes)",
            "score": 1,
            "replies": []
        },
        {
            "author": "W1ckedaddicted",
            "body": "I just always put the lid down but it’s not for anybody’s benefit, I just don’t want my cats drinking toilet water",
            "score": 1,
            "replies": []
        },
        {
            "author": "TreshKJ",
            "body": "Word",
            "score": 1,
            "replies": []
        },
        {
            "author": "rrattheew",
            "body": "okay this is a little funny like i smiled",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoodnyInc",
            "body": "Women likes to complain about men leaving like a toothbrush in wrong spot while they leave all they toys like this",
            "score": 1,
            "replies": []
        },
        {
            "author": "Marid-Audran",
            "body": "If you don't get the joke then...you *might* be the problem...Just a word of caution...",
            "score": 1,
            "replies": []
        },
        {
            "author": "DupeyTA",
            "body": "Every time you flush, particles are sent into the air and land on everything in the bathroom. PUT THE COVER DOWN!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot_Raisin6264",
            "body": "God bless this joke",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far-Metal-9125",
            "body": "Just laziness not lifting the seat up after themselves",
            "score": 0,
            "replies": []
        },
        {
            "author": "Collector1337",
            "body": "Women complain about men leaving the toilet seat up, but then lack the self awareness to see that they cause much bigger inconveniences/messes that are actually a much bigger problem and more annoying for men to deal with, than a woman having to spend 0.6 seconds putting the toilet seat down.",
            "score": -4,
            "replies": []
        },
        {
            "author": "CMDR_kanonfoddar",
            "body": "25 years of marriage... I get it. I more than get it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Wise-Key-3442",
            "body": "I would rather deal with make up mess with a open toilet seat. Close the lid.",
            "score": 0,
            "replies": []
        }
    ]
}