{
    "title": "I don't get it",
    "author": "P1glinFury",
    "subreddit": "ExplainTheJoke",
    "rank": 3,
    "score": 8075,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 770,
    "url": "https://i.redd.it/oqhcpzvj6gpe1.png",
    "id": "1je4kks",
    "selftext": "Saw this in r/comics and i don't get it",
    "comments": [
        {
            "author": "p3w0",
            "body": "https://preview.redd.it/tib01d0q9gpe1.png?width=1030&format=png&auto=webp&s=d0bd141563e4bb366ee1d19f1d3fe334379b465d",
            "score": 1159,
            "replies": [
                {
                    "author": "Boom_doggle",
                    "body": "I'm so annoyed that the best 40k quote comes from real life",
                    "score": 473,
                    "replies": [
                        {
                            "author": "AcrolloPeed",
                            "body": "I play a few warhammer 40k video games and the loading screens are quotes from the lore and it’s stuff like “a small mind is a tidy mind,” “blessed are the merciless,” “forgiveness is a crime worthy of death” and it’s like “how in the hell did we get to a place where 40k is nearly indistinguishable from actual rhetoric?”",
                            "score": 156,
                            "replies": [
                                {
                                    "author": "Dhawkeye",
                                    "body": "Blessed is the mind too small for doubt",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "author": "monkwrenv2",
                                            "body": "An open mind is a fortress with it's gates unbarred and unguarded.",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "author": "General-Ad6927",
                                                    "body": "Yup,that's the one",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Sivalon",
                                                    "body": "Foreign travel narrows the mind wonderfully.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "malthak",
                                                            "body": "Hope is the first step on the road to disappointment.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "The_Nelman",
                                    "body": "\"Only the dead have seen the end of war\" is not 40k but rather Ninja Sex Party.",
                                    "score": 59,
                                    "replies": [
                                        {
                                            "author": "The_Chief_of_Whip",
                                            "body": "That’s Plato hahahahaha",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "ShrimpRampage",
                                                    "body": "Plato has been known to throw down some sick sex parties.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "jtr99",
                                                            "body": "You know it, bro.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "The_Nelman",
                                                    "body": "I think that old coot got it from a certain Galaxy Hamster.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AlternativeAccessory",
                                            "body": "Plato  \n(I only know that because it was on the back of the Lamb of God’s Ashes of the Wake CD when I was a teenager lol.)",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "zegoalie39",
                                            "body": "Daaaad, I need a new galaxy hamster.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Slutty_Tiefling",
                                            "body": "Yeah, because in 40k even the dead are fighting in the war.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "ArcticF0X-71",
                                            "body": "GALAXY HAMSTER",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "wondercaliban",
                                            "body": "Was this not a CoD death screen?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Many_Mongooses",
                                    "body": "Dawn of War Librarian quotes.\n\n\"Blessed is the mind too small for doubt.\"\n\"Hope is the first step along the road to disappointment.\"",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "too-far-for-missiles",
                                            "body": "That second one is so real",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Simbertold",
                                                    "body": "Sounds kinda like something a buddhist monk could say.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "JimWilliams423",
                                    "body": ">  it’s like “how in the hell did we get to a place where 40k is nearly indistinguishable from actual rhetoric?”\n\nIts always been this way, its just so normalized you didn't notice it before now.\n\nFor example, the OG conservative sneer about \"bleeding heart liberals\" literally refers [to the bleeding heart of Jesus.](https://www.merriam-webster.com/words-at-play/bleeding-heart-phrase-origin-meaning)  For nearly a century, millions and millions of so-called Christians have been sneering at liberals for being *too Christ-like.*\n\nAmerica has always been an empathy-killing culture.  The country was literally founded on slavery after all.\n\nIf you are born with empathy you won't be the best possible competitor. If you aren't born with empathy you can learn it, but American culture makes it very difficult and even punishes it.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "digitCruncher",
                                            "body": "I couldn't believe that the bleeding heart liberals comes from the bleeding heart of Jesus, and I checked with a few other sources, and it seems to be mostly true. Tl; Dr: Modern conservatives (after 1950) probably didn't know the origin of the phrase, but the phrase has a recorded history that makes it unambiguously religious in origin.\n\nThe phrase bleeding heart was popular in the 14th-16th centuries, and was associated with the bleeding heart of Jesus, and was used in a positive context. It seems to have dropped off in popularity between 1600 and 1900\n\nHowever, the phrase reappeared in a right wing columnists writings (Westbrook Pegler), as \"bleeding heart liberal\" and \"bleeding heart humanitarian\". It seems it didn't gain much traction outside of his writings for a while, partially because he was so far right for his time.\n\nLater on, it was picked up by prominent politicians such as McCarthy, Nixon, and Reagan. However, it is possible that these politicians did not know the religious origins of this phrase and were just copying a far right columnists catchphrase.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Informal-Tour-8201",
                                                    "body": "Yeah - the picture is usually Blessed Jesus of the Sacred Heart, iirc",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "WeimSean",
                                            "body": "The sneer comes for caring more about the criminal than the victim. \"Oh the robber/rapist/murderer never had a chance. They were failed by society!\"\n\nThat's why we have victim impact statements at sentencing. It's also why we've passed a spate of laws requiting parole boards to notify victims when their attackers are coming up for parole, or are going to be released. \n\nFor a more recent example look at the push for no cash bail. Back in 2022, in New York, Adam Bennefield was released on no cash bail after violating a protection order that was put in place after he assaulted his wife. Once he was released, he promptly kidnapped her in front of their young children, and murdered her.\n\nThere can be such a thing as too much empathy. Sometimes it gets innocent people like Keaira Bennefield murdered.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "littlebrotherof_ptm",
                                            "body": "Slavery and genocide, don't forget the genocide!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "U_L_Uus",
                                    "body": "Even funnier when you consider the Imperium was originally a parody of sorts of the tories of Thatcher's era",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Rodreago22",
                                    "body": "\"A curious mind is like a fortress woth it's gates unbarred and unguarded\" \"Walk softly and carry a big gun\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LeDjaap",
                            "body": "Check the timeline tho...",
                            "score": 38,
                            "replies": []
                        },
                        {
                            "author": "Fairytale-Rays202",
                            "body": "Absolutely so annoying.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "WorryNew3661",
                            "body": "Outjerked once again",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "R3sion",
                            "body": "Theocracy something something",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "error_98",
                            "body": "40k is becoming more and more relevant and I don't like it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Accomplished_You_480",
                                    "body": "Well 40K was created in the 80's in the UK, the effects of WW2 and facisim as a whole was still felt heavily throughout Europe, 40K was created to criticize \"what if facisim won?\". 40K will always be relevant while fascists exist ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MASSochists",
                            "body": "It's because satire and life and becoming indistinguishable. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Outrageous_Zebra_221",
                            "body": "Some people are into 40k for the deep lore and just pure absolute insanity of it all. Some people are into 40k because they think it's the best future...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "profuselystrangeII",
                    "body": "Similarly, Allie Beth Stuckey, professional Christian and conservative talking head wrote a book recently called “Toxic Empathy” about how the left is bad for ostensibly weaponizing empathy.. or something lol",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Slurms_McKensei",
                            "body": "\"Your policies are genuinely negatively affecting the lifes of you and your neighbors, can we try this instead?\"\n\n\"sToP wEaPoNiZiNg EmPaThY!!!!1!!!!\"",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "TheBigness333",
                                    "body": "I’d argue they have a point. Especially in geopolitics. “The left” pick and choose who they’re ok with being bombed and exploited.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PlaneCartoonist2782",
                            "body": "I see this all the time in my local sub regarding the homeless population. It’s “your not helping them by being empathetic” and then their “solutions” are to round up all the homeless and put them in camps. \n\nYeah that’ll work, rounding up a bunch of people indiscriminately is always what the good guys do. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TheBigness333",
                            "body": "this sounds like one of those cases of oversimplification of what the person actually said. The only issue I can think of is he’s being a hypocrite by saying “that side weaponizes empathy” when GOP loyalists and religious nationalists do that exact thing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "qwerqsar",
                    "body": "So sad to see my fav fiction verse turn into reality.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Accomplished_You_480",
                            "body": "Well 40K was created in the 80's in the UK, the effects of WW2 and facisim as a whole was still felt heavily throughout Europe, 40K was created to criticize \"what if facisim won?\". 40K will always be relevant while fascists exist. ",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "qwerqsar",
                                    "body": "Agreed. That is why I fell in love with it. A whole imaginary study on the worst that humanity could be.  Fascinating and horrifying thought experiment. But here we are and it will not go down, as you say, as long as we have these kinds of people.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "andy_is_awesome",
                    "body": "For those that are curious: \nhttps://www.betterup.com/blog/how-to-protect-yourself-from-toxic-empathy",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HazDenAbhainn",
                    "body": "Dan McClellan goes in depth on this sin of empathy quote and the movement around it. His background in biblical scholarship and cognitive science positions his perfectly for this, its easily the best resource I’ve found on this messed up topic:\n\nhttps://youtu.be/2z8DEF6b54I?si=BkgKPr4WHc0Ye0dj",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheScareLab",
            "body": "It's a reference to this image that made the rounds after Mariann Edgar Budde (the Bishop pictured) delivered a speech in front of Trump asking for him to extend compassion and empathy to immigrants and LGBTQ people. \n\nTrump condemned her and said that she owes the public an apology for it. \n\nhttps://preview.redd.it/bxd16sue7gpe1.png?width=1080&format=png&auto=webp&s=7e9eae9e1400c377bc9254473a301c93b86b0cc7",
            "score": 1443,
            "replies": [
                {
                    "author": "dj_rubyrhod",
                    "body": "it's not just a reference to this image. there are prosperity and evangelical preachers giving full sermons on how empathy is \"dangerous\".",
                    "score": 816,
                    "replies": [
                        {
                            "author": "Tsu_Dho_Namh",
                            "body": "Dangerous how? Cause it gets in the way of greed?\n\nI thought Christians were supposed to care about the 10 commandments",
                            "score": 453,
                            "replies": [
                                {
                                    "author": "CaptServo",
                                    "body": "prosperity gospel followers are christian in name only",
                                    "score": 320,
                                    "replies": [
                                        {
                                            "author": "drugsovermoney",
                                            "body": "They aren't the only ones",
                                            "score": 106,
                                            "replies": [
                                                {
                                                    "author": "guarddog33",
                                                    "body": "Speaking as someone questioning faith, many people who partake in organized religion have never read their Bible, no matter the denomination. \n\nThere's a reason people say if you want to hide something from a republican you need only put it in their Bible",
                                                    "score": 123,
                                                    "replies": [
                                                        {
                                                            "author": "SmPolitic",
                                                            "body": "Also the sayings related to: \n\n>\"The fastest way to become an atheist is to read the bible.\"\n\nGoogle showed me this which is pretty good too:\n\n>\"Atheism is what happens when you read the bible. Christianity is what happens when somebody else reads it for you.\" - Bertand Russell",
                                                            "score": 70,
                                                            "replies": [
                                                                {
                                                                    "author": "mikejnsx",
                                                                    "body": "after 12 years of Catholic school I've been an agnostic Buddhist and actually closer to a real Christian than most who claim that title.\nI don't understand how any religion can tell people to kill non believers or shun those who live an alternate lifestyle. it sickens me what extremists do to people .",
                                                                    "score": 25,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Loco-Motivated",
                                                                            "body": "I think I got into a debate with someone at the salvation army about how that seems inherently contradictory.\n\nShe was my future boss.\n\nThe job was seasonal, but I was honestly still surprised I got it.",
                                                                            "score": 11,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "BlackKingHFC",
                                                                            "body": "I don't think I have ever seen my belief structure laid out so well before. Though, my religious education was summer bible camp and bible study day cares representing multiple denominations. Asking preachers and teachers to explain why different churches read the same passages so differently got me kicked out of one program.",
                                                                            "score": 14,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AOCsMommyMilkers",
                                                                                    "body": "Because your questions meant you were thinking and religions frown upon that type of behavior.",
                                                                                    "score": 9,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Ecstatic-Sun-7528",
                                                                            "body": "As a fellow buddhist I hear you. It's baffling how many religious people preach stuff they don't do when for us being good to others and taking care of the world is just the rational thing to do so we do it, full stop.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Unusual_Pitch_608",
                                                                            "body": "It's funny that, as functionally a lifelong agnostic in a Christian culture, the more I understood how the prosperity and salvation focused \"Christians\" fail to live out and up to the actual tenets of their alleged messiah, the more I find myself thinking historical, non-magical Jesus might have really been onto something with his ethical teachings.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Loco-Motivated",
                                                                    "body": "I never even read the actual Bible, to be honest.\n\nThe words are so small, my eyes hurt after one page.\n\nI only ever fully read, like, two or three comic bibles.\n\nOne was a Minecraft recreation, another was basically an action comic series.\n\nBut jeez, people don't even read simplified versions.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Xaero_Hour",
                                                                    "body": "I always hated that saying for how it's really just another endorsement for Eurocentric interpretations of Christianity. \"Oh, if WE got it wrong, then surely no one else got it right, because if any god existed, it would be ours.\" Sure, it's a great dig at how little people actually read what's in there, but in a rush to dunk on them, you fall headlong into the same thinking (or lack thereof).",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Complete_Cook_1956",
                                                                    "body": "I'd argue against that, Biblical living comes from reading the Bible and embodying it in day to day life...or that too.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "CasuallyCritical",
                                                                    "body": "Never forget that the church hated the invention of the printing press because it meant that the Bible could be translated into languages that people could read.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "BiosTheo",
                                                                    "body": "That's usually because when people read the Bible they don't take the time to research the context, nor understand the nature of oral tradition. For example: literalism is a consequence of written tradition, oral tradition was very flexible and the message was what was important (not the details). Now consider all of Genisis was a game of telephone for possibly thousands of years until Moses wrote it down.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "HootToot47",
                                                                    "body": "Redditor response",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Thijsie2100",
                                                                    "body": "Have you ever heard of Calvinism and Presbyterianism?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Mr-Goteboi",
                                                                    "body": "Am reading it myself, and can not confirm that this is true.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Last-Influence-2954",
                                                                    "body": "Atheism is what happens when I dishonest person comes before God and when faced with their own dishonesty (as God does to all) they lash out and pretend God isn't real instead of taking responsibilty for their faults.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Sun_Gong",
                                                                    "body": "That is a contradiction. If god is the ground of all being, without cause, and without fault, then the fault in humans would by definition exclude them from being. That’s like being resenting non-being for not having being, which is redundant and pointless.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Last-Influence-2954",
                                                                    "body": "So your will is pointless? Personally, I don't think so little of myself. I have choice and potential which can be greatness or destruction. And I have the pleasure of chosing. What you say would make sense if God was a robot making machine.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Sun_Gong",
                                                                    "body": "That’s honestly a good question, and one that I’d really love to explore in a different setting if it were possible. First of all I don’t see it as thinking any less of myself, I see it as being grounded. There are things inside my control and outside of my control. Therefore, no, I do not believe in either extreme of perfect free will or predestination. I’m trying to use Christian terminology because it is more intelligible to most English speakers, but full disclosure I’m a pantheistic-Neoplatonist who’s spent a lot of time studying and being shaped by Buddhism. The focus of my life is neither greatness nor destruction but rather contentment. I try to live with as little pretense as possible, like the birds and flowers Christ speaks of in Matthew. I hope this provides some context for my original comment.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "MutantSquirrel23",
                                                            "body": "I spent 2 decades questioning my Christian upbringing. Even as a child I had questions that couldn't be answered and things I was taught that either didn't make sense or were direct contradictions in the Bible. I still believe if Christians followed their own religion faithfully, it would be beautiful, but it is far too corrupted by human greed and lust for money and power.\n\nUltimately, you'll have to come to your own conclusion, but I believe if there is a deity out their somewhere, no fallible human religion has got it perfectly right.\n\nI constantly think of how CS Lewis wrote about the Muslim in The Last Battle and how they were admitted into heaven because they had found god too, but through a different path. I wish everyone could see it that way.",
                                                            "score": 28,
                                                            "replies": [
                                                                {
                                                                    "author": "Apollo_T_Yorp",
                                                                    "body": "The corruption is a feature, not a bug",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Ecstatic-Sun-7528",
                                                            "body": "Honestly it's not only about reading it but actually letting it change you and have a genuine fundamental care for others. Some people just get into religion to justify their previous bigoted biases, that doesn't make religion bad in of itself. \n\nI say that as a Buddhist btw, so we technically don't have a God, but if you are questioning your faith I am very sad to hear that and hope you find something that works for you and gives you comfort.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "guarddog33",
                                                                    "body": "On that I can agree. Anyone who has read any religious texts (the Bible, the Tao Te Ching, the Vedas, the Tenach, etc etc) know that really the foundation of religion is love, whether that be one's self, others, the world, nature, everything, etc. Just have love\n\nIt's actually the exact opposite way around in my circumstance, I've been an atheist my entire life and have found that over the recent years I've grown discomforted by that concept, and thar maybe reality is a little too perfect to have been random chance. Maybe there's something larger than me at play, just haven't discovered what I think that is yet, and have sought exposure to try and find the answer",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ecstatic-Sun-7528",
                                                                            "body": "Could not agree more. If you don't have Love in your belief system you are just looking at a bunch of rules. \n\nOh, in that case very happy to hear that you are open to finding a new perspective when your soul demands it. My hope still stands that you find answers that suit you and give you peace my friend, this has been a nice exchange.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "guarddog33",
                                                                                    "body": "I agree, on reddit a pleasant exchange is a rare commodity, so have a good day and stay safe, stranger",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Ecstatic-Sun-7528",
                                                                                            "body": "👏🏽🌺",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Semperty",
                                                            "body": "my dad routinely says he doesn’t need to read the bible bc he believes god speaks to him directly and puts the issues he cares about on my dad’s heart. \n\nmind you he’s some how turned that into being a liberal that challenging and calls out his family at every turn and has turned his platform as a beer drinking, blue collar christian to champion liberal issues, but he’s certainly one of those « i don’t need to read my bible » christians 😂",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "seriouslees",
                                                                    "body": "To be honest, thanks to Jesus, you really don't need to read the Bible. He replaced the 10 commandments with a singular rule. You only need to know and follow that one rule... the golden rule. \n\nDo onto others, as you would have others do onto you.\n\nIn other words: empathy",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Cyno01",
                                            "body": "Uh-hu, and they arent Scottsmen either...",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "SpezDrinksHorseCum",
                                            "body": "No True Scotsman ^^",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Sir_Penguin21",
                                            "body": "That still just makes them Christian. All Christians cherry pick their verses and ignore the clear reading of inconvenient texts. There is no correct interpretation of Christian. Well, except mine of course. But don’t let those other Christians hide behind a no true Scotsman fallacy.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "liquid_jayy",
                                                    "body": "I'd argue that your view of Christians is skewed by media representation (assuming because you says \"all\" Christians). Many Christians are doing it right, but it's harder to tell because they're quiet",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Sir_Penguin21",
                                                            "body": "My view is skewed from reading the Bible. You don’t understand my point. You are arbitrarily deciding which commands of your god to follow. So are the prosperity gospel Christians. That you think there are “real” Christians and “fake” Christians is the issue. You have no grounds to say your interpretation is true. \n\nYou ignore where your god is saying it is moral to make and own slaves for life. You ignore that your god commanded killing people for all kinds of issue, several of which were not addressed in the NT. \n\nYour cherry picking might make you a better person, but it doesn’t make you a better Christian. You are both ignoring inconvenient sections of the Bible.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "klawz86",
                                                                    "body": "Being a Christian requires belief in Christ, not that everything in the Bible is fact or written by God or there for anything more than to learn from. And you can learn a lot from mistakes and evils committed by people claiming to be doing good or to have a divine mandate for their evil. It sounds like you only know, or care to acknowledge for purposes of your arguement,  \"Christians\" who worship the Bible instead of the Christ.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sir_Penguin21",
                                                                            "body": "So when the book says Jesus commanded this, or god commanded that, you are saying you can’t know what the actual commands and words were? \n\nSo you are just making up your own religion? Great. Just throw out the whole book. It is full of garbage, lies, and failed messianic prophesies.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "klawz86",
                                                                                    "body": "Of course you can't know. It wouldn't require faith if you knew. Just like you can't know lots of things you chose to believe.\n\nThe book didn't exist for the majority of the time the religion existed. It's a cannonization of several different texts and a rejection of even more. Its not perfect, never claims to be, and doesn't have to be perfect to teach us valuable lessons. It doesnt define God, it attempts to describe him. And it does so through the eyes and words of human beings who could and did make mistakes.\n\nYou sound like a kid who opened his 6th grade history book to a page with Mississippis articles of secession and decided the whole text was an endorsement of slavery being the greatest material institution of the world. \n\nYou ask why I dont throw out the whole book because i dont treat it like one long rigorous math proof where a single mistake invalidates the premise: I would ask why you throw out nuance and context in a book of history, art, and literature and pretend you have any sort of meaningful grasp on the text? You're just like one of those scripturally illiterate fundamentalists you think represents all of Christianity.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Sir_Penguin21",
                                                                                    "body": "I am not sure why you keep taking about the book. We already agree you have no idea what parts are true. So why would you worry about if parts of it try to describe god? Maybe those parts are all wrong. You have no idea. \n\nIf you just want it for the nice stories, then cool. I accept many ancient myths are fun and thought provoking. We weren’t talking about them being thought provoking, we were talking about a guidance, a religion. You were the one that said it isn’t true. I just said throw it out and stop appealing to nonsense that we both agree can’t be trusted. \n\nI am not throwing it out as literature. I put it right next to the myths about Zeus, vampires, Ra, fairies, and Mormon. My question for you is why are you throwing out the nuance, context, and literary beauty of Harry Potter in favor of the Bible? Surely Harry Potter has better themes, cultural impact, and moral guidance than the Bible?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "klawz86",
                                                                                            "body": "1. We did not agree to that. \n2. It's useful to learn from the attempt right or wrong.\n3. I don't require all of a thing to be truth to be able to glean real truth from parts of it, like i said before, this isn't a two column proof. Discernment is valuable in all aspects.\n\nYou aren't making a good faith argument if you think the cultural impact of Harry Potter has been greater than that of the Bible. That's the kind of thing that's laughable. It doesn't require a value judgment, its just a fact, the bible has influenced, for better or for worse, the last ~500 years of western thought. Harry Potter has been a fun story for 30 years. I see no reason to continue feeding the troll.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Sir_Penguin21",
                                                                                                    "body": "Discernment in this case means just making up your own morals and religion. You can do that without the Bible. I would suggest you can do even better without the Bible. Look up the 7 Tenets of Satanism. Now there is a moral code.\n\nAs for Harry Potter, I didn’t say it had a greater impact, I said a better impact. You have countless hate crimes, conflicts, and even the crusades on one side. On the other, the worst Harry Potter has done is make adults run around on brooms playing quidditch. I was taking about the capacity for moral guidance and not harming the culture around it in a story. Surely you agree Harry Potter has better themes, moral guidance, and has done less harm to society than the Bible?",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "liquid_jayy",
                                                                    "body": "I think I understand your viewpoint better now. Have a great day!",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "None",
                                                                    "body": "Reading and studying aren't always the same thing though.  But as you said, cherry picking.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "PraxicalExperience",
                                                    "body": "Eh.  I'd kinda disagree.  Christianity is about following the message of Christ, no?  With a critical reading of the bible from that perspective, there are portions of the bible which obviously conflict with the words and message of Christ.  \n\nNow, there're a lot of things which are up for interpretation, but there're also portions which leave no room for interpretation that are regularly abrogated by those who call themselves Christian.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Sir_Penguin21",
                                                            "body": "So you are just saying you cherry pick the verses you like. If Jesus is your god, then Jesus is the one that said all those evil commands like kill babies and kill disobedient children, make slaves for life and make their children slaves for life, and kill innocent women for sex crimes they didn’t commit. \n\nWhy is one command from your god the one you listen to, but another command from your god you ignore? Cherry picking. Just like the prosperity gospel Christians. I will acknowledge Christians that ignore the evil in their book are more agreeable, but that doesn’t make them more right or correct on their cherry picking.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "PraxicalExperience",
                                                                    "body": "\\> Why is one command from your god the one you listen to, but another command from your god you ignore?\n\nBecause there are verses that can be used to support basically ignoring Leviticus and the rest of the OT, or at least substantial portions of it.  'Cherry picking' is 'well this is all true but not the part about shrimp and pork, obviously, but the part about the gays is obviously right.'  They can't speak to internally consistent logic towards which parts are ignored or accepted other than \"well I don't like it,\" or \"because that's what my Pastor told me\" or whatever.\n\nSome Christians recognize that the Bible is a document written and translated by fallible humans, and that a book as important to controlling the populace as it is has not gone without edits designed to fortify that control.  (It's farcical to believe that it would not be.)  To my mind, part of being a 'Good Christian' would be looking at the book with such a critical eye.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "OlympiasTheMolossian",
                                                                            "body": "I think the point is that propserity gospel preachers are also looking at the book with a critical eye and just coming to different conclusions than you do. That was the whole point of the Protestant Reformation. That all personal interpretations of Christianity are equally valid.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "RichBleak",
                                                                                    "body": "I'm not saying you are necessarily wrong, but I'd push back in the reading you are describing in this way:\n\nUse simple logic. God has put out the Old Testament, but has decided there's more to do and say. Keep in mind, this guy is all knowing and knows what we'll need to know for thousands of years until he drops his next album or makes his next appearance. Do you really think he's going to be focused on throwing out fluff that can be ignored or rationalized away? No, he's going to be dropping the new moral imperatives that he needs us to hear most loudly. \n\nThe story implies a primacy in the articulated message of Jesus; it's God speaking directly to us in the most up-to-date and clear language. Prosperity gospel directly contradicts much of that content. Sending your money to rich people and coveting wealth above all else is in clear opposition to that content. Directing hate and judgment against powerless people is in clear opposition to that content. \n\nYes, you can ignore the new testament or the words supposedly spoken by God himself, in the person of Jesus, but it seems like a weird claim to call that Christianity. You'd have to believe that God came back for a few cute stories and a bit of fun.\n\nI don't believe any of it, by the way.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "RichBleak",
                                                                                    "body": "I'm not saying you are necessarily wrong, but I'd push back in the reading you are describing in this way:\n\nUse simple logic. God has put out the Old Testament, but has decided there's more to do and say. Keep in mind, this guy is all knowing and knows what we'll need to know for thousands of years until he drops his next album or makes his next appearance. Do you really think he's going to be focused on throwing out fluff that can be ignored or rationalized away? No, he's going to be dropping the new moral imperatives that he needs us to hear most loudly. \n\nThe story implies a primacy in the articulated message of Jesus; it's God speaking directly to us in the most up-to-date and clear language. Prosperity gospel directly contradicts much of that content. Sending your money to rich people and coveting wealth above all else is in clear opposition to that content. Directing hate and judgment against powerless people is in clear opposition to that content. \n\nYes, you can ignore the new testament or the words supposedly spoken by God himself, in the person of Jesus, but it seems like a weird claim to call that Christianity. You'd have to believe that God came back for a few cute stories and a bit of fun.\n\nI don't believe any of it, by the way.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "PraxicalExperience",
                                                                                    "body": "I think the prosperity gospel people can only get there through a series of logical fallacies, and that it was less likely that they were guided to their conclusions by reading the book than they read the book in a way to meet their conclusions.\n\nThe protestant reformation is a red herring here and irrelevant.  Protestants believed people should be independent in their relationship with God, taking personal responsibility for their faith.  The key word clause there is *personal responsibility.*  Most people don't take any.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Minimum_Dealer_3303",
                                            "body": "Anyone who calls themselves a Christian is a Christian.  That's how religious identification works.  \n\nProsperity gospel certainly seems anti-Christ-like to my outsider's eye, but religious people do zany stuff all the time.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "rusztypipes",
                                            "body": "Hehe CINners",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Fairytale-Rays202",
                                            "body": "Exactly. The whole message of prosperity gospel goes completely against what Christianity actually teaches. It’s all about greed and personal gain rather than faith and genuine compassion.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Turbo-Corgi",
                                            "body": "Chinos.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "AI_Lives",
                                            "body": "Its like whaling out for heaven. They think they can get into heaven by buying the battlepass.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Swiftax3",
                                            "body": "Genuinely heretics and blasphemers.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Boojum2k",
                                            "body": "There has to be a prefix for someone who represents the polar opposite of a Christian, maybe even the kind of people who wear their leader's mark on their foreheads?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Shuber-Fuber",
                                    "body": "It's the height of idiocy that can be best explained by an example.\n\n1. Empathy (per their definition) is to put yourself mentally in another person's shoes.\n\n2. Empathizing with a sinner means thinking about being seduced by the sin.\n\n3. Thinking about a sin makes you a sinner.\n\n4. Ergo empathy is a sin.",
                                    "score": 56,
                                    "replies": [
                                        {
                                            "author": "Hot-Profession4091",
                                            "body": "Man… that is jumping through some hoops to avoid being like their prophet said they should be.",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "author": "TitaniousOxide",
                                                    "body": "You say that like they can read",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "burning_man13",
                                                            "body": "Alvin Toffler said it best when he said, \"The illiterate of the 21st century will not be those who cannot read and write, but those who cannot learn, unlearn, and relearn.\" That sums up MAGA perfectly in one succinct sentence.",
                                                            "score": 10,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Nirvski",
                                                    "body": "I think they read a slightly revised Bible for the modern Conservative, which holds such moral teachings as:   \n  \n\"Do unto others as you damn well like\"   \n\"If anyone slaps you on the right cheek, turn to them your concealed carry\"  \n\"Love thy neighbour, but only if they're white and heterosexual\"",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Hot-Profession4091",
                                                            "body": "Ugh. People really misunderstand the “turn the other cheek” thing. It means you (non-violently, _maybe_) demand to be treated as an equal, not a lesser.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HannibalPoe",
                                                                    "body": "What? It's a complete refusal of \"an eye for an eye. A tooth for a tooth\", I.E. if someone slaps you on the cheek, don't retaliate but turn to them your other cheek to show forgiveness. While it isn't about letting people just do whatever they want to you, as it is not passive acceptance, it is about forgiving instead of escalating a situation with more violence.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "spootlers",
                                            "body": "It's way simpler than that.\n\nEmpathy = caring = socialism = bad\n\nDon't give them the benefit that they bothered to look for justification for their hate.",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "Im_here_but_why",
                                            "body": "Yay, religious thought crime !",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Terrh",
                                            "body": "This means that if I empathize with Jesus, I am Jesus, and therefore can do whatever I want right?     Because it would be god's will?",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Sixguns1977",
                                            "body": "2-4 are not true,  at least for Catholics.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "ArtMnd",
                                                    "body": "These are not the kinds of Christians with any deep tradition or intricate theology.",
                                                    "score": 7,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "schleppylundo",
                                                    "body": "I find more and more that while the church remains detestable, I can respect Catholics for having a theology and approach to religious law that actually comes off as well thought out and nuanced, and often overlaps with the Jewish perspective on things that I am rooted in. Here the example would be that both systems refuse to treat thought which never carries through to action as a sin.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sixguns1977",
                                                            "body": "That's probably because Catholicism is the church founded by Jesus(who was Jewish). The other Christian churches have no unified theology/doctrine.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Shuber-Fuber",
                                                    "body": "I know it's not true. I'm saying this is essentially the mental gymnastic used to claim that \"empathy is a sin\".",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sixguns1977",
                                                            "body": "Roger that",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ecctt2000",
                                            "body": "And we all must be grateful for the inquisition.   \nHaving any empathy for those “Sinners” would be a one way ticket to H E Double Hockey Stock.      \nWait, if hockey sticks are mentioned does that mean Canada is being given empathy too?       \nShoot now we are all Canadians and unless that is made the 51st then that too is a sin!!!!     \nDamn it, what can’t we just be unkind, mean, cruel, judgmental and vicious Christians with good values.    \n/s",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Toppoppler",
                                            "body": "Lemme ask, is it possible to have too much unbrideled empathy? I think we all know people who sacrifice themselves daily for others in a self-harmful way",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Shuber-Fuber",
                                                    "body": "Maybe, we are potentially getting into some interesting medical issues.\n\nOne way empathy works in humans is that our brain \"mirrors\" the expected response of what we see. So, for example, we see someone being kicked in the crouch, the part of the brain that processes pain would light up a bit as if we're the one being kicked.\n\nIt's conceivable for that reaction to be so strong that it became debilitating, which would suck for people who want to go into rescue services.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Toppoppler",
                                                            "body": "Even if its not debilitating, there are some people so focused on appeasing/making other people feel good that they destroy themselves over every percieved failure in making someone elses life perfect",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "NoLegeIsPower",
                                            "body": "Sooo.... they think Jesus is a sinner?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "oceanmaster48",
                                    "body": "Matthew 22:37-40\n'[37] Jesus replied: “ ‘Love the Lord your God with all your heart and with all your soul and with all your mind.’ [38] This is the first and greatest commandment. [39] And the second is like it: ‘Love your neighbor as yourself.’ [40] All the Law and the Prophets hang on these two commandments.” \n\nEven if you ignore the 10 commandments Jesus literally talks about empathy and being empathetic to others. \n\nSorry about the dodgy formatting I'm not great at this.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Stingrea51",
                                            "body": "Literally my dad's lead off scripture last Sunday before he started preaching on actually caring about people being the literal whole point of what Christians are supposed to be doing",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "mxcn3",
                                                    "body": "My best friend is a pastor and he has told me about how he repeats this literally every sermon, and there's *always* someone saying \"yeah but what about...\" and he has to basically (politely) ask them if Jesus stuttered.  Some people have hate programmed so deeply into them that they cannot comprehend the words of the one they claim to worship.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "oceanmaster48",
                                                    "body": "Its the basis of what Jesus preached which is love and empathy.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Sqiiii",
                                            "body": "Not just that, 1 John 2, 3, and 4 talk several times about hating your brother or sister (metaphorical here) and how if you do, you're not in christ.\n\n\nThis isn't directed at you, person who I am replying to, but to folks who may need to see it.\n\n\nEven if you think that the acts of those she advocates love for are in sin, we are still called to love.  Somehow, even if you still consider them the enemy, and not your brother and sister, in Matthew 5, Christ says love your enemy.  If you follow Christ, there is no place for hating people.  \"Hate the sin, not the sinner.\"",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "oceanmaster48",
                                                    "body": "You do make a great point. \n\nHating the sinner is a sin in itself. You should hate the sin not the sinner and we should also show compassion and empathy towards those people.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "rwilcox",
                                            "body": "….. and you wonder why the Evangelical church is in love with Paul? Jesus was a _communist_ (…. in parts, yes obviously 1800 years before, blah blah)\n\nPick and choose most of the Old Testament until it’s just kids stories and hammer verses, why not the NT too? ;)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sabotsalvageur",
                                    "body": "Evangelical Christians would likely say \"old law is less relevant with the sacrifice of the son to resolve original sin\", hence why Christians are permitted to eat pork and wear blended fabrics...\\\n\\\nThen in the same breath forget that \"love your neighbor as yourself\" and \"you will sooner see a camel pass through the eye of a needle than a rich man enter the kingdom of heaven\" were Christ's own words...",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "FrontBrick8048",
                                            "body": "Not necessarily. Jesus spoke about loving your neighbor as yourself (Mark 12:31).\n\nHere's an essay describing what happened to the Old Testament Law after Jesus fulfilled it. It's fairly summarized, but still works: [https://basicprinciplesoftoday.blogspot.com/2023/10/the-argument-against-evil-argument.html](https://basicprinciplesoftoday.blogspot.com/2023/10/the-argument-against-evil-argument.html)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "oceanmaster48",
                                                    "body": "On the first point those exact words are used in multiple gospels all said by Jesus.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Polygeekism",
                                    "body": "I have found that many of them are people of the church, and not people of christ. And that is coming from a non believer...",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "IamaHyoomin",
                                    "body": "you must be new around here, they haven't cared about those in a *long* time",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Paindepiceaubeurre",
                                    "body": "Not prosperity gospel followers. Everything is transactional for them. The greed of their leaders knows no bounds.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "will-read",
                                    "body": "Empathy gets in the way of being a sociopath.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "PraxicalExperience",
                                    "body": "Greed, and other things.  It might make you care about the Undesirables.  \n\nEmpathy for the foul, enemy untermenschen is a betrayal of your race.  That kinda thing.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "naidim",
                                    "body": "Empathy, while key to a functional society, can be easily exploited with scamming, fraud, guilt-tripping, emotional blackmail, workplace exploitation, media and political manipulation. Instead of teaching people how to be aware of the exploits, they're teaching them \"empathy bad.\" :(",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "AlexisFR",
                                    "body": "Evangelicals are a really *special* kind of Christians",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "happyapy",
                                    "body": "You thought wrong.\n\nModern Christians only care if you don't.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "xtheredmagex",
                                    "body": "I looked into this previously, and the context is that empathy becomes a sin when it gets in the way of you \"hating the sin\" that people embrace (such as LGBT+ individuals)\n\nIn short, it's justification to be a bigot",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Justin-Stutzman",
                                    "body": "https://www.facebook.com/share/v/1AHcPv1s73/\n\nHere's a breakdown of the message that's making the rounds. The movement that the head of the White House Faith Office is a leader of, Independent Charismatic Christianity,  preach the prosperity gospel and toxic empathy",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Nexxus3000",
                                    "body": "I think you’re confusing Christians with tv evangelists",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Fairytale-Rays202",
                                    "body": "Exactly my thought too",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "WandFace_",
                                    "body": "It's more like bias. A bear protecting her cubs will rip to shreds anything that threatens them because she has empathy towards them. It's definitely not evil and still the best virtue there is but it does come with an edge.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "mrhorus42",
                                    "body": "You yes, the leadership not necessarily",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "LepiNya",
                                    "body": "Dude there's a whole chapter in the Bible about wolves among sheep in reference to what is happening right now but it was understated AF. It's more like an odd sheep in the wolf pack right now. But for some reason they're all wearing sheep costumes.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "dj_rubyrhod",
                                    "body": "As I've witnessed it in my own family, they allow the preachers to warp their definitions and beliefs - they will alter anything to make their worldview work.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Veilchengerd",
                                    "body": "There is no reference to empathy in any form in the ten commandments.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "seriouslees",
                                            "body": "Who cares about the commandments? Jesus replaced them with the golden rule. You know, literally empathy.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Veilchengerd",
                                                    "body": ">17 Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them.\n\n>18 For truly I tell you, until heaven and earth disappear, not the smallest letter, not the least stroke of a pen, will by any means disappear from the Law until everything is accomplished. \n\n>19 Therefore anyone who sets aside one of the least of these commands and teaches others accordingly will be called least in the kingdom of heaven, but whoever practices and teaches these commands will be called great in the kingdom of heaven. \n\nMatthew 5 17-19",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Panzerkatzen",
                                    "body": "Prosperity Gospel is the branch of Christianity that the wealthy follow. They preach that wealth is a reward from God to the most Holy and faithful, and so the wealthier you are, the more God loves you. It encourages donations to charitable causes as a way to stay in God's good graces, but doesn't require you to give up all of your wealth as Jesus originally taught.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Jealous_Shape_5771",
                                    "body": "The only time I can think of it being dangerous would be in either wartime or post apocalyptic scenarios, where your kindness will be all but guaranteed to be used against you later down the road.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "whomad1215",
                                    "body": "Supply Side Jesus is who they follow now",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Waitsjunkie",
                                    "body": "They're supposed to care about the Beatitudes even more, but I don't feel like many have read them.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Whorq_guii",
                                    "body": "I have empathy for the victims of cartel violence. Which is why I support the deportation and detainment of cartel members. \n\nIs my empathy now a sin to you because I want these people to be deported and detained?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Freya_84",
                                            "body": "Absolutely no sin. You just have to make sure that the people who are being targeted are actually those things and not just bc someone (a known liar at that) said so. Innocent until proven guilty - that thing. If proven guilty I'm pretty sure almost all in this comment section would agree with you. \n\nThe problem is when you just jump to conclusions and then retribution without  due process.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Ake-TL",
                                    "body": "Some American protestants have about as much in common with christianity as Nation of Islam has with actual Islam. NoI believes ancient black evil genius Yakub created white people out of spite. Mormons believe black people ancestors sided with satan during his fall IIRC.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AmPotat07",
                                    "body": "Many Evangelical Christians haven't followed the teachings of Christ in a long time (in fact I would argue most Christians don't). Religion, to them, has become tied to their identity and their politics. They see empathy as a \"leftist\" and \"anti-capitalist\" trait, therefore it is evil.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "nerdybioboy",
                                    "body": "Following the 10 Commandments is not about understanding that their god wants them to be empathetic. They follow the authority of god through those commandments and other teachings of the bible. Christians can use empathy so long as it doesn’t lead them to questioning Christian teachings. But the second they do, they’re supposed to set empathy and logic aside and return to obeying authority. This is why you can be having a perfectly rationale conversation with a Christian, then they short circuit when you get too close to a “controversial” topic.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "WeebOfFiles",
                                    "body": "Supposed to, yes. Many denominations are less about actually following the Word of God and are instead about using the Word for fun, profit, or personal agenda. Abusing the fact that no one really speaks out against them because they are a religion in the US and that they have a facade of Christianity.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "WeebOfFiles",
                                    "body": "Supposed to, yes. Many denominations are less about actually following the Word of God and are instead about using the Word for fun, profit, or personal agenda. Abusing the fact that no one really speaks out against them because they are a religion in the US and that they have a facade of Christianity.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "DoodleJake",
                                    "body": "One of the 10 commandments was broken almost immediately after they were written. Forcing Moses to retrieve a second updated set of 10 commandments. People were never gonna listen to any rules or commandments. Humans are inherently curious and dumb.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Shimraa",
                                    "body": "I believe the mental gymnastics are saying that having empathy for anyone else is akin to giving into every whim a 3 yr old could think up, such as sticking a fork in a wall socket. If you try and see things from anyone else's perspective then no one will stop them from being a danger to themselves and others. \n\nSimilar to how certain demographics are trying to attack LGBT folks under religious pretenses. They will simultaneously firebomb a doctor's office as well as scream that they are punishing gay folks out of love. Their love for fellow man is so strong that they cant let that random person continue existing without believing in god, for that would be cruel to be godless. What the person wants or feels is irrelevant, so long as their soul is cleansed. If you simply let them live their life without god you may as well let that toddler crawl into an oven. \n\nThat's how it was explained to me anyways. It doesn't even pass the most basic of reason checks in either case but here we are.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Randy_34_16_91",
                                    "body": "[The gospel of Supply Side Jesus will clear up any confusion](https://imgur.com/gallery/gospel-of-supply-side-jesus-bCqRp)",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "CatOfGrey",
                                    "body": "I can see my Evangelical relatives on facebook telling me \"Empathy isn't in the 10 Commandments!!\"",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Denmark_217",
                                    "body": "To be more reductive, the New Testament states in essence that “the old laws are done away in me (Christ),” and that there are only two essential commandments, to love God and to love others as Christ loves you. You know, the guy that came and died for the sins of *every* person? And yet, way too many people screw that up. I know that there are more rules to follow, but when the J man says “listen up, these are important” you’d think we’d do a better job.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Error-451",
                                    "body": "Not if you believe in [supply side jesus](https://imgur.com/gallery/gospel-of-supply-side-jesus-bCqRp).",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Famous-Register-2814",
                                    "body": "10 commandments are more a Judaism thing. Christianity is supposed to be more focused on the teachings of Jesus Christ (hence the name) so focusing on things like the parables, sermon on the mount, ext. Biggest one according to the man himself in the book of John chapter 35 verses 34-35 are “A new commandment I give you: Love one another. As I have loved you, so you must love one another. By this everyone will know that you are my disciples, if you love one another.” (NIV) \n\n\nAlso illustrated in the book of Mathew Chapter 22,  verses 36-40: \n\n\n“Teacher, which is the greatest commandment in the Law?” \n\n\nJesus replied: “‘Love the Lord your God with all your heart and with all your soul and with all your mind.’ This is the first and greatest commandment. And the second is like it: ‘Love your neighbor as yourself.’ All the Law and the Prophets hang on these two commandments.” (NIV)",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "UpstageTravelBoy",
                                    "body": "It's Christianity influenced heavily by current conservative thinking. Their thinking is that poor people are poor because they are lazy and unintelligent, by empathizing with them and trying to help them you're only allowing them to stay lazy. \n\nSpeaking with a bit more opinion, you're right, this thinking is directly contradictory to the letter and spirit of Christianity. It's also observably incorrect. Americans and Christianity are weird, there's a lot going on there",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "nau5",
                                    "body": "Evangelical belief is to ignore your eyes and ears to believe nonsensical evangelicalism.\n\nCritical thinking and empathy are the key enemies of evangelicalism.\n\nDon’t think, believe what you’re told is the key foundation of the religion.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Willemboom00",
                                    "body": "Technically because they believe that empathizing with the wrong people will tempt you to sin.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "FlyinB",
                                    "body": "Christianity is a corporation now. They will change their rules / core beliefs as they see fit to generate more profits.\n\nIf you ask a biblical scholar, they won't deny that the Bible, in its current form(s), has had giant sections either re-worded or removed for political or economic reasons.\n\nIt's not too say that all Christian faiths don't do good things, but the whole system is based on a book that isn't the truth.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ReturnOfWoke",
                                    "body": "The 10 commandments dont mention empathy or raping kids",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GibDirBerlin",
                                    "body": "The concept of empathy being a sin is a typical element of fascism. Adolf Eichmann, the architect of the holocaust, spoke many times in interviews about having to \"resist the temptation of empathising\" with jews he knew and worked with for \"the greater good of the Reich and the German people\". \n\nThe sentiment can be found among fascist and extremist right wing movements all over the world today and it is a core element of the brutality all of them incorporate in their strategy.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Distantstallion",
                                    "body": "Evangelicals arent christian, they don't follow the words of christ.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Sardukar333",
                                    "body": "Real life experience:\n\nEmpathy can be dangerous when it causes you to enable another person at great cost to yourself. There are people who will see your empathy and use it to suck life out of you like a parasite. My ex did it, my wife's ex did it, and I've heard testimonials from other people with the exact same story.\n\nI still believe overall empathy is good, but you need to be careful and have limits.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BrotherLazy5843",
                                            "body": "Ok, so there is a difference between being empathetic and being naive. What you are describing is being naive.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Iron_Snow_Flake",
                                    "body": ">Cause it gets in the way of greed?\n\nYes.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Mezlanova",
                                    "body": "No, the danger they identify is that empathy is easily manipulated to control the people who would wear it like a virtue. \n\nIt's not to say that empathy is inherently bad, but that it is an exploited weakness in our modern social climate.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ImNotALegend1",
                                    "body": "That is actually a common misconception. The 10 commandments are the first 10 in the law of Moses. Which Jesus absolved by dying on the cross. Many still preach the 10 commandments, but that would be blasfemus, as it is against the word of Jesus and by extension, god.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "HannibalPoe",
                                    "body": "blasphemous\\* it's one of those words with the silly ph instead of f spelling.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "N-economicallyViable",
                                    "body": "Empathy for the criminal and dangerous is cruelty to the innocent.  Some \"kid\" who's 19 and stabs some old lady doesn't deserve empathy, and giving them any is cruelty to the rest of society that will deal with their likely reoffending.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Omegoon",
                                    "body": "Empathy for sinners and their sinful behavior. One thing is being empathetic towards \"good god fearing people who have it rough, but that didn't tempt them to sin\" and something else is being empathetic towards people commiting sins and understanding or feeling why they had to sin (ad absurdum something like \"I feel for Hitler. He had it rough because they were really bad to him\".)\n\n\nI'm not even Christian, but it's quite obvious what they mean. It's really not that complicated. ",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "maximumborkdrive",
                                    "body": "I'm not 100% sure what the people who say empathy is a sin are meaning but I have heard someone explain it this way:\n\nThere is a difference between being empathetic and sympathetic. While sympathy is understanding ones plight empathy is more identifying with it. They gave an example of a sinking boat. Sympathy is seeing the people on board and understanding their concern. Using that concern to reach out and help them. Empathy is like jumping on the sinking boat with them.\n\nThey said the reason we should be more sympathetic is that we are better able to help by remaining outside of the situation itself. If we join ourselves with them then we are more likely to just suffer with them and then no one gets saved.\n\nNot sure if this is what they mean but I've heard it before.",
                                    "score": -8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HugTheSoftFox",
                            "body": "Remember, if a foreign pregnant couple come seeking shelter, just turn them away, and then report them as well as any strange gift bearing men who come looking for them to ICE.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "Telvin3d",
                                    "body": "Mary and Joseph weren’t even a *foreign* pregnant couple. They had to travel to Bethlehem because it was the town of Joseph’s family. It was more kicking your nephew and his pregnant wife into the streets because you didn’t like their choices ",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Efficient_Ear_8037",
                            "body": "“A lack of empathy is the path to evil”",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "burbankamaki",
                            "body": "this was one of my first moral dilemmas as a teenager raised in a religious cult. empathy for satan, as i correlated empathy to the love of god. and god loves all his children, and satan is a child of god....\n\ni think i just didn't tell anyone that i took time to understand why satan was trying to do what he did.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Kim_catiko",
                            "body": "I'm not religious, but didn't Jesus literally preach kindness??? Do they not know what kindness entails? I'm baffled.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Kiri11shepard",
                            "body": "1) what",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TopNeighborhood2694",
                            "body": "Jesus openly showed empathy and deep emotion \n\nFrom John 11:33-36\n\n33 When Jesus saw her weeping and saw the other people wailing with her, a deep anger welled up within him,[f] and he was deeply troubled. 34 “Where have you put him?” he asked them.\n\nThey told him, “Lord, come and see.” 35 Then Jesus wept. 36 The people who were standing nearby said, “See how much he loved him!”",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Ixothial",
                            "body": "The Fool's Golden Rule",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "tyfunk02",
                            "body": "\"Christians\" giving sermons that to be christ-like is a bad thing? I mean, I know they've been like that for a while, but they've avoided saying it out loud for most of my life as I can remember.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ravenrabit",
                            "body": "When I saw an article posted on an Evangelical site calling compassion evil and wrong I felt a shiver go down my spine.\n\nIt was so bold and blatant, and how anyone could continue to follow that church after was truly terrifying.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Reddragonsky",
                                    "body": "“Not everyone who says to me, ‘Lord, Lord,’ will enter the kingdom of heaven, but the one who does the will of my Father who is in Heaven. On that day many will say to me, ‘Lord, Lord, did we not prophesy in your name, and cast out demons in your name, and do mighty works in your name?’ And then I will declare to them, ‘I never knew you; depart from me, you workers of lawlessness.’”\n\nMark 7:21-23\n\nI fear there will be many who call themselves, “Christians” who will encounter this exact situation.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Hita-san-chan",
                            "body": "Someone needs to remind them what their boy stood for and what his final words when we nailed him to a piece of wood were.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Reddragonsky",
                                    "body": "Favorite meme:\n\nhttps://www.reddit.com/r/gatesopencomeonin/comments/ewegoq/jesus_never_stutters/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "justwalkingalonghere",
                            "body": "There's multiple shots going around of Fox segments as well where the screen says something like \"Discussing the Sin of Empathy\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OmegaRaptor_CH",
                            "body": "Wait, isn’t that literally heretical?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Last-Influence-2954",
                            "body": "These are foolish and Spiritless people who are not sustained by God as they claim to be. For if they had the power of God within them they need not fear. That is why they cannot distiguish their emotions and as a result see empathy as a danger. They do not understand that you can care for someone without giving them permision to wrongdoing, and do not have the bravery to say with certainty what is acceptable. Read the book of Jude, I'm sure if they actually bothered to search in God's understanding they wouldn't dare to behave that way after reading Jude.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Arthurs_towel",
                            "body": "They’re writing books about it now.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "xenelef290",
                            "body": "Dangerous to their wallet",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Keji70gsm",
                            "body": "Edolf Titler went on Rogan recently and spoke about how dangerous empathy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RadTimeWizard",
                            "body": "It's dangerous to white supremacy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BoatSouth1911",
                            "body": "Source or you made it up (caus this is reddit we all know somebody will be a bit overeager to christian bash)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ijustwannasaveshit",
                                    "body": "Here's a video with multiple faith leaders talking about the sin of empathy.\n\nhttps://youtu.be/GFOMXXDlBTw?si=MrlV7x1qDboEJchr",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "dj_rubyrhod",
                                    "body": "if you're that concerned, you can simply google the following three words \"pastor+empathy+dangerous\" or maybe \"sermon+empathy+sin+\".\n\nnumerous instances, publications discussing it at least since 2020.\n\n\"let me google that for you\" seems to be broken or I'd link you.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "amethystalien6",
                    "body": "Additionally, a new book came out on February 25th called “The Sin of Empathy”. It’s by Joe Rigney and it’s making the evangelical rounds. Allie Beth Stuckey also released a book late last year called “Toxic Empathy: How Progressives Exploit Christian Compassion”. (I’m not linking to either because this is already more promotion than either deserves). \n\nEmpathy being bad is the hot new MAGA Christian trend.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "andy_is_awesome",
                            "body": "For those curious:\nhttps://www.betterup.com/blog/how-to-protect-yourself-from-toxic-empathy",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "amethystalien6",
                                    "body": "Your link is different from what I’m referring to. Your link talks about how important it is to have boundaries and be realistic in your empathy. \n\nHere’s the synopsis from Stuckey’s book from the publisher. \n\n>> Toxic Empathy, Allie Beth Stuckey argues that empathy has become a tool of manipulation by left-wing activists who bully people into believing that they must adopt progressive positions to be loving. She explores the five most heated issues through which toxic empathy is deployed: abortion, gender, sexuality, immigration, and social justice. Progressives use catchy mantras to present their perspective as empathetic, like “abortion is healthcare,” “love is love,” or “no human being is illegal,” but in each case, they ignore the other side of the moral equation. For example, abortion is presented as compassionate for the woman, but what about the human life the procedure kills?\n\n>>This book isn’t about killing empathy; it’s about submitting our empathy to God’s definitions of love, goodness, and justice. Stuckey exposes the logical pitfalls and moral consequences of toxic empathy, equipping Christians with research-backed, Biblical truths to dismantle the progressive lies that have permeated our culture—and our church.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheRealLXC",
                    "body": "\"Properly hate in response\" oof.\nI not a fan of the j-man but I'm pretty sure he had some words strongly condemning this exact thing.",
                    "score": 60,
                    "replies": [
                        {
                            "author": "pvtcannonfodder",
                            "body": "Eh most of the stuff Jesus did was pretty cool. He walked around turning water into wine, feeding people and storming temples, condemning the hyper dogmatic priests. It’s like that ghandi quote: “I like your Christ, I do not like your Christain’s. Your Christian’s are so unlike your Christ”",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "PaperPlaythings",
                                    "body": "I heard Mojo Nixon say on his radio show, (paraphrased) \"I'm cool with Jesus, but his fan club scares the hell outta me!\"",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "keelhaulrose",
                            "body": "\"Love thy neighbor as thyself\"\n\nMaybe these people all hate themselves? A Jesus loophole? If you hate yourself you can hate others?\n\n\"Do onto others as you would have them do onto you.\"\n\nWhere's that LibsofTikTok lady who was crying about conservatives getting treated badly after leading lunch mobs against school workers and drag queens?",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "TheScareLab",
                            "body": "That's the thing about some Christians though. Cherry picking sections of the Bible to listen to and sections to ignore is a tale as old as time.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "FrontBrick8048",
                                    "body": "Absolutely. As a Christian myself, this is absolutely something that Christians do far too often. It isn't okay.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Bigethanol5",
                            "body": "Of course you don’t like the coolest dude ever to live in the most barbaric time. Redditor 🥱",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sheggly",
                    "body": "Elon musk is also quoted as saying the fundamental weakness of the west is empathy. In psychology this is just known as being a sociopath",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Cortower",
                    "body": "Evangelist encounters Christian, gets angry, and becomes a Pharisee. \n\n\nMany such examples.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "UselessTrashMan",
                    "body": "I'm so confused, isn't empathy like the main pillar of Christianity? Isn't that what the entire new testament is about? How can you, with a straight face, as a pastor, just say empathy is a sin with absolutely no sense of irony? In any other timeline that would get you exiled from your religion in a second.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "9ElevenAirlines",
                            "body": "You are correct. I do a lot of new testament reading and research, and a lot of it is complicated- the different authors had contrary opinions, differences in theology, even differences in just general facts like times and locations. So to be a Christian requires some sort of negotiation with the texts to make them all fit together.\n\nHowever, Jesus said very clearly and unambiguously: \" “Teacher, which is the greatest commandment in the Law?”\n\n37 Jesus replied: “‘Love the Lord your God with all your heart and with all your soul and with all your mind.’[a] 38 This is the first and greatest commandment. 39 And the second is like it: ‘Love your neighbor as yourself.’[b] 40 All the Law and the Prophets hang on these two commandments.” \"\n\nThat's the bedrock of requiring empathy to be a Christian and love your neighbor as yourself, which is  what Bishop Buddes message was",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "somersault_dolphin",
                                    "body": "To be fair, they have been failing at it ever since the beginning.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Thijsie2100",
                                    "body": "Romans 13:8-14 as well.\n\nPaul is rather clear about this.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tokyo_Sniper_",
                                    "body": "Notice that the \"first and greatest\" commandment is to love god, he ranks above the love thy neighbor bit. Sin being anti-god is a pretty fundamental fact of christianity, so being anti-sin taking priority over loving your neighbor makes complete sense. You have empathy up to the point of encouraging sin.",
                                    "score": -2,
                                    "replies": []
                                },
                                {
                                    "author": "9ElevenAirlines",
                                    "body": ">so being anti-sin taking priority over loving your neighbor makes complete sense\n\n\nRidiculous interpretation. The commandments are for **you** to love god and for **you** to love your neighbor as yourself. There is no exception to not love your neighbor if you think they are sinful. People can be rebuked out of love, but that has nothing to do with the Bishops message - it is a call to empathy that you do not get to ignore because you believe they are too sinful",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tokyo_Sniper_",
                                    "body": "You can absolutely ignore a random Episcopalian bishop if you're not an Episcopalian. Bible makes a point of telling people to ignore false teachers, which would generally include priests of denominations that differ theologically from your own. \n\n\"Beware of false prophets, who come to you in sheep's clothing but inwardly are ravenous wolves.\" \n\n\"For the time will come when people will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear.\"",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "9ElevenAirlines",
                                    "body": ">Bible makes a point of telling people to ignore false teachers, which would generally include priests of denominations that differ theologically from your own\n\nLol thought you were serious till this part - well played internet troll master, i tip my fedora to you",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Purrosie",
                            "body": "That's the fun thing! They don't read the New Testament. Most of the verses you'll see them quote aren't from it, because many of the clearest teachings in the New Testament are antithetical to their cruel and bigoted worldviews.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RealisticSorbet",
                    "body": "Where did Bill Gates get that sick staff?",
                    "score": 49,
                    "replies": [
                        {
                            "author": "en43rs",
                            "body": "When he unlocked the lvl 100 gear for his cleric.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "Interesting-Log-9627",
                                    "body": "Gates foundation = Lawful good",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "NotAPirateLawyer",
                                            "body": "The Gates foundation that believes the earth needs to be depopulated is lawful good? At best they could be lawful neutral, seeking balance in population vs natural resources, but are more likely lawful evil. Remember, he's the single largest holder of farm and pasture lands in the US, most of which he purposely lets go fallow to artificially drive up scarcity.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Interesting-Log-9627",
                                                    "body": "Is any of that actually true? I'd like to see your sources.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ok-You4214",
                                    "body": "Pay-to-play sucks",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "No_Corner3272",
                            "body": "It's +3 to attack and damage rolls, and has a once-a-day smite ability.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Kilikorek",
                                    "body": "*once a long rest",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Rutgerius",
                                            "body": "Gates plays Pathfinder obviously so once a day is correct",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "dratseb",
                                                    "body": "What, Gates is still playing 1st ED",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LarrySDonald",
                            "body": "I think it was Melinda’s originally.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zachary-360",
                    "body": "That is wild to tell a bishop they’re blasphemous",
                    "score": 9,
                    "replies": [
                        {
                            "author": "ManoftheDiracSea",
                            "body": "Are you aware that anyone can be a Pope of the church of discord?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MintyMoron64",
                                    "body": "Nah usually you have to do pretty well as a moderator for a while",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Tokyo_Sniper_",
                            "body": "Multiple denominations have bishops, all of whom can differ theologically on a number of issues. She's an Episcopalian, Catholics would find a female bishop heretical in itself.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Hotdog_Waterer",
                    "body": "\"Do not commit the sin of Empathy\" sounds like a 40k quote...",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "nekoandCJ",
                    "body": "Trump is an idiot. Empathy has always been seen as a virtue not a sin",
                    "score": 11,
                    "replies": [
                        {
                            "author": "PoorMansPlight",
                            "body": "Trump is jewish the rules are different",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Vat1canCame0s",
                    "body": "She didn't deliver a \"speech\", she delivered a *sermon*.... in her *parsonry* (her church that she leads) that they *walked into during service*.\n\nThey wanted a nice, easy to ignore talk on not physically striking your neighbor or something they didn't particularly have trouble shoving aside.\n\nInstead she preached to the needs of her congregation (which they became by choosing to walk in)\n\nIt is absurd that Christians have rebelled against the teachings of their very namesake",
                    "score": 5,
                    "replies": [
                        {
                            "author": "TheScareLab",
                            "body": "Apologies for using the incorrect word in my response, but love the additional context you provided.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Vat1canCame0s",
                                    "body": "You're good. I just thought it's an important contextual distinction. And for a man who believes himself above all others, it was refreshing to see someone stand up to Trump.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "TheScareLab",
                                            "body": "That’s what I loved about it. The bravery to stand in front of him and say what she said, knowing where he stands in those issues, was amazing to see.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Binx_Thackery",
                    "body": "This gave Warhammer 40k vibes.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Quotalicious",
                    "body": "Nah, it was Elon’s recent interview where he said empathy was western civs greatest weakness or something. ",
                    "score": 5,
                    "replies": [
                        {
                            "author": "TheScareLab",
                            "body": "That’s also true, but he didn’t say it was a Sin in that interview specifically, like the comic is referencing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ArethaMorris",
                    "body": "Powerful speech, controversial response.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Historical_Words",
                    "body": "Controversial moment, strong message.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "shunyaananda",
                    "body": ">You need to properly hate in response \n\nWe got \"religion of peace\" at home",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JRiceCurious",
                    "body": "Also [Elon Musk](https://www.snopes.com/fact-check/elon-musk-empathy-quote/).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheMilesCountyClown",
                    "body": "Who’s Ben Garret?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "boistopplayinwitme",
                    "body": "Is he trolling? The whole Christian faith basically boils down to having empathy",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ppman2322",
                    "body": "Isn't the bishopry meant to be only male? unless Pancho the first did something I didn't know",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tokyo_Sniper_",
                            "body": "For Catholics, yes. Episcopalians have started ordaining female bishops in an attempt to appeal to the youth though.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "ppman2322",
                            "body": "Oh that's weird",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Different-Case-6859",
                    "body": "I may not be christian but if heaven/hell do exist I am so goddamn excited for all of these people to spend the rest of eternity in the latter",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "realnjan",
                    "body": "Oh, hate… how christian of them./s\n\nFor further reference, please check out 1. John 3:15",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Illumynarty_234",
                    "body": "\"properly hate in response\"\n\nI have a *sliiiiight* feeling that that's not really the Christian way...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WattebauschXC",
                    "body": "I kinda knew it had to be Trump but I thought it was because of his general pettiness and crying.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Upsetti_Gisepe",
                    "body": "How’s she doing now?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Deadpool1205",
                    "body": "Elon also claimed that empathy is a weakness recently as well",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "C_MMENTARIAT",
                    "body": "Jesus Christ.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AGweed13",
                    "body": "Religion based on love btw.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RadTimeWizard",
                    "body": "Ben Garrett is a piece of garbage.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CaptAdamovka",
                    "body": "Bishop? Pseudobishop, women cannot be bishops.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ProfessionalMilk5780",
                    "body": "Empathy is a sin now? This is so ridiculous. 🙄",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "No_Caterpillar_4179",
                    "body": "Matthew 5:44, Romans 12:19-21, 1 John 4:20, Ephesians 4:31-32, Luke 6:36.\n\nJesus directly commands us to love, not hate, even those who oppose us. Hatred is not the response Christians are called to. Instead, we are to act with kindness and leave judgment to God. Loving God means loving others, not fostering hatred. True faith is measured by compassion and righteousness, not by promoting animosity. The golden rule teaches us to treat others with the grace and mercy we would want for ourselves",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Humans_Suck-",
                    "body": "Why are democrats offended? They don't do empathy either.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Hoosier_Engineer",
                    "body": "Pardon?\n\nI'm pretty sure that MSNBC reached out to this pastor to have her give an interview, and MSNBC is seen as being very democratically aligned. I don't see democrats being offended by this.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SkibidiDooDah",
                    "body": "Clearly she has never read the Bible.",
                    "score": -6,
                    "replies": []
                },
                {
                    "author": "Quplet",
                    "body": "Yeah it's a lot more evil then she portrayed",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MintyMoron64",
                    "body": "100% right, she would be an atheist by now if she had.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "otter_fucker_69",
            "body": "On or about Inauguration Day of the POTUS, a preacher asked Trump to show mercy and compassion.\n\nTrumposphere types said not to commit the \"Sin of Empathy\".\n\nAnd Elon is on record for saying that he thinks the downfall of Western Civilization is \"too much empathy\".",
            "score": 348,
            "replies": [
                {
                    "author": "UnarmedSnail",
                    "body": "When you're planning on using your followers to attack their neighbors, empathy must be discouraged, and dehumanization encouraged.",
                    "score": 113,
                    "replies": [
                        {
                            "author": "Independent_Bet_6386",
                            "body": "See: Elon calling anyone who disagrees with him an NPC.",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Famous_Ad_4258",
                    "body": "“empathy is the reason for the fall of the west!”\n\nthe words of someone who truly cares for the working class",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Darkwing-cuck-",
                    "body": "I will have no empathy when Musk gets Luigi’d",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "sputtertots",
                    "body": "Religious republicans want to live in the old testament where violence and destruction is the only option, *to others*. The beatings will continue until compliance is achieved.\n\nOrganized religions are stupid.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "doofer20",
            "body": "Im going to help some old lady cross the street. *laughs menacingly*",
            "score": 178,
            "replies": [
                {
                    "author": "Xehant",
                    "body": "YOU MONSTER!!!",
                    "score": 60,
                    "replies": [
                        {
                            "author": "doofer20",
                            "body": "Hahah you cant stop me, next im going to donate to a local shelter.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Xehant",
                                    "body": "How can you be so sinful?!!!",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "Jill-Of-Trades",
                                            "body": "Not only that! I'm going to volunteer at the soup kitchen!",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "joethespacefrog",
                                    "body": "Have some decency, not the local shelter! *clutches pearls*",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Puffyboi59",
                                            "body": "I'm gonna buy something at the store... and let the cashier keep the change!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "torakun27",
                                                    "body": "*Gasps* \n\nLocal shelter is one thing, they're just animals. But empathy for a fellow human? That's too far! Have you no shame?!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HugTheSoftFox",
                    "body": "I bought a sandwich and a coke for a beggar the other day, looks like I'm going straight to hell.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Kuberow",
                            "body": "It's sad how many Christians actually follow that sentiment",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Defti159",
                    "body": "*\"in an exacerbated tone while I clutch my pearl necklace\"* They can't keep getting away with this!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DoctorWZ",
                    "body": "Muhahahah i'm going to give so much love to orphans and rescued puppies for the good of everyone involved!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zahrad70",
                    "body": "Ummmm.  This works as an actual evil plan in a frog-and-scorpion kinda way.\n\nYou know.  Just saying.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "randomthrownaway126",
            "body": "MAGA Christians now say empathy is a sin because, you know, MAGA politics is pretty evil and so fails the \"basic empathy\" test for morality. So now everyone is confused because MAGA is claiming Jesus did not like empathy.",
            "score": 126,
            "replies": [
                {
                    "author": "Xehant",
                    "body": "I mean, I would too, how your brain can process this and think it's okay",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Umbrella_Viking",
                    "body": "I’m certain that’s not their reasoning. What is their actual logic?\n\nEdit: I found this, for anyone interested, that evaluates what the actual thought process is:  \nWhat’s wrong with empathy?\nOne of the dangers of empathy, he writes, is that it pulls the Christian down into the pit of sin along with the person in need. His assumption is that empathy — unlike sympathy — requires acquiescing to any and all beliefs, including those that run counter to the Christian faith.\n\n\n\nhttps://baptistnews.com/article/have-you-heard-the-one-about-empathy-being-a-sin/\n\n\n\nFrom 2021, mind you, so this is not a brand new concept it’s been out there. ",
                    "score": -9,
                    "replies": []
                },
                {
                    "author": "RangisDangis",
                    "body": "Jesus walked with beggars and prositutes and said that the golden rule that all 10 commandments were based on was “do unto others as you would have them do unto you”",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Umbrella_Viking",
                    "body": "Nowhere in my post do I say their beliefs align with mine or with Jesus. I’m just telling you what they actually said, not someone’s interpretation of what we think they mean. ",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "peachesgp",
                    "body": "Nah their reasoning is actually way more simple than that. They, and the political movements they subscribe to, lack empathy. But, in their minds, they're good people. Therefore, empathy must actually be bad.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Umbrella_Viking",
                    "body": "I posted an article with their reasoning… I mean… I get that we have to turn them into monsters, I totally understand that, but they explain their thought process for you. ",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "peachesgp",
                    "body": "No, you posted an article about what they say is their reasoning. You're taking the public spin as the reality.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Umbrella_Viking",
                    "body": "I took what they said is their thought process to say that…. It’s their thought process. \n\nYou’re just speculating. \n\nMaybe they act the way they do because they have hatred in their heart and are evil people. ",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "peachesgp",
                    "body": "And if you believe their spin, I've got a bridge to sell you.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Umbrella_Viking",
                    "body": "Of course I don’t believe their logic, it doesn’t make any sense. \n\nBut it’s their logic. *shrug* ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DishwashingWingnut",
                    "body": "It's their *purported* logic. They're dishonest about the actual beliefs they hold rather frequently, because those beliefs fall outside the realm of what's generally considered acceptable in society today.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Umbrella_Viking",
                    "body": "I mean… you can say that but it doesn’t mean it’s true. I could be right. Maybe they’re true believers in what they say. You have no idea, you’re assuming. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Sir_Penguin21",
                    "body": "To be fair, the Bible is pretty clear that murder is the most moral response for disobedience according to their god. So in the Christian worldview they technically aren’t wrong. Anything can be read from the Bible. Which is why it is useless as a moral guide.",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "LoneWolf4991",
                    "body": "I'm surrounded by devout Christians that voted for Trump. I've never heard of empathy being a sin. In fact they show more real empathy than what I see here from redditors.",
                    "score": -8,
                    "replies": []
                },
                {
                    "author": "wagedomain",
                    "body": "Out of morbid curiosity here, why would they vote for Trump specifically if they show so much empathy? For what specific reason?",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "ZagreusMyDude",
                    "body": "lol the MAGA lies again.  It’s like breathing isn’t it.  Just comes naturally to right wingers to always lie.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "LoneWolf4991",
                    "body": "Believe what you want I guess",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "ArnamYombleflobber",
            "body": "https://preview.redd.it/vw4qgj27rgpe1.jpeg?width=292&format=pjpg&auto=webp&s=a3749fe276b6138d4449ec64621cce35fef8184c",
            "score": 25,
            "replies": []
        },
        {
            "author": "ParticularRough6225",
            "body": "So a bishop at the presidential inauguration preached about being merciful to people. Trump's fan base went apeshit. They went on about falling for the \"sin of empathy\" which is what this is referencing.",
            "score": 40,
            "replies": []
        },
        {
            "author": "PopeSusej",
            "body": "Mariann Budde, an American Bishop, gave a speech at trumps inauguration asking him to have consideration for other people and she recieved backlash for \"committing the sinning of empathy\"",
            "score": 38,
            "replies": []
        },
        {
            "author": "ImaginaryParrot",
            "body": "Elon Musk said that 'The fundamental weakness of Western civilization is empathy.'",
            "score": 22,
            "replies": [
                {
                    "author": "GTor93",
                    "body": "Yes. This. I think this is what the comic is riffing on",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "PabloMarmite",
            "body": "American Evangelicalism has evolved into an unusual contradiction in the last twenty years or so. Jesus said “it is easier for a camel to pass through the eye of a needle than a rich man to enter the Kingdom of God” (Matthew 19:24) and yet with the rise of TV preachers and MAGAs they have to be quite creative as to which tenets they follow and which they ignore. Jesus also said the most important commandment was “love your neighbour as yourself” (Mark 12:31), and obviously this flies in the face of the Trump movement. So they have to reinvent a lot of traditional Christian teachings to fit in with MAGA. This means when they come across actual Christian values such as empathy, they don’t really know what to do. You can generally tell Fake Christians based on how they respond to traditional Christian values.",
            "score": 12,
            "replies": [
                {
                    "author": "SAJewers",
                    "body": "Jesus also said in Matthew 5:44 \"Love your enemies\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Mr-Goteboi",
                            "body": "And right after that in the same verse: ”And pray for those who persecute you.”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Pr0xyWarrior",
                    "body": "I wish it were just my ex-codenominationalists. If Vance’s self-serving misuse of Catholic doctrine is any indication, the conservative members of the Mother Church are following the Evangelical lead.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "B_Maximus",
            "body": "My pastor was praying to God that private vouchers get passed (we are in Tx and the church has a successful school) and it really put a sour taste in my mouth. \n\nLuckily 2 weeks later, the assistant pastor delivered a sermon about how no one, not even the highest members, know what EXACTLY you should be like, want, or do, so it made me feel better",
            "score": 5,
            "replies": []
        },
        {
            "author": "Cannabis_With_Emilie",
            "body": "MAGA Christians claim having empathy is a sin, so her devil is confused because that means she'll have to encourage her human to be a good person.",
            "score": 4,
            "replies": []
        },
        {
            "author": "bangbangracer",
            "body": "Shortly after the inauguration of Trump, Mariann Edgar Budde delivered a sermon asking Trump and his admin to show empathy and compassion.\n\nBen Garrett later tweeted \"Do not commit the sin of empathy.\"\n\nGenerally, empathy and compassion are big parts of the teachings of Jesus.\n\nIt's also worth noting the creator of the comic.  Pizzacakecomics is heavily disliked by many people online because she is very progressive and puts those beliefs to print in her comics.",
            "score": 11,
            "replies": [
                {
                    "author": "1254125412541254",
                    "body": "She's not liked by some due to comming off as obnoxious to some people (as example that Canada poster and \"I drew you as soyjack\" type comics about hate), not for progressiveness. Also for artstyle and \"lack of humour\", but these two seem to be just people trying to justify their hate beyond \"I think it's cringe\".",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Vegetable_Concern34",
                            "body": "It’s not her political views for me. She isn’t funny and her comics have the same vibe as that meme of the ‘she’s so crazy’ woman with the bag or chips on her head making the peace sign.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "wildcatwildcard",
                    "body": "Her being progressive or a woman has nothing to do with why I dislike her. For you to claim that is why people don't like her is disingenuous. \n\n\nTo this day, she's the only account I've blocked on Reddit. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IlluminatingTrauma",
                            "body": "bangbangracer just stated their hypothesis, why pizzacake is disliked by some people. \nNeither did they say anything about you, nor about people hating on them for being a woman.\n\nWould be interesting to hear why you blocked their account?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "BenVera",
                                    "body": "I blocked her too.  Painfully unfunny",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Embarrassed-Weird173",
            "body": "Probably something about how most Republicans think it's evil to help the poor or oppressed. That's empathy, and I guess that's bad. ",
            "score": 23,
            "replies": [
                {
                    "author": "Pale-Equal",
                    "body": "It's bad to murder babies too but I guess not if it's inconvenient.",
                    "score": -58,
                    "replies": []
                },
                {
                    "author": "PianoTeethNoDentist",
                    "body": "How much time are you putting into universal healthcare for babies, children and the adults they turn into around the world? Free vaccinations for everyone? Birth control free to stop abortions?",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "VestaBacchus",
                    "body": "I’m not trying to be antagonistic right now, but what if all/most pro-life people were for all the things you’ve mentioned too? What would you say to a pro-life person who actively campaigned for these things?",
                    "score": -5,
                    "replies": []
                },
                {
                    "author": "insane_troll_logic",
                    "body": "My gut reaction to your question is \"I'll tell you when I meet one\" because I never have.\n\nBut, taking you at your word that you're not just being antagonistic, I assume you are trying to get the pro-choice argument to stand on its own 2 feet without whataboutisms. \n\nIf so, fair enough. But the problem is that pro-choice people have been stating their reasons (that it is not supported by science and women deserve the choice) for decades and no one from the other side listens or cares anymore so the argument has shifted to hypocrisy.\n\nI'm pro-choice and always have been but I will admit I sympathize with people who truly believe (usually for religious reasons) that a fetus is a person. My sympathy runs out when they try to control that belief in others.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "PianoTeethNoDentist",
                    "body": "A lot of other pro choice people would disagree with me but I actually find anti choice campaigners who don't support abortion after rape to be the least hypocritical. Because if they truly believe abortion is murder, they'd never accept a loophole for rape. An embryo is a person to them. No one would accept murdering the live child born of rape. So it goes to reason that if you're ok with abortion for rape and incest that you just really want to punish the bad women, and don't perceive abortion as murder or an embryo as a baby all of the time. I find it interesting how many politicians and Christians will admit abortion is right in those cases.",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "DoubleTheGarlic",
                    "body": "> but I actually find anti choice campaigners who don't support abortion after rape to be the least hypocritical. \n\nYeah, they're not hypocrites and are internally consistent. \n\nThat just makes them ***evil.*** \n\nBut thank god they aren't hypocrites. Just abject ***evil.***",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "PianoTeethNoDentist",
                    "body": "I'd argue that stopping a woman from an abortion because you feel offended that she willingly enjoyed sex is more evil than stopping an abortion because you believe it's murder.\n\nAnd if you feel some women deserve abortions more than others, you're still not pro choice.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "DoubleTheGarlic",
                    "body": "Did you respond to the wrong person or something? \n\nWhat is this non-sequitur? How does it relate in the slightest to anything I said lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "VestaBacchus",
                    "body": "For me, supporting abortion after rape is tied to the violinist argument. The one where you are attached to this violinist against your will. If you detach yourself, the violinist will die. If you stay attached to him for nine months, limiting your freedom and endangering your life, he will live.  Is it wrong to force someone to stay attached?\n\nTo be clear, I don’t claim to be pro-life, but I’m not completely pro-choice either. The issue is complicated and I’m not sure what the best legislation for it would be. I do believe in free birth control and all the other things that you mentioned. I’m also against the death penalty. \n\nI’m also female if that matters.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "PianoTeethNoDentist",
                    "body": "Yes, but that argument is the same regardless of the means by which a woman got pregnant? To me, it's always wrong to force another human to be the biological means of support for another human. The perceived innocence of the non violinist isn't relevant. You might have misunderstood me, or maybe I've misunderstood you. I am completely pro-choice, to me it's not relevant how a woman got pregnant, just that she doesn't want to be pregnant. But I find it hypocritical when pro life people  say \"life begins at conception, EXCEPT for these specific times when a woman is perceived to be \"innocent\".\"  To me you're clearly saying that you don't actually believe it's murder.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "PianoTeethNoDentist",
                    "body": "I'd be more than happy if more pro lifers were pro free birth control and health care though. To me, that seems entirely logical as more women would*choose* to continue their pregnancies. That's why it's hard for me to believe that more people aren't just anti women, than anti abortion",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "sowinglavender",
                    "body": "\"you seem to be an intelligent person who understands cause and consequence, so surely we can both agree to accept the data that shows the proper way to materially decrease the number of abortions that happen is to keep them legal and accessible.\"\n\nbecause that data is plentiful, 'pro-life' individuals who are motivated by the desire to reduce abortion numbers usually already accept pro-choice legislation as it is genuinely effective in decreasing overall rates of abortion and miscarriage (since women have no reason to fear going to the doctor if something is threatening their pregnancy). it's hard to be pro-life and anti-abortion at the same time if you actually thoroughly understand the issue.\n\nit's really easy to talk solutions with pro-life people who have sincere pro-life values, and aren't just using them in bad faith to cover up the fact they want to punish women for having sex.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "adamempathy",
                    "body": "Congrats because you're the first one in recorded history?",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "we_are_one_people",
                    "body": "these things would still be unrelated. It’s just a movement build on the sexist notion that others should decide over a womens body.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "LeSpermReceiver",
                    "body": "If somebody pro life was actually pro life and pro children, like an honest to god orphan advocate, I'd actually respect them.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "MrBlueandSky",
                    "body": "I'd say stay out of healthcare and stop trying to restrict people's healthcare",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "adamempathy",
                    "body": "https://preview.redd.it/sjucuoeangpe1.jpeg?width=827&format=pjpg&auto=webp&s=ab162be8ae5883808bb5b07c5e75dbd9a9110a1d",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "PianoTeethNoDentist",
                    "body": "I'd probably be happy to sit down and have a genuine conversation about it, and why I feel they're wrong on this occasion. I'd be more inclined to listen to their view too, even if I'm unlikely to budge on my own.  But I've never actually met one in real life, I've only met people who want to punish women for having sex.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Extra_Glove_880",
                    "body": "They can start with programs that reduce unwanted pregnancies. if any of those take hold in so called \"pro-life\" states, thats a start. as an example, \"abstinence only\" does not work and those areas have the highest teen pregnancy rates. \n\nNext they can actually do something like supporting kids to become literate, another thing \"pro-life\" states love to fight against.\n\nI would love to live in a time where abortion was for saving lives only because we taught humans to respect each other and people how to prevent pregnancy. but until we're seriously commited to changing how we treat each other, \"pro-life\" is a lie",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "smartest_kobold",
                    "body": "A fetus is not a baby.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "stevenrritchie",
                    "body": "Why? At what point do you think the \"magic\" happens",
                    "score": -18,
                    "replies": []
                },
                {
                    "author": "smartest_kobold",
                    "body": "It’s not a chicken until it hatches. It’s not a baby until it’s born.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "FomtBro",
                    "body": "I would define the point where a fetus becomes a child as the moment spending money on their welfare goes from 'protecting the sanctity of life' to 'communism'.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Im_here_but_why",
                    "body": "When it is named.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "DoubleTheGarlic",
                    "body": "Pretty bad example. A huge percentage of parents name their future child while in utero or even before actually getting pregnant.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "stevenrritchie",
                    "body": "Your not far off",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "BookWormPerson",
                    "body": "When it has a birth certificate.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Mist_Rising",
                    "body": "Legally it's usually around the third trimester or when it starts forming the necessary ability to survive.\n\nOn reddit it's apparently fine to kill even 38 week old pregnancy, because thinking is hard so they use the dumbest thing they can think of. See all of your other replies.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "stevenrritchie",
                    "body": "A well thought-out answer? I'm not sure what to do with this. According to reddit the baby being a baby or a lump of cells is based on how people\"feel\" in the moment.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Mist_Rising",
                    "body": "Reddit predictably downvoted me. Apparently 2 weeks from full term but they'd abort that sucker.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "stevenrritchie",
                    "body": "Because to them it's about them. Not empathy or thought for others. It takes a special kind of monster to just rip a fetus from the womb. I understand that there are sometimes mitigating reasons for such a thing. Unfortunately, the vast majority use it as a form of birth control.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "unknownentity1782",
                    "body": "Not according to the bible.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Misubi_Bluth",
                    "body": "So...people sometimes commit abortions...therefore it's okay to shun poor people?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "TonyGalvaneer1976",
                    "body": "Not if it's inconvenient? So you're fine with murdering babies if it's convenient for you?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Pale-Equal",
                    "body": "Re-take 4th grade English then re-read what you just replied to.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "TonyGalvaneer1976",
                    "body": "I see you're avoiding the question.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Pale-Equal",
                    "body": "I see you're avoiding the class. Take it. It'll answer your question.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "TonyGalvaneer1976",
                    "body": "You and I both know that's a lie, but your desperation is noted.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Mist_Rising",
                    "body": "As a rule, evading a question by insulting someone isn't actually a smart tactic in real life. It works well enough on reddit because nothing important happens in reddit and reddit will agree with murder (apparently) but trying this in actual real life settings will get you mocked by colleagues.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Pale-Equal",
                    "body": "As a rule, I don't owe you anything 🙃",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Striders_aglet",
                    "body": "I empathize with your feelings on this matter.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MintyMoron64",
                    "body": "\"Blessed is he who takes your little ones and dashes them against the rock\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GoldNovaNine",
                    "body": "You murder kids all the time \n\nhttps://preview.redd.it/sfm4239aoipe1.jpeg?width=2048&format=pjpg&auto=webp&s=2720cb1cb67bc55d283f9109704b8a8183c5d004",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MintyMoron64",
                    "body": "\"Blessed is he who takes your little ones and dashes them against the rock\"",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "biffbobfred",
            "body": "The joke is - capitalism is in some ways more evil than the literal devil on your shoulder",
            "score": 4,
            "replies": []
        },
        {
            "author": "iCer_One",
            "body": "It don't need to be any reference. The thing speaks for itself. It's just funny that now the evil side is even more confused by the obviously stupid narrative that empathy should be a sin. \n\nI think it tries to show how stupid the statement is, that even from an evil perspective it doesn't make any sense.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Tri4ceunited",
            "body": "Pretty sure empathy was Jesus’ whole thing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ObsidianTravelerr",
            "body": "It's about Trump, it always circles back to Trump. Someone says something, Trump says something, joke is made, Trump bad. Karma is farmed. Stupid is as stupid does.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Salty-Hashes",
            "body": "I want this mini succubus. How do I get one? ☝️ 😈",
            "score": 3,
            "replies": [
                {
                    "author": "IlluminatingTrauma",
                    "body": "It’s a representation of their inner \"evil\" voice. \nSo follow your instincts, dress up in drag and you are golden.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Salty-Hashes",
                            "body": "I would definitely look cute in drag but I want a mini succubus.\n\nI understand the internal dialog. But we need a small angel to go with it.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "xwiroo",
            "body": "Not the instant 20.1k upvotes comic lady!",
            "score": 3,
            "replies": []
        },
        {
            "author": "gaglean",
            "body": "Wow, the use of this sub now.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Spirited-Cover7689",
            "body": "When all you care about is power empathy seems like a sin..",
            "score": 3,
            "replies": []
        },
        {
            "author": "bearkerchiefton",
            "body": "Christians aren't good people & Maga are traitors..",
            "score": 10,
            "replies": []
        },
        {
            "author": "Complex_Cable_8678",
            "body": "the joke is that pizzacake is not funny",
            "score": 10,
            "replies": [
                {
                    "author": "Tratiq",
                    "body": "That’s putting it mildly lol",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "astral_immo",
            "body": "The joke is pizzacake is aggressively unfunny.",
            "score": 13,
            "replies": [
                {
                    "author": "wohldmad",
                    "body": "I wanna know how she astroturfed to the top of reddit. Painfully unfunny or thought invoking.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "The_Elusive_Dr_Wu",
                            "body": "Pleasant-to-look-at white girl draws comic in a simple style with generic jokes and left-leaning messaging that appeals to most redditors.\n\nWe're not exactly figuring out how to touch down the lunar module here.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "astral_immo",
                            "body": "her comment engagement/upvote ratio shortly after posting seemingly implies botting, but it's not confirmed.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Steezysteve_92",
                                    "body": "Thank you for pointing it out, I’m just scratching my head on how people find her funny.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "z_e_n_a_i",
                            "body": "She has an onlyfans. That's why.\n\nTBH, I'm totally down with unfunny content creators with onlyfans accounts.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "ZeusJuice",
                            "body": "Enjoy your slop",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "The_Elusive_Dr_Wu",
                            "body": "Lmao I believed this enough to actually search it.\n\nDoes she really? If so I couldn't find it under her reddit name or real name.\n\nEDIT: I do hope you're kidding because her website says she has a husband and two children.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "z_e_n_a_i",
                            "body": "oh her nudes are on patreon actually [https://www.patreon.com/pizzacakecomic](https://www.patreon.com/pizzacakecomic)\n\nYou can find her photos if you try just a bit harder with google image search.\n\nNo need to be a prude - people can be married and have kids, and still be naked in public. No big deal.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "The_Elusive_Dr_Wu",
                            "body": "I'd found the patreon already. Mostly just wanted to see if the OF profile is actually out there because that would be hilarious.\n\nNot really interested in looking much further. She's a good looking girl but not my type.\n\nAs far as being a prude, I'm just thinking of her kids mostly. I can't imagine it bodes well for kids in this day & age if mom is posting naked pictures online.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "samisrudy",
                    "body": "Amen brother",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "kirkt",
                    "body": "You forgot preachy too!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "FlatOutUseless",
                    "body": "They are more relatable than outright funny.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "waspocracy",
                    "body": "I find her funny. I don’t know why you need to comment about it negatively though. \n\nShe’s my age and very relatable.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "lonely_biscuit",
                            "body": "Do you also go around threatening people with lawsuits?!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dracostheblack",
                    "body": "Does everything that goes into comics need to be funny? Sometimes he has jokes sometimes it's just a comic...",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "astral_immo",
                    "body": "in this case though, it's just an advertisement for her onlyfans account. no, I am not kidding.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Korrro",
                    "body": "Her OF really isn't worth being advertised. She posts there like once a week, and posts comics at least triple that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "astral_immo",
                    "body": "only one of those puts money in her pocket, though.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "The_Elusive_Dr_Wu",
                    "body": "Link?",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "dracostheblack",
                    "body": "Yeah i saw she has one but meh",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "TruPOW23",
                    "body": "What is “meh” supposed to mean",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "yesterdayandit2",
                    "body": "Oh well, so what. She has one and this isnt a blantantly obvious ad for it. Meh let her have one",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "dracostheblack",
                    "body": "Yeah she doesn't push it",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "The_Elusive_Dr_Wu",
                    "body": "Link?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "egoserpentis",
            "body": "Should've tempted pizzaslop to have a decent punchline for once.",
            "score": 6,
            "replies": [
                {
                    "author": "MintyMoron64",
                    "body": "I don't think there's a punchline, this reads more like \"haha please help\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "poopmcbutt_",
            "body": "Oh, pizzacake tries to make jokes in comic form but she isn't funny and her art sucks.",
            "score": 8,
            "replies": [
                {
                    "author": "MaybeSecondBestMan",
                    "body": "I’ve muted every sub where this lady’s comics show up in an effort to avoid her and her work entirely. She gives me this really unpleasant feeling, like the fact that somebody is that painfully unfunny and still wildly popular on this website gives me serious doubts about the average person’s intelligence. I’m not even your standard elitist jerk, either. I usually see at least some value in most things, even if they’re not my taste. But this woman and her comics make me genuinely uncomfortable to the point that I actively try to avoid ever seeing them. Even the name—pizzacake—it’s like the quintessence of a painfully unremarkable person trying to be quirky. “My two favorite things—le pizza, and le cake. 🥴” It’s very 2012 “I’m so random” millennial coded.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "poopmcbutt_",
                            "body": "There are so many other artists who are actually funny with decent art. I don't know why they give this milquetoast mom any attention. It's so horrendous and so bland.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Andromeda-2",
                            "body": "Spot on - this is exactly how I’ve always felt about her comics.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Positron5000",
                    "body": "Its not even thats shes painfully unfunny, its that she doesnt even have the ability to frame anything in a way that gives good commentary on an issue by pointing out irony or hypocrisy. Like at least if youre going to make me look at this, make some kind of point or argument that makes me think. Her stuff just make you say \"huh\"?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "rizzyg6",
                    "body": "Good to know I'm not alone.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Still-Wash-8167",
            "body": "US Politics. DEI (Diversity Equity and Inclusion) is getting removed from everywhere in the federal government and federally funded institutions like universities. DEI is basically institutional empathy\n\nThe devil on her shoulder is supposed to tempt her to do bad things. If DEI/empathy is bad, she’s supposed to tempt her to do it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "cammontenger",
            "body": "It's Pizzacake, it's not supposed to be funny",
            "score": 6,
            "replies": [
                {
                    "author": "notjustforperiods",
                    "body": "I used to comment \"ACKK!!\" on her worst comics, as a reference to the terrible comic *Cathy* and she blocked me\n\nTotally forgot pizzacake even exists and now I'm annoyed all over again that this is a thing in the world haha",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Vegetable_Concern34",
                            "body": "I can never forget it exists bc Reddit forces her HORRIBLE comics down our throats constantly. Soooo grating.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Griffinjohnson",
            "body": "Modern demons have more empathy than modern Christians",
            "score": 5,
            "replies": []
        },
        {
            "author": "North-Water-1950",
            "body": "seriously screw pizzacake. (I hate Elon and Trump too)",
            "score": 2,
            "replies": []
        },
        {
            "author": "askalotlol",
            "body": "Nothing to not get, it's just not funny.\n\nThat author makes boring tired comics as a way to advertise her NSFW work.",
            "score": 2,
            "replies": []
        },
        {
            "author": "madeyegroovy",
            "body": "Damn, apparently blocking pizzacakecomic isn’t enough to stop me from seeing their lame comics…I’m surprised to see them here though, the reason I dislike them is they’re unimaginative and make the most obvious points about current events.",
            "score": 2,
            "replies": []
        },
        {
            "author": "havoc1428",
            "body": "Its a Pizzacake comic. She's an e-thot that lost the plot a long time ago. I can't remember the last time i saw a comic of hers that elicited a genuine chuckle. Careful OP, you wouldn't want her to threaten legal action for posting her comic. (yes this has actually happened)",
            "score": 2,
            "replies": []
        },
        {
            "author": "eldritch-kiwi",
            "body": "OH NO OP! You'll get us all sued by reposting this comic 😭😭😭😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "PoliceDotPolka",
            "body": "it's pizzacake slop. dont expect any joke whatsoever",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pure__Satire",
            "body": "It's Pizzacake who cares what she thinks",
            "score": 2,
            "replies": []
        },
        {
            "author": "BonkGonkBigAndStronk",
            "body": "Pizzacake is literally probably the most unfunny cartoonist of all time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ShiverDoll_TheFourth",
            "body": "This person just isn’t funny.",
            "score": 2,
            "replies": [
                {
                    "author": "mdahms95",
                    "body": "Hit too close to home?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "xenelef290",
            "body": "This is clever",
            "score": 2,
            "replies": []
        },
        {
            "author": "athosjesus",
            "body": "Did you read the thing? Come on...",
            "score": 2,
            "replies": []
        },
        {
            "author": "MorganTheSavior",
            "body": "It's pizza cake, there is no joke, no punchline.",
            "score": 2,
            "replies": []
        },
        {
            "author": "majorkev",
            "body": "Pizzacakecomic is bad and she should feel bad.\n\nSue me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vegetable_Concern34",
            "body": "That artist’s comics are truly annoying",
            "score": 2,
            "replies": []
        },
        {
            "author": "ilikefinalfantasy",
            "body": "Ugh blocked this comic creator and she still pops up elsewhere.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AnOriginalUsername07",
            "body": "There’s a lot of talk going around now about ‘toxic empathy’.\n\nSome people are expressly calling all empathy bad, neglecting to differentiate, hence the comic.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Odd-Collection-2575",
            "body": "pizzacakecomic is absolute garbage that Reddit just gobbles up",
            "score": 2,
            "replies": []
        },
        {
            "author": "DiesNahts",
            "body": "Its a pizzacake comic its normal to not laugh at them dont worry OP",
            "score": 2,
            "replies": []
        },
        {
            "author": "MaxicalUM",
            "body": "Pizza cake comics are meant to only be understood by boring 40-year old moms.",
            "score": 6,
            "replies": [
                {
                    "author": "Adventurous-Mind6940",
                    "body": "Only boring 40 year old moms follow politics? Wtf?",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chris_on_crac",
            "body": "https://preview.redd.it/qkjojkdiagpe1.jpeg?width=750&format=pjpg&auto=webp&s=ddb1bbfe53649f4df810669c0b563fce86562bb0\n\nWell what do ya know",
            "score": 4,
            "replies": [
                {
                    "author": "lil_Liam39",
                    "body": "https://preview.redd.it/85xhmgw4bgpe1.jpeg?width=1080&format=pjpg&auto=webp&s=46ad20c25ef1159b2cdc04f7b2fc689f8f49a743\n\nWhat do YOU know?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MysticBimbo666",
            "body": "Because empathy is “woke” and being woke is a bad thing apparently. Such crazy propaganda. Like, they are literally admitting they want people asleep and plugged into their energy harvesting matrix, turning working class energy into money for the elites.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mcylinder",
            "body": "Obligatory it's pizzacake there is no joke comment",
            "score": 5,
            "replies": [
                {
                    "author": "chaotic_ugly",
                    "body": "She's the Big Bang Theory of comic artists.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "chaotic_ugly",
                    "body": "She's the Big Bang Theory of comic artists.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BlueProcess",
            "body": "Woe unto those who call good evil and evil good",
            "score": 4,
            "replies": []
        },
        {
            "author": "zebrasmack",
            "body": "This author doesn't write jokes. Mostly just observations, usually something sexist.\n\n\nbut the \"humor\" here is a reference to the bishop Mariann Edgar Budde asking for empathy from Trump and everyone else, and trump said it was an evil thing to say and she should apologize. So trumpers just do what their told and are saying empathy is evil. This was about 2 months ago, around inauguration time.\n\n\n\nextrapolating from that, the \"devil on her shoulder\", which is what tells you to do bad things, is now confused as apparently it's evil to care about other people. not pictured here is the angel on her other shoulder, which tells you the right thing to do, and would probably also be confused. \n\n\nthe author didn't bother to put the devil actually on/above her shoulder because they assumed people would understand what they were trying to do I suppose.",
            "score": 3,
            "replies": []
        },
        {
            "author": "residentweevil",
            "body": "I don't want to sound like a wingnut, but think through the initiatives by the current admin on social programs.  Assume they do all they say they want to, and end entitlements entirely.  No more Social Security, Medicaid, Disability, etc.  \n\n\n\nWhat are all of those millions of Americans that are too elderly or infirm supposed to do?  There is a substantial population of Americans that rely on government programs to survive.  Literally survive.  So if they take away all of those entitlements, either the states step up their entitlement programs or these people just...die.  Can you imagine a state like Alabama stepping up entitlements to close the gap?  Neither can I, and I live here.\n\n\n\nSo here is where the \"sin of empathy\" rhetoric comes in.  They are laying the groundwork for people to watch these mass deaths without revolting against their masters.\n\n  \nPart of me think this is the tip of the spear for a population culling.  Look, as long as there have been classes in society, the aristocracy has railed against the filthy plebeians getting any resources allocated to them.  The \"parasite class\" in their thoughts, and certainly not worth any empathy.  However, the plebeians have always been essential in a way, doing the work that no one else would.\n\n  \nHowever, this time around there is a wildcard.  Most, if not all, menial jobs will be soon automated with AI and robotics.  Doesn't matter if this is based in real fact or not, if Musk and company believe it and are shaping the world around it.  So, run small businesses and farmers into bankruptcy, megacorps buy up all the assets and replace the workers with AI-run robots and let all of the suddenly extraneous lower and lower-middle class folks kill each other and starve to death.  \n\n  \nThen there is less competition for resources, less needs to be allocated to the filthy poors, and there is no drop in goods and services thanks to the robots.  More money for a trip to Mars by the way.  \n\n  \nLogically, if most menial jobs will soon be replaced by AI and robotics, there are only two options for the displaced worker class.  Provide a Universal Basic Income, or let them die.  Which option do you think will appeal to the current administration?  If many people \"commit the sin of empathy\" then this whole plan falls apart, hence the foundational groundwork being laid here.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cutiewho",
            "body": "I know this what this referencing- but it’s also funny to think even the devil was like ‘y’all need to chill, try caring about one another’",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cyg4nn",
            "body": "I II II L",
            "score": 2,
            "replies": []
        },
        {
            "author": "Arimer",
            "body": "It's better not to get involved in the ongoing pizza cake drama of reddit.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Wordshurtimapussy",
            "body": "pizzacomics is the most unfunny piece of garbage.",
            "score": 2,
            "replies": [
                {
                    "author": "CaptainAksh_G",
                    "body": "Username checks out",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Epyphyte",
            "body": "Is this about Blooms book, Against Empathy: The Case for Rational Compassion?\"  He believes empathy increases the likelihood of emotional exhaustion and increases in-group bias among other things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "adamempathy",
                    "body": "https://preview.redd.it/wrvax042bgpe1.jpeg?width=1080&format=pjpg&auto=webp&s=f05599622e73b160298c81f31a04860d7f04e5b0",
                    "score": -5,
                    "replies": []
                },
                {
                    "author": "Breath_Deep",
                    "body": "https://preview.redd.it/sy5b2p9q2hpe1.jpeg?width=216&format=pjpg&auto=webp&s=0e91c5236f8a84ff9e18c1df2249488f3c91d63e",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CommercialTie727",
            "body": "And Elmo added another coat…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kitchen_Device7682",
            "body": "The comic is already explained and the top answers seem to be accurate, but it's interesting that in modern Greek empathy means hatred or malevolence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "parthamaz",
            "body": "\"Let us not therefore judge one another any more: but judge this rather, that no man put a stumblingblock or an occasion to fall in his brother's way.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "indifferentgoose",
            "body": "Friendly reminder that you should not talk with people who agree that empathy is a sin. These people are the enemy and wage war against you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheUniqueKero",
            "body": "I mean, just look at the state of the world right now, empathy for the less fortunate is seen as a weakness. If you are going through a rough patch in life, or fled your country looking for a better life, you're lazy, entitled, and deserving of suffering.\n\nI saw a trumper the other day tweet \"Knowing jesus changes your life\" and then literally in the same day shared videos of the prisoners in venezuela saying that non-american citizens don't have constitutional rights. These people are sick.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guba_the_skunk",
            "body": "I don't understand how you don't get the joke.  Even devoid of the actual context of the joke... It's her personal \"devil\" confused as to why empathy, a thing taught in the bible, is now a sin.  even without the political context the joke is funny.",
            "score": 1,
            "replies": [
                {
                    "author": "xdiox66",
                    "body": "The political context is where the joke is.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Guba_the_skunk",
                            "body": "The joke works absolutely fine without it, why would empathy ever be considered a sin?  The context is it's a political joke, withiut context it's just a religion joke.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Turbo-Corgi",
            "body": "Empathy is a sin to the right because it means they care about someone other than themself. Sure they can have a wife and kids, but the wife is there to make him look good, and whoa be the child that embarrasses him with bad grades or not acting properly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Financial-Working132",
            "body": "Because now days you can get in trouble for showing empathy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zaphodb-42",
            "body": "A more direct reference may be[ the quote](https://www.snopes.com/fact-check/elon-musk-empathy-quote/) by Elon Musk on \"The Joe Rogan Experience\" where he said \"The fundamental weakness of Western civilization is empathy.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShaggyLR76",
            "body": "There’s no way you don’t get this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EmotionalJoystick",
            "body": "What don’t you get?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Qwqqwqq",
            "body": "reddit pls\n\nhttps://preview.redd.it/f8iqlbvuxgpe1.png?width=748&format=png&auto=webp&s=a5e175de76410b4934805dc25e3cd1291537d784",
            "score": 1,
            "replies": [
                {
                    "author": "CaptainAksh_G",
                    "body": "One is a subreddit for comics, and the other is full of brain-dead people who's the literal epitome of this pic\n\nhttps://preview.redd.it/xyc1cv04ahpe1.jpeg?width=645&format=pjpg&auto=webp&s=9512cfccb17f6d49023d94f059289ab6b8114ed6",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Misubi_Bluth",
            "body": "If we define sin as \"Thing gods don't like,\" human selfishness is supposed to be one of those things God absolutely loathes. It can then be construed that \"selfishness\" is one of the worst sins you can commit. The idea that demons are rebelling against God by...treating others with compassion...is antithetical to both demons and god.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shua4887",
            "body": "It is ironic,  G.M. Gilbert (prosecutor) found lack of empathy to be the trait that defined evil during the Nuremberg Trials.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hearth_witch",
            "body": "There is a possible related reference to a video of Elon Musk saying that empathy is the fundamental weakness of Western civilization, but it's pretty recent, and the comic might be older.\n\nhttps://www.cnn.com/2025/03/05/politics/elon-musk-rogan-interview-empathy-doge/index.html",
            "score": 1,
            "replies": []
        },
        {
            "author": "loicvanderwiel",
            "body": "In January, the Right Reverent Budde (Episcopal Bishop of Washington) called in a sermon (in front of D. Trump) for compassion and mercy for LGBT and immigrant communities.\n\nhttps://www.bbc.com/news/videos/cn4mwe3lk9wo\n\nThis enraged some people, including some idiot who called on people to not \"commit the sin of empathy\" : https://x.com/tompawnbadil/status/1882115502061068777?lang=en",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wooden-Ad-9925",
            "body": "Do we want Cenobites? Coz THIS is how we end up with Cenobites. 💯",
            "score": 1,
            "replies": []
        },
        {
            "author": "atlashoth",
            "body": "I think you have to be on Twitter as much as I'm on dota2, (+50hr/wk) to get it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "2327_",
            "body": "I already blocked pizzacake, can you put a spoiler on it next time, u flashbanged me bro",
            "score": 1,
            "replies": []
        },
        {
            "author": "navetzz",
            "body": "I guess this is the daily occurence of people reducing empathy to compassion",
            "score": 1,
            "replies": []
        },
        {
            "author": "Afraid-Care-5226",
            "body": "It's a leftist strawman, as usual.\n\nNot all people deserve empathy, or help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "greasy_weggins",
            "body": "Funniest pizzacake comic",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interest-Small",
            "body": "And so goes Sympathy. Hooray for Apathy!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThisPresentation5291",
            "body": "Shes so painfully unfunny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xerxes_dandy",
            "body": "Good devil like in Terry pratchetts the good omen",
            "score": 1,
            "replies": []
        },
        {
            "author": "tired-but-determined",
            "body": "There is that one story I've read a few times about a guy giving food to a homeless person near his workplace, and the next day he gets fired for \"feeding the animals\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gnarwhill",
            "body": "In recent years some Far Right Christians have said oddly unchristian things like \"do not commit the sin of empathy.\".\n\nThis comic pokes at that by using the \"Devil and Angel on my shoulders\" metaphor for judgement.\n\nUsually, the devil encourages you to do bad things like being mean to people for no gain, doing drugs when you know you shouldn't, being selfish or just being not helpful to yourself. \nThe Angel typically encourages you to do good things like being kind to others, sharing, being selfless, showing gratitude for yourself and having empathy.\n\nIn this skit, the devil is confused because it's supposed to teach her to be nice to others and try to understand what other people struggle with in life, the twist, it's a Devil not teaching \"good\" instead of an Angel.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SculptusPoe",
            "body": "Left wing straw man. Move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kpingvin",
            "body": "*insert pizzacke copypasta*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheLobst3r",
            "body": "It’s a bone hurting juice meme",
            "score": 1,
            "replies": []
        },
        {
            "author": "mustard138",
            "body": "Can't remember which one of them said it. But I did hear before the election. One of the televangical church people,  one of the mega church nut job ministers, mentioned that people should be careful about the sin of empathy...\n\nChristian leader calling empathy a sin. \n\nThe followers of Christ. \n\nCalling empathy a sin....",
            "score": 1,
            "replies": []
        },
        {
            "author": "Delicious-Ad5161",
            "body": "Another thing this could be in reference to is Elon Musk going on the Joe Rogan podcast and saying that Empathy is the weakness of Western Culture.",
            "score": 1,
            "replies": []
        },
        {
            "author": "N4t41i4",
            "body": "Musk just said 'The fundamental weakness of Western civilization is empathy.'",
            "score": 1,
            "replies": []
        },
        {
            "author": "dividedwefall1933",
            "body": "The year is 2025, and humanity is getting ready to eat itself outa anger",
            "score": 1,
            "replies": []
        },
        {
            "author": "Repulsive-Square-593",
            "body": "something about you should care about other people bla bla. I care about only one person and thats me :D.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fibstheman",
            "body": "This isn't a joke, it's propaganda - part of an ignorant debate between political puppets who do not understand the concepts they are weaponizing against humanity.\n\n**EMPATHY** is the ability to *understand* the thoughts and feelings of others. **SYMPATHY** is the tendency to *feel bad for* the negative experiences of others. These are not the same thing and the terms are not interchangeable.\n\nSerial killers have supreme empathy but zero to negative sympathy. They use their keen understanding of the thoughts and feelings of others (ie empathy) to prey upon them more effectively, but they are either indifferent to or *enjoy* the suffering of their victims (ie no sympathy.) Ted Bundy, for instance, would pretend to be injured so that women would approach to help him.\n\nThe **SIN OF EMPATHY** refers to supposedly unethical actions taken under the guise of empathy or sympathy. For instance, forcibly shaving everyone bald so that cancer patients do not feel excluded for losing their hair.\n\nThe problem is that political puppets, presuming whatever they do not like is objectively unethical, pretend that empathy = sympathy = sin of empathy. And rather than set the record straight, social media warriors instantly concede this grand delusion, and strut around with their hands on their hips irrelevantly boasting about how they're committing the sin of empathy, because smugly cawing stupid things that have no bearing in reality is all social media is able to do.\n\nThe entire \"debate\" is founded on poor comprehension, conceit, and objective falsehood, and should be shown away at the door. When speaking of adult topics we should not seek wisdom from children.",
            "score": 0,
            "replies": []
        },
        {
            "author": "KillMeNowFFS",
            "body": "bro.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldSoul4NewGen",
            "body": "Hmmm... I wonder. If they are teaching this, and children of today were exposed to this teaching (y'know, they usually abosrb things they are taught at a young age) are we making a new generation of psychopaths?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amethyst271",
            "body": "honestly its not even a good joke or comic",
            "score": 0,
            "replies": []
        },
        {
            "author": "GIRose",
            "body": "In the eyes of a lot of Christo-fascist type people have for a while now (brought to the wider light of public consciousness by recent events) viewed empathy as a sin. \n\n[If you want to try and grok this stupid worldview, this is the oldest article I could find online from 2019](https://www.desiringgod.org/articles/the-enticing-sin-of-empathy) but be forwarned this is basically rambling incoherent mess of words if you, like me, aren't already neck deep in weird American Christian \"Us vs Them\" rhetoric",
            "score": 1,
            "replies": []
        },
        {
            "author": "Diligent-Chance8044",
            "body": "It references Trump and others stating empathy is bad. Just to explain why empathy is bad in their opinion it has lead the US to care too much about others and we have started to disregard our own problems as we spread too thin. People are also caring too much about the worst people. Empathy is good when talking about sick children or homelessness or veterans. We need to care less about particular groups and care more about our own people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "acidbatterydude",
            "body": "Careful you might get sued",
            "score": 1,
            "replies": []
        },
        {
            "author": "dirigibles21",
            "body": "This is what fully convinced me that Satan is the good guy",
            "score": 1,
            "replies": []
        },
        {
            "author": "FragrantAd2497",
            "body": "The people/religion in control of the US right now are trying to make empathy out to be a dangerous and evil and selfish feeling to have in order to make those who care about other people look like enemies to the nation/Christianity. To make empathy out to be wrong or abnormal or misled.\n\nIt's about control and subduing opposition. \n\nIf caring about other people is bad, then people won't express concern when others are negatively impacted (specifically minorities or others who would be considered outside strict \"norms\"). That's the idea anyway.\n\nOnly problem is, everyone knows what empathy is. So there's no real way of making it sound bad without looking like a buffoon to anyone capable of logic and reason.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Meowster11007",
            "body": "So the people wearing symbols on their head that represent their idol are saying *don't* look upon the snake, and that empathy is a sin. The irony",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soisoi-77",
            "body": "Republicans have been telling their followers not to fall for the sin of empathy. That's the whole joke. That the God-fearing Republican party of the United States of America believes empathy is a sin",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shikatsuyatsuke",
            "body": "To be fair, in regard to what this meme is referencing, too much empathy isn’t a good thing.\n\nToo much of anything isn’t a good thing. A balanced approach is ultimately what should always be the goal on any matter or solution to a problem.\n\nToo much order is tyranny. Too much chaos is anarchy. Neither is good. But a balance of the 2 is.  A balance doesn’t automatically mean 50/50. Balance is circumstantial to any current situation its needs. So 70/30 or 40/60 could be the ideal balance between 2 opposing forces.\n\nToo much empathy has lead to some obnoxious problems in society over the past decade or so.  PC culture, death of comedy, lower quality entertainment (in the west), cancel culture, gender wars, extreme division in politics, etc.  \n\nThere has been a serious imbalance and overabundance of empathy to the point where it’s been weaponized and used by corporations, media outlets, politicians, influencers especially, and many more for personal gain far more than for actual good.\n\nIt’s literally the same logic that was used during the Crusades where something supposedly good like spreading civilization and Christian values was used for personal gain and subjugation of others under the guise that there action were sanctioned by a god.  Empathy is just that god this time. \n\nI came to the conclusion that there was too much empathy in our society to the point where it was doing more bad than good a couple of years ago. I’ve spoken with a few friends and my parents about this subject. Gotten quite a bit of push back, and probably will here too. But everyone learns sooner or later than balance is the key to most things. Doesn’t matter how we feel about an opposing concept or approach to something. Balance is usually still the ideal goal that appeals to all aspects of a problem or desire or whatever.\n\nToo much empathy is just as problematic as too much of any other approach to the problems of our society today.  Attack or downvote me all y’all want for saying this.  If I cared I wouldn’t have posted this comment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yesterdayandit2",
            "body": "None of what you said was empathy or caused by empathy. Theres much more nuance. Be fine with lower levels of empathy in life but it isnt empathy that caused any of what you said. Empathy is literally just the ability to understand anothers perspective, point of view and experiences despite not directly havibg experienced it yourself. Thats it. Most people use SYMPATHY as a weapon. Most people try to act on behalf of others because they THINK they have empathy for them. Please recognize the difference. Lack of empathy is Sociopathy. Though they arent evil, it can cause much more devastating effects when unchecked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shikatsuyatsuke",
            "body": "Sure you can say it isn’t “real” empathy.   If it was real empathy, a lot of the nonsense I described might not have transpired the way they have and still do.  But it’s been justified because of empathy or counterfeit empathy or whatever you’d want to call it.\n\nJust like how the Crusades didn’t portray or spread real Christian values.  But they said they did and history looks poorly on Christianity as a result, despite the lack of Christian values there.\n\nEmpathy is the intent behind much of what I described. Even if empathy isn’t what’s been exercised throughout all of those things.\n\nBut I actually think empathy has been very present. I believe it’s why so much of society and the common public have bought into and given so much power and authority to most of the nonsense. Lots of bad or ineffective things happen despite good intentions.  People with agendas and power have just taken advantage of the empathy present.\n\nIt’s the same reason why powerful world leaders like Hilter have been able to come into power through the vote of the people. A large build up of mutually shared sentiments becomes a tool that can be tapped into, used to unite a people for common objectives. For good or for bad, or more often something in between. It’s the same reason why someone like Trump was able to win the popular vote. He took advantage of a common sentiment of dissatisfaction with the government mingled with the promise of “change”.  Whether those changes will be good or not is another discussion. But changes are being made and we’ll get to experience the positive and/or negative repercussions in the coming future.\n\nEmpathetic intent has been weaponized over the past many years to the negative consequence of many, despite some of the good that may have also come.  I’m confident that we’ll experience some similar things with the desire for “change” being implemented in the government.  Hopefully more good than bad, but that’s ultimately unlikely given the track record of history where these uniting sentiments always get taken too far. We’ll have to wait and see with time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "disdkatster",
            "body": "This continues to be my favorite comic strips",
            "score": 1,
            "replies": []
        },
        {
            "author": "Uusari",
            "body": "This artist is a tool. She'll get you banned for any criticism.",
            "score": -9,
            "replies": []
        },
        {
            "author": "erejum31",
            "body": "In this case, \"criticism\" = hating on her because she's progressive and a woman",
            "score": 4,
            "replies": []
        },
        {
            "author": "TruPOW23",
            "body": "Leaving out the ‘very unfunny’ factor",
            "score": 3,
            "replies": []
        },
        {
            "author": "jamesick",
            "body": "no it's because her comics arent funny and if you mention that they'll say you're being horrible because she's a woman.",
            "score": 9,
            "replies": []
        },
        {
            "author": "PhysicalGraffiti75",
            "body": "I think they’re pretty funny. What about them do you think isn’t funny?",
            "score": -1,
            "replies": []
        },
        {
            "author": "jamesick",
            "body": "the lack of jokes or comedic value mostly",
            "score": 9,
            "replies": []
        },
        {
            "author": "PhysicalGraffiti75",
            "body": "I disagree I think they’re pretty funny and I like the jokes. Maybe you don’t get the jokes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jamesick",
            "body": "i get jokes, they’re bottom of the barrel gutter jokes. if that’s what you’re into that’s fine, can’t fault you for that. there’s something for everybody.",
            "score": 7,
            "replies": []
        },
        {
            "author": "astral_immo",
            "body": "defending pizzacake comics is a hell of a hill to die on",
            "score": 8,
            "replies": []
        },
        {
            "author": "PhysicalGraffiti75",
            "body": "Making a big deal about something that has literally no effect on your life seems like an even weirder hill to die on.\n\nMost people just ignore things they don’t like and go on about their business.\n\nBlocked me after replying lol, scared?",
            "score": -3,
            "replies": []
        },
        {
            "author": "reddituser8719192",
            "body": "likely just annoyed",
            "score": 5,
            "replies": []
        },
        {
            "author": "penanceffect",
            "body": "https://preview.redd.it/zce0ynk0ygpe1.jpeg?width=208&format=pjpg&auto=webp&s=371b9d0708984af1bf4a99fba5a918029815b1f1\n\nyea I’m sure they were horrified",
            "score": 4,
            "replies": []
        },
        {
            "author": "penanceffect",
            "body": "not really, she just posts stuff that makes you say “yikes” sometimes whether it’s cringe (the picture of her riding the moose) or a bad take (the comic about men’s mental health). she isn’t immune to criticism because she’s progressive and a woman\n\nEdit: you’re allowed to like pizza cake but disregarding all criticism on her comics as “hate because she’s a woman” is straight up wrong. If you’re allowed to like things people are allowed to dislike things 🫃",
            "score": 7,
            "replies": []
        },
        {
            "author": "esplonky",
            "body": "Do you know about PizzaCakeCat at all?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Peritous",
            "body": "If your criticism is a bigoted point of view then yeah you'll usually get banned from the comics subreddit.",
            "score": 0,
            "replies": []
        },
        {
            "author": "UponAPaintedOcean",
            "body": "Your response is as good-faithed, nuanced, and funny as a pizzacake comic. I honestly believe you enjoy them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "astral_immo",
            "body": "\"hurdur not liking comics made by a woman makes you a bigot, hope this helps :)))\"",
            "score": 6,
            "replies": []
        },
        {
            "author": "Peritous",
            "body": "Aww, the intellectuals are coming out to play.",
            "score": -4,
            "replies": []
        },
        {
            "author": "astral_immo",
            "body": "assuming women can't be criticized is very intelligent and enlightened, indeed",
            "score": 7,
            "replies": []
        },
        {
            "author": "esplonky",
            "body": "The criticism is typically that her comics are cringe and unfunny. This one's a bit of an outlier as it's sort of serious, but her typical comics are just 15 year old Tumblr girl humor. One of them was just \"haha girl has short fingernails only on her index and middle finger\" and the punchline was her doing the mischevious Peter Parker face. \n\nThe mods have access to her nudes and don't want to lose it, so they ban anyone who says \"yeah this isn't funny\" lol. It's nothing to do with her views and everything to do with how not-funny she is, and the reasons she's \"untouchable\"",
            "score": 8,
            "replies": []
        },
        {
            "author": "PhysicalGraffiti75",
            "body": "So you just don’t get the jokes. And that upsets you. Weird.",
            "score": -12,
            "replies": []
        },
        {
            "author": "Uusari",
            "body": "Noooo? What upsets me is that she feels privileged. She threatened to sue reddit over comic cirlcejerks, and one would get banned off of r/comics for simply bringing said fact up or criticising her in any even constructive manner.",
            "score": 9,
            "replies": []
        },
        {
            "author": "PhysicalGraffiti75",
            "body": "Yeah I highly doubt that’s the real story.",
            "score": -6,
            "replies": []
        },
        {
            "author": "astral_immo",
            "body": "go try it then and find out for yourself. I was banned for asking what the joke was on one of her comics.",
            "score": 8,
            "replies": []
        },
        {
            "author": "inthevendingmachine",
            "body": "Look into it. It's true. She went on a severe misandry/toxic femininity attack against males, and when there was a backlash, she went crying to the moderators, who in turn went very one-sided into the investigation.",
            "score": 7,
            "replies": []
        },
        {
            "author": "esplonky",
            "body": "If that's your takeaway, then you might want to work on your reading comprehension",
            "score": 8,
            "replies": []
        },
        {
            "author": "PhysicalGraffiti75",
            "body": "I get the jokes so my reading comp is perfectly adequate. I think maybe you need to work on it considering you don’t seem to understand what is implied in the quote you provided.",
            "score": -7,
            "replies": []
        },
        {
            "author": "astral_immo",
            "body": "found pizzacake's alt account",
            "score": 6,
            "replies": []
        },
        {
            "author": "esplonky",
            "body": "Point to where I indicated that I didn't understand the joke in her comic about someone trimming their nails to finger themselves/someone else lmao. \n\nThe joke is sex",
            "score": 6,
            "replies": []
        },
        {
            "author": "TonyGalvaneer1976",
            "body": "Why do you assume that?",
            "score": -5,
            "replies": []
        },
        {
            "author": "Digital0asis",
            "body": "https://preview.redd.it/2bm6k913fgpe1.jpeg?width=195&format=pjpg&auto=webp&s=d1f02841f1971213665b05a0ca0f8193e2f17c2f\n\nThink it's this. Elon said Empathy is weakness.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Big_Bat9969",
            "body": "There’s nothing to get with pizza cake trust me seen enough of it. It’s vapid “edgy” validation seeking echo chamber nonsense.",
            "score": -5,
            "replies": []
        },
        {
            "author": "TonyGalvaneer1976",
            "body": "What's edgy about it?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Big_Bat9969",
            "body": "Edgy was in quotes because nothing is actually edgy about it, the series just thinks it’s edgy by being indignant toward the right, which is obviously common sentiment so not actually rebellious or whatever. It’s the tired “spreading awareness” when honey, everyone’s aware. You can try something original it’s okay.",
            "score": -6,
            "replies": []
        },
        {
            "author": "TonyGalvaneer1976",
            "body": "Clearly not everyone's aware since trump won the popular vote. And what makes you think the comic thinks it's being edgy?",
            "score": 6,
            "replies": []
        },
        {
            "author": "voppp",
            "body": "if everyone were aware we wouldn’t be here, dealing with fascism in real time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Big_Bat9969",
            "body": "“Dealing with”? How exactly. This is the edgy stuff I mentioned. You’re not fighting the power, you’re not going to jail defending your values. You’re whining on Reddit like everyone else. If you really truly believed that this was the new reich or whatever they call it, you should be out physically doing something about it. But you’re not. So either you’re the worst kind of coward, or you are exaggerating for doomer cosplay, pick your poison.",
            "score": 1,
            "replies": []
        },
        {
            "author": "silent_b",
            "body": "Orange man bad",
            "score": -2,
            "replies": []
        },
        {
            "author": "Williamthewicked",
            "body": "The joke is Pizzacake comics sucks and if you talk about them, you get banned from the comics subreddit. It's an oddly controversial subject and I'm probably banned.... Which would matter a lot more if I hadn't left that sub for precisely this reason.",
            "score": -10,
            "replies": []
        },
        {
            "author": "TonyGalvaneer1976",
            "body": "Do you have evidence of that?",
            "score": -2,
            "replies": []
        },
        {
            "author": "jamesick",
            "body": "i asked what the joke was in one of her comics like 3 years ago and was banned lol",
            "score": 5,
            "replies": []
        },
        {
            "author": "TonyGalvaneer1976",
            "body": "X > doubt",
            "score": -5,
            "replies": []
        },
        {
            "author": "jamesick",
            "body": "well that’s entirely up to you isn’t it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Dat_yandere_femboi",
            "body": "Me when I lie",
            "score": -1,
            "replies": []
        },
        {
            "author": "jamesick",
            "body": "feel free to go to the subreddit and do the same thing :-)",
            "score": 4,
            "replies": []
        },
        {
            "author": "ComfortableDrive79",
            "body": "Keep glazing, and while you are on to it, sub to her patreon or whatever.",
            "score": 2,
            "replies": []
        },
        {
            "author": "astral_immo",
            "body": "I love the two people in literally every reply in this thread desperately trying to defend pizzacake lmao\n\n\"dO u HaVe AnY pRoOf, of this thing I can easily go and verify myself? checkmate :)\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "OnionsHaveLairAction",
            "body": "right wing folks on podcasts have been going around saying empathy is a sin and will be the fall of western civilization",
            "score": 0,
            "replies": []
        },
        {
            "author": "xlayer_cake",
            "body": "Only thing to get is she is painfully unfunny and doesn't know how to do punchlines",
            "score": -7,
            "replies": []
        },
        {
            "author": "BitSevere5386",
            "body": "the punchline is good if you are aware of how real this is",
            "score": 2,
            "replies": []
        },
        {
            "author": "Roflcopter_Yes",
            "body": "Yeah because calling out a real life issue with no hint of comedy is super funny and it automatically makes the punchline hit!",
            "score": 2,
            "replies": []
        },
        {
            "author": "BitSevere5386",
            "body": "you not having the same sense of humour as other doesnt mean it lack any comedy",
            "score": 2,
            "replies": []
        },
        {
            "author": "Roflcopter_Yes",
            "body": "Reddit humor is not actual humor and Mrs. Pizza is the epitome of Reddiy humor.",
            "score": 2,
            "replies": []
        },
        {
            "author": "voppp",
            "body": "Pizzacake is actually successful and talented and that seems to bother you lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "voppp",
            "body": "yeah and all her success is because she’s *checks notes* unfunny",
            "score": 0,
            "replies": []
        },
        {
            "author": "xlayer_cake",
            "body": "No accounting for taste",
            "score": 1,
            "replies": []
        },
        {
            "author": "LanceTHEcolton",
            "body": "https://preview.redd.it/3uhdl62kegpe1.jpeg?width=1080&format=pjpg&auto=webp&s=06c165441e17772d09676d61d1645d5a5011b110",
            "score": -3,
            "replies": []
        },
        {
            "author": "Breath_Deep",
            "body": "https://preview.redd.it/xdphprq72hpe1.jpeg?width=720&format=pjpg&auto=webp&s=2337a0b5d5df361941c75c8250a7ddd33d4bd5cb",
            "score": 1,
            "replies": []
        },
        {
            "author": "NobodyofGreatImport",
            "body": "This artist is a grifter who makes comics falsely portraying all conservatives as evil and heartless, often latching on to what far-right extremists say and presenting it as if it were the mainstream belief. Also, just making things up.",
            "score": -12,
            "replies": []
        },
        {
            "author": "flirtmcdudes",
            "body": "“Falsely portraying”",
            "score": 8,
            "replies": []
        },
        {
            "author": "NobodyofGreatImport",
            "body": "Are you saying that all conservatives are evil and heartless people?",
            "score": -7,
            "replies": []
        },
        {
            "author": "flirtmcdudes",
            "body": "no, they simply voted for the evil person with 0 empathy who is currently destroying democracy.\n\nI guess your argument is gonna be if you give a gun to a murderer, you’re not a murderer right?",
            "score": 8,
            "replies": []
        },
        {
            "author": "NobodyofGreatImport",
            "body": "Trump is neither heartless nor destroying democracy. And no, if you don't murder someone, you're not a murder. But seeing as how murder isn't even involved in this situation, I don't understand why you brought that up.",
            "score": -5,
            "replies": []
        },
        {
            "author": "flirtmcdudes",
            "body": "Trump is openly ignoring judges orders and says he will keep doing it. But sure, he isn’t destroying democracy. So you’re right, you don’t understand",
            "score": 8,
            "replies": []
        },
        {
            "author": "gr1zznuggets",
            "body": "Bro is you think Trump has compassion there’s not much hope for you.",
            "score": 7,
            "replies": []
        },
        {
            "author": "kejovo",
            "body": "Nobody doubts your lack of understanding",
            "score": 5,
            "replies": []
        },
        {
            "author": "NobodyofGreatImport",
            "body": "Going for personal attacks already? Didn't expect to win this fast.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gilbert_Grapes_Mom",
            "body": "You thinking that’s a “win” just further proves the comment they made lmfao",
            "score": 4,
            "replies": []
        },
        {
            "author": "NobodyofGreatImport",
            "body": "Ad hominem is usually a sign that you're losing, grasping at straws. They don't have a real argument, so instead they're trying to hurt my feelings.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gilbert_Grapes_Mom",
            "body": "Lmfao sure\n\nETA: they downvote every response immediately, I think they got their feelings hurt lol",
            "score": 4,
            "replies": []
        },
        {
            "author": "whiskey_at_dawn",
            "body": "Trump is a rapist, he's a racist, he's a transphobia, he's an all-around monster.\n\nThe best thing you can be as someone who voted for him is someone who is blind to all of those issues.\n\nThe worst you can be is someone who supports those behaviors and ideologies.",
            "score": 3,
            "replies": []
        },
        {
            "author": "NobodyofGreatImport",
            "body": "Oh, I didn't vote for him",
            "score": -2,
            "replies": []
        },
        {
            "author": "MintyMoron64",
            "body": "Doubt",
            "score": 2,
            "replies": []
        },
        {
            "author": "whiskey_at_dawn",
            "body": "Have you heard of the \"generic you\"? That's the \"you\" I meant. It's used in place of \"one\" in informal speech.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MintyMoron64",
            "body": "AHAHAHAHHAHHAHAHHAHAHHAHAHAHAHAH\n\n\nOh, that's a good-\n\n\nWait, hold on, you're serious?\n\n\nExcuse me a moment, I need to laugh harder.\n\n\n# TCHEHEHEHAHAHAHAHAHAHAYAHEHEHEHAHHEHAHHEHHAHAHAHAHEHHAAHA *(Coughing)* HHH *(More coughing)* *(breathing normally again)* HAHAHAHAAHAHAHEHEHEAHAHA",
            "score": 1,
            "replies": []
        },
        {
            "author": "BitSevere5386",
            "body": "We are saying that \"Empathy is a sin\" is a real thing said by conservative.",
            "score": 4,
            "replies": []
        },
        {
            "author": "NobodyofGreatImport",
            "body": "Yes, it's something real that was said, and further parroted by other right-wing extremists, but it is not the mainstream belief.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BitSevere5386",
            "body": "Book about the Sin of Empathy are being shared in evangelical group and are growing more and more popular. Other proeminent figure such as Elon musk which is a leading figure of the right also said that empathy is a weakeness.\n\n\nThe lack of empathy is one of the most common trait  in MAGA. \n\nThey couldn t care about anything if it doesnt impact them directly.  Or if it doesnt impact their cult.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TonyGalvaneer1976",
            "body": "https://preview.redd.it/lhz8rr96ygpe1.jpeg?width=267&format=pjpg&auto=webp&s=1e6e9448e1e08f5d65b743dbadf0b5b471279028",
            "score": 2,
            "replies": []
        },
        {
            "author": "NobodyofGreatImport",
            "body": "Wow. That's a very harmful belief. What about people like Nick Freitas? He's a good dude. Blair White? They're a good person. Binary thinking does nobody good, and by saying \"everyone who does not agree with my beliefs is evil,\" you're continuing the problems we face.",
            "score": -1,
            "replies": []
        },
        {
            "author": "GoldNovaNine",
            "body": "https://preview.redd.it/h49au5ahoipe1.jpeg?width=750&format=pjpg&auto=webp&s=6260a3753667f6f3fe3bf9f4ff872c6b3eb5a64a\n\nYou are bad people, you're just too unintelligent to realize it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "GoldNovaNine",
            "body": "Yes\n\nhttps://preview.redd.it/r8j6xm7foipe1.jpeg?width=2048&format=pjpg&auto=webp&s=e173ca397986e20e78fdabcbeae857b1a10864c7",
            "score": 1,
            "replies": []
        },
        {
            "author": "TonyGalvaneer1976",
            "body": "Far right extremists ARE the mainstream Republican party right now. Sorry, that's just where we're at right now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Chameleos",
            "body": "A comic written by someone who had 0 understanding how real empathy works",
            "score": -4,
            "replies": []
        },
        {
            "author": "BitSevere5386",
            "body": "sure buddy sure.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jade_Templar",
            "body": "I have said it many times, and I will say it again today... Christianity is not a religion, it is a lifestyle. Catholic is a religion that follows Christ, Methodist is a religion that follows Christ.\n\nYou can, and I am, a Christian without belonging to a religion. Folks should try it, you don't need a lot of rules and procedures, and whatnot. You simply need a relationship with Jesus.",
            "score": -1,
            "replies": []
        },
        {
            "author": "TonyGalvaneer1976",
            "body": "How is that fundamentally different from a religion?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MintyMoron64",
            "body": "It isn't but they don’t want to be associated with other sects",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jade_Templar",
            "body": "A religion has very specific rules that have to be followed. For example if you are a Mormon you are expected to give 10 percent of your earnings to the church, Catholics pray to the Virgin Mary, etc.\n\nI only have 10 rules that define sins and the main rule that Jesus preached, love everyone like he loves you.",
            "score": 0,
            "replies": []
        },
        {
            "author": "TonyGalvaneer1976",
            "body": "So in other words, you have very specific rules that have to be followed. Congratulations, you have a religion even by your own definition.",
            "score": 1,
            "replies": []
        },
        {
            "author": "N-economicallyViable",
            "body": "Universal and unrestricted empathy, is cruelty to the innocent.\n\nIf you have empathy for the mugger and let them out earlier... They mug again.  Go easy on the young murderers and they kill again.\n\nEmpathy for the violent and dangerous is cruelty to the weak and innocent.",
            "score": -1,
            "replies": []
        },
        {
            "author": "ProfessionalCreme119",
            "body": "The bullet point like presentation emphasizes the one dimensional thinking behind this.\n\nIt requires no critical thought or logic. Just 1+1=2\n\nBy your logic:\n\n-God is love\n\n-Love is blind\n\n-Therefore Ray Charles is God\n\nAnybody can do it. You just have to shut your brain off. \n\nBut at the end of the day this is the way conservatives want people to think. And why they are afraid of colleges making people think critically.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MintyMoron64",
            "body": "Cool but the idea here is that empathy itself is viewed as inherently a moral failure by a frankly unreasonable amount of people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YujiroRapeVictim",
            "body": "its to promote her OF nothing else",
            "score": -5,
            "replies": []
        },
        {
            "author": "AnyImpression6",
            "body": "Panel 2 and 4 don't need to exist.\n\nEdit: How am I wrong? The actual \"joke\" is conveyed by panel 1 and 3. 2 and 4 are pointless.",
            "score": -2,
            "replies": []
        },
        {
            "author": "reddituser8719192",
            "body": "panel 1 and 3 also don't need to exist",
            "score": 2,
            "replies": []
        },
        {
            "author": "Black-Patrick",
            "body": "Empathy is understanding someone else’s perspective, not compassion towards it.",
            "score": -5,
            "replies": []
        },
        {
            "author": "MysticBimbo666",
            "body": "Empathy is feeling other people’s feelings, not understanding them. Like when a sad scene in a movie makes you cry.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Black-Patrick",
            "body": "Empathy allows for the exploitation of vulnerability. You are attaching a positive connotation to the concept that is etymologically more neutral despite colloquial application.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Zyfoud",
            "body": "A dictionary is meant to help you understand a word, not limit its meaning. \n\nEmpathy can include both understanding and sharing feelings",
            "score": 5,
            "replies": []
        },
        {
            "author": "Black-Patrick",
            "body": "Right. Like I said empathy doesn’t include compassion and can be negative depending on context.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zyfoud",
            "body": "Don't get me wrong your second comment was respectably measured and makes a good point, but you keep doubling down on the dictionary definitions of compassion and empathy and trying to pretend colloquial or multifaceted usage is less valid which is still silly.\n\nSympathic feelings can also be felt empathetically (eg Comisserate). Just because the words can be used for different situations doesn't mean they also can't be applied to the same situations",
            "score": 1,
            "replies": []
        },
        {
            "author": "Black-Patrick",
            "body": "I feel that language is dumbed down when colloquial usage gives a negative or positive connotation to an otherwise neutral word. The doubling and dumbing down is the insistence on the colloquial connotation’s preeminence.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zyfoud",
            "body": "At the same time giving connotations to words opens up the world of poetry. \n\nThere are pros and cons to every way you choose to communicate, no one is going to understand or appreciate you enforcing your view of language on them, they just are going to down vote and move on using language how they want.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Black-Patrick",
            "body": "Poetry is better when the word use reflects etymology. But that’s my opinion. My comments are not swayed by upvotes or downvotes. I enjoy the discourse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "redskyrish",
            "body": "Who is calling empathy a sin? Haven’t seen anyone on either side of the isle say that. I’m assuming this about politics and hating on Christian’s but still haven’t heard anyone say empathy bad.",
            "score": -6,
            "replies": []
        },
        {
            "author": "MintyMoron64",
            "body": "Open eye\n\n\nInsert knowledge",
            "score": 1,
            "replies": []
        },
        {
            "author": "RhetoricalMenace",
            "body": "Read the top comment on this thread for sources of right wingers decrying empathy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fluid_Cup8329",
            "body": "To be fair, that word was weaponized years ago. Rare to see it in context that doesn't involve gaslighting or manipulation.",
            "score": -6,
            "replies": []
        },
        {
            "author": "RhetoricalMenace",
            "body": "Sounds like something only a supremely selfish person would say.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fluid_Cup8329",
            "body": "I'm not. You have no clue of anything about me. Stop being manipulative.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RhetoricalMenace",
            "body": "I know plenty about you from these 2 comments.\n\n1. You think empathy is bad\n\n2. You are familiar enough with therapy speak to misuse the words to try to make yourself look smart (you don't)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Excavon",
            "body": "Empathy isn't \"caring about others\". That's sympathy. Empathy is taking the perspective of other people, and wanting what they want. This isn't a problem until other people want something bad, in which case empathy makes you also want something bad. Sympathy will always make you want what is good for others.\n\nFor example, if someone is about to jump off a building, is it better to say \"you're right, the world is so cruel, jump!\" or to talk them down?",
            "score": -17,
            "replies": []
        },
        {
            "author": "PlummetComics",
            "body": "“Empathy isn’t “caring about others”. That’s sympathy. Empathy is taking the perspective of other people, ~~and wanting what they want~~. This isn’t a problem ~~until other people want something bad, in which case empathy makes you also want something bad~~. Empathy ~~Sympathy~~ will always make you want what is good for others.”",
            "score": 10,
            "replies": []
        },
        {
            "author": "TheOneAndOnly09",
            "body": "Empathy - the ability to understand and share the feelings of another.\n\nLearn what words mean before you use them. Empathy is just understanding why someone may feel/act the way they do. Putting yourself in their shoes.\n\nWanting what others have is called envy, and has nothing to do with empathy.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Excavon",
            "body": "Did you read whatI wrote? I said \"wanting what others \\*want\\*\" not wanting what others have.\n\n  \nAgain, don't put yourself in others' shoes. If you get attached emotionally, you make bad decisions.\n\nBut sure, don't read what I wrote and then berate me.",
            "score": -7,
            "replies": []
        },
        {
            "author": "FomtBro",
            "body": "I read what you wrote. It's not correct. Deliberately, because you're lying about the definition of empathy to try and make the dumb thing the right wing commenter said about that bishop sound less evil.\n\nYou're being dishonest and disingenuous to push your agenda. \n\nAt least I hope you are. Because honestly, the idea that you go through life having no idea how anyone else thinks or feels is even sadder than you just being a troll.\n\nLike, I can see you noticing your niece is sad after watching a documentary on Factory Farming, and trying to cheer her up by taking her out for barbecue. \n\n'Hey, I heard you have lung cancer, that sucks man. I got you a carton of the cigarettes you usually smoke to help cheer you up!'\n\nSympathy without empathy is something sitcoms use to show how woefully out of touch someone is with the people around them.",
            "score": 4,
            "replies": []
        },
        {
            "author": "TheOneAndOnly09",
            "body": "Which still has nothing to do with the definition of empathy. I was giving you the benefit of doubt, as \"wanting what others want\" is just a nothing burger. That's called wanting something.\n\nPutting yourself in others' shoes has nothing to do with getting attached emotionally. That's closer to sympathy than anything.\n\nSympathy - feelings of pity and [sorrow](https://www.google.com/search?client=opera-gx&hs=XcH&sca_esv=68d1291a0cea95fc&q=sorrow&si=APYL9bv6NZfDtNd4vqOHf1pb5ALyU4C5vpfv6IY3WYb9NpBE2jsoRdWd1Y3K_u1QZ4IolMtCBaPxtIZDr601GBefspVeBSnmjA%3D%3D&expnd=1&sa=X&ved=2ahUKEwifrsK15pOMAxW-3QIHHS2AJ5UQyecJegQIGRAP) for someone else's [misfortune](https://www.google.com/search?client=opera-gx&hs=XcH&sca_esv=68d1291a0cea95fc&q=misfortune&si=APYL9bsHRxpYwvvSTGj17LkMtmwD7vA-kiQLzebqkgLkQ6z8azyDXy0KGM8CiOFUxM5xyu2cKJXr07igJxx4ZYEMEJA_JtIvop0HtVnxUoHcaWZN4kPz2gQ%3D&expnd=1&sa=X&ved=2ahUKEwifrsK15pOMAxW-3QIHHS2AJ5UQyecJegQIGRAQ).\n\nalso - understanding between people; common feeling\n\nAll I said was to know what words mean before using them. Which seems very valid, given you're arguing their meaning. If you consider that berating, that's seems like a you problem. I didn't insult you or anything, just provided facts.",
            "score": 4,
            "replies": []
        },
        {
            "author": "SteakMadeofLegos",
            "body": "> I said \"wanting what others *want*\"\n\n\nYes you did, which shows you are not using the definition of empathy. You seem to not know what the word means.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FomtBro",
            "body": "I like how you had to make up an addendum to the actual definition of empathy that just...isn't true, to try and make it sound bad. Empathy is taking the perspective of other people' is the entire definition. 'And wanting what they want' is you lying.\n\nYour example is stupid. Empathy in that situation would be an understanding of why they believe they *need* to jump off of a building; which is a tool you could use to help convince them not to go through with it. Showing empathy in that situation is the BEST way to talk someone down.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Excavon",
            "body": "How is wanting what someone else wants not part of taking their perspective?",
            "score": -2,
            "replies": []
        }
    ]
}