{
    "title": "Gotta Love It",
    "author": "goad316",
    "subreddit": "PleX",
    "rank": 0,
    "score": 75,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 33,
    "url": "https://i.redd.it/r72te1rtxipe1.png",
    "id": "1jehtl3",
    "selftext": "You've gotta love it when your friends and family are all using Direct Play and Steam. On stress on the server.\nSimply lovely",
    "comments": [
        {
            "author": "xlly-s",
            "body": "I'm curious, do you keep 720p download just for the purpose of people who can't run 1080p? Or do you have like 2 versions, with one being 1080p for those who can run it?\n\n  \nI just haven't seen many 720p file lately",
            "score": 15,
            "replies": [
                {
                    "author": "goad316",
                    "body": "Nah. I started my movie collection on 720p to restrict transcoding on my old 2 bay Synology and after upgrading my server, I am slowly upgrading them to 1080p.\n\n720p TV though is just to save storage as the folk who request those shows don't care about the quality. Stuff I watch is 1080p minimum",
                    "score": 17,
                    "replies": [
                        {
                            "author": "xlly-s",
                            "body": "Very valid reason. The storage needed for TV shows gets absurd at some points, haha.\n\nEnjoy!",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RED_TECH_KNIGHT",
            "body": "Great work!\n\nWhat is the difference between \"Direct Play\" and \"Direct Stream\" ?\n\nthanks",
            "score": 6,
            "replies": [
                {
                    "author": "61746162626f7474",
                    "body": "Direct play: the client supports the video and audio codecs as well as the container. No transcoding happens.\n\nDirect Stream: the client supports the video and audio codecs, but not the container so Plex remuxs it into a compatible container. E.g MKV converted to MP4, this is very light on CPU.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "RED_TECH_KNIGHT",
                            "body": "Thank you!",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Afraid-Expression366",
                            "body": "Thanks! Just checked and I’m running direct play as well!!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "iAmmar9",
                                    "body": "me too. checked with a 7 fel + atmos truehd + srt english subtitles in mkv. all hail the ugoos 🙏",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "According-Place918",
                            "body": "So I've been encoding my mkv files to mp4 with handbrake so I can get more direct plays instead of direct streams, but some of my mp4 files will convert to mpegts for some reason. Any idea why?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "yepimbonez",
                                    "body": "Oh god please don’t do that lol.  MKV and MP4 are containers, not codecs.  Download ffmpeg and just remux them into mp4 containers if you need to.  Reencoding is going to result in quality loss no matter what.  Remuxing will not. I prefer MKV significantly more than MP4 tho fwiw.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "According-Place918",
                                            "body": "Damn I knew I was doing something wrong. Ok thank you I appreciate the info 🙏🏾",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Krigen89",
                                                    "body": "Just don't even bother. Transmuxing from mkv to MP4 is very light. As long as it's direct stream, it's fine.\n\nIf you're transcoding on the fly, then sure it makes sense to prepare your files.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "themask888",
                            "body": "how do you force to all videos to be direct play?\nall my media is converted to mkv transcoded with unmannic.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bgrngod",
                    "body": "It means the container is getting replaced for some reason, but the track is not getting transcoded.\n\nIn the OP's case, it's the unusual scenario of neither audio or video being transcoded and looks just a container swap. That can happen if the only thing the client can't handle is the container while it can handle the audio and video.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "RED_TECH_KNIGHT",
                            "body": "TIL!  Thanks!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DudeLoveBaby",
                    "body": "Direct stream means video is untouched and audio is transcoded. Effectively the same as direct play as it's MUCH less cpu power to only mess with audio",
                    "score": 3,
                    "replies": [
                        {
                            "author": "RED_TECH_KNIGHT",
                            "body": "Thank you very much for the explanation! :)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RareBugBear",
            "body": "Hell yeah on MAFS AU. Love my trash!",
            "score": 3,
            "replies": [
                {
                    "author": "tokenmus",
                    "body": "Before MAFS, I was having max 4 streams on my server. Since I started adding MAFS, I regularly have 8 people streaming most nights",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KungPaoChikon",
            "body": "I used to like seeing this - until I realized my ISP doesn't offer more than like 30mbps upload speed :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "Splatx",
            "body": "Something I need to keep in mind as I start to build my Plex library. Most people say 1080p with high bitrate is good. Need to start learning all the codecs and such for video and audio and subtitles and making sure if playing on a phone or my users TVs/devices will be able to direct Play",
            "score": 1,
            "replies": []
        },
        {
            "author": "tbo1992",
            "body": "Noob question, how do you achieve this? Do you make sure your Sonarr/radarr is configured to download specific codecs? Or do you convert your files with something like handbrake?",
            "score": 1,
            "replies": [
                {
                    "author": "goad316",
                    "body": "My sonarr by default will grab anything 720p upwards. I mostly use this for disposable shows like MAFS or stuff I will never watch again.\n\nI have an option I use to grab 1080p videos with any codec and it will replace them with 1080p H265 versions if they become available which I use for keeper shows like Drive to Survive for example\n\nI hand curate my movie collection but I have Radarr setup for when I get a request for a unavailable movie that I'm inevitably going to forget about",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "iAmmar9",
            "body": "lol i just downloaded oceans eleven. i wonder if that person liked it",
            "score": 1,
            "replies": []
        },
        {
            "author": "MapPractical5386",
            "body": "What do you use for a server?",
            "score": 0,
            "replies": []
        },
        {
            "author": "EvilbunnyELITE",
            "body": "i store everything in formats that must transcode, the transcodes look so much better imo",
            "score": -17,
            "replies": [
                {
                    "author": "EternallySickened",
                    "body": "Transcodes do not look better than direct play/direct streaming. That’s a ridiculous notion.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "NoReallyLetsBeFriend",
                            "body": "Maybe a 50GB UHD file transcoded to FHD?\n\nEdit: not to knock OP, but those are lower quality streams based on the bit rate. So pretty low stress on the server. A higher quality file could transcode and I assume look better than what's playing. But I have a full blown home theater and 85\" TV so even good HD doesn't look as good as FHD mediocre stream. UHD is pretty good in so formats, but I'm using 30GB+ h.265 files",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "goad316",
                                    "body": "If I had the storage space, everything would be 4K. Most TV shows that people request (friends and MAFS) I'll get at 720p cos they mostly don't care about the quality. Things I watch will be 1080p minimum. I'm slowly upgrading the Film library to 1080p. Ocean's 11 must have slipped though the cracks",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "NoReallyLetsBeFriend",
                                            "body": "I hear ya. Before COVID I did an upgrade to one of those jet engine 4U EMC servers, swapped the CPUs to something lower power (45w) single, reduced RAM from 256GB to 64GB. Upgraded my 3TB RAID discs to 8TB. Now looking to move to 12TB for replacements. Anyway, paid $350 for it, literally just to be storage. 10x 8TB drives with 8x 3TB drives still. They're split into 2x 5 disc Raid 5 and the 3TBs I did in 2x 4 discs in raid10. So, 4 pools overall. It's decently low power I guess, but plenty of room for movies and shows. I cut the fan plugs and wired directly to the MoBo in order to control speeds manually through software... They're screaming but just at less volume",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "piratenaapje",
                    "body": "Transcoding literally lowers the quality by definition, are you trolling?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "faptainplanet7",
                            "body": "No, they might just be an idiot.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EvilbunnyELITE",
                    "body": "sheesh figured the /s was obvious, direct play is the way to go",
                    "score": -2,
                    "replies": []
                }
            ]
        }
    ]
}