{
    "title": "Upgrade Question",
    "author": "TurkGonzo75",
    "subreddit": "PleX",
    "rank": 11,
    "score": 0,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 3,
    "url": "https://i.redd.it/2c4t2knubjpe1.jpeg",
    "id": "1jejl30",
    "selftext": "I have a Synology DS223j that I bought mostly for extra storage, playing music through Plex and just to tinker and learn. I recently started ripping some blu rays and adding them to Plex. When I try to view them, I get a message saying “the server is not powerful enough to convert this video for smooth playback.” I expected this as my NAS is the cheapest thing Synology makes. My question is, if I upgrade the NAS and pop in the old drives, will everything just work or will I need to rebuild my Plex libraries from scratch? I’m also thinking about buying a desktop computer. Would that ultimately be a better/simpler solution? ",
    "comments": [
        {
            "author": "TheEmptyJuiceBox",
            "body": "The easier solution would be to see why it's transcoding as that's usually a client issue, not the server.\n\n  \nWhat client are you using? Would get a screenshot of your dashboard when you're watching something and while it's transcoding, so it'll tell us why it is.\n\n  \nEven a simple Raspberry Pi can handle multiple streams if they're direct play so I wouldnt go about upgrading the server just yet unless you need to upgrade it for a different project or if you absolutely need to transcode.",
            "score": 3,
            "replies": [
                {
                    "author": "TurkGonzo75",
                    "body": "I was just testing it on the Plex app on my phone. I haven’t done any other tests. Just messing around at this point n",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ew435890",
            "body": "I get this sometimes on my iPhone. Ill be in my house, connected to my WiFi 6E router, sitting 15 feet from the server, and I get this. My server can handle tons of transcodes and I get it when Im the only one using it, and there is nothing else using the CPU. Ive found that force restarting the app, or even sometimes restarting the phone/iPad fixes the issue.\n\nSince you have an older NAS, its likely the culprit though. You could hook a mini PC up to it and let that handle the server stuff.",
            "score": 1,
            "replies": []
        }
    ]
}