{
    "title": "You do a lot more things for attention than you think, and that's sometimes okay.",
    "author": "freecroissants",
    "subreddit": "unpopularopinion",
    "rank": 18,
    "score": 37,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/unpopularopinion/comments/1jdpg8j/you_do_a_lot_more_things_for_attention_than_you/",
    "id": "1jdpg8j",
    "selftext": "I truly believe a lot of people do things for attention more than they realize, especially in the case of social media. I mean social media is literally made to show other people something, i would absolutely not believe someone who is posting their cars, their jewlerys, their body on social media is solely doing it for themselves.\n\nI mean I get it though, like posting your body or flexing ur watches do make you feel better about yourself and build up confidence, but isnt a major part of it because you know that some people will admire what you are showing is that which makes you feel better about yourself?\n\nThis is not the case for EVERYTHING but i would say this is the case for a majority of the reason why we do a lot of things, from the way we dress to the things we post on social media. Sometimes this can be vain, materialistic and trashy, sometimes its completely fine to want a little bit of validation.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Please remember what subreddit you are in, this is unpopular opinion. We want civil and unpopular takes and discussion. Any uncivil and ToS violating comments will be removed and subject to a ban. Have a nice day!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Straight_Ear795",
            "body": "Social media is designed to exploit insecurity. The worst offenders have the IQ of a goldfish and the confidence of a pre-teen.",
            "score": 9,
            "replies": []
        },
        {
            "author": "avid-learner-bot",
            "body": "It's pretty cool how we often seek validation through our social media without even realizing it. While showing off achievements or what we own can boost confidence and self-esteem, there's no denying that part of the reason we do it is to get others to notice these aspects of ourselves. Finding a balance is key, while some appreciation from others can be really gratifying, it shouldn't overshadow the intrinsic value we place on our actions and choices... you know? It's like walking a tightrope between wanting people to see your cool new car and just enjoying driving it yourself",
            "score": 6,
            "replies": [
                {
                    "author": "freecroissants",
                    "body": "Yea lol. I was thinking of posting again on my instagram after YEARS of not posting, then it hit me that I really just wanted to show off my life now too old friends",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "StrawbraryLiberry",
            "body": "People act like it's a crime to want attention, but that's actually extremely normal social behavior. \n\nI'm not socially that normal, so certain common behaviors don't seem appealing to me. I'm kind of scared of attention. I'd rather you pay attention to someone else, lol. It's too much pressure to be a person, and getting attention can make people jealous which is annoying. \n\nSocial media exists for social reasons. If you don't want attention, you probably wouldn't post almost anything. It's designed for people to respond when you post- it's an attention machine. \n\nEven antisocial me does certain things to manage the gaze of the other. I dress to blend in so I seem more normal & look like someone you could give a job to. \n\nWe live in a society, as they say. We are a social species and we are often signifying things to each other even less consciously. \n\nI won't say everyone loves or wants attention, but if you don't, you're some flavor of neurodivergent, like schizoid or something. Not wanting attention genuinely isn't normal, but it is a normal variation of human.",
            "score": 6,
            "replies": []
        },
        {
            "author": "taglietelle",
            "body": "Yeah attention seeking is normal human behaviour, we're social animals. It can be taken too far but so can anything.",
            "score": 3,
            "replies": []
        },
        {
            "author": "genus-corvidae",
            "body": "It's funny because I got an undercut and dyed my hair specifically for myself. I don't post pics of myself online and I don't want comments on how I look from most people, I just wanted less hair and for it to be a better color. Same with how I dress--maybe 1 time in 20 do I actually take a pic of the cute outfit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "7h4tguy",
            "body": "Nah bitch, I don't give one literal shit what you think, and yes it wasn't that way before where I perhaps did fucking oh noes cared",
            "score": 1,
            "replies": []
        },
        {
            "author": "Future_Usual_8698",
            "body": "Smart post, and unpopular because of the harsh criticisms we get from others as kids, thanks for the balanced approach 👍",
            "score": 1,
            "replies": []
        },
        {
            "author": "RevolutionKooky5285",
            "body": "No, this makes a generation of needy insecure and frankly annoying people. This needs to be judged. If you want to brag about an achievement that isn't related to consumerism then fine but showing off shiny new shit shouldn't be encouraged.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Uhhyt231",
            "body": "I think some people do but like the idea that people look at your social media posts and admire you doesn't even make sense to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crosslegbow",
            "body": "Like this post?",
            "score": 1,
            "replies": [
                {
                    "author": "freecroissants",
                    "body": "Yes.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}