{
    "title": "'Lite' beer is fucking gross and is undrinkable, and I don't really understand how someone can just sit there and drink 6 or 7 of them in a row in order to get drunk when they taste as bad as they do.",
    "author": "6ftToeSuckedPrincess",
    "subreddit": "unpopularopinion",
    "rank": 2,
    "score": 105,
    "upvote_ratio": 0.66,
    "num_comments (reported by reddit)": 223,
    "url": "https://www.reddit.com/r/unpopularopinion/comments/1jee4zb/lite_beer_is_fucking_gross_and_is_undrinkable_and/",
    "id": "1jee4zb",
    "selftext": "Seriously, how does anyone enjoy drinking coors lite or whatever? I drink alcohol all the time and I honestly think there needs to be some bite to make it palatable. I don't drink Natty Ice but I always thought it tasted at least a little less disgusting than lite beer even though everyone claims it's bottom barrel, because at 5.6 percent alcohol or whatever it's not just pure poss water like Miller lite or colors lite. Plus besides the fact that it tastes terrible, drinking a 6 pack of Miller lite (4.2 percent) is the equivalent of 5 units of alcohol. Apparently it's about cost, but you can get a decent tallboi Imperial IPA that actually tastes good that is 3 units of alcohol for around 2 for $5-9, how much more alcohol do you truly need to drink than that? Next you're gonna tell me the $60 gram of trash blow cut with draino is worth it over  the $80 solid chunk of 70% pure because you're saving 33%.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Please remember what subreddit you are in, this is unpopular opinion. We want civil and unpopular takes and discussion. Any uncivil and ToS violating comments will be removed and subject to a ban. Have a nice day!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpeciousSophist",
            "body": "The irony here is that you say light beers are undrinkable when that is precisely one of the two main reasons people drink them.  They are generally something that you can consume numerous of without getting sick of the taste or getting way too wasted.  The other reason is low calories.\n\nMy personal favorite is an IPA called Slightly Mighty by Dogfish.",
            "score": 109,
            "replies": [
                {
                    "author": "Tu4dFurges0n",
                    "body": "Guiness has fewer calories than Stella",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Fit-Construction3427",
                            "body": "Neither of those are light beer though",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Accurate-Instance-29",
                            "body": "Both taste like dogshit to me",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Tu4dFurges0n",
                                    "body": "Well, not everyone has good taste",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NoOneImportant333",
                            "body": "Stella isn’t considered a light beer",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WhiteAsTheNut",
                    "body": "It’s really just about health. Regular beer makes you fat really quick, and has other adverse effects. Most light beer drinkers simply want less calories while still getting alcohol. It’s usually not cheaper and I think OP just misses the point of it. Most people do not drink it because it tastes better than full flavor.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Altostratus",
                            "body": "It’s not common to meet someone who drinks Coors lite and cares greatly about their health.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "WhiteAsTheNut",
                                    "body": "My dad used to drink coors light and switched to michelob but he drank it because he said full flavor beer made him weigh too much. And I can tell you for sure there’s less people who drink coors light for its taste.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Oracle1729",
                            "body": "Drinking…light…beer…for…health…….\n\nSome things about American culture are truly incomprehensible.   I understand and accept what you said but every part of your post is just so bizarre. \n\nHow about drink something you enjoy a lot more, drink less of it, then switch to water?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WhiteAsTheNut",
                                    "body": "I mean I enjoy beer a ton, I don’t personally drink light beer too often. I usually drink lagers like Yuengling, but they are objectively healthier. A diet soda is healthier then a regular soda. Technically neither should be drank, humans should only really drink water. But to many who have drank for years and wanna catch a buzz with something that’s lighter it exists for that reason, just like diet soda.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "the_urban_juror",
                                            "body": "There's a huge difference between diet vs regular soda compared to light vs regular beer.  Diet soda has zero calories compared to regular soda loaded with sugar.  The stuff in beer that should be consumed sparingly, alcohol and empty calories, are still present in light beer.  If you're drinking enough beer that light vs regular creates a meaningful calorie difference (Budweiser has 145 calories, Bud Light has 110), you need to cut back on beer.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WhiteAsTheNut",
                                                    "body": "I see so many attempts to jump around the baseline that it’s just healthier and some people care about that. It’s the same reason people drink white claws, I find them foul but they’re less calories. Sure we can sit here and be like “still this isn’t fully healthy!” But baseline is it’s still healthier then full flavor beer.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "the_urban_juror",
                                                            "body": "It's 35 fewer calories for Bud vs Bud Lite.  That's a very small difference if you're drinking a few beers weekly.  If you're drinking enough that the calories difference matters, you're drinking far too much for a 35-calorie difference per beer to matter.  It's not jumping around the baseline, it's just acknowledging reality.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Oracle1729",
                                            "body": "My preference is Munich lagers.  I’d much rather have one of those and a litre of water than 3 or more light beers.  My way is objective healthier as well as more enjoyable.  Quality over quantity. \n\nIf I want to get drunk, I’m stuck with the alcohol calories anyway.  So why not have a few good beers. Or something else like scotch. May as well be something you enjoy.  \n\nUnless your goal is the cheapest booze you can get, but I’d never do that. ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WhiteAsTheNut",
                                                    "body": "Well 3 or more light beers and you’ll probably atleast catch a buzz. If we compare it 1 to 1 it would be healthier to drink a light beer and then a liter of water. Quantity isn’t a thing to take into account unless you’re drinking high ABV beer which I assume most Munich lagers are around 5%. Most light beers are 4-4.5% so it’s not much different but less calories. Either way 6 light beers is likely much less calories then 5 full flavor and some people that’s what they want.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Oracle1729",
                                                            "body": "For the same amount of pure ethanol equivalent, light beers are not healthier or lower calorie.  The main source of calories is the alcohol. \n\nLately I’ve been drinking hacker-pschorr gold.  5.5% alcohol and 46 calories per 100ml.  And an excellent taste. \n\nBud lite is 31 calories per 100ml and 4.2%abv.   41 calories for the equivalent alcohol of 100ml of the German beer.   And you have to really hate yourself to endure the taste. ",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "WhiteAsTheNut",
                                                                    "body": "When you break things into smaller numbers to try and make the differences seem less it’s really stupid. Try that over the span of 10 beers throughout the night. That could be a 500 calorie deficit. And while yes there’s less alcohol usually by then people will stop either way. There’s much worst tasting beverages then light beer, even I know that seltzers exist. Also carbs are a huge part as well with light beer being healthier. All of this combined makes a valid point, if you don’t like it don’t drink it but I would never tell somebody to stop doing something that’s healthier for them even if it’s not perfect.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "6ftToeSuckedPrincess",
                                            "body": "I am a PA guy and Yuengling straight up sucks ass.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WhiteAsTheNut",
                                                    "body": "Then you must not be an actual PA guy because I love it. Or maybe you’re just on the jersey side of the state…",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "count_strahd_z",
                                                            "body": "I was a PA guy who grew up on the east side of the state and I enjoy Yuengling too.  Yuengling Flight is my current go to lite beer.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Hard_Corsair",
                                    "body": "Drinking light beer for health makes sense when you run the number against soda. My favorite local craft light beer (Aluminum Cowboy by Hop & Sting) has 110 calories and 5 carbs per 12 oz can. For that same 12 oz I could drink Coca-Cola which is 140 calories but 39 grams of carbs, which is all from high fructose corn syrup (processed sugar). If I drink 2 of either per day, Aluminum Cowboy saves 420\ncalories and 490 grams of carbs over the course of a week, and that takes essentially no willpower since the beer is tastier anyway.\n\nEven if I use a non-light beer (but nothing unusually heavy), another local favorite (Altstadt's helles lager) is 150 calories and 12 grams of carbs. 2 per day now sees an increase of 140 calories but still decreases carb intake by 378 grams.\n\nThis is very valuable because America puts processed sugar in all sorts of places that it doesn't belong (e.g. Subway's bread has too much sugar to legally be called bread in Europe) so reducing this as much as possible is very helpful.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ken28eqw",
                            "body": "And you don’t have to rinse the taste out of your mouth like after an IPA",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "6ftToeSuckedPrincess",
                            "body": "But it's the alcohol that ultimately has the heavy calories, even liquor has a lot of calories. Again, if you are trying to get drunk, you have to drink way more anyway, so will there really be much of a difference at the end of the day? Sure maybe if you are a 100 pound woman and two drinks gets you drunk, you will consume way less calories off 2 coors lites than one Voodoo ranger 19 ounce 9.5 percent beer, but there is also about 60 percent more alcohol in one of those cans than the 2 12 ounce coors lite you just drank, which still probably adds up to what? 250-300 calories?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JoshHuff1332",
                                    "body": "Your first problem is comparing voodoo ranger to bud light. You should be comparing another cheap beer, like regular budweiser. The difference between bud light and good beer is noticeable. The difference  between bud light and budweiser is pretty negligible, and if it's not a big difference, why wouldn't someone drink the light version?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Whiskeymyers75",
                                            "body": "There are multiple craft lagers that are very comparable to Budweiser or Bud Light. Not all beer is for obese hipsters like IPA is. The brewers association recognizes over 100 different styles of beer. American lager is one of them regardless of what the cork sniffers think.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JoshHuff1332",
                                                    "body": "You are missing the point again. A craft lager is still a CRAFT beer. The biggest reason people drink budweiser, PBR, Coor's, Miller's, Michelob, etc and their light counterparts is because it's cheap and can be found anywhere. Saying \"why do people drink bud light when (insert craft beer) is so much better?\" completely misses the point.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Whiskeymyers75",
                                                            "body": "And yet their craft counterparts don’t taste much different. Not all macros are cheap BTW. I pay as much for Corona Light, Michelob Ultra or Bud Light Next as I pay for a lot of craft and regional offerings.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "WhiteAsTheNut",
                                    "body": "Well Voo Doo ranger at 7% ABV and around 220 calories give or take. Coors lite is 102 calories and 4.2 ABV for 12 ounces each. So for less calories you can get more total alcohol, even if the ratio is 2 to 1. Plus if the argument is mostly about taste and not calories IPAs are a horrible comparison as most of the population finds them abysmal. Light beer just tastes a little sad to me an IPA tastes like an abomination.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "6ftToeSuckedPrincess",
                                            "body": "Lol talk about an unpopular opinion.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WhiteAsTheNut",
                                                    "body": "I can guarentee you most people would drink a light beer before an IPA. Maybe on Reddit it’s an unpopular opinion but an average citizen would spit an IPA out almost instantly…",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Whiskeymyers75",
                                    "body": "Not all of us are trying to get drunk. Just like to loosen up a little. Low calorie beer or straight whiskey and tequila is great for that. There are 97 calories is a pour of bourbon for instance. Two or three of them are good enough and not very many calories. Not everyone participates in binge culture.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "6ftToeSuckedPrincess",
                                            "body": "Is a \"pour\" an ounce of 1.5 ounces? Because a unit of alcohol is 1 1.5 ounce 40 percent spirit.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Whiskeymyers75",
                                                    "body": "1.5 to 2oz at most which isn’t adding many more calories. Whiskey enthuestists aren’t pounding shots like basic bitches & bros. We sip and enjoy the complexity which is why some of my pours cost $60 each.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Icy-Mortgage8742",
                                    "body": "marketing is around party culture/sports. People shotgun or chug, so why would you waste your money on something with flavor? Why would you spend a bunch of money on nice beer to bring to a rager when nobody there would appreciate the taste? These products are a vehicle to a buzz, nothing more, nothing less.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "VickyCriesALot",
                    "body": "Yea, and there is also a subset of people who aren't huge fans of the taste of beer to begin with so light beer actually makes its more palatable to them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Additional-Bag-1961",
                    "body": "Have you tried their newer low cal 30min IPA?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SgtPopNFresh_",
                    "body": "I love Slightly Mighty!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Guerrillablackdog",
                    "body": "You're not making the argument you think you're making. Light beer is terrible. IPA is terrible. It's all terrible. Lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tylerchu",
                    "body": "Aren’t lite alcohols simply their color and nothing to do with their nutrition or alcohol profile?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "cdazzo1",
                            "body": "It's supposed to be lower calories, but they also tend to have less alcohol. \n\nOne time I compared the nutrition labels of Bud and Bud Light. I forget the difference, but it was the same percentage difference of everything. Based on this, my assumption is that Bud Light is literally watered down Bud.\n\nI'm sure there are better ways of finding out, but for me this one was more about the journey then the answer or even the correct answer. I like it just being a theory.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "the_urban_juror",
                                    "body": "It's 35 fewer calories per 12 oz serving for Bud Light compared to Budweiser.  People drastically overstate the benefits of light beer.  Drink what you want, just drink it sparingly.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dong_tea",
                    "body": "Nah, it's the same trap as eating crappy diet food because it's healthier but overeating to the point where it's the same amount of calories as something that would have tasted good.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "kellyguacamole",
            "body": "Cause they’re different people than you and like different things. Crazy, I know.",
            "score": 19,
            "replies": []
        },
        {
            "author": "Euphoric-Affect-4228",
            "body": "Yeah, I'm not drinking my piss water to get drunk. I drink it because I like the taste. Also, I'd much rather have my piss water on a 110 degree day than a fucking IPA.\n\nAnd I'm also really sure you've never done blow because your math ain't mathing.",
            "score": 50,
            "replies": [
                {
                    "author": "6ftToeSuckedPrincess",
                    "body": "Lol I've done plenty of blow I've been to Peru and Colombia 3 times each, what math exactly are you referring to? A gram is typically 80 to 100 bucks, which is why I used that example because sometimes people do have shitty blow for 60 bucks. Maybe if you live in Texas it's like 500 an ounce and therefore a gram is only 40 bucks or whatever but that's not the case in Philadelphia.",
                    "score": -29,
                    "replies": [
                        {
                            "author": "UselessAndUnhelpful",
                            "body": "Saying \"ive done blow because ive been to Peru and colombia\" is like saying you're not racist because you work with a black guy.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "Different_Car9927",
                                    "body": "Ive done Blow every time ive been to Colombia and Peru also tbh. I believe him",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Zombisexual1",
                                            "body": "It is also less cut closer to the source. Although I’m sure they rip off gringos there too lol",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Different_Car9927",
                                                    "body": "They do, my gf is Peruvian and I speak like one so I get pretty fair prices. Everything from 10€-15€/gram. Im sure you can get it cheaper in bulk. \n\nAwesome quality.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "UselessAndUnhelpful",
                                            "body": "Ok and I  have black coworkers and im not racist. I don't have to say it though. When it's true, you don't need to over explain yourself",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ReputationOk2073",
                                                    "body": "Have you ever done blow with your black coworkers?",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Different_Car9927",
                                                    "body": "Allright man!\n\nWhy he needs to proove it to any of you anyway",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "6ftToeSuckedPrincess",
                                    "body": "I mean it's not, have you ever fucking been there? People offer you blow constantly and I enjoy doing blow especially in the place where it is produced. It's more akin to accusing someone of never drinking wine and having them say they lived in France. In fact I guarantee a smaller percentage of wine is produced in France than the percentage of cocaine produced in either Peru or Colombia, considering only 3 counties produce cocaine in pretty equal amounts where as a whole slew of countries produce and export wine (Spain, Argentina, Chile, USA, Australia, Italy off the top of my head).",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Suitable-Art-1544",
                                    "body": "is it completely unimaginable to you that someone might have done both of those things???",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Euphoric-Affect-4228",
                            "body": "So you've been to places where production and supply chains are infinitely closer to the end product. Also, something tells me you're not American or experienced in drugs because there is no way in hell I would have ever bought my top grade 8 ball for more than $140, and that's in California. \n\nSorry to tell ya, bud.....you got fleeced by your South American dealers.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Different_Car9927",
                                    "body": "Pretty sure he didnt mean he paid that much in SA.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Suitable-Art-1544",
                                    "body": "the reading comprehension these replies show is exactly why america is so low in education scores. good god y'all just take an extra minute to go over it again",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "nothanksiliketowatch",
            "body": "Maybe because people aren't drinking them to get drunk",
            "score": 53,
            "replies": [
                {
                    "author": "LumplessWaffleBatter",
                    "body": "Okay, but people do definitely drink light beers to get drunk.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "ToastWithoutButter",
                    "body": "If someone is drinking coors/bud/natty/whatever \"for the taste\" then they need help.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "MFish333",
                            "body": "I drink lone star and Modelo for the taste. It's nice and refreshing at the end of the day. It's like a better soda.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "n1klaus",
                                    "body": "Modelo and Pacifico all day. This bar I used to frequent would add a tequila shot in the rim and hot sauce and some other spices (forget the mix) but goddamn if that wasn’t a way to start my morning 😂",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ToastWithoutButter",
                                    "body": "Those are both A-OK in my book. Well, modelo is at least. Never had lone star.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "itsmeart",
                            "body": "I drink miller's lite for the taste",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MyOwnPenisUpMyAss",
                    "body": "…I do lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EndLight_47",
                    "body": "Why not just drink cider?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "RogueCoon",
                            "body": "Too sweet",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "User-NetOfInter",
                            "body": "Calories",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "ultravioletblueberry",
                            "body": "There’s some ciders out there with some fucking hiiiigh ABV’s.\n\nPlus it’s a completely different flavor from beer.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "dhoomsday",
                            "body": "The pH of cider is very low.  That's a lot of acid to slam dunk",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "rargghh",
                            "body": "6 pack of ciders will give you a terrible stomach ache",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "natziel",
                            "body": "You ever drink cider before? It is disgustingly sweet, even the \"dry\" ones",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "EndLight_47",
                                    "body": "Not every cider is 'disgustingly sweet'",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MakeAmericaPoopAgain",
                            "body": "Diabetes",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "6ftToeSuckedPrincess",
                    "body": "They taste like garbage. Just drink water. Also this is such a contrarian point, alcohol is meant to get you inebriated and nobody who spends 15 bucks on a 30 pack is doing it to just drink one or two then call it a night.",
                    "score": -24,
                    "replies": [
                        {
                            "author": "where-is-the-off-but",
                            "body": "Well….. alcohol gets you inebriated. I wouldn’t say it’s meant solely for that. Some people enjoy having a beer with their friends, getting a little bit relaxed, and not getting drunk, and not dealing with malty hoppy bitterness. Enter light beer.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Crecious",
                            "body": "I drink both for different reasons\n\nGoing out with friends after work to have a beer or two? Drinking IPAs or lagers 99% of the time\n\nHaving some buddies over on a Saturday night to play drinking games for several hours? It has to be light beer",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Oracle1729",
                                    "body": "Why does it have to be light beer?  Not water, coffee, soft drinks, gatorade, etc.  \n\nAt this point just curious because nobody I know chills with buddies drinking light beer for hours. ",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Crecious",
                                            "body": "Uhh, cause you don’t get drunk from drinking water? 😂\n\nI know plenty of people who do it.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Background-Goal-1602",
                                            "body": "Drinking games…you’re getting drunk while playing games with the beer. Beer pong, kings cup etc…you’re going to be to full and waste money by buying heavy full flavor beer",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "The_Real_Lasagna",
                                            "body": "Drinking games are to get drunk?\n\n\nYou probably just don’t hang out with people who play drinking games lol",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Oracle1729",
                                                    "body": "We use shooters for that. Or real beer.  And sometimes shots.  \n\nNever light beer. ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Crecious",
                                                            "body": "Just try to survive 2 Grand Prix of beerio kart drinking regular beer. I’ve done it with IPAs before but it never ends pretty",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Oracle1729",
                                                                    "body": "I’m still not getting what you mean. Take smaller sips?   Why do you need the biggest quantity of the least enjoyable substance.   Isn’t less of someone good win-win and you still get drunk in the end?  Unless your goal is the maximum number of ounces of the crappiest water-beer?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Crecious",
                                                                            "body": "The “drinking” part of the game is to drink one beer per race so in the spirit of that rule, that’s what everyone does, regardless of ABV.\n\nKeep in mind these are gatherings of 25 year olds, so I’m not saying it’s the peak of rationality, just that it’s what we do to have fun and get drunk. I personally don’t hate the taste of light beer anyways so no loss I guess.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "goobdoopjoobyooberba",
                            "body": "Dude some people but a 30 pack and it lasts 30 days.   It’s not good to get drunk every day and most people don’t.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "dmtdmtlsddodmt",
                            "body": "I guess I'm nobody",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "tropicf1refly",
                            "body": "Spoken like a true alcoholic buddy.\nI buy beer to drink it like any beverage.\nI don't buy a 24 pack of coke and drink the whole case.\nI don't buy a 40 pack of cheese sticks to eat 10+ sticks in one sitting. \nWhen I buy a bottle of 120 ibuprofen pills, it's not to take 50+ pills \nDo you buy a carton of cigs and smoke all the packs too?\n\nGet some help LMFAO",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Oracle1729",
                            "body": "*15 bucks on a 30 pack*\n\n30 bucks on a 15 pack is a bargain here (Ontario). \n\nI have to agree with OP.  Light beer is gross.  There are so many better tasting choices with or without alcohol. Even water. ",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "JoshHuff1332",
                            "body": "People absolutely do that? Lol",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Haiku-On-My-Tatas",
                            "body": "Guess I'm about to blow your mind by telling you I drink non-alcoholic beer because I like the taste of beer but no longer drink alcohol lmao",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoleJawn",
            "body": "I drink Bud Light cause if I'm going to spend all day watching sports and drinking, I don't wanna be fulled up and plastered by the primetime game. Light beer allows for a good steady all day buzz and when I wanna switch to a full bodied beer later at night I can do it.",
            "score": 19,
            "replies": [
                {
                    "author": "checkprintquality",
                    "body": "Why not just add water or ice to regular beer? You get more alcohol for your money and it’s literally the same thing.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NoleJawn",
                            "body": "Because A) You're not saving on the calories and the fullness B) You're diluting the taste of actual full-bodied beer that I like C) And you're not saving on convienence",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "104MAS",
            "body": "It has less calories and most non drinkers get a buzz since they rarely drink.",
            "score": 8,
            "replies": []
        },
        {
            "author": "jayrady",
            "body": "How else am I supposed to watch my girlish figure as I slam beers working under my shit box?\n\nYou are completely missing the point of the beer and sound pompous.",
            "score": 14,
            "replies": [
                {
                    "author": "checkprintquality",
                    "body": "Just water down regular or ice beer and save money. You get more alcohol.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ethancknight",
            "body": "Drinking beers to get drunk never makes sense. Just take 2 shots.",
            "score": 6,
            "replies": [
                {
                    "author": "Background-Goal-1602",
                    "body": "Some people like to hold onto something and sip while they’re hanging out",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EccentricPayload",
                    "body": "Taking shots is harsher and also much harder to control. If I only drink beer it's impossible for me to get way too drunk. When the liquor is out, sometimes I lose track...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Useful_Milk_664",
                    "body": "Two?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ethancknight",
                            "body": "2 shots is worth like 5 beers at least.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Useful_Milk_664",
                                    "body": "This is drunk math lmao. Unless you take massive shots, in which case, carry on brother.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Noodlefanboi",
            "body": "It’s cheap, and being able to drink a lot of them over the course of the night without getting absolutely shit faced is a feature, not a bug. ",
            "score": 11,
            "replies": []
        },
        {
            "author": "MC_Stimulation",
            "body": "Most beer is gross anyway. IPA or Euro-Beer snobs are just as annoying as a light beer only person",
            "score": 15,
            "replies": [
                {
                    "author": "Useful_Milk_664",
                    "body": "Tell me you’ve never had a Pabst blue ribbon with a smooth American Spirit cigarette before without telling me that.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "BlazingPandaBear",
                            "body": "Turquoise American Spirit with a tallboy PBR is an indispensable life experience",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Useful_Milk_664",
                                    "body": "I’m more of a sky, if I do smoke. But I respect the turquoise. I only smoke at shows and concerts at this point, but god damn does it always set me straight. A local punk venue near me has $3 tall boys of PBR so I always flock to those. Now I unironically love em.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MC_Stimulation",
                            "body": "Lmao you got me I don't smoke, but hey if thats your bag then go for it!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Useful_Milk_664",
                                    "body": "Wanna start? (Don’t start, it’s a shitty habit)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MC_Stimulation",
                                            "body": "Ya not my thing, too many smokers in my life I hate the smell now",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "youchasechickens",
                            "body": "Who even smokes in 2025?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "6ftToeSuckedPrincess",
                    "body": "Dude I am simply referring to the amount of volume you have to drink. Even so IPAs and Stouts, or even a regular domestic, taste better than a 4 percent alcohol beer, and you have to down twice as much while you're at it. Mixed drinks, wine, and strong beers are Goldielox of alcohol because they are strong and flavorful without being too strong like a shot of liquor is (although a nice on the rocks isn't terrible in the right context).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MC_Stimulation",
                            "body": ">Even so IPAs and Stouts, or even a regular domestic, taste better than a 4 percent alcohol beer\n\nDo they? Id argue that they don't and are just as gross as light beer.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Drslappybags",
                            "body": "4.5. which I believe is the same as Guinness here in the States. Now if you want to talk about gross beer you should be talking about near beer or Oklahoma 2.3. I don't know if they have changed it but when I lived there that's what they served at the bars. State law.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "beaglefat",
            "body": "I used to hate on lite beers and only drinks IPAs. Now im the opposite, IPAS especially imperials and heavy ones just make me feel so full. I cant drink an IPA with dinner its too heavy. I find lite beers refreshing though and can drink a lot of them and feel good. Also if you are going out to drink with friends, drinking IPA's before hand kind of sucks and will make you feel unwell for the whole night.",
            "score": 4,
            "replies": []
        },
        {
            "author": "DefNotReaves",
            "body": "I think cheese is fucking disgusting and people who eat it are just eating rotten milk. Clearly people have different tastes haha",
            "score": 3,
            "replies": []
        },
        {
            "author": "slampig3",
            "body": "I love all beer from light to stouts not a huge fan of IPA but i will drink them. I don’t drink to get drunk but sometimes it happens.",
            "score": 3,
            "replies": []
        },
        {
            "author": "motrep",
            "body": "As someone who can get a bit carried away, lite beers keep me humble. The more liquid the longer it takes for me to get drunk. All beer is pretty gross so to say one is more gross is a bit wild to me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "vendettaclause",
            "body": "1. Because they want to get drunk \n\n2. It tastes and feels a whole lot better than hard liquor \n\n3. It's an acquired taste just like every other beer so it doesn't taste bad to everyone",
            "score": 7,
            "replies": []
        },
        {
            "author": "hunkerd0wn",
            "body": "Counterpoint: IPAs are ass",
            "score": 6,
            "replies": [
                {
                    "author": "KingoftheWildlings",
                    "body": "People tell me it’s an acquired taste, but I’m not sure I can acquire it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Guerrillablackdog",
                    "body": "They _are_ ass",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Structure_6275",
            "body": "Alcoholism and trying to cut calories is a thing in America.",
            "score": 6,
            "replies": [
                {
                    "author": "irresponsibleviewer",
                    "body": "Or maybe it’s the same reason why zero sugar drinks exist? People enjoy the taste but don’t want the calories.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "DefNotReaves",
                    "body": "Because light beer doesn’t exist in other countries? Lmao",
                    "score": 3,
                    "replies": [
                        {
                            "author": "VenusHalley",
                            "body": "What is lite beer?\n\nI suspect it might get you defenestrated in Czechia",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "MeeMeeGod",
                            "body": "Not nearly as prevalent as America lmfao, go to germany and ask for a light beer i dare you",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Oracle1729",
                                    "body": "The German beer purity laws are the only good German purity laws.  They take that stuff seriously. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "No_Structure_6275",
                            "body": "I would say it also has to do with the superficialness of the US. We thrive on marketing diets, lifestyles, and looking a certain way. American culture and business intensely enables unhealthy habits and then tries to counteract people's desires to combat them by providing low cal products.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Serendipitous_donkey",
                    "body": "Exactly",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Slackerwithgoals",
            "body": "Hahaha.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dude_PK",
            "body": "You're def entitled to your opinion obv but I love Miller Lite and Modelo. I hate Coors Light; yellow belly Coors is OK though. Cannot stand Shiner Bock but I'm not sure how popular that is outside of Texas.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheProcess1010",
            "body": "I drink miller lite as a marathon beer, and coors banquet if I’m feeling like I need to get a bit drunk. I enjoy the taste, and my relationship with alcohol is not a healthy one. If you let me get ahold of liquor, I’ll be asleep wherever I am in an  hour or two after I switch from beer. I can ride a very fine line of coherency with beer. Liquor ruins that. And calories of course. 96 calories, 3.2 carbs, 4.2% 🍻",
            "score": 2,
            "replies": []
        },
        {
            "author": "the_pedigree",
            "body": "There is no one more boring than someone who cares what other people drink",
            "score": 2,
            "replies": []
        },
        {
            "author": "Subsandwich99",
            "body": "Believe it or not, especially on a hot summer day..an ice cold can of light beer taste fantastic to me, it doesn't really even have to be light beer, a regular Coors or High Life will do just fine. The last thing I want when it's blistering hot is a triple hopped bottle of dog shit that leaves my mouth tasting like tree bark, and a bloated gut after just 2.",
            "score": 2,
            "replies": []
        },
        {
            "author": "q234",
            "body": "For the most part - I drink light beer when I want to drink to be social but I DON'T want to get drunk. Those heavy-hitter IPAs will sneak up on you fast, I don't like wine, and whiskey...well that's for when you're looking for a different kind of night.\n\nI find that Guinness also fills the role that light beers do when I am in a place that has it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rainbwned",
            "body": "Its refreshing and can get a little buzz going while out playing golf.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Smelly_fartballs",
            "body": "Coors Light*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bitter-Assignment464",
            "body": "Slightly mighties are not bad. People drink light beer for many different reasons. I don’t like almost all lights beers but to each their own.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandomRedditRebel",
            "body": "The bad taste compliments the low lighting and shitty attitudes of the places I drink at.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wadeissupercool",
            "body": "Most cheap American beer is approximately the same, with minor differences. You get used to what you started drinking when you were young. That is the only reason I can imagine someone liking Miller Lite, it's what they think beer tastes like. \n\nAnd that's fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Super_Science_Guy",
            "body": "I completely agree.  Macro brewed light beer tastes so bad. If you just want to take the edge off and give yourself a nice treat at the end of the day there's so many better ways to do it. If you don't want to get drunk, buzzed, feel sleepy, anxious or whatever else it is that you might be avoiding, just drink an N/A beer.  Half the calories of light beer and taste so much better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "etm105",
            "body": "Ah an opinion from an IPA fan, one who enjoys beers brewed from pine needles and rusty nails.",
            "score": 1,
            "replies": []
        },
        {
            "author": "notyourbuddipal",
            "body": "Notice that most people who like them are smokers. Ao they can't taste for shit anyways.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YaboyRipTide",
            "body": "1. I hate the taste of hops, thus IPAs are fucking disgusting and oftentimes considerably and sit in my stomach.\n2. It’s light beer and I can drink a bunch of them. Drinking is also a social thing so if I have 1 shit beer I hate (IPA) that’s 10-12% ABV that’s only 20 minutes of conversation vs 40-60 minutes with 2-3 beers.\n\nBtw this entire post is why people HATE beer snobs. Also why did you bring up blow???\n\nUpvoted for unpopular though",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sugar_Plum_Mouse",
            "body": "It’s a certain kind of person. It’s the same kind of person that drinks, Diet Coke. They’re in a cult. I think? I didn’t like light beer the first time I had it in high school and I certainly don’t like it in my mid 40s. I am too old to drink cheap booze.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Perfecshionism",
            "body": "I don’t understand how anyone likes the taste of beer.\n\nIt has to be a psychological addition to the alcohol.\n\nSo by that reasoning, they drink the lite beer for the same reason anyone drinks beer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Totes_mc0tes",
            "body": "People who feel this strongly about beer are always under 30. Drink whatever you think tastes good, don't worry about other people's preference. I assume you also have strong opinions on which music people should listen to and which movies they should watch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "el_payaso_mas_chulo",
            "body": "LMAO stfu, you sound like you just got into IPAs like a hipster/ barely of age to drink. Light beer is cool",
            "score": 1,
            "replies": []
        },
        {
            "author": "igw81",
            "body": "This is an unpopular opinion?\n\nMost people know it sucks. They just don’t want to get fat or they’re on the beach or something where you don’t want anything heavy",
            "score": 1,
            "replies": []
        },
        {
            "author": "OnlyInterpretations",
            "body": "Nothing worse than beer snobs... take my upvote",
            "score": 1,
            "replies": []
        },
        {
            "author": "JustAContactAgent",
            "body": "OP you lost me at \n\n>IPA that actually tastes good",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArgentVagabond",
            "body": "I thought like you when I was a new drinker at 21. 7 years later and now I almost exclusively drink Coors Banquets (and Light!), Busch and it's lite variant, Miller High Life and the Lite variant, etc. I still like heavier beers, but I can crush 4-6 of the ones I named in a night and not be drunk, maybe pleasantly buzzed at most, meaning I can still remember the night and don't have a hangover the next day. I love me some 'pisswater' beers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Competitive_Pen7192",
            "body": "My excuse is it's cheap...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Turbulent_Effective9",
            "body": "People ain’t drinking lite beers to get drunk \nYour point is really that you don’t like beer",
            "score": 1,
            "replies": []
        },
        {
            "author": "wetcornbread",
            "body": "To me lite beers taste similar to water. I like IPA’s but sometimes I can’t drink more than 1-2 at a time. My favorite domestic non-ipa beer is Yuengling which isn’t “light” but falls in line with Miller lite and Coors lite. I’m also from PA so it’s a popular drink there.\n\nThe first miller lite (my go to “lite” beer) I feel kinda iffy about but halfway through my second one they start to go down like water until I drink 5-6 of them. \n\nIPAs are usually double the price. I buy 24 packs of miller lite at Sam’s club for just under $20. A 6 pack of pernicious (NC IPA and my favorite) is close to $10 at Wal-mart. \n\nIf I’m at a brewery or a bar I’ll get craft beer if available. At home I’ll switch between Yuengling or Miller Lite. Coors lite is fine too it just has less of a beer flavor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eternalrevolver",
            "body": "If you’re drinking lite beer to get drunk then your shoe size probably matches your iQ.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Think-Juggernaut8859",
            "body": "Shane Gillis is turning in his grave right now",
            "score": 1,
            "replies": []
        },
        {
            "author": "IllimitableNebulie92",
            "body": "Light Beer doesn’t taste bad to me, because I find it simply tastes of nothing. It’s also no cheaper than far more flavourful options, at least where I live",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hippopotamus_Critic",
            "body": "It tastes like bad beer, only waterier. Light beer is what you drink if you want to drink beer for some reason, but want it to taste less of beer and also not get you drunk quite as fast.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic_Water3870",
            "body": "Lite beer is amazing. It's the IPAs that are fucking disgusting",
            "score": 1,
            "replies": []
        },
        {
            "author": "HikeSkiHiphop",
            "body": "I just cracked a Coors Light. Fight me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "flirtmcdudes",
            "body": "Why do people eat salads when they can eat cheaper pizza every day that tastes better?!?",
            "score": 1,
            "replies": []
        },
        {
            "author": "dothebubbahotep",
            "body": "Someone's never been on a boat on a lake before.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EccentricPayload",
            "body": "I drink them because they are easy to drink. I could never slam 6 IPAs but 6 Busch Lights, easy. Also cheap and just better for getting a nice buzz.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedSunCinema",
            "body": "All beer has a disgusting taste and undrinkable. It's definitely an acquired taste.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Physical_Complex_891",
            "body": "Beer is disgusting in general. This post makes you sound like an alcoholic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "samhibs",
            "body": "Maybe people like the taste",
            "score": 1,
            "replies": [
                {
                    "author": "StarTrek1996",
                    "body": "Honestly it's really surprising how mad people get about foods when it's very obvious no taste is universal what one person loves another thinks is disgusting",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Robot_Embryo",
            "body": "I agree, but I also think all beer is gross.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amazing-Essay7028",
            "body": "**Alcoholism has entered the chat**",
            "score": 1,
            "replies": []
        },
        {
            "author": "IAmHaskINs",
            "body": "Other than the very first time(which was a budweizer), I have never stopped to taste beer again. Hated the taste of that bud and I knew beer tasted like shit from then on. So I just chug it all. I'm drinking it to get drunk, not talk about it with friends. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "PutridAssignment1559",
            "body": "They taste better after the first three or four.",
            "score": 1,
            "replies": []
        },
        {
            "author": "One-Guilty-Finger",
            "body": "I see a lot of comments about people drinking Bud Light and other light beers because they have less calories. Which may be true, because a watery Bud Light has about 2/3 of calories of a rich, delicious Guinness stout. \n\nHowever, have you ever noticed what people are eating when they’re drinking Bud Light? Baskets of curly fries, cheeseburgers, cheese fries, nachos, bratwursts, onion rings… Not exactly a low-calorie menu. I believe a lot of people who don’t actually like beer will drink light beers because they have less beer flavor. They couldn’t care less about the calories.\n\nFull disclosure, I worked with the Anheuser-Busch brewery as a vendor and consultant off and on for roughly 30 years. When I met my wife, she too was working for the brewery. A-B does not make any of their traditional brands flavorful enough for me, and when I find myself in a location where all that is served are Michelob, Bud, Bud Light, etc., I will just abstain. Same for my wife, who has traveled all over Europe and knows how good beer can be in countries like Belgium and Germany. Typical American beers are not worth the calories, even if the calories are somewhat reduced.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gh1993",
            "body": "I love a hazy double IPA or an imperial stout as much as anyone. Been getting into German and Belgian beers more lately. Absolutely awesome stuff. \n\nBut if you're at the beach all day, or a barbecue, or a long sporting event etc, you don't want to be drinking beers that are 8.5% all day long, or something that's super heavy and super flavorful or you'll be sick and way too fuckin drunk. That's what they're for. They're made to be as close to seltzer water as possible. \n\nPlus I think they taste fine 🤷",
            "score": 1,
            "replies": []
        },
        {
            "author": "NecessaryIntrinsic",
            "body": "Why do you post this as unpopular? I don't know a single person that would rather drink pee than beer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shthappens03250322",
            "body": "Lite beer is the perfect drink to not feel full, but drink all day and maintain a good buzz without being crazy hungover the next day. I like a good craft beer as much as anyone, but on hot summer days on the lake a cold coors light or something similar really goes down nicely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cryingstlfan",
            "body": "I drink Busch Light because it's the only beer I can tolerate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gamebow1",
            "body": "Drink a couple of the nice ones to get a buzz going, then drink the cheap shit, you’ll get hammered and won’t know the difference by the end of the good stuff",
            "score": 1,
            "replies": []
        },
        {
            "author": "imadogcunt",
            "body": "Just turned 22 huh?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Apprehensive_Map64",
            "body": "I prefer 10% beer.  That way I only have to drink 4",
            "score": 1,
            "replies": []
        },
        {
            "author": "WhistleTipsGoWoo",
            "body": "Former alcoholic here - I used to drink the SHIT out of lite beer for the buzz and being able to just rip through them quickly. At my height, I’d drink 12-15 per day and mix some water in so I could function the next morning. \n\nIf I was at dinner with family and friends, I’d order something like a Guinness for the taste to accompany the food and not run up the bill super high (or like like a complete drunk in front of everyone), but pick up a 12-pack of lite beer on the way home and crush it in under two hours. \n\nLite beer to me basically didn’t have much taste, so it was perfect for me to get my fix, although it took quite a few.",
            "score": 1,
            "replies": []
        },
        {
            "author": "redcurb12",
            "body": "meh they don't have enough flavor for me to think anything about it. a coors light basically tastes like carbonated water with a bit of bitterness to it... i don't mind it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GustavoSwift",
            "body": "Beers beer, cold and free ideally",
            "score": 1,
            "replies": []
        },
        {
            "author": "sky_lites",
            "body": "I drink coors light because it's lower in calories and its cheaper than everything else.\n\nIf I never gained weight and was rich as fuck I'd be ordering frulis and blue moon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fatboyfat1981",
            "body": "You’re probably not going to be happy OP, but you’re coming across as a pompous pseud. \n\nWhat one decides to drink is a matter of personal taste, being Judgy McJudgyface is not how to win friends.\n\nAlternatively, this could all be ragebait….",
            "score": 1,
            "replies": []
        },
        {
            "author": "PsychotropicPanda",
            "body": "If you drink fast, then drinking 9% is going to floor you in same time as enjoying an evening and drinking 8 light beers as fast as you want. \n\n\nI mean, I have been in lots of situations where everyone drinks for games, sports, just being crazy. Shotgunning and funnelling and whatever else shenanigans. \n\n\nDo a whole night partying like a wild man drinking imperial beers and see how far you make it before its not fun. \n\n\nEach beer is good in its own ways and uses and preference. \n\n\nI sometimes drink a terrible beer from Colorado, just because it reminds me of a time I lived there and good memories.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ditovontease",
            "body": "They are in fact easier to drink than heavies hence the popularity lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top_Macaroon_155",
            "body": "So what you're saying is it tastes like beer",
            "score": 1,
            "replies": []
        },
        {
            "author": "SasquatchKimono",
            "body": "Needs to be ICE cold and chugged imo, but i like em",
            "score": 1,
            "replies": []
        },
        {
            "author": "gringoloco01",
            "body": "Life is too short to drink cheap beer. \n\n![gif](giphy|QmYosM4PO08FO)",
            "score": 1,
            "replies": []
        },
        {
            "author": "CAMx264x",
            "body": "I'm a sucker for a good whiskey or some crazy heavy beer, but man, you sit on the lake with it being 90 degrees out and an ice cold light beer can really hit the spot, especially when I can drink 12 of those in a few hours and not be fallover drunk. I think they are the perfect for a long day of drinking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Serendipitous_donkey",
            "body": "Regular beer is double the calories. As someone who's 5'1 , I ain't trying to drink all my calories,  but i love drinkin.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Less_Zookeepergame73",
            "body": "I drink Coors Light because it tastes great and I can drink 20 of them with my people for hours on end whilst maintaining a good buzz for a long period of time without getting that feeling that I just had a 4 course meal! Try that with an IPA or even just a regular beer! Bloated gut blah! Everyone is different in taste I would say.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drslappybags",
            "body": "IPAs are also gross.",
            "score": 1,
            "replies": []
        },
        {
            "author": "acclimation6",
            "body": "When I first started drinking, I didn't see the appeal of light beers beyond the cost. I preferred to spend a little more for something with a flavor profile. But as I've gotten older and lived life, I've come to recognize that sometimes a light beer just hits the spot. They're effectively water+, you can have a few while out and not have to worry about finding a ride home. During the summer while mowing the lawn or grilling out or at a baseball game, a light beer goes down smooth. \n\nYeah, there are tastier options, more cost efficient methods of getting drunk, and so on, but there are times where a shitty light American lager is exactly the right beer for the situation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sophiasmistake",
            "body": "Modelo especial with a lime wedge! That shit is the most refreshing drink I've probably ever had. Next to that, Girdwood Brewery's No Woman No Cryo IPA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "knucklebone2",
            "body": "If you’re drinking to get drunk why the fuck are you drinking beer? Get yourself some real alcohol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bobbolini",
            "body": "My dad always said the light beer tastes like \"Homogenized Horse Piss\". I never had the nerve to ask him how he new that...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accurate-Instance-29",
            "body": "Beer, is gross, but it grows on you.  I started with high life. Moved to dweiser and settled on Lite to cut some calories. After a while a Bud heavy would taste gross. To each there own, but if you drink enough, you begin to like it. Also, an ice cold miller lite just hits different on a hot day. Imho.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy_Calligrapher7088",
            "body": "I definitely hated lite beer in my early 20s and didn’t see the point of it. Now in my late 30s, lite beer is definitely the way to go.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fishesar",
            "body": "they taste like a dusty sparkling water",
            "score": 0,
            "replies": []
        },
        {
            "author": "akaynaveed",
            "body": "People like unflavored seltzer water.",
            "score": 0,
            "replies": []
        },
        {
            "author": "figuringitout1192",
            "body": "Or just don't drink, what's the point?",
            "score": -1,
            "replies": [
                {
                    "author": "kellyguacamole",
                    "body": "lol I know this subreddit wouldn’t exist if people just stfu and didn’t do the things they didn’t like instead of complaining about other people liking them.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Busterthefatman",
            "body": "Cheap.",
            "score": 0,
            "replies": []
        },
        {
            "author": "G-T-R-F-R-E-A-K-1-7",
            "body": "Same goes for beer in general - would rather drink a small amount of spirits",
            "score": 0,
            "replies": []
        },
        {
            "author": "LeadGem354",
            "body": "Light beer is water lying about being beer.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Himmel-548",
            "body": "I agree. If I can see through the other side of the glass, it's crap beer. It doesn't have to be dark, but it at least needs to be a pilsner.",
            "score": 0,
            "replies": [
                {
                    "author": "Useful_Milk_664",
                    "body": "Sounds pretentious ngl",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Himmel-548",
                            "body": "Maybe it is. I don't judge anyone for drinking a light beer, what beer someone drinks doesn't determine their quality as a person in any way, shape, or form, but I just hate the taste of light beers. I've tried plenty before, but I've never liked the taste. Take Bud Light, for instance. I can't understand why people would willingly drink it if they have other options available. But if they do, more power to them. They can drink what they like, and I'll drink what I like.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -1,
            "replies": [
                {
                    "author": "Rainbwned",
                    "body": "Cannon?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "EconomyAny1213",
                            "body": "Pirate ship cannon",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Rainbwned",
                                    "body": "Wonder why they didn't say just say sex on a boat.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "WiseBelt8935",
                            "body": "don't type while eating. lesson learnt",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "PabloMesbah-Yamamoto",
                            "body": "I think they meant to write \"USS Carl Vinson Nimitz-class supercarrier.\" Or a canoe. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DaFuMiquel",
                    "body": "Did you mean to say like sex in a canoe?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FireGodNYC",
            "body": "Hard Agree",
            "score": -2,
            "replies": []
        }
    ]
}