{
    "title": "Told my friend I'm not drinking right now and she brought me alcohol",
    "author": "youarebeingwild",
    "subreddit": "stopdrinking",
    "rank": 17,
    "score": 853,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 76,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1in67ac/told_my_friend_im_not_drinking_right_now_and_she/",
    "id": "1in67ac",
    "selftext": "She came to give me something + a jar of vodka with a juice that she knows I like, it was in the same day that we had a nature walk and I told her that. She is a daily beer drinker and we used to get drunk together a lot I was more of a binge drinker when we hungout a lot and I'd say 1-3 times every 2 weeks I would overconsume, I took a long break from her and recently I've tried to do non party stuff with her like that day and she did that the following evening. \n\nMakes me think she's doing it to tempt me and honestly it worked I had a drink, poured out the rest the vodka when she left though. I realize I dont have a friend I have a drinking friend.",
    "comments": [
        {
            "author": "BeneficialSubject510",
            "body": "It's possible she is just a drinking friend. But it's also possible she just doesn't understand. My friend didn't take me seriously when I said I quit drinking. To be fair, she had never seen me NOT drink and I had never voiced to her how much alcohol was impacting my life negatively. I didn't tell her about my alcohol related health issues and my pitiful mental state. So yes, she still offered me a drink every time we got together because that's just what we always did! It took a good few MONTHS of getting together and seeing me refusing alcohol before she finally got it through her head that I was serious. You should give your friend the benefit of the doubt. It's highly possible she just hasn't grasped that you are trying to make a change in your life. It might also be beneficial to see this friend less often if you think she will tempt you. Myself, I'm very stubborn. Every time I'm offered alcohol and get to say \"No thanks!\", it makes me feel empowered. lol But not everyone feels this way. Please make sure you put yourself and your sobriety first. Sometimes you might have to be a little rude about it, and that's okay!",
            "score": 415,
            "replies": [
                {
                    "author": "hot_like_wasabi",
                    "body": "Bingo. Never attribute to malice what you can to incompetence/ignorance/etc.",
                    "score": 195,
                    "replies": [
                        {
                            "author": "BeneficialSubject510",
                            "body": "Exactly. Especially if you know the person well. I knew my friend didn't have bad intentions, and I knew I wasn't completely open about how much of an issue alcohol was for me. Can't be mad at her for what she doesn't know! Even if I had been open about my issue, she has literally NEVER SEEN ME NOT DRINK. It must have been weird for her! I completely understand her not taking me seriously at first. lol",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "luvthatsauce",
                            "body": "That's solid advice. I could stand to remember that more often",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Notablueperson",
                            "body": "This has been the biggest lesson I’ve had to learn in the last few months. And it’s an amazing rule to live by.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Tess_88",
                            "body": "Go Hanlon!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lowkeydeadinside",
                    "body": "people can forget too. i went to a new year’s eve party with my partner and i haven’t really hung out with that group since i quit, though they did *know* i quit. my friend made everyone green tea shots, which used to be a favorite of mine, and slid one my way. my partner caught it and reminded her that i don’t drink, to which her drunk ass said, “oh she *drinks!*” i laughed and reminded her i don’t anymore, she was a bit embarrassed but i assured her it was no problem and gave someone else my shot. \n\nand again to be totally fair to her, that particular group of friends drinks a lot and i was *far* from the exception to that rule. it was a running joke that i was the only gal who could keep up with the guys. she was tipsy, we don’t see each other very often, she genuinely forgot and she didn’t offer me another drink after being reminded.\n\ni know it might seem crazy that op’s friend could forget in an afternoon. but i’ve been known to forget things even quicker than that.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "EmpressPlotina",
                    "body": "This is true. I also wanted to add that sometimes drunks talk about wanting to quit or even mention that they cut down. But a lot of the time they don't really mean it, they're just expressing a wish. I think most of us have been there when you're with other addicts and someone says \"we should really quit. I am done with beer\" and a bunch of others might even chime in and say \"yeah me too\". Or some people I know say they \"quit drinking\" but what they mean is that they stopped drinking vodka, they still drink beer. So it might take some time until it clicks for people that you are really sober.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "buzzbuzzbuzzitybuzz",
                    "body": "I had three \"friends\" in the night out stubbornly offering and trying to trick me by putting it in juice all night long. It was both funny and sad observing three heavily drunk people miserable like that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "youarebeingwild",
                    "body": "Yes I would agree with this but I've known her over 10 years we have had plenty of conversations about addiction about the fact we both don't have parents due to addiction, she got sober and went through extreme withdrawals in 2017 and lasted a month and never again did she try, I have had my windows of being sober and have always explained why and we talk about depression/life how alcohol ruins me and why I am always trying to quit and do better. I had to take time from her in the past 3 years and what made me get closer to her again is her saying she's laying off drinking due to her kidneys and general health after what the doctor told her but then recently that nature walk happened which made me think alot",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "goira",
                    "body": "nah, you have to have a double-digit EQ to only be able to empathize with things you've experienced yourself, let alone something as culturally pervasive as drinking struggles. girl is a loser, and has no empathy.\n\ni honestly am shocked at how often this comes up on this subreddit, and how acclimated people are to low-empathy ppl in their lives.\n\nwe're talking about ***the same day he told her he's not drinking***. the same day. not a month later, where it'd be understandable that old routines outweigh novel information.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "thegracelesswonder",
                            "body": "I’m with you. Absolutely no idea why people trip all over themselves to excuse this behavior.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "nonegenuine",
            "body": "As someone who hated when my friends quit, I totally understand her angle.\n\nAs someone who has since quit, that sucks.",
            "score": 131,
            "replies": [
                {
                    "author": "SoftConfusion42",
                    "body": "Unfortunately, might be a friend OP will have to lose.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fine-Branch-7122",
            "body": "She probably struggles and doesn’t want the party to end yet. Let her know your boundaries.  It might get her to think about her own relationship with alcohol.  Way to flex the discipline muscles.  Iwndwyt",
            "score": 33,
            "replies": [
                {
                    "author": "could_be_doing_stuff",
                    "body": "That's the assertive and healthy approach!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "BeneficialSubject510",
                    "body": "It did with my friend! (See my comment above.) While she was ignorant at first and made back-handed comments about me being \"boring\" a couple of times (while drunk), she's now super respectful and even hinting at her own issues. She's attempted moderation a couple of times (and failed) but she's definitely sober-curious now. What makes me happy is that she still wants to hang out with me all the time even though I don't drink anymore. 🙂 I hope my example rubs off eventually. I'll support her as much as I can just like how she is supporting me now!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "luvthatsauce",
            "body": "I have about 20 years of experience in the medical field, 10 of that as a PA and this is what we professionals call a \"dick move.\"\n\nI am sorry for the lack of support, my friend. I'm not drinking with you today.",
            "score": 111,
            "replies": [
                {
                    "author": "Benwhurss",
                    "body": "They are just panicking for fear of losing their support system (you).",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wobs9",
            "body": "She doesnt want to lose her drinking buddy, and for her alcohol is more important than you. Once you sober up, you will realise some friends will go away (drink ones) other will go near (real ones).",
            "score": 32,
            "replies": [
                {
                    "author": "stinkypitpaste",
                    "body": "this is happening to me and It’s hard but I think it’ll be worth it in the long run. iwndwyt<3",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Wobs9",
                            "body": "You will find new friend and new hobbies/ activities, trust me.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BoneAppleTea-4-me",
            "body": "I will say now and always that friends and family who dont support healthy choices dont give a flying fuck about you. She just wants you to be drunk with her. I was an alcoholic (have liver cirrhosis now) and the only people bummed i no longer drank were all the active users in my life...they no longer are. If they cant support you, then adios.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Meetat_midnight",
            "body": "“MISERY LOVES COMPANY”\n\nA friend who is sober told me this as an answer for peer pressure during my first months of sobriety. The friends who continue pressuring me to meet for drinks/drugs, it’s true. The addicted ones, need others to party so they insisted on me attending events. \nI am out! Few days shy from 1y sobriety and I am Not going back to alcohol, cigarettes or any other shit I have tried during my mental breakdown. I am not even around the people who still do nothing to get out of theirs mental breakdown. \nLife is only one and too precious to live in a brain fog.",
            "score": 20,
            "replies": [
                {
                    "author": "NailCrazyGal",
                    "body": "True!  \n\nI have the same situation with a friend of mine. \n\nIt's not just with alcohol, but other things as well. She's keeping her toxic boyfriend who spat in her face the other day, and made mention that maybe I should still be friends with my toxic ex-boyfriend. I said, no thank you. It's going to take many months for me to get back to my baseline I had before I met said toxic ex-boyfriend, and I'm going to focus on myself. \n\nOur conversations have become fewer and fewer because I don't really want to hear her alcohol/bar/drama stories anymore. I try to focus the conversation onto something healthy, and it seems like she doesn't like it.\n\nEdit to add - it seems like misery does love company because she's trying to keep me in the same situation she's in. Nope, not having it! I am enjoying sobriety and doing healthy things.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Anfield_YNWA",
            "body": "One of my friends is a great guy but he can miss cues sometimes, about two months after I got out of the hospital he told me I should stop taking my antabuse for a couple weeks so we could go to Vegas and party. I thought my wife and his were going to kill him, he really just didn't get it somehow but once it was clearly explained he understood. It's been about five months since that incident and he's been my best friend through this, checks in when he hears about any struggles I am having to make sure I'm ok not drinking and overall has just been a great dude to have in my corner. \n\nSome people just need it spelled out a little clearer, some don't get it, some don't care. Good luck finding your people for your journey.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Practical_Choice5981",
            "body": "She is not your friend",
            "score": 34,
            "replies": [
                {
                    "author": "Jokkitch",
                    "body": "Listen to this OP!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "PaintedWoman_",
            "body": "When you decide to get sober you find out who your friends and family that  are good to have in your life and unfortunately the ones that are toxic in your life.",
            "score": 8,
            "replies": []
        },
        {
            "author": "latabrine",
            "body": "My best friend once asked me if it was ok if we didn't drink when we next saw each other, she was trying to slow her drinking. I said 100% of course!! \n\nI since quit drinking (529 days ago)and she has ghosted me. Not. A. Word.\n\nSome friends aren't meant to be forever.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Valuable_Divide_6525",
            "body": "Good on you for pouring out the rest even after having a drink though. You're awesome. Please don't ever feel pressured to have that first drink though!",
            "score": 13,
            "replies": []
        },
        {
            "author": "briantx09",
            "body": "misery loves company",
            "score": 12,
            "replies": []
        },
        {
            "author": "SandBrilliant2675",
            "body": "(This is a strait from this naked mind opinion, great book highly recommend).\n\nBy no fault of your own, after your conversation about *your drinking*, she likely feels self conscious of her own drinking and felt hurt by your perspective of *your* relationship with alcohol and its impact *on your life*. \n\nYou say you used to get drink together (pretty frequently), that she still drinks on a daily basis (no judgment we’ve all been there), and since you have reevaluated your own drinking you’ve (1) distanced yourself from her and (2) tried to center your relationship around non alcohol related activities. \n\nAlcohol consumption is something that can really strike a emotional nerve with people (because we’re conditioned to look at alcohol like it’s not an addictive substance and when someone cannot or chooses not to drink alcohol, something terrible must have happened to them that lead them to that decision). \n\nSo when you spoke about your current relationship with alcohol and choice not to drink, she likely first thought, oh gosh this person drank similarly to me, and if they think they have have a problem, that must mean *they think* I have a problem. Then she thought, no I don’t have a problem, therefore you don’t have a problem. And then she brought you alcohol to prove that fact to herself, by showing both herself (and by proxy) that your drinking is fine, therefore her drinking is fine as well. \n\nGiving her the most grace possible, she probably wasn’t even consciously aware she was thinking this or putting you in such an uncomfortable position. She was just trying to protect her self image of herself and her drinking. Which yes, is a dick move, but likely an unintentional dick move. \n\nIf she is a true friend and a good friend, I would give another run and really explaining to her how alcohol has affected your life and how you feel alcohol is not serving you life (right now, forever, whatever you have decided) and that her gesture “while thoughtful”, made you uncomfortable. You are not judging her and you’d like to continue a relationship with her, but you have boundaries around *your own* drinking and you’d like her to respect that. If you don’t think she’s a true friend, that’s also fine, we do have friends who are just drinking friends, and when the alcohol is removed there’s nothing left (alcohol is a HUGE part of our society and adult friendships). That’s up for you decide and act upon, while maintaining the boundaries you’ve set for yourself. \n\nWhen I told my close friends I was stepping back from drinking, none of them offered me alcohol, but they did feel a little weird inviting me to events with alcohol, and I had to let them know it’s ok, I have my own boundaries and if I need to leave I’ll leave. I have less close friends I haven’t seen in time since I really questioned and changed my relationship with alcohol, I never told them I wasn’t drinking, I just declined heavy drinking invitations and they stopped inviting me out.",
            "score": 6,
            "replies": []
        },
        {
            "author": "PossessionOk8988",
            "body": "Some people really don’t get it so it’s up to you to be strong and say no to yourself. Get what I mean? And yeah it’s a lot harder than I’m making it sound. My number one rule? Not even a sip.",
            "score": 7,
            "replies": [
                {
                    "author": "BloggerCurious",
                    "body": "I like that rule, \"Not even a sip.\"",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "roseyrune",
            "body": "try talking to her about it, how it made you feel. explain that this is a serious life change for you. if she doesn’t get it, you might have to stop hanging out with her. i’ve lost friends because all they do is drink and i don’t want to be around it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "AimingForBland",
            "body": "Wow. That's strange and sad on her part. I would have stated honestly exactly what I was thinking: \"I'm confused: Why are you bringing me alcohol right after you learned I'm quitting and how important it is to me to quit?\" \n\nI wonder what she would have said. \"Let's drink one more time for old time's sake\"? Or try to convince you not to? \n\nI don't think you should leap to abandoning her as a friend, but if something like this happens again, it shouldn't go unchecked. She needs to know that it isn't acceptable to tempt you with alcohol.",
            "score": 5,
            "replies": []
        },
        {
            "author": "IngenuityNovel5936",
            "body": "People who are drinking amd likely have a problem with it will do stuff like that, because if you admit you have a problem, we’ll then they have to take a long look at themselves and they don’t like it. That’s so much more about her than you!",
            "score": 7,
            "replies": []
        },
        {
            "author": "This_Possession8867",
            "body": "Ask yourself these questions. \n1. If I was your friend and said I needed to lose weight. Would you bring me an entire cake the next day? \n\nThis isn’t a true a friend. If a friend tells me they are quitting something I do everything I can to be supportive. I have a friend who is quitting smoking and when she tells me that she can’t go somewhere as everyone smokes there. Well we go somewhere else. \n\nPlease this isn’t healthy. \n\nPerhaps go on Meetup and join a local hiking & walking groups. Gravitate towards people in the group who don’t drink. Build your new life without the drinking buddy.",
            "score": 6,
            "replies": []
        },
        {
            "author": "AskingforFriend69",
            "body": "That is not a friend. There are people struggling with drinking and want others to continue on with them. My neighbor is just like this. He eggs me on to have 1 with him all the time and I stand firm but its at a point where I am about to say “bro, fuck off - dont offer me a drink” and yes he is a functioning alcoholic",
            "score": 6,
            "replies": []
        },
        {
            "author": "yuribotcake",
            "body": "When I drank, last thing I'd want was to lose my drinking buddies. I'd purposely try to convince people to drink who said \"I got stuff to do tomorrow, not drinking today.\" To me it was like a hilarious mission to get them to cave. Never realizing that my brain was so transfixed on drinking that not drinking didn't make sense. The main reason I went to AA (as a self-proclaimed atheist) was just to surround myself with non-drinkers. And when I told people that I quit, my drinking buddies got upset and tried to find a way to change my decisions, while real friends stood by my side saying \"yea it's probably the right thing to do...\" Drinking buddies faded into thin air, real friends (who still drink) are still there. But I've learned that I cannot be upset at people who worship alcohol, this addiction is ruthless, and it manifests itself in so many normalized ways. Not drinking simply allows be to see pass all the bullshit. It also allows me to do things that I actually enjoy doing, and not do things that are awful unless substances are involved. \n\nIWNDWYT",
            "score": 4,
            "replies": []
        },
        {
            "author": "CryptoTipToe71",
            "body": "I think the most important thing is that you didn't drink what she brought you.  It's one thing to not go out and buy alcohol.  It's another to have it in your home and intentionally get rid of it.  Good job!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Alone-Village1452",
            "body": "Next time trow it down the drain in front of her and tell her I told you I dont drink.",
            "score": 13,
            "replies": [
                {
                    "author": "bayareadunks",
                    "body": "How inconsiderate! At the very least smash it over her head and let her drink it!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NailCrazyGal",
                            "body": "🤣🤣🤣",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dj_juliamarie",
            "body": "Be bold, tell her exactly how you feel. “ I told you I don’t wanna drink. Why are you offering me alcohol? It’s usually their own reflection that hurts the words when people around them stop drinking.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Papa_Dabz",
            "body": "One of the hardest parts of sobering up was realizing who my friends were and who just liked drinking with me. IWNDWYT 🫗",
            "score": 4,
            "replies": []
        },
        {
            "author": "Suspishbish97",
            "body": "Unfortunately I’ve experienced something similar. I had to cut my friend off because she was refusing to respect my boundaries I hope you’re situation has a different outcome but if it does happen stay strong 💪🏻",
            "score": 4,
            "replies": []
        },
        {
            "author": "Eldest_Muse",
            "body": "You’re right. She’s not your friend and you are not her friend, either. \n\nYou are her drinking buddy and she made that very clear.",
            "score": 4,
            "replies": []
        },
        {
            "author": "DoingItForMe93",
            "body": "In my experience, the people in my life who took it personally when I stopped drinking felt that way about it for two reasons: the people who drank as much as I did questioned their own relationship with alcohol and/or felt that I was going to judge them now, and the people who didn’t drink as much as I did couldn’t use me as their “messy drunk friend” or their “well at least I don’t drink as much as SHE does” anymore. If I had a friend that did this I would talk to them about it directly. I would tell them that I’m completely sober, that this is something I would like their support on, and that I don’t want them to bring over anymore alcohol. If they can’t support that, then what kind of friend are they?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Zeeky_H",
            "body": "I would cut her some slack because it was the same day and it might not have registered, but only because of that. You’ll probably have to find new friends if you want to give yourself the best chance of staying sober, that’s a hard thing to accept for some people and a sad time, so she may be in denial.\n\nEdit: on second read, it sounds like you’re in denial too, lol. Maybe you had a thing for this girl, (idk) but she’s not likely to change for you. Trust me, I’ve tried that before, it sucks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "barkingatbacon",
            "body": "Your friend is insecure about her own drinking. That is all I know for sure. \n\nShe could have simply forgot but I doubt it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "InuitOverIt",
            "body": "When I was drinking I didn't want to hang out with non-drinkers because their existence made me examine my own issues that I didn't want to confront. Never went to the point of sabotage like this, but I'm not surprised. Next time dump it in front of her, she'll get the point.",
            "score": 7,
            "replies": []
        },
        {
            "author": "yearsofpractice",
            "body": "Hey OP. I have had similar experiences, and they have all been - ultimately - benign rather than someone trying to make me drink. \n\nIt comes down to one thing for me - fear. I’m ***afraid*** of alcohol and the effect is has on me. I know - I fully comprehend - that it wanted me dead. People who have never felt the seductive pull of alcohol as I have cannot understand that fear, that terror - facing something that I fully understand is lethal. To them, it’s just another thing like chocolate, a book, some coffee beans, some flowers… it’s not something that has any further connotations or indeed threat. To me, it’s a lethal as a hungry tiger and I sure as shit don’t want a hungry tiger for a gift. \n\nEither that, or she’s a monumental dick. \n\nAll the best and IWNDWYT.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Aggravating_Junket77",
            "body": "You're her safe and comfortable person to drink with and be in that state of mind with. She is trying to get back to that. Hopefully you can work out just being friends in general because regardless its still a friendship and you are important to her.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Much_Row4780",
            "body": "People who drink often, usually do not like to see others, especially drinking buddies, quit drinking. In my personal experience I've had to stop spending time with some of my really good friends because we have lost a lot of things we have in common now that I no longer drink.",
            "score": 3,
            "replies": []
        },
        {
            "author": "FineLavishness4158",
            "body": "That's not a friend",
            "score": 3,
            "replies": []
        },
        {
            "author": "Spare_Answer_601",
            "body": "IWNDWYT. “Grant me the serenity to accept the things I cannot change, the courage to change the things I can and the wisdom to know the difference “ focus on what you can control. That way I was able to keep my drinking friends, set my boundaries and focus in my sobriety.",
            "score": 5,
            "replies": []
        },
        {
            "author": "brentf2000",
            "body": "You need a new friend.",
            "score": 9,
            "replies": []
        },
        {
            "author": "BrownGurlinTheRing",
            "body": "You do not need enemies if you have such friends.",
            "score": 6,
            "replies": []
        },
        {
            "author": "NiCeY1975",
            "body": "Sad uncovering. \nYour recovery however tops that on the prioscale. \nDoing great.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AmazingSieve",
            "body": "Your friend sucks. She’s got a bad sense of humor or is outright disrespecting you by trying to break your sobriety",
            "score": 4,
            "replies": []
        },
        {
            "author": "Eye-deliver",
            "body": "Bingo! You were pissing in her beer and she was not having it!\nPeople, places and things are my biggest trigger. Sometimes you just have to leave them behind",
            "score": 2,
            "replies": []
        },
        {
            "author": "spiritual_seeker",
            "body": "Not your friend.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jealous_Appearance93",
            "body": "Time to get a new friend.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JACSliver",
            "body": "She is not your friend, she is someone who must be cut off from your life. Establishing a boundary will never ruin authentic things.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tintabula",
            "body": "That hurts. I'm sorry.",
            "score": 2,
            "replies": []
        },
        {
            "author": "spaceshipforest",
            "body": "I have been that friend with weed. When a friend told me that she was smoking less weed, I didn’t really understand that she meant “I am trying to seriously cut back and do not want to smoke with you.” She was my stoner buddy and it just didn’t compute - I was never trying to be a terrible friend. \n\nTry talking to her and telling her how you feel about this. If she responds badly or defensively, just explain how you feel and the demons you’re trying to overcome. If she’s a real friend, she will take what you say and learn to be your friend without the booze.",
            "score": 2,
            "replies": []
        },
        {
            "author": "buzzbuzzbuzzitybuzz",
            "body": "Yea, same here so I cut her off. Plus other friend. Some people are just drinking friends. They don't hang out with you from respect but because you make them feel accepted regardless they are alcoholics.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ShillinTheVillain",
            "body": "It's tough when you quit and realize many of your friends are just drinking buddies.\n\nHang in there.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GrouchyVacation6871",
            "body": "And that's not a \"friend.\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beautiful-Victory976",
            "body": "She isn’t a friend then 🤷🏻‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrokenVacuumCleaner",
            "body": "I think we need to understand that the fact and decision that we stop drinking, people simply might not understand. That doesn't make them less of a friend or \"just a drinking friend\". \n\nNot drinking is a personal choice, it's ours alone and in my opinion, we cannot saddle up others with it. I am not expecting others to avoid drinking just because of me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "genie_in_a_box",
            "body": "Cut her off if you value your sobriety. She clearly showed you she has no respect for your decision to be sober.",
            "score": 1,
            "replies": []
        }
    ]
}