{
    "title": "Hooch made me a functional alcoholic (lsd reversed that)",
    "author": "jeiay",
    "subreddit": "stopdrinking",
    "rank": 10,
    "score": 269,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 28,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1injijb/hooch_made_me_a_functional_alcoholic_lsd_reversed/",
    "id": "1injijb",
    "selftext": "I thought I was doing okay, and even saving money compared to my peers. With food stamps I'd purchase gallons of juice, sugar, and yeast, and voila, in a week I'd have hard cider. \n\nSince it took time to make I though I could regulate my drinking, until Friday nights turned from making 2 gallons of hooch to 8 gallons. I still functioned enough to go to school (I graduated high school early with an associates degree, but dropped out of college when I was living alone with no reason to hide my drinking) and considered it a flex when other asked how I managed to always aquire alcohol in large quantities (I'm still below drinking age).\n\nI grew up around alcoholics, and from 10 years old my uncle and dad thought it'd be funny to give me some cognac or wine and see what happened. After a decade from stealing alcohol to eventually making it, I decided to stop drinking after having the most profound and shitty trip on acid while hungover (I don't condone nor recommend psychedlics to anyone, do your own research). \n\nI knew alcohol was poison, but I never visualized the exact way it poisoned my mind and body, until this trip outlined my brain fog, shitty sleep, bloated face, blacking out, waking up in vomit, actively killing myself when I'd never wish this on someone else.\n\nSince then if I smelled even a drop of alcohol from either hooch or hand sanitizer I'd start gagging. It was my body actively rejecting what is destroying it. I still tried to drink 2 times afterwards, the first time I was gagging with each sip and had to swallow the bile that rose, with the second I threw back up everything I worked so hard to drink into the cup.\n\nNow after only 2 weeks sober since the last drop of alcohol I can finally stay asleep throughout the night, I'm still having trouble falling asleep. My face cleared up and I can remember my previous activities from the day before. I know it's only been 15 days, but I don't ever want to touch that poison again.\n\nYes I no longer talk to some people cause they only want to hang out when intoxicated, and now I can't hide from my thoughts, but sobriety is beautiful. I don't remember the last time I was sober this long. You can see my previous post I nearly died choking on my own vomit a month or so back. \n\nBut I think I'm content now. ",
    "comments": [
        {
            "author": "untimelyrain",
            "body": "I am absolutely thrilled for you!! 🙌💕 It seems like this experience was necessary and may actually be one you look back on forever as a monumental moment that changed your life. Psychedelics can extremely powerful tools of transformation. This experience doesn't surprise me at all ~ psychedelics often act as medicine, bringing us insights and realizations we sometimes don't think we want or know that we need. I am so happy that you had this experience and that it had such a profound effect on you. You deserve to live a fulfilling and wholehearted life ~ you deserve to thrive!! Alcohol steals that opportunity from us. \n\nWishing you all the best! 🤍🤍🤍",
            "score": 49,
            "replies": []
        },
        {
            "author": "SuddenlySuper",
            "body": "Wow! That is pretty interesting, I must say. I hope your sleep patterns continue to improve! That is a game changer for me.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Odd_Support_3600",
            "body": "Tripping ftw",
            "score": 34,
            "replies": [
                {
                    "author": "papes_",
                    "body": "I'm glad it works for who it works for - but is this not a dangerous message in a subreddit where many people are already prone to substance abuse, and often in an emotionally vulnerable state and looking to potentially alter conciousness in a harmful way? I think OPs take was good on it, but I feel like this is a seed that doesn't need planting.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "blizzardplus",
                            "body": "I know you are getting a lot of shit.  But you are totally right.  Emotionally distressed people can have VERY polarizing experiences.\n\nSome people can have an inspiring, life changing experience.\n\nSome people can absolutely freak out and lose touch from reality.\n\nI have had both experiences.  My first trip made me a better, happier person and my last trip almost landed me in jail and lost me my job.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "papes_",
                                    "body": "For sure. I'm sure LSD and weed can both be useful tools depending on circumstance, as evidenced by OP. But reducing it to 'getting high is great', in a forum with a large proportion of people who have issues with at least one substance, has the potential to cause real harm.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Odd_Support_3600",
                            "body": "I respect your viewpoint but I feel disregarding other substances like medical cannabis for example could stigmatise a potentially useful treatment or tool to give up alcohol.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "papes_",
                                    "body": "I don't think any of it should be disregarded - but I do think 'tripping ftw' strips the nuance out of the topic and reads as 'psychedelics are the answer', which could be a harmful message in a space for recovery.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Morlanticator",
                                            "body": "Most of my friends died from switching substances. Not from LSD itself obviously but everything else. Extreme desperation for relief from alcohol addiction. Many relapsed on just pot then flew off the rails to alcohol and the rest.\n\nSome can do one thing and not another. Some people turn out to not be alcoholics after all. \n\nPersonally I wouldn't have survived without following the AA approach of complete abstinence from everything. I never made a true life lasting change from within until I stopped everything.\n\nAnyone else can enjoy and defend drug use and that's fine for them. I had enough from years of homeless alcohol and drug rampaging though myself.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "Odd_Support_3600",
                                            "body": "I think you might be reading too much into it.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "papes_",
                                                    "body": "I think it's important to be careful about recommending, or trivialising, substances in a place designed for recovery for people with substance abuse issues.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "Odd_Support_3600",
                                                            "body": "Cali sober works for many people. Everyone is different but we don’t judge and we respect and support people in their journey to getting their drinking under control.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "papes_",
                                                                    "body": "I agree - I think it can be a useful tool for a lot of people. I also think 'getting high ftw' is a potentially harmful message on a forum for substance abuse recovery of any kind.",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Odd_Support_3600",
                                                                            "body": "Ok agree to disagree",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Odd_Support_3600",
                                                            "body": "With all due respect this is stopdrinking, not drugsarebad.",
                                                            "score": 10,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LargeInvestigator961",
                            "body": "If you have tried strong psychedelics you would know that it would be nearly impossible to become addicted to them.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "blizzardplus",
                                    "body": "Very possible to have a dangerous psychotic episode tho.  Ask me how I know.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "StinkyNutzMcgee",
            "body": "Congratulations don't take your achievements lightly.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Tg_the_king",
            "body": "Youre are content now, friend.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Funny_bunny499",
            "body": "Awesome.  Simply awesome.",
            "score": 5,
            "replies": []
        },
        {
            "author": "NoCoastNeutral",
            "body": "Thank you for sharing and congratulations!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Gradydurden",
            "body": "Keep going. Way to go! IWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "LocusHammer",
            "body": "Stay strong. 2 weeks is still very early",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tess_88",
            "body": "That’s really great news! Psychedelics can lead to immensely powerful insights. I’m really happy you choose an alcohol free life at such a young age. Not that I have regrets - however if I could’ve done 1 thing differently - that is the one. IWNDWYT ♥️",
            "score": 1,
            "replies": []
        },
        {
            "author": "OvertonWindowCleaner",
            "body": "[FWIW](https://www.theguardian.com/science/2012/aug/23/lsd-help-alcoholics-theory)",
            "score": 1,
            "replies": []
        }
    ]
}