{
    "title": "Breaking the cycle",
    "author": "Skerries10",
    "subreddit": "stopdrinking",
    "rank": 18,
    "score": 32,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1inosj4/breaking_the_cycle/",
    "id": "1inosj4",
    "selftext": "Haven't had a night off in a couple of months now.\n\nJust after 7pm here - prime danger zone for me.\n\nBut instead of being on my second beer (of 8), I'm about 30 mins in to 4 mile walk.\n\nI've left my car at one end, and have to get public transport back, so am committed to this walk. Gonna treat myself to a burger when I finally get back to my car, so don't expect to be home til around 9. \n\nToo late to start drinking then (for me),  so it just took a little motivation to at least have one  night off.\n\nLooking forward to a read tonight, and some proper restful sleep. And of course no anxiety inducing hangover tomorrow.\n\nNot sure the point of this post, other than maybe offering some inspiration for anyone else struggling to break the cycle like I am.\n\nLate night showing at the cinema is another good one to get your mind off it.\n\nPeace to you all.\n\nEdit - thanks all for your comments.  Done it, had my burger, fries and strawberry shake.  In bed with my book now.  Funny once I got past the \"Danger zone\" I didn't feel the need to drink.\nWishing you all well.",
    "comments": [
        {
            "author": "Hopeful_Concept_1704",
            "body": "Mine is 4:30-7:30. Trying to come up with ideas for transitioning from working from home into mom-mode which can be mind numbing.",
            "score": 5,
            "replies": [
                {
                    "author": "wisarow",
                    "body": "Taking a shower is a nice way to switch from one mode to the other. I think the kids notice a difference as well.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Odd_Support_3600",
                    "body": "Non alcoholic beer works for me",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LongjumpingLeek6820",
            "body": "I know alot of people use exercise to help, also food haha. I do both but one thing I've came to realize as I am early in my sobriety as well is swimming is super helpful. If you can find a gym with a lap pool swimming is a great relaxing exercise to clear the mind. And even if you aren't good at swimming, it's hard to think about drinking when you are trying to just breath. Congrats on the win. Enjoy the hell out of that burger",
            "score": 4,
            "replies": [
                {
                    "author": "DazeofGl0ry",
                    "body": "I'm not good at swimming and this summer I got into treading water at our local lake. I would just swim out a bit, tread for 15-30, and dry off. Being in the water really takes you out of your usual space. Ugh! I miss summer. It always comes back, but yikes Feb is hard.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "papes_",
            "body": "Sounds awesome! I think avoiding the danger zone like you are today is essential in early sobriety. Mine was around 5:30-8pm - after 8pm there was no point because I couldn't get as drunk as I wanted before falling asleep.\n\nEnjoy your burger!",
            "score": 3,
            "replies": []
        },
        {
            "author": "MopingAppraiser",
            "body": "This is a great plan.  Thanks for sharing!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Eye-deliver",
            "body": "My danger zone during the work week was 4pm until I passed out. Weekends anytime until I passed out.  It was never too late or too early. Any time was right on time. \nI’ve found that my alcoholic brain does not like a moving target so you taking a long walk is the best thing to do. Any movement really is beneficial for me so I try to stay in motion. And when I can’t I come here and keep my brain in motion. \nIt helps to keep reminding me of the hell that awaits if I pick up",
            "score": 2,
            "replies": []
        },
        {
            "author": "on_my_way_back",
            "body": "One step at a time leads to day at a time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LongjumpingLeek6820",
            "body": "Something about the water right!... maybe try a warm bath",
            "score": 1,
            "replies": []
        }
    ]
}