{
    "title": "Help",
    "author": "Odd-Cup-1626",
    "subreddit": "stopdrinking",
    "rank": 47,
    "score": 7,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1inqxd3/help/",
    "id": "1inqxd3",
    "selftext": "I feel like shit today. Please give me tips and tricks for a miserable hangover. ",
    "comments": [
        {
            "author": "wethrowupupandaway",
            "body": "There is zero cure for hangover. The best you can do is take to heart how you feel now and use it as fuel to motivate you to not drink.",
            "score": 7,
            "replies": []
        },
        {
            "author": "shineonme4ever",
            "body": "> \"*tips and tricks for a miserable hangover.*\"\n\nI stopped drinking and haven't had a hangover since August, 2015.          \nWhat are you going to do when the next urge to drink enters your mind?          \nI needed a plan because nothing changes if nothing changes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Yell-Oh-Fleur",
            "body": "The only cure I found was preemptive: don't drink alcohol. I can't think of anything else. I'll go check the r/howtoenjoydrinkingalot sub and get back to you.",
            "score": 2,
            "replies": [
                {
                    "author": "Apart_Cucumber4315",
                    "body": "I actually clicked this link thinking it was real, haha.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Eye-deliver",
            "body": "Glad you’re here! The only tip I know of to beat a hangover is to not drink. Of course this will not help you today but I will help you tomorrow. Today you have to pay. Tomorrow you don’t have to. Good luck!",
            "score": 2,
            "replies": []
        },
        {
            "author": "mindbodysober",
            "body": "Hydrate with Gatorade and water. Won't really make you feel better, though. The hangover is your body trying to metabolize the poison in your body. Staying hydrated may help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CalmRage1989",
            "body": "Time",
            "score": 1,
            "replies": []
        },
        {
            "author": "Character-Grade-4247",
            "body": "This was me 3 days ago and I got through it by 1. Chanting “I never have to feel this way again” to myself like a prayer and 2. Joining this subreddit and soothing myself with solidarity 3. Being honest to the people closest to me about how scared I was about my drinking 4. Drank a shit ton of fluids and tried my hardest to get some food in me and nap. \n\nI will not drink with you today. ❤️",
            "score": 1,
            "replies": []
        }
    ]
}