{
    "title": "I'd rather feel FOMO than have another drink",
    "author": "sleepcomfort",
    "subreddit": "stopdrinking",
    "rank": 23,
    "score": 18,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1inr4m4/id_rather_feel_fomo_than_have_another_drink/",
    "id": "1inr4m4",
    "selftext": "A week sober now and my coworker said they'd love to have me at a going away party for another coworker that's at a bar. I work nights and thankfully it's on a day that I work so I could just say \"sorry, I have work\". She was saying I should call out and go the party but I just laughed it off. Really, part of me would love to call out and join but the bar is the last place I need to be at right now. I don't want to miss out on money either even if it means I have to endure another 10 hour shift at work. I didn't tell her that I'm a week into sobriety and trying to stay that way. Everyone at my job talks about drinking all the time, either from them it's a bottle of wine a day or a couple glasses of wine a day or several beers a day or going to the bar immediately after work and getting shitfaced. It's really hard to listen, makes me feel like I need to drink in order to feel included and have a social life. I already am used to being alone enough because I work nights so what difference is not drinking going to make. I don't like me when I drink and I wouldn't want to reveal the drunken side of me to people who only ever know the sober side of me. \n\nIt's been tough this week. Yesterday I was having a hard time sleeping and I felt really anxious so I felt this great temptation to go to the convenience store and get a tall boy so I could relax. I ended up making some valerian tea instead and that worked much better than alcohol. Wish me luck for the next few weeks",
    "comments": [
        {
            "author": "Derek-Lutz",
            "body": "100%. The FOMO is a fallacy anyway. A fear of missing out on wasting money, behaving poorly, and hangxiety… it’s like feeling bad you’re gonna miss out on getting into a car accident.",
            "score": 10,
            "replies": [
                {
                    "author": "Helen369kevin",
                    "body": "No FOMO, solo alcol!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "FlyingKev",
            "body": "It's called FOMO (and not MO) for a reason :)",
            "score": 4,
            "replies": []
        },
        {
            "author": "S3simulation",
            "body": "I don’t know what happened to me this last time that i decided to quit but i don’t have that at all this time around. I have no desire to go out with coworkers like I did before. I wish I had hit this point sooner.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Limp_Library225",
            "body": "I've never been the after work happy hour kinda gal but my colleagues do like their drinks at dinners conferences,  etc. My last drink was 12/31 and have held strong thru three work outings this month ... i was the only one not drinking. No one seemed to care except my former boss who commended me for sticking w it.\n\nStay strong. IWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sweetnessnease22",
            "body": "I’m avoiding social drinking situations these early days it’s too hard for me. Wishing you luck but also that you connect with your values. ",
            "score": 1,
            "replies": []
        }
    ]
}