{
    "title": "Doug, house of cards.",
    "author": "Dyl302",
    "subreddit": "stopdrinking",
    "rank": 33,
    "score": 7,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1intzxj/doug_house_of_cards/",
    "id": "1intzxj",
    "selftext": "House of cards is one of my all time fave shows (for the first 2 seasons anyway. In season 2 Doug Stamper meets with Feng. Feng tempts him to a drink. With expensive as hell scotch in the way of an old fashioned. The way Doug: 1. admits he’s still an alcoholic despite being in recovery for many years and 2. slaps that $40k scotch out of Fengs hand. I think that’s the most ‘real’ portrayal of alcoholism I’ve seen in a long time. Especially with the mantra, “you can only control your first drink.” \nBut the way he slapped that drink in the ‘nice try, I’m not doing this bullshit’ was. I think it’s Doug’s best episode for that alone and wish we got a spin off. I\n\nI know he’s not real, but damn. The conviction in that scene. As an ex whiskey lover, I don’t think I would’ve turned down $40k Macallan. But it was just so iconic for me to see in recovery myself. I was thinking about buying a bottle until I saw that. Alas. I will not drink tonight. Thanks House of Cards. ",
    "comments": [
        {
            "author": "Dyl302",
            "body": "I also apologise if this is not what this sub is for. Since I’ve stopped drinking life been getting lonely, so I just started rewatching all the old good Netflix shows from its peak and this was just a standout moment I felt I had to share with anyone really.",
            "score": 6,
            "replies": [
                {
                    "author": "spacebarstool",
                    "body": "I'm not sure about rules, but you are sharing an anecdote about how your real life relationship to alcohol related to something you watched.  I enjoy posts like these.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Apart_Cucumber4315",
            "body": "I don't remember this scene but it's been a while since I've seen any episodes from that show. \n\nDuring my first year, I used to get such a feeling of accomplishment when I was able to refuse alcohol,  whether it was someone offering it or I had access and manage to turn away from it. It was such a great feeling at the time I turned it away, but more so the next morning. \n\nIt still happens, yet I think I've become more accustomed to the feeling now. I should take some time to be grateful for the mornings of waking up sober. \n\nThanks for sharing",
            "score": 2,
            "replies": []
        }
    ]
}