{
    "title": "Fascinating: I’ve not been drinking for three months, and I realize today that my cracked feet returned to normal!",
    "author": "Feed_Me_No_Lies",
    "subreddit": "stopdrinking",
    "rank": 3,
    "score": 143,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 26,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1inux7a/fascinating_ive_not_been_drinking_for_three/",
    "id": "1inux7a",
    "selftext": "In hindsight, it makes sense, right? We all know drinking is not good for the skin. It’s a diuretic, etc. etc.\n\nBut yeah: I looked at my feet today and said “What the hell ?!” Because as an almost 50-year-old, I had noticed my feet getting progressively dryer and cracked over the last several years.\n\nI simply never connected it to alcohol. \n\nWow. That’s pretty mind blowing for me actually.\n\n😮 \n\nWhat are some other things did you were surprised to see improve after you stopping drinking?  ",
    "comments": [
        {
            "author": "Muted_Ad9910",
            "body": "Somewhere along the way, I was convinced that I run hot. I was always sweaty, spent most of my time at home in just shorts no matter the season.\n\nWell… I always ran hot, and my wife was always feeling colder. Now it’s the opposite! I’m always colder than she is, wearing more clothes in the house etc. \n\nI see now that without my body constantly churning away to process alcohol. I run cooler. It makes sense! But for a decade of my adult life I was convinced that it was just how I am, but it was what I was doing to my body.",
            "score": 55,
            "replies": [
                {
                    "author": "Basic-Direction-559",
                    "body": "Well I'll be damned.... I hadnt given any of this much thought... My feet are now softer, and I do run quite a bit colder. Only 2 months in.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Feed_Me_No_Lies",
                            "body": "Wild huh?!",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Muted_Ad9910",
                            "body": "Only 2 months and you’re seeing positive healing!! Awesome 🤩 \n\nIWNDWYT",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "greatreference",
                    "body": "Dude same",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Muted_Ad9910",
                            "body": "Pretty crazy right?! I said so many times “I just run hot” genuinely believed it was me. Not anymore.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "YeOldeKnob",
                    "body": "The same thing happened to me lmao",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KingkLou",
                    "body": "Oh my goodness I am also colder!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "arianaflambe",
            "body": "A lot of that is actually related to mild damage to the circulation and micro veins and arteries in your feet! The skin starts to suffer because blood flow to nourish it is getting poorer and they can't get a break. Same reason people get the old red nose and cheeks from being boozers, or people with cold hands and feet from diabetes. Your body is healing! IWNDWYT!",
            "score": 26,
            "replies": []
        },
        {
            "author": "NCC_1701-K",
            "body": "Same, my heels got real bad, like I used a cheese grater to remove skin and could cut out 1/4” thick pieces. I would cut myself with my heels when using them to scratch my shins or calves at night. They would wear through the sheets. Now, all good. Not sure how long after getting sober, but definitely a nice benefit.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Worried-Experience95",
            "body": "Ever since I got sober my feet NEVER smell. That was a weird one for me that I never connected to alcohol!",
            "score": 13,
            "replies": [
                {
                    "author": "femoral_contusion",
                    "body": "My partner joined me for Dry January and then returned to drinking in February. I don’t know how to say it nicely but he smells so much worse even with a drink every few days! Honestly it’s such a bummer hahaha",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Worried-Experience95",
                            "body": "Hahaha I get it!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aramis_Bzh",
            "body": "Wow! I read your message, I took off my socks and took a look at my feet. Same! It's amazing, of all the little things that have been improved by a few months of non-drinking, I would never have thought that the skin under my feet would ever be baby smooth again, as opposed to dry, cracked and constantl shedding. Thanks for another little tick in my list :D",
            "score": 11,
            "replies": [
                {
                    "author": "Feed_Me_No_Lies",
                    "body": "Awesome lol! Glad to have helped!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "aretheesepants75",
            "body": "I'm coming up on 2 years sober from about 40 years of drinking and 10 solid years of hard drinking. My body took about 8 months to a year to level off. I lost about 45lbs, and it put me dangerously underweight, and I lost enough muscle that my joints started to go. I'm doing awesome now and very happy. There are some things to look out for depending on the severity of your disease.",
            "score": 8,
            "replies": []
        },
        {
            "author": "moon-child1234",
            "body": "I'm a 47F and I thought I was having night sweats because I was going through perimenopause. Nope! Once I stopped drinking, the night sweats stopped 🤗",
            "score": 8,
            "replies": []
        },
        {
            "author": "BeachJenkins",
            "body": "I commented this yesterday but it seems pretty relevant here, and it also involves feet. \n\nMy feet don't smell. \n\nWeird, I know, but for most of my life my feet have smelt really bad. I'm very hygienic, the rest of my body smelt fine, it's just my feet were gross. I tried all kinds of things; different socks, different shoes, alternating shoes after a few hours, going bare foot when I could, anti-perspirants, powders, multiple showers a day, footbaths, everything I could think of. And then a few weeks ago I randomly noticed my socks didn't stink at the end of the day and I can't think of anything else in my life/diet that has changed other than I don't drink anymore. I know alcohol affects people in different ways and I just figure that was some weird side effect that I had. Makes me laugh how many different things I tried to remedy the problem without actually solving the problem.",
            "score": 7,
            "replies": []
        },
        {
            "author": "DorkChopSandwiches",
            "body": "My restless leg went away immediately.  Never connected that to drinking, was surprised to learn how common it was.  I thought I just wasn't stretching enough.",
            "score": 4,
            "replies": []
        },
        {
            "author": "gonzolingua",
            "body": "55 M and 2 years 4 months sober.  When I moved back from CA after living out there for 13 years I was not used to winter.  I would get dry skin all over my body.  It sucked.  I figured it was just the cold weather.  I hydrated my entire body with cream.  When I quit drinking, guess what? No more dry skin.  Go figure! Here are some other things that I was surprised to see: near-perfect sleep, 25 lbs lighter, Vo2 max of 43 (top 25% for age group) without any practice (running), top 10 age group in first 5K.  I am not a gifted athlete.  I just quit drinking.",
            "score": 3,
            "replies": []
        },
        {
            "author": "eggflip1020",
            "body": "My brain lit up immediately. I’m talking firing on all cylinders. Much better mood.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gloomy_End_6496",
            "body": "I am sober almost 3 years. My legs don't ache anymore,  my skin isn't dry, my hair is thicker and healthy. I sleep like a baby now, too! Those, combined, make me feel so much better in general.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Charlie2and4",
            "body": "Same here, no more itchy skin. And this was a life-long issue. Nothing worth seeing a doctor about.  \nI've also seem some other improvements, that I believe were caused by soaking my digestive system with yeast.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FinancialWarning3380",
            "body": "I am going to feel my feet as soon as i get home! :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wanttobebetter76",
            "body": "My fingernails are strong and healthy and actually pretty! And I can visibly see the lines near the top where the crappy parts from drinking are almost grown out. I think my hair is doing better too, certainly less of it is falling out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rflorkey",
            "body": "Not drinking today!!!",
            "score": 1,
            "replies": []
        }
    ]
}