{
    "title": "Why doesn't China support Cuba?",
    "author": "FuckReddit5548866",
    "subreddit": "socialism",
    "rank": 282,
    "score": 47,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/socialism/comments/1ir2zq7/why_doesnt_china_support_cuba/",
    "id": "1ir2zq7",
    "selftext": "Edit: as mentioned in one of the comments, China indeed does support Cuba.\n\n\\-------------------------------------------------------------------------------------------------------\n\nNot an expert. From what I know, is that ships that port in Cuba are bared from US ports for 6 months, right? So why won't China use 1 or 2 ships to supply Cuba with what it needs? The Chinese military is already sanctioned by the US, so why if they are the \"entity\" or the official partner dealing with Cuba, there is nothing more the US can do, right?\n\nStuff like solar and wind energy wont make the island more independent and energy secure, while some small factories could supply spare parts needed instead of importing everything, etc.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This thread has been identified as being related to the People's Republic of China due to containing the following keyword: China.\n\nDue to this subreddit's long-term experience with PRC-related threads, [low effort discussion will not be permited](https://www.reddit.com/r/socialism/comments/l5ccjb/topics_of_contention_raising_the_quality_of/) and may lead to removals or bans. Please remember that r/Socialism is a subreddit for socialists and, as such, participation must consist of conscious anti-capitalist analysis - this is not the place to promote non-socialist narratives but rather to promote critical thought from within the anti-capitalist left. Critques are expected to be high quality and address the substance of the issue; ad hominems, unconstructive sectarianism, and other types of lazy commentary are not acceptable.\n\nPlease keep in mind that this is a complex topic about which there may be many different points of view. Before making an inflamatory comment, consider asking the other user to explain their perspective, and then discuss why specifically you disagree with it.\n   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unlikely_Position242",
            "body": "China does, they just helped cuba get their electric grid up running again\nhttps://tvbrics.com/en/news/china-and-cuba-sign-agreement-to-install-photovoltaic-parks-on-the-island/\n\nhttps://our.today/cuba-receives-donation-from-china-to-support-power-grid-restoration/\n\nChina has continously aided cuba. China is cuba second largest trade partner after Venezuela. This aid includes food https://havanatimes.org/cuba/china-will-send-1-of-cubas-monthly-rice-need-for-april/,  debt relief and donations  https://www.reuters.com/world/americas/cuba-wins-china-debt-relief-new-funds-2022-11-27/\nand medical aid http://www.xinhuanet.com/english/2020-04/07/c_138953928.htm\n\nEDIT: Lastly you can find info on cooperation between the two countries on this China state department website https://www.fmprc.gov.cn/mfa_eng/gjhdq_665435/3376_665447/3488_665048/3490_665052/index_1.html",
            "score": 160,
            "replies": [
                {
                    "author": "FuckReddit5548866",
                    "body": "Good to know, ty!  \nOf course you would barely see this on western mainstream media.",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "ryuch1",
                    "body": "distance is a big factor as to why china doesn't do more, if china was right next to cuba it would've overtaken venezuela years ago",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "VictoryToThePeople8",
                    "body": "Yes and the current US president put Cuba back on the 'state sponsors of terrorism' list.  The US fears socialism/communism more than anything.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ImABadSport",
                    "body": "Didn’t see this! Puerto Rico could use use some help but unfortunately the Jones act prevents any outside aid unless approved by the US.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Qweedo420",
            "body": "Historically, Cuba decided to side with the USSR during the Sino-Russian split, which is also why Che Guevara (who sided with China) decided to leave Cuba and bring the Revolution somewhere else\n\nAs the other user said, China does support Cuba to some degree now, but not as much as the USSR did",
            "score": 32,
            "replies": [
                {
                    "author": "FuckReddit5548866",
                    "body": "Didn't know that. Thank you!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "RezFoo",
            "body": "Cuba is an associate member of BRICS.",
            "score": 6,
            "replies": []
        },
        {
            "author": "StarStabbedMoon",
            "body": "China is their largest export market and second largest import market.\n\nhttps://oec.world/profile/country/cub#yearly-trade",
            "score": 3,
            "replies": []
        },
        {
            "author": "DueGas6985",
            "body": "I've always wondered this as well. Cuba flourished with the Soviet Union's support, allowing them to provide basic necessities to their people but then Cuba fell into poverty after the USSR's fall. Why hasn't China continued where the USSR left off?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Invalid_Pleb",
            "body": "China doesn't have much to gain by sticking their neck out for Cuba. There's no significant trade between them and I'm not even sure how close they are ideologically. It's not even clear that it would benefit Cuba because Id wager the US would probably respond by doing something increasingly aggressive and hegemonic, possibly resulting in more actions taken against Cuba. You have to pick your battles.",
            "score": -20,
            "replies": [
                {
                    "author": "FuckReddit5548866",
                    "body": "I agree on the 2nd part, though from what I read (food and medicine) which already should not be part of the sanctions are in reality sanctioned. (US bought 2 companies that provided ventilators to Cuba during covid and used the sanctions as pretext to stop providing the island with it.)\n\nFor the 1st part, Why not? China has a foreign aid program, so why not include Cuba in it? Also at the very least, it could be a response to the US escalating trade war against China.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "ryuch1",
                    "body": "both countries are marxist-leninist it's literally as close as you get",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}