{
    "title": "Daily Discussion, March 18, 2025",
    "author": "rBitcoinMod",
    "subreddit": "Bitcoin",
    "rank": 1,
    "score": 15,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 72,
    "url": "https://www.reddit.com/r/Bitcoin/comments/1jdyfvt/daily_discussion_march_18_2025/",
    "id": "1jdyfvt",
    "selftext": "Please utilize this sticky thread for all general **Bitcoin** discussions! If you see posts on the front page or /r/Bitcoin/new which are better suited for this daily discussion thread, please help out by directing the OP to this thread instead. Thank you!\n\nIf you don't get an answer to your question, you can try phrasing it differently or commenting again tomorrow.\n\nPlease check the [previous discussion thread](https://www.reddit.com/r/Bitcoin/comments/1jd6wdm/mentor_monday_march_17_2025_ask_all_your_bitcoin/) for unanswered questions.",
    "comments": [
        {
            "author": "the-radiator",
            "body": "Back in July I invested in 4 things and it's interesting where they sit right now.\n\nSCHD (Schwab US Dividend Equity ETF) - up 8.5%\n\nFTEC (Fidelity MSCI Information Technology Index ETF) - down 6.45%\n\nIVV (iShares Core S&P 500 ETF) - up 2.6%\n\nBitcoin - up 40%\n\nDespite all the chaos right now, bitcoin still holding up well!",
            "score": 9,
            "replies": []
        },
        {
            "author": "MrRandle",
            "body": "Fuck the IMF",
            "score": 16,
            "replies": [
                {
                    "author": "Soicethut",
                    "body": "Based",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "SmokeAndSkate",
            "body": "Pet cats stack sats",
            "score": 9,
            "replies": []
        },
        {
            "author": "Dandytrash",
            "body": "I wonder how we will look at today's price in 10 years.\n\nYou always see those \"I wish had bought (or had not sold) 10 years ago\" posts and comments. \n\nTen years ago is today.",
            "score": 8,
            "replies": [
                {
                    "author": "StonksPeasant",
                    "body": "Id ask to set a remind me but I hope im not still using reddit in 10 years",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Disastrous_Battle_14",
                    "body": "Im sure it will be mind blowing how obvious bitcoin is a buy at these prices. 100k will be the 10k of now I’m\nSure of it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "partyboycs",
            "body": "The spring can't get much more coiled.",
            "score": 9,
            "replies": []
        },
        {
            "author": "OxfordKnot",
            "body": "Mods: Why is the \"previous discussion\" link often wrong, pointing to the Mentor Monday post? Bad autoscript?",
            "score": 5,
            "replies": []
        },
        {
            "author": "escodelrio",
            "body": "**Historical Bitcoin prices for today, March 18th:**\n\n2025 - $81,262\n\n2024 - $67,549\n\n2023 - $26,966\n\n2022 - $41,801\n\n2021 - $57,859\n\n2020 - $5,238\n\n2019 - $4,033\n\n2018 - $8,224\n\n2017 - $974\n\n2016 - $410\n\n2015 - $256\n\n2014 - $599\n\n2013 - $51.6\n\n2012 - $5.3\n\n2011 - $0.80\n\n**Additional Stats:**\n\nBitcoin's current market cap is $1.61 trillion.\n\nBitcoin's current block height is 888339; with the average block time for the last 7 days being 10.02 minutes.\n\nBitcoin's current block reward is 3.125₿, which is worth $253,942 per block.\n\nThe next Bitcoin halving is anticipated to happen between 26-Mar-2028 to 20-Apr-2028 (within 161,661 blocks); the block reward will fall to 1.5625₿.\n\nThere are currently 21,889 reachable Bitcoin nodes.\n\nBitcoin's average daily hashrate for the last 7 days is 804 exahashes per second.\n\nBitcoin's average daily trading volume for the last 7 days is $30.88 billion.\n\nBitcoin's average daily number of transactions for the last 7 days is 443,204.\n\nBitcoin's average transaction fee for the last 7 days is 4.6 sats/VB, with the average fee's USD amount being $0.98; with the median values being 1.54 sats/VB & $0.33 respectively.\n\nThere are currently 19.84M ₿ in circulation, leaving 1.16M to be mined.\n\nThere are currently 3.10M ₿ held by companies, governments, DeFi, and ETFs, representing 15.63% of circulating supply.\n\nThere are currently 54,691,650 nonzero Bitcoin addresses that contain 175.89M UTXOs.\n\nBitcoin's average daily price from 18-Jul-2010 to 18-Mar-2025 is $15,146.\n\nBitcoin's average daily price for the year 2025 is $94,779.\n\n1 US Dollar ($) currently equals: 1,231 satoshis; making 1 penny equal 12.31 sats.\n\nBitcoin's minimum (closing) price for the year 2025 was $78,532.0 on 10-Mar-2025.\n\nBitcoin's maximum (closing) price for the year 2025 was $106,146.27 on 21-Jan-2025.\n\nBitcoin's minimum (intraday) price for the year 2025 was $76,624.25 on 11-Mar-2025.\n\nBitcoin's maximum (intraday) price for the year 2025 was $109,114.88 on 20-Jan-2025.\n\nBitcoin's largest daily decrease for the year 2025 was -$8,182.68 on 03-Mar-2025.\n\nBitcoin's largest daily increase for the year 2025 was +$8,216.44 on 02-Mar-2025.\n\nBitcoin's all-time high (intraday) was $109,114.88 on 20-Jan-2025. Bitcoin is down 25.53% from the ATH.\n\nBitcoin has reached at an all-time high 1 time in 2025.\n\nIt has been 57 days since the last ATH.",
            "score": 4,
            "replies": []
        },
        {
            "author": "harvested",
            "body": "Every week more people are moving away from crypto and into bitcoin.",
            "score": 6,
            "replies": [
                {
                    "author": "Alfador8",
                    "body": "The smart ones are. But there are a loooot of people in the crypto space for whom that descriptor does not apply.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DatBoiETC",
            "body": "Stay humble stack satoshis",
            "score": 8,
            "replies": []
        },
        {
            "author": "JashBeep",
            "body": "New money will be minted into existence for the sole purpose of buying bitcoin.",
            "score": 8,
            "replies": [
                {
                    "author": "Analog_AI",
                    "body": "And bonds and to prop up the stock market. \nBut bonds is the biggest. 20 trillion in global bonds have to be turned over and at least 20-25% have to be bought with printed money. A few hundred billions of them will be parked in bitcoin as well.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Deep-Elderberry-2770",
            "body": "Don‘t understand who is selling all the time despite game theory playing out with regard to strategic btc reserve etc. I mean how can prices stay at these levels",
            "score": 6,
            "replies": [
                {
                    "author": "Analog_AI",
                    "body": "Let's of people with holdings 0.1-1 coins sell because 1) they expected a very quick profit; 2) saw the price correcting about 30% which would be disastrous for the stocks they were used to; 3) were over leveraged and couldn't make margin call. \nUntil these bozos are cleared out the price will go sideways.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "marblemorning",
            "body": "Just went to do my regular bank transfer to an exchange and got harassed with all kinds of questions on the app. Why I'm sending it, who I'm sending it to, who will control it, what I'm doing with it... ridiculous.",
            "score": 3,
            "replies": [
                {
                    "author": "dirodvstw",
                    "body": "On the bank app? What country?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "harvested",
            "body": "The next halving block subsidy is only going to be 1.5625. That's basic knowledge, but also fucking crazy to think about!\n\nNot sure why I got downvoted for this, but cool!",
            "score": 10,
            "replies": [
                {
                    "author": "Traditional-Bed-6369",
                    "body": "I'm always obsessing over those.  Trying to get myself lined up to be able to match the 2032 amount plus 2044 amount and maybe another few years 1 block reward amount with some excess... really thinking just under a whole coin is what most people need for 10-30 years down the road but it may only be obtainable for average people to grab even half of one for another 3 years",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "be_like_agua",
                    "body": "Feels like we need more transactions happening to incentivize the miners.  And for that, we need transaction fees to get way cheaper",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cliff_smiff",
                            "body": "Or difficulty just adjusts down and joe schmoe starts mining at home again",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wobbalabba776",
            "body": "Sorry folks, I bought today causing dip🤷‍♂️",
            "score": 6,
            "replies": [
                {
                    "author": "Ok_Application963",
                    "body": "Same",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "jonoghue",
                    "body": "You sunofa",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Soicethut",
            "body": "These are the times we should be ecstatic both ways: We can buy cheaper sats from the recent peak, and prices have more than quadrupled from the lows in 2022",
            "score": 4,
            "replies": []
        },
        {
            "author": "Savik519",
            "body": "“Bitcoin needs better privacy”\n\nWhere does it lack privacy? Is the main weakness when tied to an exchange and KYC rules? If/when BTC is used more for exchange of goods/services will that automatically solve the privacy issue because nobody will have to sell on a centralized KYC platform for fiat? ",
            "score": 2,
            "replies": [
                {
                    "author": "GimmeFunkyButtLoving",
                    "body": "Yes. Uses on second and third layers become near impossible to track.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Savik519",
                            "body": "I was thinking even the main layer would be hard to track when P2P movements make up a user’s wallet history without touching an exchange",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GimmeFunkyButtLoving",
                                    "body": "Sure, but it wouldn’t make economic sense to transact much on the base layer. So fewer and larger transactions to track. \n\nIt’s going to be easier to track house sales on the main layer than coffee sales on lightning, for example.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KingPettyx",
            "body": "WHALEBEAR pulled out",
            "score": 3,
            "replies": [
                {
                    "author": "OxfordKnot",
                    "body": "How much profit?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "AllCapNoBrake",
                            "body": "9m",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "OxfordKnot",
                                    "body": "sonofa",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NectarineDirect936",
            "body": "Are we winning?",
            "score": 2,
            "replies": [
                {
                    "author": "PlasticEyebrow",
                    "body": "By design.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "NectarineDirect936",
            "body": "21' ptsd. Funny how people think btc can't go below a certain number.. Like, ftx was nothing compared to the shit going on in the world today. 15k wasn't that long ago so we'll see. Didn't sell in 21' and won't sell now. As a matter of fact, i keep buying.",
            "score": 3,
            "replies": []
        },
        {
            "author": "NectarineDirect936",
            "body": "Gonna need a bigger bag",
            "score": 2,
            "replies": []
        },
        {
            "author": "Financial_Design_801",
            "body": "Germany’s parliament approves a massive €500B ($546B) spending package via [Reuters](https://www.reuters.com/world/europe/german-parliament-vote-historic-spending-surge-2025-03-18/)",
            "score": 1,
            "replies": [
                {
                    "author": "Analog_AI",
                    "body": "What's the status of bitcoin in Germany, mate? Is it legal? ATM machines? ETFs? Can banks custody for clients? Etc",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Equivalent_Candy_706",
            "body": "I’m somewhat new to the crypto game and first bought in after BTC went over 100k. Now I’m caught holding the bag. But I’m in it for the long term. My question is this…do people tend to think that BTC will ever top 100k again? Like maybe in a year? 5 years?",
            "score": -1,
            "replies": [
                {
                    "author": "harvested",
                    "body": "Of course. No reason why 150-200 in the next 12 months wouldn't be possible. You know liquidity is coming. It always comes. The system breaks without it.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Realistic-Jelly8133",
                    "body": "If you truly understand Bitcoin, you should be dollar cost averaging. You should not care about your buy over 100k. You should only think about how many sats you can stack. Bitcoin is a long game, not one measured in weeks or months. \n\nLower your time preference, set up a recurring buy, and HODL.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "NectarineDirect936",
                    "body": "In it for the long term but wondering if btc will ever hit 100k again? ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Analog_AI",
                    "body": "It will get back to 100k before the end of this month",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "RoyKent12",
                    "body": "Are you buying down your average? If you aren't, you should be.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "StonksPeasant",
                    "body": "If bitcoin really does follow m2 then we should be there in a month or 2",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Secret_Operative",
                            "body": "If it doesn't then people will quickly find a justification and a new correlation of the moment.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Responsible_Emu3601",
            "body": "Shorter was right eh",
            "score": -1,
            "replies": [
                {
                    "author": "NectarineDirect936",
                    "body": "Prob more than 1 short running.. Why waste time on such events",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "OxfordKnot",
                    "body": "did they close it or are u trollin?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Substantial-Table569",
                            "body": "closed it when the price spikes to 83ish",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SensitiveChipmunk124",
            "body": "My 75K price target is in range",
            "score": -4,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -1,
                    "replies": [
                        {
                            "author": "R3dFiveStandingBye",
                            "body": "Expect everything with Bitcoin",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "forgotmypassword4714",
            "body": "I had a question about taxes. I wanna start long-term hodling BTC, I just bought a chunk of BTC yesterday to start. I'm in the US, btw.\n\nNow, since I'll only be buying and holding (no selling) for, let's say, 10 years...in 10 years when I finally sell and then do my tax returns, how do I get the tax forms for each year (since you need $600 profit for Kraken to send them to the IRS and I won't have any profit until the last year)? Do I just make sure to download my transaction log every year and use those on my eventual tax return in ~10 years (if the tax return website asks me to upload documents as proof)?\n\nAnd then...I just remembered that earlier this year I bought and sold some Litecoin. That is considered separate from my plans to long-term hodl BTC, right? As in, I take care of that on my next tax return, and don't mention my BTC on that one yet (since I plan on holding it for a long time)?\n\nI just wanna make sure because the site I used to do my taxes changed the crypto part from two years ago when it made me separate all the different cryptos and made me upload documents as proof, to this past one where it had a more general crypto part where I just put all my crypto numbers in and it didn't require any uploads (and both years were over the $600).",
            "score": -1,
            "replies": [
                {
                    "author": "SmoothGoing",
                    "body": "Yes download all transactions and save them yourself. Buying with fiat does not require reporting or uploading any documents. Don't have to report what coins you're holding either. If you sold a coin that must be reported. Any coin, stablecoins too. It would be short term investment so taxed at your income tax brackets, if there was any gain.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrWahrheit",
            "body": "What is the true value of Bitcoin? Can anyone tell me that?! Edit: how could it replace our currencies if there are only 21,000,000 of them and the exchange rate always fluctuates so much?",
            "score": -9,
            "replies": [
                {
                    "author": "AllCapNoBrake",
                    "body": "You should probably head on over to r/BitcoinBeginners",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "TheRadishBros",
                    "body": "There are 2.1 quadrillion satoshis. More than enough.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Analog_AI",
                            "body": "Exactly 👍🏻 \nMost people buy and transact in satoshis and not whole coins. This has been true for a decade already",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PlasticEyebrow",
                    "body": "True value of bitcoin is an incorruptable money supply that cannot be tinkered with by governments. It will put an end to the corruptive inflation of the money supply, stealing from the poor to give to the rich. It is the only true scarse asset, and the only (apart from other crypto's) that can be held in self custody making it unseizable. \n\nBitcoin is inclusive for everybody, meaning there is no middle man having to allow transactions, there is not exclusion of anybody. Might not mean a lot to you but there are hundreds of millions of people that are unbanked (eg, lower casts in India), those people can still use bitcoin. \n\nAnd bitcoin is designed to be perfect money, and part of that is divisibility. One bitcoin can be divided into 100 million satoshi. So yes, 21 million bitcoin is PLENTY to work as money, and it is NOT SET IN STONE and changes can be made to bitcoin eg, even if only one bitcoin were left, it could be made so much more divisible that bitcoin could still function properly as money with only one bitcoin left.\n\nAs for the volatility, yes it is a problem (for some) to use as a store of value, or money. But volatility is decreasing as adoption increases, this is already clearly visible. Gold also has some volatility...",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "GimmeFunkyButtLoving",
                    "body": "What is the true value of anything? \n\nHint: less in bitcoin terms over time",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Realistic-Jelly8133",
                    "body": "Value, by definition, is subjective. Anyone buying and/or holding Bitcoin believes it to be currently undervalued. Anyone selling/not buying/not holding believes it to be overvalued.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}