{
    "title": "Is it really that hard to understand why Algalon thought Azeroth needed a reset?",
    "author": "Arcana-Knight",
    "subreddit": "wow",
    "rank": 16,
    "score": 3073,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 221,
    "url": "https://i.redd.it/hsi6ty9ayape1.png",
    "id": "1jdmbsv",
    "selftext": "",
    "comments": [
        {
            "author": "Vargen_HK",
            "body": "Oh there's no arguing that, by his and the Titans' standards, Algalon should call for a reset.\n\nThe issue with that is it will kill all of us player characters so we can't let that happen.",
            "score": 920,
            "replies": [
                {
                    "author": "Arcana-Knight",
                    "body": "Exactly! That's the nuance about the titans that I loved. They aren't doing any of this out of malice, it's just a necessary evil to them.\n\nThis is why I've been leery of the narrative the new writers are pushing where the Titans have actually been deceiving us this whole time and actually have sinister plans for Azeroth. That takes all the nuance out and just makes them regular mustache-twirling villains which is not even remotely as interesting. ☹",
                    "score": 421,
                    "replies": [
                        {
                            "author": "Lt_Spacedonkey",
                            "body": "It’s the exact same nuance as before though. The Titans motives haven’t changed, we’re just become even more exposed to the fact that we mean nothing to them and that our goals are opposed to theirs.",
                            "score": 264,
                            "replies": [
                                {
                                    "author": "Arcana-Knight",
                                    "body": "But in Chronicle the titans see themselves as protectors the mortals that manifest on the planets they order. Which is a story told from their perspective. So clearly we aren't \"nothing\" to them. We're just not worth risking the entire universe for.",
                                    "score": 97,
                                    "replies": [
                                        {
                                            "author": "Zofren",
                                            "body": "If you have a sick batch of farm animals, and you think you need to put them down to save the rest of your animals, I think you'd still consider yourself a protector of your animals if you put them down.\n\nYou might also consider yourself a protector by putting your animals in cages or pens. It's for their own good, since they'd probably be killed or hurt themselves if left alone in the wild.\n\n(hopefully the analogies are clear here)\n\nI think the Titans probably view themselves as benevolent, but I imagine the nuance will come down to whether their ethics and goals align with our own (e.g. the classic self-determination/free will question).",
                                            "score": 148,
                                            "replies": [
                                                {
                                                    "author": "norixe",
                                                    "body": "Yea. They're beings on a whole scale greater than the mortal races.  Did a pretty good job with your analogy.",
                                                    "score": 37,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "WriterwithoutIdeas",
                                                    "body": "But the issue is that the universe keeps proving them right on principle, Azeroth being a glaring exception where by the power of writing things keep happening that never happen elsewhere. If you have said farm animals, and putting them down works to be the best route every single time, it's hardly you being a worse person when one batch by some miracle repeatedly keeps inventing a cure and effectively applying it.\n\nTitans in the end suffer from Blizzard wanting to make everything more morally grey, being the designated \"good guys\", so they need to be artificially lowered by making them seem worse.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Lt_Spacedonkey",
                                                            "body": "If Algalon had wiped us out in Wrath then there would have been no one to defend Azeroth when the Legion or The Jailor finally made their way there.\n\nTo keep the farm analogy going, it’s like putting down all your dogs because one of them has rabies. But now there’s nothing to protect the chickens from the foxes when they find a way through the fences.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Skeletonized_Man",
                                                                    "body": "I recall the burning legion arriving during the Legion expansion because Guldan was able to raise the tomb of Sargeras and summon them from there. Something that wouldn't have happened if Garrosh (along with everyone else) was wiped out in Wrath.\n\nAnd the Jailer wouldn't be able to do anything. His entire plan required us the players to kill Argus and basically knock the arbiter out of commission and none of that would happen if the aforementioned didn't happen either.\n\nIn theory the Legion is still coming but we don't know how long that'll take so for all we know by the time the Legion arrives the world recovered from being reset.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Lt_Spacedonkey",
                                                                            "body": "The Legion used Gul'Dan to accelerate their invasion but they still would've arrived eventually, Sargeras had been looking for Azeroth since the other Titans told him about her millennia ago.\n\nAnd even if the world had recovered by the time they arrive, which is unlikely as reorigination would have destroyed all life on the planet, there's no guarantee that whoever was there could resist the Legion as well as we did.\n\nThe Jailor also would've been delayed but he was an opportunist above all else, none of his plans were that meticulously detailed and easily could've been amended. All he would've needed to do was get the Dreadlords to kill Argus instead of the Azerothians, something that probably would have been pretty easy considering they had access to the worldsoul before it was born and could fight back.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Skeletonized_Man",
                                                                                    "body": "Its completely speculative this whole scenario but the Forge of Origination is designed to reboot the planet basically not just wipe out all current life and civilization leaving titan structures intact but then ensure afterwards it can recover. Yes we have no guarantee that whoever comes after could resist the legion as well as us but its not like we had something entirely unique to us, but its really hard to tell \n\nThe Jailer though would not have been able to finish his plans, he got insanely lucky and only one of the things he set out to do actually worked, corrupting Argus with death magic. Every time he succeeded in a plan was because of some azerothian enabling him, like that time we just basically delivered the primus keystone straight to him. I highly doubt he could've just had the Dreadlords kill Argus either, we needed the powers of the pantheon to defeat it and the only reason they had access to Argus to begin with was they convinced Sargeras to use the it as a resurrection engine so doubtful Sargeras would let them anywhere close afterwards.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Lt_Spacedonkey",
                                                                                            "body": "The Forge of Origination absolutely destroys all life, that's why Southern Kalimdor is almost entirely a desert instead of the Jungle it used to be, because the Tol'Vir used it at its lowest possible power level to defeat Lei Shen.\n\nThere is absolutely nothing the Jailor needed doen that couldn't have been done by the Dreadlords, and if it was Algalon that reoriginated the planet in Wrath then most of his plan is already set up, all he would need is the death of Argus and someone to shatter the Helm of Domination.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Skeletonized_Man",
                                                                                                    "body": "The Forge is why Uldum is a desert but why it stayed a desert is frankly bizarre because they explicitly state the Forge also renews life afterwards. Its also stated that Tanaris became a desert from the changes the Shattering caused so we can at least assume the blast was restricted to within Uldum.\n\nAnd if he could use the Dreadlords for literally everything he would've but we see in shadowlands he opted for puppeting anduin around to get the sigils for example. I'm personally not a fan of the Dreadlords turning into this omnipresent masterminds that are treated like they can see the future and apparently now everyone can be actually a Dreadlord. Shadowlands writing in general isn't very good so that doesn't help",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Lt_Spacedonkey",
                                                                                                            "body": "The Titans may have hoped that life would start again but the forge in no way makes sure that'll happen, it just kills all life.\n\n  \nAnd the Dreadlords have always been like that, even when we thought they were just demons. They've always got so many schemes and contingencies that it seems like they planned for what ends up happening, but only because they try to plan for every outcome.",
                                                                                                            "score": 0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Hoodoodle",
                                                    "body": "Does a sick batch of animals on your farm gun down the lacky of your psychopathic brother who's going to murder you and your siblings?",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "W_ender",
                                            "body": "In chronicles they arrive on the elemental-dominant planet and start spourting order everywhere, killing off everything that doesn't agree with their views.\nIt's also canonized to be a titan's pov, not that chronicles are a lie, in fact there are plenty of things that are pretty true to the game, but all the bias and views on cosmology are titan-sided",
                                            "score": 78,
                                            "replies": [
                                                {
                                                    "author": "Arcana-Knight",
                                                    "body": "Except they didn’t kill anyone who disagreed they just relocated them to the elemental planes so they’d stop killing each other long enough for the titans to get to work.",
                                                    "score": -19,
                                                    "replies": [
                                                        {
                                                            "author": "jerslan",
                                                            "body": "That's like saying \"the US never committed genocide against Indiginous Peoples, they just relocated them against their will to reservations and maybe a few that resisted just happened to die along the way\". It's kind of a gross misrepresentation of what actually happened.\n\nAs others have said, that novel was written from the perspective of the Titans, so it has their biases baked into it. Much like a lot of American History books will promote \"Manifest Desitiny\" as a good and righteous thing, but in reality it was a genocidal colonization.",
                                                            "score": 33,
                                                            "replies": [
                                                                {
                                                                    "author": "Scribblord",
                                                                    "body": "Not really not even close \n\nThe elementals and proto drakes made it impossible for life to prosper bc they where all bound on senseless destruction \n\nEspecially the fuckn primals only goal was to keep killing everything that moves for all eternity (which is the kind of status quo that birthed galakrond too so it’s bound to eventually eradicate all surface live on the planet forever (also reminder that galakrond would’ve actually ended everything if not for the titan keepers)",
                                                                    "score": -7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "onetimenancy",
                                                                            "body": "> The elementals and proto drakes made it impossible for life to prosper bc they where all bound on senseless destruction\n\nThat sounds like titan talk, whats senseless destruction as opposed to orderly destruction? The former is war and the latter is a planetary death ray?\n\nNothing the elementals or dragons did put Azeroth in harm until the old gods made them submit to servitude, they are just native life of Azeroth.",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Scribblord",
                                                                                    "body": "And the titans arrived after the void \n\nAlso the elemental lords couldn’t stop waging war against each other making the planet pretty uninhabitable for every other present form of life \n\nAlso the proto drakes spawning galakrond due to their life style \n\n\nAlso an Azeroth torched by elemental wars till the end of time is pretty impossible to defend from the old gods corrupting the world soul thus potentially ending all life in existence \n\n\nThey did what they though would be the most secure way to protect the world soul from void influence bc if it gets corrupted it’s over for everyone \n\n\nThe titans flaw is that they see things too dry and see no point in letting insignificant life forms try to fight cosmic horrors bc logically that should be impossible",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "jerslan",
                                                                                            "body": "Which is also all a very titan-centric view of the situation on Azeroth before they \"re-ordered\" it. That's also a lot of the same justification Algalon had for wanting to \"re-order\" it again. We (the current inhabitants of Azeroth) were too busy waging war against each other and had already caused numerous catastrophes that threatened the \"Titanic Order\" of the planet. Essentially, Algalon determined we were too chaotic for \"Titan Order\" and his \"solution\" was commit mass genocide and start over.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Scribblord",
                                                                                                    "body": "Ye bc at the rate we where going yogsaron was just about to take over the planet \n\nIt’s less about the order and titan centric view it’s about whether or not the old god stays down or not and with how shit it’s been going it’s pretty reasonable to push the reset button \n\nWe showed him a one in a trillion miracle and changed his mind",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "jerslan",
                                                                                                            "body": ">  We showed him a one in a trillion miracle and changed his mind \n\nWe beat his ass within an inch of his life and changed his mind.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Scribblord",
                                                                                                                    "body": "Which in itself was a miracle bc don’t forget we are degenerated titan foot soldiers cursed by the old gods",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "jerslan",
                                                                                                                            "body": "Me: We beat his ass until he reconsidered genocide against our various peoples\n\nYou: It was a miracle\n\nThese are not the same thing...",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Scribblord",
                                                                                                                                    "body": "Miracle as in  degenerated failed foot soldiers being powerful enough to beat both an old god and him is a statistical miracle no entity thought would ever be possible \n\nThe old gods where baffled and so where the titans and everyone else",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Arcana-Knight",
                                                                    "body": "I don’t really think the comparison works. Like at all. And it’s pretty disrespectful that you think it does.",
                                                                    "score": -16,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jerslan",
                                                                            "body": "Let's see... The titans show up, brand the elementals as savages in need of their re-ordering... They proceed to forceably relocate many of them to what they brand as \"The Elemental Plane\" and then take their previous lands for themselved and recolonize it how they see fit.\n\nSure sounds a lot like US History of showing up, declaring the locals to be \"savages\", and then forcibly relocating them to take their lands.\n\nA lot of fiction takes inspiration from history.",
                                                                            "score": 21,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Scribblord",
                                                                                    "body": "Only if the indigenous people where torching the entire area attempting to turn it uninhabitable till the end of time while also constantly murdering each other and everything that moves  constantly every hour of every day \n\nAlso didn’t the elemental lords also lose against the void and where enslaved super soldiers anyways ?",
                                                                                    "score": -4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "onetimenancy",
                                                                                            "body": "> Only if the indigenous people where torching the entire area attempting to turn it uninhabitable till the end of time\n\nSounds habitable to fire elementals, who came before all other life so they have dibs on azeroth. If other fleshier life couldn't adapt to that, it couldn't exist without outside influence of old gods and titans. Azeroth would be entirely fine with only elementals and dragons.\n\nNature is not fair.\n\n# #PROUDPRIMALIST",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Scribblord",
                                                                                                    "body": "Trouble is fire can make the place uninhabitable for everyone else but is way too weak to fend off the void meaning if primalists own the place the universe ceases to be",
                                                                                                    "score": -2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "jerslan",
                                                                                                            "body": "That sounds a lot like pro-Titan propaganda if you ask me... :P",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Scribblord",
                                                                                                                    "body": "Fair",
                                                                                                                    "score": 2,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "W_ender",
                                                            "body": "Yeah you are another case of \"i don't care about plot it's all about the agenda\"",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Arcana-Knight",
                                                                    "body": "What?",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "F-Lambda",
                                                            "body": ">Except they didn’t kill anyone who disagreed they just relocated them to the elemental planes\n\nY'Shaarj would disagree.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Scribblord",
                                                                    "body": "Y’shaarj who was actively working towards the goal of wiping out the entirety of the universe \n\nEradicating all life in existence forever \n\nI think it’s pretty objectively good for every living being in our plane of existence to kill old gods and all their associates",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "1stonepwn",
                                                                            "body": "Speak for yourself, I want to grow tentacles and hang out with purple women",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Scribblord",
                                                                                    "body": "Ye I’d doom the world if xalatath asked me to",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Lt_Spacedonkey",
                                            "body": "They might believe they’re protecting the mortals, but in reality it’s kinda tyrannical and the protection stops as soon as the mortals do anything that goes against the Titans plans.",
                                            "score": 39,
                                            "replies": []
                                        },
                                        {
                                            "author": "Gaatti",
                                            "body": "They see themselves like that, doesn't make it so. They have a very \"You think you do, but you don't\" attitude.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "RemtonJDulyak",
                                                    "body": "> They have a very \"You think you do, but you don't\" attitude.\n\nNow the circle is complete!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Saracus",
                                            "body": "The weird part is iridikron calls out that the titans preserved our specific timeline and.... Yea they did. The bronze dragon flight and aman'thul specifically preserve events where things like half the planet getting the \"curse of flesh\" or us stopping algalon happen. We've met Aman'thul and he didn't say \"Ew why do you have free will\". He recognised us as children of azeroth.\nThe problem is in the last few years blizzard have been trying to turn all of their stories into diablo, where everyone's \"grey\" but it just.... Doesn't make sense with the previous lore  so now we have aman'thul and eonar arguing because she's giving life free will and progenitors... I mean first ones that the titans are pretending didn't happen (everyone loved when halo 4 did that so good to see blizzard copying what works /s)",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Reniconix",
                            "body": "The Old Gods are warping our minds after so many encounters with them. It's not the writing making the Titans bad out of nowhere, it's deeply established this is what Old Gods do.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Scribblord",
                                    "body": "If that’s the conclusion to all the dog shit attempts at making the titans seem evil that would be great writing ngl \n\nUs squaring up against titan plans at the end of an expansion just to realize that we where really fuckn dumb all along and released sth sinister by stopping them",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Comfortable-Ad1937",
                                            "body": "Yeh the lores gone so backwards, that would be a great flip",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lindestria",
                            "body": "necessary evil doesn't make something less sinister though?\n\nLike Algalon is explicit that he's genocided entire worlds before due to the Titan's orders. There's no real nuance there, if anything Algalon just made the Titan's suddenly evil compared to the generally benevolent portrayal pre-wrath.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "riftrender",
                                    "body": "Well looking at the Fel scarred and void infested worlds we've seen, were there any mortals left?",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "Zeaket",
                                            "body": "part of his dialogue includes the line \"A million-million lives wasted.\"\n\nso at least some of the worlds he's reset have had presumably mortal populations",
                                            "score": 27,
                                            "replies": [
                                                {
                                                    "author": "Arcana-Knight",
                                                    "body": "The idea is that the Titans thought that mortals were incapable of defending themselves from the old gods. Since the death of the Prime Designate is what summons a constellar the assumption is that if the Prime Designate couldn’t handle the situation then there’s no way the mortals could. So the mortals are doomed either way, might as well make it quick. \n\nBut we proved to Algalon that mortals CAN protect themselves and he was like “Wait, could the other mortals do that too? Holy shit. How many salvageable planets did we declare lost?!”",
                                                    "score": 25,
                                                    "replies": [
                                                        {
                                                            "author": "Scribblord",
                                                            "body": "Tbf we performed and incredible miracle against all odds while if we failed the entirety of all life in the universe would end forever",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Arcana-Knight",
                                                                    "body": "Yeah although Azeroth is ironically the only planet where that last part applies. The other planets would have just had a really shitty time until the constellar decides that now it really IS the time to flip the switch.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Scribblord",
                                                                            "body": "This goes for every titan soul planet out there \n\nPlanets like draenor also didn’t get a planet wiper \nThey got gardened bc things like the overgrowth would most likely end life on the planet sooner than usual so they trimmed it and installed opposing forces to create a balance \n\nOr left titan keepers to help defend/keep it going",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Arcana-Knight",
                                    "body": "Well I'm more talking about the idea that they are in some way hurting Azeroth or manipulating her for their own selfish purposes instead of just trying to keep her healthy until she wakes up is my problem.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Lofi_Fade",
                                            "body": "Algalon has extreme guilty for his previous actions against other planets though. Its not as grey as you're projecting. Algalon basically realizes people are people, and he is responsible for the deaths of trillions.\n\nThe Titans other than maybe Eonar have always been distant and strict parents who would cut you down if you disobey (or were born wrong).\n\nI don't get why people have a hard-on for the Titans to be strict daddies, who are brutal, but have our best interests in mind. Why can't they be godly beings with their own goals and lack of respect for life or freedom?",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "Scribblord",
                                                    "body": "Bc all their “shady” deeds are absolute situation with exactly 2 options, do “shady” thing or everyone in all of existence dies a horrible death \n\n\nIt’s dog shit writing to make the titans kind of evil \n\nThey are gods that ignore everything except the greater good which makes them “good” just that the greater good isn’t always to the benefit of individual mortals and that dynamic worked great with ukduar alagalon etc but now they try so hard to change that up and make them evil or whatever and every evil thing they name is sth that was perfectly reasonable to do xd",
                                                    "score": -2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Arcana-Knight",
                                                    "body": "Because that’s boring and derivative.",
                                                    "score": -14,
                                                    "replies": [
                                                        {
                                                            "author": "Lofi_Fade",
                                                            "body": "How is it any less boring then benevolent gods?",
                                                            "score": 20,
                                                            "replies": [
                                                                {
                                                                    "author": "Arcana-Knight",
                                                                    "body": "They’re not benevolent, they’re just not tyrannical either. There’s a middle ground to be found here.",
                                                                    "score": -6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Lofi_Fade",
                                                                            "body": "Seems wish washy and derivative",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "F-Lambda",
                                                                                    "body": "on the scale of black and white morality, the titans see the world as orange and blue.",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ghekor",
                            "body": "It's not really mustache twirling,  from their PoV anything they do to us is justified provided the World Soul is safe so they can continue their experiments/Ordering of it, from our PoV that's bad since it will wipe all life on the planet and we are now learning the Soul of Azeroth is most likely of a more pure and primal nature and thus why both Order and Void want it for their needs... which means bad shit for us either way.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "Arcana-Knight",
                                    "body": "Yeah but I liked it better when the idea was that they had Azeroth's best interests at heart and were just trying to keep her healthy but the failsafes they left behind are now backfiring or misdiagnosing the situation because the Titans didn't anticipate all the crazy shit that would happen.\n\nThe idea that they are in some way hurting Azeroth or forcing her to be something she's not because \"dey wan OrDuR\" undermines that.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Lishio420",
                                            "body": "I mean they do still have Azeroths \"best interest\" at heart, as long as Azeroth the World soul is intact and not in the voids hand thats all that matters",
                                            "score": 22,
                                            "replies": [
                                                {
                                                    "author": "Korashy",
                                                    "body": "Yeah but the juiced up demigods that kill gods and titans for new pants should probably no longer be disregarded. \n\nEspecially by entities who upon death drop higher simming pants.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "Khaoticsuccubus",
                                                            "body": "Eh, I dunno how much we could do against the actual Titans directly.  Sargeras in his actual physical body was larger than the planet lol.  \n\nIf he hadn't been sucked up by the other Titans and put in Titan jail that sword of his could have very well just cleaved the planet in half and we all would just die or w/e.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Korashy",
                                                                    "body": "We killed Agrammar and Argus, so we definitely killed Titans.\n\nJust not the Pantheon level Titans, but that's what the new pants are for.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Khaoticsuccubus",
                                                                            "body": "We killed weakened much smaller versions of them.   Certainly not planet sized versions lol.  \n\nThough I wonder if they’ll just retcon the size thing when it comes time for pants crafting.  😂",
                                                                            "score": 11,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Korashy",
                                                                                    "body": "Goblin shrinker and then hit em with the old 1 1 2",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Shleepo",
                                                                            "body": "Agrammar wasn't killed ... at least, he seemingly got better off-screen. You see him sitting on his chair at the Seat of the Pantheon.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Korashy",
                                                                                    "body": "Okay he got spared, but still got his pants beat off.",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Jackofdemons",
                                                                            "body": "Its worth nothing the devs said in the past they want our characters to increase in power to the point they can 1v1 titans.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FrostiKitsune",
                                                                                    "body": "A whole raid that's just Titans, or raid after raid dedicated to each Titan would be awesome.\n\nCould make it that we absorb power from each Titan killed.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "onetimenancy",
                                                                                    "body": "Ugh, imagining Eonar as a quest mob makes me sad.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Scribblord",
                                                                            "body": "Tbf argus wiped the floor with us but the whole pantheon juiced us up and stuff \n\nAnd aggramar was some sort of zombified thing iirc \n\nBut ye it’s weird how small aggramar was so I’m guessing that was an artificial avatar like the one sargeras used a few times",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Gaatti",
                                            "body": "The thing is: they have the best interest of Azeroth's at heart. From their point of view. It isnt just that \"dey wan OrDuR\". From their point of view, order is good. From their point of view, if they are hurting azeroth, is to that can grow into something better, thus it is in its interest.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "aMaiev",
                            "body": "You pretend like most bosses in wow are mustache twirling villians, but they are a hard minority lol, everyone justifies their motives in wow. The only batshit villain we had recently was fyrakk and thats why he was so refreshing",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "find_the_apple",
                                    "body": "The defias brother hood had it coming",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Arcana-Knight",
                                            "body": "I didn’t even know what was going on. I was just a VERY lost troll who ended up busting a criminal kingpin looking for a way to get home without hearthing.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Arcana-Knight",
                                    "body": "No I LOVE the mustache twirlers. Gul’dan, Denathrius, The Lich King, Xal’atath. They’re so much fun.\n\nI just don’t like characters who used to have depth being flanderized into being bland and two-dimensional.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "aMaiev",
                                            "body": "Out of everyone you mentioned only guldan could be described as mustache twirler lol",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Arcana-Knight",
                                                    "body": "I’m talking about people who know they’re bad and love it. They all meet that description unless you’re about to regale me with some super memtal gymnastics about how Arthas was a good guy and all the times he maniacally laughed at the screams of the innocent were all part of being a lesser evil.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "aMaiev",
                                                            "body": "No? Arthas justified every move he made as a prince and then lost his soul to the jailer. Even then he resisted him from taking over controll and created the scourge in a twisted desire to protect azeroth. Xalatath and Denathrius both just try to help their cosmic force win the war that happened since their creation, they also dont view themselves as evil",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "skyshroud6",
                                                            "body": "No one there is \"knowing their bad and loving it\"\n\nGul'dan sought power and strength because he was sickly and abandoned by his clan. He was given it by the legion. He was effectively a \"fel shaman\" (which is what the original orc warlocks viewed themselves as essentially). He didn't see it much different that using the elements.\n\nDenathrius justified it as propelling his own kingdom forward. Those who went along with it benefited and saw what was a fairly fruitful and happy life. The issue is he was doing it at the expense of all other realms.\n\nArthas literally viewed himself as the king of the undead, and the undead were his subjects. In spreading and building his kindgom he viewed it as bringing his subjects prosperity and strength. The same as any human king would. There's dialogue in the frozen throne I believe where he talks about this with KT.\n\nXal'atath, we admittedly don't know much about, but considering she's working for the void, she probably see's what she's doing as justified in spreading her kingdoms power.\n\nAll of these pople viewed themselves as justified.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "skyshroud6",
                                                                            "body": "I mean I'm not saying they're not evil. I'm saying they viewed their own actions as justified.\n\nMAYBE Gul'Dan is questionable since he stuck around with the legion far after he got power, but even then. \n\nI'm not even saying any of these characters are particularily complex with like, the exception of *maybe* Arthas. Gul'Dan and Denathrius in particular are fairly simple.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Zofren",
                            "body": "It's still Metzen though. Metzen was also around for Odynn in Legion.\n\nAnd what is specifically more sinister about the Titans' depiction in DF/TWW compared to prior depictions? You could still say everything they do is out of that they believe to be necessary; their vision of necessity just doesn't necessarily align with the interests of mortals on Azeroth.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Rappy28",
                                    "body": "Honestly I really don't understand these recent \"they made Titans bad and that's terrible!!\" complaints.\n\nAlgalon's whole existence kinda proves the Titans were always this way. We've kicked Titan-adjacent ass before for this. Not \"bad\", they just have a moral system that is beyond us.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Hallc",
                            "body": ">  it's just a necessary evil to them.\n\nIt's not even an evil though, that's the thing that really annoys me most about all this new discourse. People act like some group having goals that don't align with your own makes them Evil.\n\nThe Titans are giant, cosmic beings. The comparative is, if you set up an experiment in a lab with an antfarm and left it to run for a while and then you checked on it only to find something had gone horribly wrong with your experiment. Are you evil for wanting to start fresh with it?\n\nTo the Titans, mortal races would be seen as something like insects. Maybe they see them differently now after Legion, we don't know but all this info that's coming out is *ancient*.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Arcana-Knight",
                                    "body": "I agree entirely but there was a massive shift in how WoW fans interpret the story and perspective is just not a concept people in the community want to engage with anymore. Now anyone who doesn’t have 100% perfect moral track record by our standards is a future loot piñata and the player character’s perspective is the only one that matters. And by that I mean what the writers tell you the player character’s perspective is through their various mouthpieces because our last shred of agency was stolen from us at the end of the War Campaign in BfA and was never given back.\n\nSo the nuance around the subjectivity of good and evil and how the scale you’re working on can change your perspective on the matter is dead in the water, Dragonflight made sure of that with it’s faux-morality pretending there’s nuance to the story while railroading the player character’s stance. And for some reason people are gobbling it up and asking for seconds.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "ATinyLittleHedgehog",
                                    "body": "Also, if you put an anteater in the farm and 25 ants gang up and kick its ass you might reconsider",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Scribblord",
                                    "body": "Also if the ant farm was creating sth that if it left the lab would eradicated all life on the planet",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Nutcrackit",
                            "body": "I don't think they have sinister plans for azeroth. They just have THEIR plans for azeroth. They are about order. Azeroth may not agree with what they view exactly so they are forcing it upon her. It isn't sinister by intent.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "shaidyn",
                            "body": "Not even a necessary evil, just necessary.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Forrel33",
                            "body": "This is Reddit. They love the 'god' who we all thought is good turns out evil trope.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Specific_Frame8537",
                            "body": "> They aren't doing any of this out of malice\n\nI mean we're practically an ant infestation in their terrarium..",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Arcana-Knight",
                                    "body": "I don’t think we’re even a infestation. The Titans didn’t seem to think we were abominations or anything at the Seat of the Pantheon. Also the Keepers like us a lot. Even Odyn who was presumably wary of us at first seems to be just as enthused about mortals as his brethren now. (Although bootleg Elsa might have burned that bridge)",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LuckyLunayre",
                            "body": "They're not evil and they're not sinister, that's not where the hints are going. The hints are leading to the fact that their plans are not good, but that doesn't make them evil. \n\nThe titans are order. That's neither good nor evil. They simply want to order things. Things like the emerald dream are not good to them, because you cannot order the dream. The world tree was ripped up specifically because it was of Elune. But keeper Freya kept the roots and tasked the Harranir with defending them in secret. \n\nUntil now, the titans goals have mostly aligned with ours. That's simply it.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Rajewel",
                            "body": "Idk man some of the Titans seem pretty vengeful bordering on evil.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Arcana-Knight",
                                    "body": "In what way? They didn’t seem to have much issue with us at the Seat of the Pantheon.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "skyshroud6",
                            "body": "It's still the exact same nuance.\n\nThe titans are doing what they believe is logical, in an effort to spread order and awaken Azeroth as a titan. They've always, always worked in a \"Our goals first. If you align with it great. If not then you're not a consideration\" kind of way. They're not being sinister. They're spreading order like they always have. \n\nEven before the cosmology chart, it was them spreading order. Like, apart from a brief time when they were \"the good guys\" in Legion, the titans are probably of the least retconned in terms of their goals in the game. The minutia and details of how they get there may have had some changes, but overall its' been the same.\n\nIt's still. The exact. Same.\n\n\nThis is why I hate wow lore discourse. People will seriously look at something like \"the titans are acting towards their own goals independent of us!\" and go \"god the lore sucks. Remember when they would act towards their own goals independent of us in the *good ol' days*. That was so much better!\" Like, its the same shit. If you're gonna argue about a story, at least be able to comprehend it first holy crap.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TengenToppa",
                            "body": "its because everything after Legion is non canon/fan fiction",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ThrobbinHood11",
                            "body": "I mean, the narrative is still the same tho? The Titans want Azeroth to be theirs and have a bunch of machines set up around the world to help their goals. The only difference is that they aren’t taking it out of benevolence to “help defend their sibling from dark forces”, they seemingly want to just make Azeroth one of them, same as the rest of the other worldly forces. \n\nThere’s still no malice or outright evil intentions, they want another titan, and whatever they make along the way is just a tool, or means to an end, same as it always has been",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Rappy28",
                            "body": "Eghh, I don't think it's as sinister as you think. They want Azeroth to align with Order, because it's a hell lot better than to allow the Void, Chaos or Death to seize control of it—both for them and likely for us as well… relatively speaking.\n\nI just don't see much of a difference between Titans now and Algalon then. We kicked his ass then too. They have their own cosmic morality our tiny mortal lives aren't really a part of (and we're changing that).\n\nMy personal opinion/theory is that the Titans we are going to interact with are a diverse bunch on a wide spectrum of ORDER! zealotry. Definitely foresee some Algalons taking our side",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OgerfistBoulder",
                    "body": "> The issue with that is it will kill all of us player characters so we can't let that happen.\n\nBasically all of politics throughout history summed up:\n\n\"We need to do this thing. Oh but it will affect me negatively? Never mind we won't do this thing.\"",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "NeaLandris",
                    "body": "But the players had an immortal soul, and would just respawn. its fine",
                    "score": 5,
                    "replies": [
                        {
                            "author": "PheonyXtreme",
                            "body": "One day they will figure that killing players on some mountain peak that is not reachable on foot and without access to flying mount spirits is the key to conquer Azeroth.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "burnn29",
                    "body": "I heard reset? \n\nWoW 2 CONFIRMED",
                    "score": 4,
                    "replies": [
                        {
                            "author": "vanilla_disco",
                            "body": "They had the opportunity to do this with Shadowlands. Had the Jailer won, we would've had the perfect opportunity to do WoWXIV: an Azeroth Reborn",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Vio94",
                    "body": "Right. We understood perfectly. We just weren't going to let it happen. What was asked of the Titans was \"is it really that hard to understand why we don't want you to kill all of us?\" \n\nAnd it was, so we beat that ass.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "garliclemonpepper",
                    "body": "I don't know much about WoW lore, but that gives me big Forerunner and Halo Ring(s) vibes",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "judgedavid90",
                    "body": "Cameraman (us) never dies",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Karpulltunnel",
                    "body": "wait, are we the bad guys?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DragonEmperor",
                    "body": "It would certainly be a good way to start over if they ever do a whole reboot for WoW.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "kalamari__",
                    "body": "I say its time for a purge!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Nocs1",
                    "body": "That's probably the last straw when they would ever consider wow boogalo 2\n\nGo the ffxiv route and nuke everything",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Darkhallows27",
            "body": "Also have you seen the playerbase",
            "score": 299,
            "replies": [
                {
                    "author": "Arcana-Knight",
                    "body": "Yeah the world has one heck of a toxic murderhobo infestation.",
                    "score": 81,
                    "replies": [
                        {
                            "author": "PM_ME_GOOD_DOGS",
                            "body": "Won't be murderhobos much longer. \n\nWe're gonna need a new term....",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Arcana-Knight",
                                    "body": "Murder homeowners?",
                                    "score": 45,
                                    "replies": [
                                        {
                                            "author": "Darkhallows27",
                                            "body": "Murder HOA (so just a regular HOA)",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "author": "DudeMan1217",
                                                    "body": "I hate how accurate this is.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Zinek-Karyn",
                            "body": "Captain grim has a great video about the playerbase invading hell and I think it’s so true. We are the hell.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Arcana-Knight",
                                    "body": "“DID SOMEONE SAY THUNDERFURY BLESSED BLADE OF THE WINDSEEKER?!”",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fox112",
                    "body": "Anal [Rend]",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "ArcticPanzerFloyd",
                    "body": "Back during Wrath at least: \n\n•Looks at Barrens Chat\n•Looks at Nessingwary’s base camp corpses\n•Looks at Goldshire Inn \n•Looks at LFG\n•Looks at almost all DK and Pally rollers\n\nNukes everything",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Exeftw",
                    "body": "Your icon IS Algalon looking at the player base.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "bmonge",
                    "body": "Algalon after checking out Goldshire Inn: I do what I must",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Sprucemuse",
                    "body": "Lol mostly this tbh",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DoverBoys",
            "body": "I find it amusing that we almost kill him, he understands we deserve to live, helps us cancel reorigination, and then hangs out outside Ulduar with a pet bunny.",
            "score": 85,
            "replies": [
                {
                    "author": "Swineflew1",
                    "body": "Did we canonically almost kill him, I was under the impression he was just impressed how hard we were trying despite us having no chance against him.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "jmstanley88",
                            "body": "I believe the canon is that we engaged him to essential stalemate. That scene in game also negates the commentary from the Heroes (players). I think Metzen was on record saying that there was a meaningful discussion that, between the conversation and our display of power, we proved to him we were in effect the better option for protecting the Azeroth World Soul. I believe Algalon saw we could have continued to the point of defeating him. Remembering the Black Empire and the difficulty the defenses of the world had against the Qiraji, yet we were able to exact a surgical strike directly to the Old God to kill (or some are arguing to 'pacify') them, and we were actually doing it. C'thun had fallen, we were there for Yogg, and he saw the best chance for taking out N'zoth and Yogg was going to be the Heroes of Azeroth. The primary initiative of the Titans efforts originally was the preservation of the Azeroth Titan World Soul, after all.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Conscious_Web7874",
            "body": "All I know is everyone except for me consumed the Artifact Power item [Defense Construct Identifier](https://www.wowhead.com/item=151789/defense-construct-identifier#comments) when it *explicitly states*:\n\n> \"Marks the bearer as one exempt from Annihilation Protocols.\"\n\nI tried to warn them, they wouldn't listen (or read)",
            "score": 90,
            "replies": [
                {
                    "author": "tempinator",
                    "body": "Lmao how hilarious would it be if that got some use down the line",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Conscious_Web7874",
                            "body": "Don't give me hope..I'm still waiting for never turning in the quest [His Eye Upon You](https://www.wowhead.com/quest=53766/his-eye-upon-you) to pan out.\n\nAny day now..",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Minute_Objective_746",
                                    "body": "Lucky… 60 minutes isn’t enough for me",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AnaTheSturdy",
            "body": "Your actions are illogical. All possible results for this encounter are calculated. The pantheon WILL receive the Observer's message regardless of outcome.",
            "score": 78,
            "replies": [
                {
                    "author": "fiction8",
                    "body": "https://www.youtube.com/watch?v=tBtMb_4KnAo",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "neckbeardsarewin",
                    "body": "Did we just delay the message? is there an expectation of messages at set intervals?\n\nOr is it some kind of trigger for motivating the fighting spirit of the world souls creatures to struggle to stay alive and endure through all the other creatures.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Oddloaf",
                            "body": "We cancelled the message, after we beat Algalon he gives us the cancellation code and tells us to send it out from somewhere high up, to save our world.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Lenxor",
                                    "body": "Funny thing, even if the message sent out, nothing happens, because the titans were destroyed by Sargeras and their souls wandered the cosmos.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Lucifa42",
                                    "body": "I wonder if the citizens of Dalaran were told about it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Oddloaf",
                                            "body": "I'm sure Rhonin kept it on the down-low",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bendorphin",
            "body": "CITIZENS OF DALARAN",
            "score": 48,
            "replies": [
                {
                    "author": "suchtie",
                    "body": "RAISE YOUR EYES TO THE SKIES AND OB<Ctrl+S>",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Any-Transition95",
                            "body": "Ob- serve? Serve... Serve... Serve... me.\n\n\\*shoots an arrow at the Jailer\\*",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "antillian",
                    "body": "Immediately what I thought of!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "terrletwine",
            "body": "It’s about as emotional as you seeing a corrupted hard drive and wanting to wipe it. \nThen all the programs decide to take control and keep you from doing it.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Bionic165_",
            "body": "I don’t get why the titans didn’t just immediately reoriginate Azeroth. If the mortal races are important to the defense of Azeroth, then just hide them in the Emerald Dream until they can use their bitchin’ titan powers to make the planet habitable again.",
            "score": 12,
            "replies": [
                {
                    "author": "Arcana-Knight",
                    "body": "Thats… a good idea actually. Gonna chalk that up to “writers didn’t think of it”.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "DrByeah",
                    "body": "As far as we can tell they didn't actually know what was up until extremely recently.\n\nOdyn and Ra were both out of commission and Loken was evil so no messages were being sent. Things were just slowly falling to pieces and they didn't have a chance at an update until Algalon and he cancelled the message. So that was another chance at getting updated on what was going on they missed. \n\nThey didn't get a look at what was happening on Azeroth until like Legion and even then they didn't get the whole breadth of what was going on. They had other more pressing things going on.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Prior-Procedure-821",
                    "body": "Writer guy: Because next expansion needs to happen.\n\nProducer guy: Ah makes sense.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "keelekingfisher",
            "body": "'The world exploded' is really getting me. I can just imagine him checking his map. Checking how Azeroth actually looks. Checking the map again. Making sure this is actually the right planet. Silently pondering quite what happened for things to go this wrong. Then immediately going for the reset button, he doesn't even need to check on the Old Gods or the Keepers, this is beyond redemption.",
            "score": 12,
            "replies": [
                {
                    "author": "Arcana-Knight",
                    "body": "The night elves got up to bit of tomfoolery.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "jmstanley88",
                            "body": "So few people want to talk about *just how much* chicanery the Elves were dabbling...",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Siggythenomad",
            "body": "<Algalon> could this get any worst!?!?!?\n\n<Iridikron> Hey.\n\n<Algalon> Oh hey---ooohhh sh\\*",
            "score": 40,
            "replies": []
        },
        {
            "author": "thebreakfastbuffet",
            "body": "Upvoting for one of the best Community episodes reference.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Rubysage3",
            "body": "Right? His reset button was under the assumption that the titan's defenses had all fallen and the Old Gods had broken free. Which in any case is a total apocalypse to both all the life and the worldsoul too.\n\nIt is THE worst case scenario they tried so very hard to prevent from happening.\n\nEvaporating the surface of the planet is extreme, but reasonable and logical. And I think people often mistake that cold rationality for malevolence. It's not evil, nothing about them is. They have a goal and they try to protect that agenda. Most of the time its in our interests too, but sometimes its not and that's ok to disagree on something. It doesn't mean the other side is always bad or evil.\n\nThey are not humans, they're titans. Very different perspectives and priorities. But we keep humanizing things.\n\nEven with all these new revelations around Khaz Algar and titan history it's still the same thing. Plus all these extreme measures they put in place was done so many thousands of years ago. Ancient history.\n\nThe titans today have since been destroyed by Sargeras, tormented and their remaining fragments were in turn saved by us mortals. It'll be interesting to see how their views and opinions have also changed.",
            "score": 29,
            "replies": [
                {
                    "author": "Sketch13",
                    "body": ">Evaporating the surface of the planet is extreme, but reasonable and logical. And I think people often mistake that cold rationality for malevolence. It's not evil, nothing about them is.\n\nHonestly, this is basically the only reason why the Jailer's plan made sense to me. I know the lore in Shadowlands was all over the place, but the dude wanted to re-originate the entire universe, because he's a machine that foresaw something absolutely horrible that would throw the cosmos and it's realms into chaos, where the only \"sure way\" of stopping it was literally re-originating everything and starting fresh under one umbrella.\n\nI like that he also had a Constellar in the raid, because they are always present when re-origination about to happen, they are basically the harbingers of re-origination.\n\nI hated how they went about the Jailer's story, but I always liked that we were basically stopping him from re-originating the cosmos, and how that's a common thread when it comes to Titans/Titan-like beings. The power to just wipe the slate clean with no regard for anything because that's what they are \"programmed\" to do.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Dolthra",
                            "body": "I think the problem was that they jumped the shark with \"he wants to re-originate the universe\" rather than \"he wants to re-originate the shadowlands\", because someone probably pointed out that a lot of players would be perfectly fine with re-originating the shadowlands if not for the fact that we were currently in them. \n\nDude just being like \"I decided that the whole thing was unjust and then got usurped and now I'm gonna burn it all down\" makes more sense than prognosticator Jim they went with— to me, at least.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Any-Transition95",
                                    "body": "I wonder if Blizzard intends to tie in Jailer and the First Ones plot to the coming Titan plot in The Last Titan. There is a running theory in the community that the First Ones was just a facade the Titans used when they \"Ordered\" the Shadowlands. If that is somewhat true, it would help tie the messy Shadowlands plot in a neat little bow and we can move on from it after the Worldsoul Saga, instead of leaving it as a distasteful stain in the lore. It's a salvageable plotpoint.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jmstanley88",
                            "body": "With what I took away from the Total Shadowlands Expansion Lore, it seemed to me that the Jailer was essentially Dimensional Algalon. He wanted to re-originate the cosmos because he saw Azeroth being born a Dark Titan as the greatest threat to the cosmos and other planes of existence. So, it's kinda the Thanos argument.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nick11wrx",
                    "body": "I’m sorry but speaking on my characters behalf….we saved their sorry asses at Antorus, they shouldn’t even be allowed to make choices anymore. We dealt with their corruption, we dealt with sargeras, they just chilled on their chairs. Haven’t seen them jump in to help with the recent void crisis and it’s harbinger either. Azeroths due for some new management and if we fuck it up thsts on us….but they lost their governing privileges a ways back. -this message brought to you by the Azeroth Libertarian Party",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Arcana-Knight",
                            "body": "They are kind of busy keeping Sargeras in his chair. Seriously. The titans are ghosts, mere echoes of their former power, so it’s taking literally everything they got to just keep Sargeras pinned down.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aMaiev",
                    "body": "Noone said its not calculating. But to those eradicated genocide IS evil. Like theres no debate. Imagine someone holds a gun to your head and insists that he knows its for the best, you still wouldnt want and condemn him from killing you lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "aMaiev",
                                    "body": "I never said the titans were enjoying any of that? I said exactly what you yourself just confirmed, that its evil to **the races of azeroth** on the receiving end, wich is the only perspective that matters, since we play the races of azeroth",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Salamander115",
            "body": "Throw this Azeroth in the trash",
            "score": 3,
            "replies": []
        },
        {
            "author": "Clericdallan",
            "body": "I'm still learning a lot about WoW lore, picked it up again after a small go at Shadowlands when it was current. Psyched to play a Dwarf race under Horde, went full tort getting the Earthen unlocked. Now I'm reading into titan construct lore and the curse of flesh. Wouldn't have made any of those connections without the meme, thanks op :]",
            "score": 3,
            "replies": [
                {
                    "author": "Arcana-Knight",
                    "body": "❤️",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Scythe95",
            "body": "Also Vulpera",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gobstoppers12",
            "body": "No, he was definitely right. We should have just let the world get re-originated, tbh.\n\n\nInstead, now we have Vulpera. Good job, guys. ",
            "score": 18,
            "replies": [
                {
                    "author": "LainaWriting",
                    "body": "Don't forget mechagnomes and fat humans.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "PlayTank",
                            "body": "Those two races are cool though, unlike Vulpera.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "-Zipp-",
                    "body": "Vulpera hate, in 2025? Get with the times man",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Gobstoppers12",
                            "body": "Hating vulpera will never go out of style. And that's coming from a person who plays almost exclusively Worgen and Dracthyr.",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "-Zipp-",
                                    "body": "Friendly fire dude",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "-jp-",
                                    "body": "Just for that I'm gonna join your raid specifically to yiff at you.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Gobstoppers12",
                                            "body": "I don't raid, I do delves. ",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lordwiesy",
                            "body": "Yeah we hate on earthen now\n\nCus unlike Vulperas, nobody plays them ha!",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Combustibles",
                    "body": "I feel like the dracthyr are a worse crime upon Azeroth. Cartoony fursonas, no thank you. Vulpera at least seem to be designed by the same rules that the Pandaren were designed with. I am in no way biased because I'm a pandaren main, no sire.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Lofi_Fade",
                    "body": "The galaxy and the titans would literally be toast if he did. We save their asses at the end of Legion. Have people playing post-wotlk?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cultist-Cat",
            "body": "At the same time it’s the very thing they want to reset that has stopped the world souls from falling into demon and old god hands all this time.",
            "score": 2,
            "replies": [
                {
                    "author": "Arcana-Knight",
                    "body": "Yeah that’s the fun irony part, the Titans never anticipated Azeroth pumping out an army of gigachads that not only can protect Azeroth but do it better than their “perfect” keepers",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gaatti",
            "body": "It would be really nice to have him back at the end of the saga and have him like \"yeah, I should have you done the first time\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vhurindrar",
            "body": "We getting a Shining meme follow up of Algalon trying to call for a reset with adventurers breaking through the door?",
            "score": 2,
            "replies": []
        },
        {
            "author": "hawkseye17",
            "body": "Honestly the average player antics alone would've been enough",
            "score": 2,
            "replies": []
        },
        {
            "author": "The_Sum",
            "body": "And you can't even really say that the denizens are exactly helping as every bad guy squashed is a bigger problem revealed.\n\nIt's like Azeroth is ill and is slowly working its way through the entirety of the ICD-10.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dolthra",
            "body": "Isn't Ulduar canonically done by the Alliance? \n\nIf so, considering the races that were available at the time of WotLK, Algalon came back to find his chamber infiltrated by \n\n1. earthen corrupted by the old gods\n2. vrykul corrupted by the old gods\n3. mechagnomes corrupted by the old gods\n4. a bunch of blue eredar\n5. night elves, that are chill with all of this, for some reason",
            "score": 2,
            "replies": []
        },
        {
            "author": "neXigram",
            "body": "Roooooooooxanne.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nyndelol",
            "body": "Algalon was right",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeadEnd68",
            "body": "I mean, when you put it like that...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Crunchy-Leaf",
            "body": "He was right to try to kill us tbh",
            "score": 2,
            "replies": []
        },
        {
            "author": "petite-pelotte",
            "body": "undead invasion\n\nsargeras invasion\n\ndeath realm breach \n\nVOID",
            "score": 2,
            "replies": []
        },
        {
            "author": "neckbeardsarewin",
            "body": "When i realized what Algalon was saying. Not just killing him in blodlust for phat lewt. There was shame, i must admit. Sadly its to late now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pleasant-Air8221",
            "body": "Who was the original prime designate",
            "score": 1,
            "replies": [
                {
                    "author": "Arcana-Knight",
                    "body": "Odyn was the original Prime Designate.\n\nLoken, under the influence of Yogg-Saron, teamed up with Helya to trap Odyn in the Halls of Valor so Loken could steal the role of Prime Designate and begin work on corrupting the other keepers and freeing Yogg-Saron.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WallyRedditsHere",
            "body": "What is a Prime Designate and who is the real one?",
            "score": 1,
            "replies": [
                {
                    "author": "Yewturn",
                    "body": "Head of the Titan Forged on Azeroth.\n\nOdyn was the original, pulled the Halls of Valor out of Ulduar and lost the title. Loken took it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LavishnessOdd6266",
            "body": "If I was him I would just turn around and walk away Clearly not worth the hassle or he could kill everyone... I suppose",
            "score": 1,
            "replies": [
                {
                    "author": "Prior-Procedure-821",
                    "body": "Holy paladins were too meta for Algalon to kill everyone.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LavishnessOdd6266",
                            "body": "Turn around and walk away it is!! It will burn itself out eventually... right?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MindlessComformist",
            "body": "And that's without even mentioning all the demons and undead risen by Maldraxxus magic scurrying around.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrustedTesticle",
            "body": "Vulpira in the horde.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Green_and_Silver",
            "body": "And then you learn from the discs you recover for the Earthen that the Titans were basically brainwashing control freaks and you have to rethink everything you've ever done for any of their agents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nick11wrx",
            "body": "I’m sorry where was Algalon when Westfall fell? Hmmm? These cosmic bozos haven’t done shit. I’d trust a Flu fart more than any of the Pantheon. Hope we get a raid where we can wipe them all out during The Last Titan",
            "score": 0,
            "replies": [
                {
                    "author": "Hugh-Mungus-Richard",
                    "body": "Inb4 we take out the Titans by imbuing Thrall with Azeroth's worldsoul. Green Jesus will usher in a new era.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "whitewolf_redfox",
            "body": "How many years have you been alive and have come to this realization?  He's been peeping for far longer..",
            "score": 0,
            "replies": []
        },
        {
            "author": "New_Interest6833",
            "body": "who the hell is algalon xD",
            "score": -12,
            "replies": [
                {
                    "author": "Arcana-Knight",
                    "body": "Quick summary: Algalon was the final boss of the Ulduar raid. He tried to end the world because everything was fucked. Then we fought him even though it was already too late to stop him and he was like \"Oh shit, do you guys really want to live that badly? Now I feel like a jerk.\" and gave us the code to stop the end-of-the-world machine.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Papabigface",
                            "body": "Final boss*.    Honestly my favorite wow boss of all time, was mega rewarding to down this guy and be celebrated in dalaran.  The Nostalgia hits hard for me with Algalon.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Prior-Procedure-821",
                                    "body": "I've played BDK tank since original wotlk so for classic wotlk I decided to run healer with an option to be tank. So I rolled hpally.\n\nSolo healing 10man alg was the most intense single button pressing I've ever done lol. 151 HL casts and we killed it on the last pull before timer went out.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "New_Interest6833",
                            "body": "I play since shadowlands xD never did ulduar",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Ognius",
                                    "body": "You should swing by sometime. There’s lots of celestial themed tmogs, a flying robot head mount, and tons of titan architecture.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "New_Interest6833",
                                            "body": "Idk, i always get bored after sanctum and icc xD",
                                            "score": -11,
                                            "replies": [
                                                {
                                                    "author": "UnionLess3277",
                                                    "body": "You can do the raid if wrath is on timewalking week\n\n\nIts pretty cool the start has tanks and a big siege wild beginning ",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "New_Interest6833",
                                                            "body": "I never get an invite for those lmao",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "UnionLess3277",
                                                                    "body": "Dont need one just check pre made groups in the dungeon finder thing\n\n\nAnd youll see people making groups for everything its low entry level so pretty much if you apply you'll get accepted fast generally ",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "New_Interest6833",
                                                                            "body": "I meant for the timewalk raid",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "UnionLess3277",
                                                                                    "body": "Yup thats how you do it, just apply to the premade group for it on timewalking week \n\n\nPretty sure even lower level guys can raid it next to max lvl toons\n\n\nNeeds 25 people in group before they can start",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}