{
    "title": "When vote to kick works exactly the way it is supposed to and the deserter buff is earned",
    "author": "Ninja--Edit",
    "subreddit": "wow",
    "rank": 4,
    "score": 248,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 58,
    "url": "https://i.redd.it/fyc1e0xhmhpe1.png",
    "id": "1jebf0e",
    "selftext": "Heroic dungeon. All DPS was between 500k-900k on 1st boss, Tank was doing 250k and is the one who is mad and gets kicked.  No wipes. No deaths. \n\nSorry for having to re-post it, had to remove the names. ",
    "comments": [
        {
            "author": "CorruptWarrior",
            "body": "Lol I see he pasted dps meters at the top. Just based on that it's deserved",
            "score": 41,
            "replies": [
                {
                    "author": "stevencastle",
                    "body": "It's also a heroic or a regular dungeon based on the blue loot.  Serious business.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "AnxiousAngularAwesom",
                            "body": "Later he requeued to a follower dungeon so he wouldn't have to deal with noobs in his game, but they kicked him out too.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "paulfdietz",
                            "body": "Those enchanting mats have to come from somewhere you know!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MarsJust",
                    "body": "That is an addon tbf, but I do really dislike it even in real keys.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Beneficial-Rip8091",
                            "body": "It's a weird flex to use an add-on to post DPS in a heroic dungeon especially when everyone likely runs Details. I see the \"unavoidable damage\" being posted at the end of some keys though.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shoddy-Evidence-2286",
            "body": "Pepperidge Farm remembers the actual name that was there \n\n\"Richard\"",
            "score": 46,
            "replies": []
        },
        {
            "author": "ChickenNuggetTsiki",
            "body": "why is it always the demon hunters. I'm embarrassed as a demon hunter tank player D:",
            "score": 24,
            "replies": [
                {
                    "author": "Playerdouble",
                    "body": "Edgy class brings edgy people, though not everyone is their scars",
                    "score": 23,
                    "replies": [
                        {
                            "author": "ChickenNuggetTsiki",
                            "body": "trueeee. I did meet someone a while back saying I was one of the few rare demon hunter tanks whos not mental. I.. don't know if that's a flex or not lol",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "HipGamer",
                                    "body": "Was it me? My main is a demon hunter night elf tank named Atwentyfour. I’m either on top of my game and clearing 7s with ease or having a bad day and bricking keys and apologizing the entire way.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ChickenNuggetTsiki",
                                            "body": "Dont think so, I rarely mingle with Alliance 🙈",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "HipGamer",
                                                    "body": "Damn I’m only alliance because my guild of irl friends in shadowlands rolled alliance. Idk why. I’ve been horde since 05 (not anymore 😢)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SutasSjet",
                            "body": "Used to be DKs but since DH were introduced DKs I run into are either chill af or silent. Like the grave.\n\nBadum tish.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Playerdouble",
                                    "body": "I played BDK last season up to like 2200 io. \n\nWe’re too busy playing yo-yo with our hp bar to chat",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TessaFractal",
                    "body": "I had great fun playing a DH tank in an incredibly chill way because it seemed to startle people when I didn't pull the entire dungeon at once.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ChickenNuggetTsiki",
                            "body": "Yeah, it's almost like people just wait for us to pull big, but we just want to chill.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "ambientfruit",
                            "body": "I love my DH but never play her as tank. Is it a good tank spec? Worth a try?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Genericfantasyname",
                    "body": "tried to run a fucking m+2 and i  had a flaming DH in 5 mins. :(",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ChickenNuggetTsiki",
                            "body": "Oh geeeeez 😬😬",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kientran",
                    "body": "The most incompetent tanks I’ve seen the last season  and this are Pally and DH.  People seem to think tier list rank can compensate for competency",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Derp_duckins",
            "body": "PP was the original name of the demon hunter there.",
            "score": 17,
            "replies": [
                {
                    "author": "Mark_Knight",
                    "body": "you can still see it lmao.  the guy used a black highlighter to try and censor the name",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bigglez1995",
            "body": "Man has a small pp",
            "score": 19,
            "replies": [
                {
                    "author": "Darkarcheos",
                    "body": "Is this true?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "teeso",
            "body": "Is this US or EU?",
            "score": 3,
            "replies": []
        },
        {
            "author": "CrackedCode2698",
            "body": "I swear its always a Demon hunter or a paladin tank causing issues. they're either asshats or \"Sorry first time tanking and im telling you after 5 wipes\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "Moist-Pickle6898",
            "body": "Another day, another iPhone user who can't tell a highlighter from a marker.",
            "score": 13,
            "replies": [
                {
                    "author": "No-Text123",
                    "body": "What does this post have to do with iPhones?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "TsubasaSaito",
            "body": "It's on one side hilarious to me how worked up some people get over trivial content. Like some of these people would probably advocate for a rating for delves.\n\nOn the other side, it's just sad that someone gets mad enough to insult people randomly over MAYBE, taking a minute longer for a dungeon where speed doesn't even matter.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SadBit8663",
            "body": "Anybody getting this pissed in heroics probably shouldn't even be running normal. Get this moron in some follower dungeons",
            "score": 2,
            "replies": []
        },
        {
            "author": "ciarenni",
            "body": "Guy runs a dungeon that's meant for getting people their initial end-game gear, is upset that people aren't running it in full mythic BiS. Checks out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "empirejoe123",
            "body": "\"Heroic dungeon\" are people really that fucking silly? Clown behavior",
            "score": 2,
            "replies": []
        },
        {
            "author": "unicornmeat85",
            "body": "I've been playing for years and I have rarely voted to kick anyone or have been kicked myself.  9/10 times someone d/c'd and others are being impatient that is usually why I have been kicked from a group, sucks but it rarely happens.\n\n\nLast night  I was just pugging my way to 80 on another alt when the tank, who has been just shoulder checking mobs as we run from the bomb bug boss to the elevator puts a vote to kick on me. Why? Because I was trying to kill the mobs as we went and missed the elevator that he and his dps buddy had pull as soon as they were on leaving the healer and me with crowd of angry bugs. \n\n\nI only know they tried to kick me because the healer typed in the party chat \"it's not his fault we got swarmed\" and whispered to me the tank wanted to kick. As soon as the dungeon was done I just left group not really worth hanging around to get into another dungeon faster if that is how others want to play.",
            "score": 3,
            "replies": [
                {
                    "author": "AnxiousAngularAwesom",
                    "body": "Was it the gates timewalking dungeon? Yeah, that one you can just run past all the trash past the first boss, doesn't take much to just type \"just run past\" if that's what you're gonna do to make sure that everyone is on the same page.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sanlayme",
            "body": "Smol pp energy",
            "score": 1,
            "replies": []
        },
        {
            "author": "a-wholesome-potato",
            "body": "Guy’s name is Pp, it adds up I guess.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LostSinclair",
            "body": "You love to see it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HoneyMustardAndOnion",
            "body": "really? in a heroic?  I can understand being upset with DPS in something like a +10.  But a heroic?",
            "score": 1,
            "replies": []
        },
        {
            "author": "tubular1845",
            "body": "You don't get deserter if you've killed a boss",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blubbpaule",
            "body": "This is why DPS meters fester toxic behaviour.\n\n  \nMake DPS meters a greyzone - allowed to use for yourself, but bullying peoples DPS should be instant 3 month ban.",
            "score": -26,
            "replies": [
                {
                    "author": "Icarus09",
                    "body": "You need to be really careful about doing this, because what constitutes \"bullying\" is a very nebulous gray area, as seen in FFXIV. DPS meters provide feedback. Toxic, shitty people use them to justify their behavior. And they should be banned for that behavior, not because they referenced a DPS meter.  \n  \nTelling someone \"You''re not using your interrupt and we really need to you\" can and should be fair game without hurting someone's feelings, and you should be able to link meters as evidence to make your case. That's not bullying, but I promise you, there would be so many reports about it. And we all know how Blizzard does with reporting accuracy.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "blackberrybeanz",
                            "body": "Yup, in DF we had a guild wide meltdown when we had to have a talk with a few of the RP’rs about their performance in raid. Like it’s okay to have low dmg, but doing below par is just basically asking the others to carry you while you don’t do anything. It wasn’t fair to the rest of us to wipe on boss 1 over and over cuz you don’t wanna hear the truth and start contributing.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Icarus09",
                                    "body": "Our guild was founded when a few of us broke off a guild that refused to talk to underperformers in leadership roles, so I know what you mean. It's not fun for anyone to work harder on a boss because Bob the Outlaw Rogue is doing tank DPS because he's 625 in Heroic and has a grand total of 2 M0s finished so far this season. And no offense to Bob, he's a super cool dude, but he's gonna have to chill on the bench until he either gets geared, gets better at his spec, or we get the power boost to carry him easily.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Specific_Frame8537",
                            "body": "The only one I allow to ride me about DPS meters is my raid leader, anyone else can stuff it and focus on the fight.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Icarus09",
                                    "body": "Okay, but what happens after the fight when you wipe and someone says \"Hey man, you need to kick that guy. You have 0 interrupts\"? Are they riding you about your DPS meters?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Specific_Frame8537",
                                            "body": "That's up to my raid leader.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Voxathul",
                    "body": "DPS meters are very much needed. The solution to people being dicks isn’t to remove a useful tool from the game.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "allwomanqueen",
                    "body": "Bad detected opinion rejected",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LadyVanya26",
                    "body": ">allowed to use for yourself\n\nRespectfully, this is a terrible idea. I agree that bullying people's DPS is toxic and should catch a ban, but I use DPS meters to help out my guildies. For example, we have a DK in my guild who consistently grey-parses. Like... 8s. On normal. \n\nUsing DPS meters, though, we were able to see his rotation and help him get bette, do more DPS, and even get a green parse. This helps not only him, but also the guild. \n\nI get it, though. Toxic people suck. But when dps meters are used well, they can be really helpful",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adequate_Pupper",
            "body": "ok 👍",
            "score": -21,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -36,
            "replies": [
                {
                    "author": "gba_sg1",
                    "body": "They said \"for ever\"\n\nIt, in fact, did not take 'for ever', it didn't even take forever.\n\nMaybe the tank should learn to play. They should learn to keep their chat box closed during dungeons.  Maybe next time, they will get to finish the dungeon if they learn this new skill.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "GormHub",
                    "body": "In-progress groups don't wait as long as the initial queue.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Jedimaster996",
                    "body": "I would rather it take longer than suffer even a minute with someone like this.\n\nIf you've got nothing kind to say, keep it to yourself.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "bwanabass",
                            "body": "Yeah, I agree 100%. I meant that the asshole would have to cool their jets for 30 minutes, not the rest of the group.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}