{
    "title": "Trump's Executive Orders Today - SCHOOLS CAN NO LONGER FORCE CHILDREN TO GET COVID VAXXES TO GO TO SCHOOL!! YEA!!!",
    "author": "ifellicantgetup",
    "subreddit": "Republican",
    "rank": 383,
    "score": 110,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 115,
    "url": "https://www.youtube.com/watch?v=2Q6KA3jgZAs",
    "id": "1ipmqgw",
    "selftext": "",
    "comments": [
        {
            "author": "Pfacejones",
            "body": "there's measles outbreaks in Texas are people anti covid vax or all vax",
            "score": 50,
            "replies": [
                {
                    "author": "JustOldMe666",
                    "body": "I believe the covid vaccine is a separate issue. I am not an anti vaxx but I didn't take the covid vaccine. My Dr didn't recommend it for me. I also never had covid which I find interesting as I was once exposed to it severely. \n\nThe covid vaccine is such a hot topic.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Careful_Fold_7637",
                            "body": "I was 16 when the vaccine came out, so my doctor straight up told me I should under no circumstance take it and signed me a fake vaccine card",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "JustOldMe666",
                            "body": "I am curious, why the downvotes? Is this from the group or from lefties?",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Animationfan69",
                            "body": "It works like shit anyways I legit got covid after both shots then 2 weeks later got the flu",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "JustOldMe666",
                                    "body": "I think lefties found their way in here to downvote as they won't discuss the subject, only demand draconian rules....\n\nYes, my relative who is a Marine waited until they forced him to take it. He got the vaccine and he had already had covid once. A month later he had covid again real bad. I can see elderly taking it, but younger males seems as if it wasn't needed. They were clearly a group with more side effects too but they forced them to take it.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Eskidox",
                                    "body": "Family member of mine got the vaccine and multiple boosters and they got COVID at LEAST 3 times..",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ifellicantgetup",
                    "body": "The topic is covid, measles and covid are apples and oranges.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "AJMGuitar",
                            "body": "Why is that?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "ifellicantgetup",
                                    "body": "If you are old enough to type, you are old enough to understand that covid and measles are not the same thing. Two very different illnesses.\n\nI can't do Gen Z today, no patience. \n\nPeace out.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "AJMGuitar",
                                            "body": "Misunderstood the thread, you are right. Was thinking vaccines in general. Have a good one.\n\n“I can’t do gen z today” lol. Go touch some grass. Not even gen z but they’re the ones that got your boy in office.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WhizzyBurp",
                    "body": "Measles isn’t a big deal. Before the 80s it was as common as getting the chicken pox",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "hy7211",
                    "body": "for me, all vax. Just eat healthy\n\nIf you truly believe in the vaccine, then you wouldn't be scared of me being that way.",
                    "score": -22,
                    "replies": [
                        {
                            "author": "squirrelfoot",
                            "body": "People like you do not pose a threat to people who are vaccinated. You and your unvaccinated children pose a threat to those people who cannot get vaccinated, like young babies or people with compromised immune systems. Also, your children may get very sick, be left disabled or even die of easily avoided illnesses. Measles is already coming because of people like you.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "hy7211",
                                    "body": "Sorry, not scared of your fear mongering and guilt tripping.\n\nWhat you said doesn't change the fact that vaccinated people do in fact get scared and panicked, even though they're vaccinated already.\n\nYou're just using the immunocompromised as an excuse for your paranoia.",
                                    "score": -20,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 52,
            "replies": [
                {
                    "author": "Wild_Storm4968",
                    "body": "Some colleges still require it: https://www.bestcolleges.com/news/2021-2/10/11/list-of-colleges-that-require-covid-19-vaccine/",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "NoIDontwanttobeknown",
            "body": "That was a thing?",
            "score": 14,
            "replies": [
                {
                    "author": "EarlOfEther",
                    "body": "In Michigan parents can waiver out.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gallant_hubris",
            "body": "Are republicans still anti vax, specifically the Covid vax?   Seems like it worked pretty well and I’m not aware of any significant health issues that it caused.",
            "score": 19,
            "replies": [
                {
                    "author": "MiloJay99",
                    "body": "I'm pro vax, but I believe it should be up to an individual whether or not we take a vaccine.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "IncreaseIll2841",
                            "body": "Yeah I think if you take the politics and conspiracy out of it the real issue with schools is that they are great vectors for illness. This is why we've had some vaccine requirements for decades. Kids are also more likely to be asymptomatic with alot of illnesses so they could expose vulnerable older family members without anyone realizing there was a problem. Contagions spread like crazy in schools, any parent can tell you that.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "AJMGuitar",
                            "body": "I think if we want the privilege of living in a functioning and prosperous society, the minimum requirement should be to keep dangerous but preventable illnesses subdued.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "gallant_hubris",
                            "body": "Sure it should be a choice. \n\nAnd had the entirety of the Republican Party made the choice to talk to their personal doctors, this never would have been an issue.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "myopinionprovokes",
                            "body": "This, obviously most of the vaccinations in history have been proven succesful. It's the moment they say you're getting vaxed for someone else. No you do that shit for your own health it doesn't minimize spread like mentioned in the early stages.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wild_Storm4968",
                    "body": "My mom got myocarditis after the 1st jab, and the doctor wrote it up as a vaccine injury.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IncreaseIll2841",
                            "body": "Yeah it's a known side affect unfortunately. It comes from the autoimmune reaction. Pretty rare but it happens, especially common among young men weirdly. But COVID can also cause myocarditis (and obviously a bunch of other symptoms) that also comes from the heightened immune response. \n\nI'm sorry about your mom. Myocarditis is no joke.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jbl1091",
                    "body": "Myocarditis, pericarditis, tinitus, bells palsy, blood clots.... just to rattle off a few",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hy7211",
                    "body": ">Seems like it worked pretty well\n\nWhat I don't get: if it truly worked well, then why do vaccinated people get so scared and panicked about someone being unvaccinated? It just tells me they don't truly believe in their product",
                    "score": -4,
                    "replies": [
                        {
                            "author": "gallant_hubris",
                            "body": "We don’t. The pandemic is over.  Largely because of the vax",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "hy7211",
                                    "body": ">We don't\n\nuh uh, sure\n\nAre you also going to tell me that no vaccinated person got infected?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "gallant_hubris",
                                            "body": "No",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "hy7211",
                                                    "body": "https://x.com/mtaibbi/status/1488196414979067904?t=FSjOp496z2fTPG21qyaFVQ&s=19\n\nSorry, but you people simply aren't trustworthy.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "gallant_hubris",
                                                            "body": "The vax worked well enough to stop the pandemic.  There is no other opinion worth listening to.  Listen to doctors, not talking heads (maddow, Carlson, and all those silly folks)",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "author": "hy7211",
                                                                    "body": ">The vax worked well enough to stop the pandemic\n\nuh huh, sure\n\n>Listen to doctors\n\nPlently of doctors spoke out against the jab, but got silenced by you people. Again, I simply don’t trust you. You're not worth trusting.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "gallant_hubris",
                                                                            "body": "Let’s just have a conversation with our personal physician next time.  Like I did.  Not doctors on the internet or television.",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "hy7211",
                                                                                    "body": ">Let’s just have a conversation with our personal physician next time.  \n\nHow can I, when doctors who spoke against the jab were silenced and got their license taken away?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "gallant_hubris",
                                                                                            "body": "It’s easy.  Just call and make an appointment with your regular physician.",
                                                                                            "score": 5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "hy7211",
                                                                                                    "body": "You think that will bring a physician's license back? Are you serious?",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "gallant_hubris",
                                                                                                            "body": "I don’t follow.  \n\nJust talk to your doctor in the future.  Not Tucker Carlson.  \n\n\nHave a good day.",
                                                                                                            "score": 3,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "hy7211",
                                                                                                                    "body": "If a doctor lost his license for spreading so-called pandemic \"misinformation\", then I'm not allowed to have him as a doctor. Likewise if a Nurse Practitioner got fired for refusing the covid jab. I'm not able to have such a nurse as my primary care provider, since....you know, she got fired.\n\nWhat's difficult to follow about that?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "gallant_hubris",
                                                                                                                            "body": "This did not happen to your doctor. \n\nCall your doctor for medical advice, not the news",
                                                                                                                            "score": 4,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JustOldMe666",
                    "body": "Republicans are not anti vaxx. Liberals in California are and constantly have outbreaks in the state because of it. \n\nCovid vaccine is a different issue because of many questions around it. Don't bunch it in with other vaccines.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "LowFlowBlaze",
                            "body": "I lived in california for years and never encountered a single anti vax liberal. Where are you getting that from?",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "JustOldMe666",
                                    "body": "from many stories over the years.\n\nhere's an article, it's longer but interesting read discussing vaccines and political sides.\n\nthere's more of course if you search for it. \n\n[https://theconversation.com/anti-vaccination-beliefs-dont-follow-the-usual-political-polarization-81001](https://theconversation.com/anti-vaccination-beliefs-dont-follow-the-usual-political-polarization-81001)",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gallant_hubris",
                            "body": "Has it caused any public health issues?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "JustOldMe666",
                                    "body": "some measles outbreaks on the west coast several times.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shakennotstirred72",
                    "body": "Yes i am anti covid Vax. It did not work well. I'm sure you are a troll. Fuck your vaccine and your vaccine mandates that raped our freedom and wanted people to bow down to your bullshit. Never again. Go fuck yourself",
                    "score": -31,
                    "replies": [
                        {
                            "author": "gallant_hubris",
                            "body": "Okay.  Good chat.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "shakennotstirred72",
                            "body": "BTW just saw this same comment I responded to on several other subs. This is their new blanket question trying to stir up shit.",
                            "score": -18,
                            "replies": [
                                {
                                    "author": "gallant_hubris",
                                    "body": "Is it possible that we just don’t understand your opinion and are asking for clarification?",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "shakennotstirred72",
                                            "body": "It's possible you don't understand because you are a bot.",
                                            "score": -19,
                                            "replies": [
                                                {
                                                    "author": "gallant_hubris",
                                                    "body": "Nope",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "shakennotstirred72",
                                                            "body": "So who is we?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "gallant_hubris",
                                                                    "body": "We? Not republicans I guess?  Please just explain what specifically scares you about the Covid vax",
                                                                    "score": 13,
                                                                    "replies": [
                                                                        {
                                                                            "author": "shakennotstirred72",
                                                                            "body": "I guess all the side effects and myocarditis.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Wild_Storm4968",
                                                                            "body": "My mom got myocarditis after the first jab. Her doctor wrote it up as a vaccine injury. There are stories like this all over. You just need to dig a little.",
                                                                            "score": -6,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Purple_Nerve_7115",
            "body": "It’s not that I’m anti vax, I’m just against putting something in my body that was made in a lab in like 2 weeks and then mandated.",
            "score": 3,
            "replies": [
                {
                    "author": "Profit_Euphoric",
                    "body": "Even if WHO & CDC approved it? Testing upon thousands? It’s not like it’s something they just whipped up and said “try it”. While several were dying and hospitals were overflowing with new cases with a vaccine yet to be made, what would be your cutoff point to say “okay now is the time to send something out to battle COVID19”?\n\nI also see your point, too. To each their own. Just another perspective is all.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Purple_Nerve_7115",
                            "body": "Actually they did just whip it up and then forced people to get it. They then censored anyone that posted against it online. If nothing was done wrong why did Biden pardon Fauchi in the first place?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vlad_The_Impalo",
            "body": "Fuck yes. Fuck forcing people to get the Covid vaccine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Living-Fill-8819",
            "body": "As someone who got the covid vax, I love this! Gov stop telling us what medical decisions we can make!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Roudyrepublican",
            "body": "My son has never had to get the vaccine to stay in schools. Are some states different?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nyroughrider",
            "body": "Now rehire every single person that was fired for non Covid vax. Plenty of open jobs in the US govt.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Ightorn",
            "body": "Only covid vaccine or others also? Like measles or smallpox?",
            "score": -2,
            "replies": [
                {
                    "author": "billstopay77",
                    "body": "Where was this school requirement happening? I have children in that specific age bracket and we didnt have to get vaccinated? Can anyone cite any states or districts that required this?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "billstopay77",
                                    "body": "I live in CA, didnt happen here. It's fear mongering. That's what I mean, most of the stories where both sides get worked up are BS. They want us divided because they dont want us to realize we have more in common than we think.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ightorn",
                            "body": "I dont know. Im just asking.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "billstopay77",
                                    "body": "Yea I can’t find anything where a school mandate actually happened. I can find stories where it was discussed but never passed into requirement. Both sides need to stop taking the bait on stories that are not factual. It just furthers the divide.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jocie809",
                            "body": "This literally isn't a thing. I live in a very liberal state and no one here required covid vaccines. This is political BS at its finest.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "billstopay77",
                                    "body": "Yea, its frustrating because it is being painted as a win via the EO when it wasnt even a requirement in the country, other than some colleges and based off the story it looks like just people that lived on the dorms. Both sides of the aisle are being manipulated to divide and not agree on many issues that arent even facts. Those in power do not want us on the same side, they want this divide to continue so we dont join together and learn we have more in common with eachother than the corporations and ultra rich. This same play has been done for centuries and we keep falling for it.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "jocie809",
                                            "body": "OH MY GOD I COULD NOT AGREE MORE. If you look at my comment history, I've been shouting this from the rooftops. I cannot STAND how often people fall for all of this. I am a democrat, but I'm more in the middle, and it makes me honestly batshit crazy how both sides say the same awful things about the other side, when in reality, we are so much more alike than we are different. It's not democrat vs republican - it's the ultra wealthy vs the rest of us. They want us distracted by this stupid shit so we stay complacent. It honestly makes me insane when I think about it too much - people are sheep. \n\nI recently posted this on a different thread: \n\n\"Everyone should rewatch/see the movie A Bug's Life. I'm not even joking. TLDR: a group of ants (representing the people) are tormented by a group of grasshoppers (representing the government). The grasshoppers see the ants as small and insignificant. They take from them as much as they want. The ants work all day to make the grasshoppers richer. Then, one day, the ants realize there are waaaaayyyyyyyy more ants than grasshoppers, and they see that if they all start working together against the grasshoppers, they can stand up to them. And they do. We are the ants. Politicians/billionaires are the grasshoppers. It's kind of this simple. They want us divided y'all.\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JustOldMe666",
                    "body": "the funding is about the covid vaccine requirement.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ACID_REFLUX_SUCKS",
            "body": "Didn’t all k-12 grade schools drop COVID vaccine requirements in early 2024? Lol.  Whats next?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Eskidox",
            "body": "It’s fair for the COVID vaccine I think. It was so rushed .",
            "score": -1,
            "replies": []
        },
        {
            "author": "thorleywinston",
            "body": "People do realize that the President doesn't have the authority to pull back funds that Congress appropriated by attaching new conditions on them by himself after the fact.  That's why he lost during his first term when he tried to take back money from sanctuary cities and while he will lose again when/if this gets challenged in court.\n\nBut at least he got a nice photo op.",
            "score": -1,
            "replies": []
        },
        {
            "author": "jocie809",
            "body": "Here is a question: it was Trump who first pushed the covid vaccine to get going - he even took credit for it? IMO, it's one of the best things he did - but then Biden came in during the pandemic and suddenly everyone hated the vaccine. Make it make sense!?!?!?!",
            "score": -1,
            "replies": [
                {
                    "author": "ifellicantgetup",
                    "body": "No, it does not make sense at all. Yes, it was Trump and I fully blame him for the vax, the lack of research, the vents, all of it. And Biden did take credit but people did not begin hating the vax because of Biden, they hated what it was doing.\n\nDo you really not understand the damage that crap has done? Seriously? You are totally unaware of the harm that drug has caused? With ALLLLLLLLLL the info out there, ALLLLLLLLLLLL the studies, ALLLLLLLLLLLL the research, the numbers, the stats, the deaths, ALLLLLLLLLLLLLLL the lives ruined, ALLLLLLLLLLLLLL the people screaming the dangers of this drug - and you \\*still\\* think it was a good thing?\n\nFor real?????????\n\nLet me ask you something. Covid has a 99% cure rate left untreated and unvaxxed. We have never before, ever ever ever created a vaccine for an illness that will fix itself anyway, like the common cold.\n\nMy question is this... why do YOU think they came up with the vax? Can you name ANY other illness in history that cures itself 99% of the time, yet we shut down the world so people could lose everything they had, their jobs, their careers, their everything? Just one, can you name one illness we have ever done this for before with a 99% cure rate left unvaxxed?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "jocie809",
                            "body": "The fact that this vaccine has become political is crazy to me, and the fact that who takes it v.s. who doesn't take it falls so clearly along party lines tells me that this topic is rife with misinformation. Very few people debate the effectiveness of the polio vaccine, MMR, etc. That is because they weren't rolled out during an incredibly contentious political atmosphere where the rise of social media fired up misinformation on all sides. I fully believe, had Trump won in 2020 and not Biden, many on the right would have been fine taking the vaccine, but because there was a transfer of power during this time, it became a political pawn. \n\nWhile the vaccine for covid was developed quickly, it was on the shoulders of decades of research developing mRNA vaccines in the fight against SARS. This wasn't a brand new thing, as is often spouted. As for the dangers of this drug, I have yet to see any compelling evidence in any major medical journal (and I'm not talking about what is said here on reddit, or on the cable news, or on social media) showing that this drug is not effective or that it is overall unsafe. Are there examples of some people having bad reactions? Or course. It is that way for any and all drugs ever created. But for the vast majority of people who took it, they are fine. You use the example of, if 99% of people who had covid recovered, why do we need a vaccine? Well, if 99% of people who took the vaccine are fine without any complications, what is the problem? \n\nAs for your stat that \"We have never before, ever ever ever created a vaccine for an illness that will fix itself anyway, like the common cold.\" - this actually isn't true. We now have a vaccine for chicken pox, which has reduced deaths from chicken pox by 97%. How many deaths were there for year prior to the vaccines? About 1.6% of people who got it, died. This means that about 98.4% of people who got chicken pox survived it. And yet, we now have a vaccine and children do not have to go through the suffering of chicken pox. And going even further, I bet if you, or someone you loved, were in that 1.6% of people who did die from chicken pox, you would be pretty sad they hadn't gotten the vaccine. \n\nI'm not trying to be a dick, and I don't know where you get all your information, but the covid vaccine is very safe. Do I agree with all the measures they took at the time? No. I was at home, trying to teach my son online kindergarten while I also had a toddler running around. It was hell. Do I think they should have closed the schools? Looking back, no I don't. But I also appreciate that hindsight is 50/50. And again, the fact that the reactions to how it was all handled falls so firmly along party lines tells me there is more going on here than \"common sense\" or \"doing research\". There is a political bent to your opinion, and probably to mine as well, and we should at least own up to that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jbl1091",
            "body": "Good start, but i think the issue is all MRNA Vaccines now and going forward untill tested properly... they should not be used",
            "score": -4,
            "replies": []
        },
        {
            "author": "None",
            "body": "We have been over protective with our children. We need to let god do his bidding instead of interfering with his ways. Death and disease are part of gods plan",
            "score": -12,
            "replies": [
                {
                    "author": "Cool_pelirroja",
                    "body": "I hope you don't have children. God also gave us brains to figure out how to protect ourselves.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "dreadguy101",
                    "body": "I wonder who’s behind this post…",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Grave_Warden",
            "body": "Fuck yeah.",
            "score": -10,
            "replies": []
        }
    ]
}