{
    "title": "Democrats Demand Transparency From Man Who Posts Literally Everything He Does On The Internet",
    "author": "M_i_c_K",
    "subreddit": "Republican",
    "rank": 351,
    "score": 180,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 73,
    "url": "https://babylonbee.com/news/democrats-demand-transparency-from-man-who-posts-literally-everything-he-does-on-the-internet",
    "id": "1iq9aa2",
    "selftext": "",
    "comments": [
        {
            "author": "None",
            "body": "[removed]",
            "score": 63,
            "replies": [
                {
                    "author": "muxman",
                    "body": "What more oversight can he have? He doesn't have the power to do anything more than look into spending. He reviews information, finds wasteful spending and reports it. That's it.\n\nHe doesn't have power to cutoff anything. Nothing that gets cut off is cutoff by him. He reviews iformation and makes recommendations of what is wasteful to people who legitimately do have the power to cut it off. The people who the only reason they didn't cut it off already is that they didn't know about it. \n\nHe let's them know about it.\n\nShould he only be allowed to look at information curated by the very people who don't want to lose thier wasteful programs? Is that the oversight he needs? His hand held so he doesn't look in the wrong places for what corrupt politicians are hiding?\n\nOr in other words, he needs oversight so he can't find exactly what his job is to find.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Ammordad",
                            "body": "For one thing, he has a history of lashing out against his critics by violating their privacy and disclosing private information. Most famously, the utterly absurd case of him leaking the DM he had with someone who called him out for lying about being a pro-gamer, pretending was uncovering some \"concpiricy.\"\n\nThat's not the sort of person who should be trusted with sensitive national information. Next time he decides to lash out against someone who is calling him out over something more serious than a video game drama, he might be able to a lot more damage to both the US government and the individual as punishment for critisim. \n\nOn that note, DOGE also seems unqualified with cyber security affairs. Not only is there no oversight on Musk to take adequate security measures to prevent leaks of national data, but there is also no reason to believe a malicious party won't alter data Musk has, which could result in bad recommendation or manufactured sacandle.\n\nOn the note of the manufactured scandle, Musk and DOGE also seems grossly unqualified to give out any sort of recommendation. We can't go a week without Musk or someone on the DOGE telling some utterly nonsensical review of the data, which points him as either incredibly stupid or an incredibly dishonest person. To me as a tech person, this is most obvious when he does \"tech commentry\" of the US databases, which might sound impressive to a non-tech person, is actully just nonsense to people who know tech. Like his comment about SQL serves or non-unique social security numbers in database tables.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "When has the left ever shown transparency?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "milaron01",
                            "body": "This isn’t about left vs. right—it’s about something completely unprecedented. When was the last time the richest person in the world was handed this kind of power? Never.\n\nAnd your response is basically, “Well, the left is never transparent.” What does that have to do with the current situation? I’m so tired of this mindset. “They did this, so now we get to do it too.” Two wrongs don’t make a right.\n\nStop using past corruption as an excuse for more corruption.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "He’s more transparent than any person I’ve ever seen in government. Him and doge.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "I’m always interested in learning. So if you know of anyone that has been more transparent I’m willing to learn.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "turndownforwoot",
                                                            "body": "You have net NEGATIVE karma (-99 as of this moment). You’ve got to be a bot, a bad one at that.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "It’s because Reddit is a liberal waste land and I post on things about trump",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "turndownforwoot",
                                                                            "body": "How did you even respond so fast? You have to be a bot.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "I’m on my phone my guy lol",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "turndownforwoot",
                                                                                            "body": "I think you mean that you *are* a phone, in a bot farm like this one: https://youtube.com/shorts/qz0k79aW0o4?feature=shared",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "turndownforwoot",
                                                                                                    "body": "^ Not sure if your programming is capable of viewing external video content.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "You got me libtard. Must be a conspiracy theorist",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "turndownforwoot",
                                                                                                            "body": "I’m a libertarian and an engineer with more than 40 patents. I’ll admit that somehow got the ‘lib’ part right, but then again even a stopped clock is right twice a day.\n\nYou should try not to resort so quickly to ineffectual insults, it makes you seem weak and unlikable. \n\nI believe in small government and transparency, I want to see budgets reduced, not $400MM contracts given out to the people we are trusting to reduce those budgets. \n\nNote: No matter how inane and/or childish your reply is, I’ll give it an upvote to help you get out of your karma debt.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "Stop listening to Rachael maddow she’s rotting your brain\n\nhttps://www.nbcnews.com/tech/tech-news/state-department-says-tesla-was-not-awarded-400m-contract-produce-armo-rcna192034",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "I didn’t ask but as someone who considers themselves smart you should do some research. Biden gave musk that 400m contract for armored vehicles and trump put a halt on it. Google is free smarty pants",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "Appreciate the upvotes tho boss means a lot",
                                                                                                                    "score": 0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "Why are you on a republican sub?",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AJMGuitar",
            "body": "I think if he’s going to essentially be an appointed government employee, he should have to sell any holdings that present a conflict of interest and disclose any conflicts of interest like any other government employee. If the roles were reversed and Kamala had George Soros doing this, I’d expect the same.",
            "score": 39,
            "replies": [
                {
                    "author": "muxman",
                    "body": "If he was able to make changes to implement programs and spending to his benefit that would make sense. Like all the members of congress who engage in insider trading when they vote for or agaisnt things that do directly benefit themselves. \n\nHis job is to review spending and report his findings. He doesn't have control or power to actually do anything, so nothing he does benefits him directly to where he can profit. \n\nReporting on what others do is not a job that presents conflicts of interest like what you're talking about.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "AJMGuitar",
                            "body": "There’s multiple reports of Elon telling government employees to leave. Let’s not be naive. Congress should also be held to a higher standard.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "muxman",
                                    "body": "He can tell people people to get out, that doesn't mean he made the official decision that they lost their job. Because he not only didn't but he can't. He can't actually fire the person.\n\nWhat is means is he's just that arrogant and rushed to tell them they did so he could be the one to deliver the news instead of waiting for them to receive that news from an official source. \n\nSo yeah, let's not be so naive. He didn't officially fire them and you know it. So why are you trying to say he did? Or are you really that naive and trying to say others are to hide it?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "AJMGuitar",
                                            "body": "If he’s able to audit the government while at the same time receiving subsidies for his companies and government contracts through space x, that’s a problem.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "muxman",
                                                    "body": "If they are related, yes. But if what he's auditing, like USAID that has nothing to do with his businesses, then, no.\n\nNot everything applies to his businesses.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Goldfishfarmer_",
            "body": "I think what really drives the people nuts is that Elon is posting inaccurate information on his x account. Like the $50M of condoms to Hamas. Which was fact checked and proven to be inaccurate. Once informed, he stated, \"We will make mistakes - not everything I say will be correct.\" Hopefully, the DOGE site they created will make everything more transparent.",
            "score": 40,
            "replies": [
                {
                    "author": "DunningKrugerinAL",
                    "body": "I think it was $50 million for a country in Africa.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Goldfishfarmer_",
                            "body": "Mozambique, yes, it's in East Africa.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Kakaduzebra86",
                    "body": "You are all cooked",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "M_i_c_K",
                    "body": "Show me someone that won't admit making mistakes and likely they will be a woke Democrat. 😁👍",
                    "score": -20,
                    "replies": [
                        {
                            "author": "Goldfishfarmer_",
                            "body": "Making mistakes is fine. Every administration makes mistakes and is bashed for it. I think with the magnitude of everything happening, canceling contracts and firing people and closing agencies... I would hope information is fact checked before being passed to the masses.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "M_i_c_K",
                                    "body": "I hope they step up the pace... 😁👍\n\nAs famously said:\n\n\"It's better to ask for forgiveness than permission\"",
                                    "score": -7,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Goldfishfarmer_",
                                            "body": "Seems like they should have plenty of time to cut the budget. A couple of days ago, 300 staff members were fired from the National Nuclear Security Administration, 24 hours later, those members were re-hired because they rushed, kicking them out the door. DOGE rushed, creating their website, which led to national intelligence being leaked. So using those examples... I personally hope they \"slow down\" in order to reduce putting our nations data and systems at risk. \n\nBut i understand people are concerned that the judicial and legislative branches will fight back against this current \"purge\"",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "M_i_c_K",
                                                    "body": "> personally hope they \"slow down\" in order to reduce putting our nations data and systems at risk. \n\nWhere exactly have you been the last 4 years, navel gazing. 🤭",
                                                    "score": -2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "launchdecision",
                                                    "body": "Excellent counter argument we should continue running this useless gargantuan behemoth of a bureaucracy because man there is one or two things it does okay and the 5 seconds it takes to figure it out is just too long....",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ShadowsGlow",
            "body": "Maybe just a little more transparency—like, I don’t know….why’d you leak everybody’s private information. How come you don’t have people there with you only ones to help you plunder. This is a big deal-all Americans should demand that he answer questions as to his stated purpose.",
            "score": 5,
            "replies": [
                {
                    "author": "aounfather",
                    "body": "What private information?  What the heck are you talking about?  Also reading this paragraph made me have a stroke.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "aounfather",
                                    "body": "I’m sorry I had a stroke reading your response.\n\nThat’s two in one thread.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "aounfather",
                                                    "body": "You mean the misreported breathless “facts” that turned out to be wrong but were good enough to get people riled up for no reason?  Those facts?  \n\nThe “classified” information was also openly available on the OPR website the whole time.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "raidmytombBB",
            "body": "It's not transparency when no receipts are provided.  I am all for cutting unnecessary spending but show proof and details with it.",
            "score": 4,
            "replies": [
                {
                    "author": "Unusual_Stay9600",
                    "body": "The receipts are there. Democrats counter argument is \"well the money still needs to be spent.\" They are fighting it in the courts to make the payments happen despite Trump EO. \n\n\nSo essentially they are admitting to the frauds and claims the money still should be spent for these programs. The other argument they made, is \"rich guy shouldn't have access to out privacy\", despite Trump running a campaign for this. The irony is that Democrats want to hire more IRS's to audit us taxpayers, yet the taxpayers cannot do the same. \n\n\nDemocrats are on the losing side of this. And they have NO PLAN how to fix the Federal debt. They actually don't care if the federal deficit goes even higher. Hence why a good reason Trump approval rating is up while the Democrats rating is at an all time low.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sciotamicks",
            "body": "The left gaslights themselves.",
            "score": -1,
            "replies": []
        },
        {
            "author": "independentlywrong",
            "body": "Stop spending endless money on stupid shit. Just like anyone else who needs to fix a budget",
            "score": 2,
            "replies": []
        },
        {
            "author": "notmyfaultyouredumb",
            "body": "Ever lie on the internet?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoishaSchwarzter",
            "body": "This is gonna be more of a fucking rant than anything, but I'm sick and fucking tired of the left attacking people because they voted for him.\n\n\"oh you voted for a felon, a r*pist, a Nazi\" \n\nThat's like their go to. They have nothing better to do than try to make everyone else as miserable as them, and it's starting to piss me off severely. I'm sick of being called a Nazi for doing my duty as a US Citizen and voting for the person I THINK is qualified for the position of POTUS. The democrat hive mind of wokeness needs to be exposed. \n\n\nThe main reason they're freaking out over Doge and not wanting to be transparent with where our tax dollars went, is because they don't want us to know who has their hand in the cookie jar. \n\nI'm sick and fucking tired of being told what to think, how to feel and who to vote for by the left. I'm glad we got a president we can be actually proud of for protecting the US Citizen and making America great again.\n\nGOD BLESS DONALD J. TRUMP",
            "score": -7,
            "replies": [
                {
                    "author": "NarwhalNo1946",
                    "body": "I feel the same way, I’m surrounded by them. I feel like the crazy one and it makes me feel very wound up. I don’t see what the issue is in un earthing all of this mis spending? This is horrible that our government has been throwing round taxpayers dollars on stupid stuff. Everyone jokes about it yes but now that it’s being exposed to this extent? How can you look the other direction when you hear some of this stuff. “20 million for sex changes to Guatemala” 10 million to Iraq Sesame Street. Our country is in distress, fentynol is claiming more lives than covid, homelessness is out of control. Most people I know can’t afford health insurance or daycare but yet illegal immigrants get these for free. What is happening!? How did we get to the point where undocumented immigrants are better off than our own people? I may not agree with everything trump says but the dude does not give up, he’s unstoppable. Hes been taken to the trenches and now he’s getting his revenge by exposing the left.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MoishaSchwarzter",
                            "body": "And the world is crying out in fear that the left creates..I'm on the verge of leaving the rat race iykwim",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comprehensive-Tell13",
            "body": "Dems are trying to get him to disclose things he isn't allowed to people signatures and things of that nature is for the investigators to disclose when and if charges are filled  it's a good thing that he isn't 100% transparent about what he has discovered.",
            "score": -3,
            "replies": []
        },
        {
            "author": "Competitive_Sail_844",
            "body": "They are blind and are asking for visual cues",
            "score": -2,
            "replies": []
        }
    ]
}