{
    "title": "Liberal Wisconsin governor has a new definition for mothers",
    "author": "LesPaulRyanBraun",
    "subreddit": "Republican",
    "rank": 175,
    "score": 65,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 19,
    "url": "https://x.com/danodonnellshow/status/1893067761552683211?s=46&t=5vvq5hd2ykSzEjOt3zOrHw",
    "id": "1iv965d",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lifeisagreatteacher",
            "body": "So great that he is focusing on the critical issues facing the residents of Wisconsin",
            "score": 10,
            "replies": []
        },
        {
            "author": "independentlywrong",
            "body": "Man wtf is wrong with these people",
            "score": 33,
            "replies": []
        },
        {
            "author": "shakennotstirred72",
            "body": "They really hate women.",
            "score": 27,
            "replies": [
                {
                    "author": "LarryMyster",
                    "body": "They do. The entire Dem party was infiltrated by incels who hated women.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhoDat89DK",
            "body": "\"...by HIM OR HER or the inseminated person\". Wow wow wow, hold up! There's also 'they', 'them', 'this n that'. What a sexist remark to the end of an otherwise excellent re-definition.",
            "score": 6,
            "replies": []
        },
        {
            "author": "BeautifulExternal943",
            "body": "Does he call his mother that? He needs a beatin’ if he does",
            "score": 4,
            "replies": []
        },
        {
            "author": "Marsrule",
            "body": "well..... some people are surrogates and its a philosophical debate if they are a mother or not and what does motherhood mean. I wouldnt say only being a mother = just being pregnant",
            "score": 2,
            "replies": [
                {
                    "author": "Low_Theory_2795",
                    "body": "In the natural world, the mother is the pregnant one. Good lord.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Michael70z",
            "body": "Hey democratic lurker here, just want to mention that the reason for this bill as I understand it is related to lesbian couples using artificial insemination. They would both arguably be “the mother” so this clarification can be useful in cases like that. Doesn’t seem to be much of a trans issue at all afaik",
            "score": 0,
            "replies": [
                {
                    "author": "Baronist",
                    "body": "I guess you're mostly right here. But the bill specifically cut out the artificial insemination part. So, if a woman, who is in a lesbian marriage sleeps with a man and gets pregnant, the biological father doesn't automatically become the legal guardian of said child. Seems to be an idea to safe lesbian couples some money and headaches when they want a child but I see potential to abuse this law to rob men of their rights as a father.\n\nOh and the wording of the \"inseminated person\" seems to be about trans issues. Otherwise it wouldn't have been necessary to change that.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Low_Theory_2795",
            "body": "https://www.waow.com/news/gov-tony-evers-introduces-bill-to-remove-the-term-mother-from-state-law-in-favor/article_e60bd02e-f0b4-11ef-b2ff-47de1443727e.html",
            "score": 0,
            "replies": []
        }
    ]
}