{
    "title": "The Nuclear Family is Under Attack - American Thinker",
    "author": "GeneralCarlosQ17",
    "subreddit": "Republican",
    "rank": 77,
    "score": 0,
    "upvote_ratio": 0.34,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.americanthinker.com/articles/2025/03/in_new_york_city_the_words_of_the_prophets_are_written_on_the_subway_walls.html",
    "id": "1j26n73",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "kotawaru",
            "body": "It’s because the United States is a nation for the people, not for a religion. Although many of the foundin fathers were Christian, they were of different denominations- and back then, not being the same kind of Christian led to some pretty nasty bigotry, especially in England. That’s why freedom of religion is in the constitution, to originally protect different denominations of Christianity and then of religions of the people who immigrated here. The article doesn’t talk about nuclear family really- just that the mainly Protestant idea of Christianity and virginity should be maintained. I’m all for teaching abstinence in schools and all that but we need to make sure that it’s both girls and guys who get those lessons- this article seems to blame everything on girls. \n\nOn nuclear families… it’s called nuclear for a reason: the Cold War. Guess what’s not happening anymore? The Cold War. We’ve moved beyond an era of nuclear families- society has changed, and always will. Life isn’t the same as it was sixty years ago when the idea of the nuclear family was a thing. So it’s not right to say it’s under attack when it was always meant to fizzle away.",
            "score": 3,
            "replies": []
        }
    ]
}