{
    "title": "Meds are wearing off so quickly",
    "author": "adhd6345",
    "subreddit": "ADHD",
    "rank": 488,
    "score": 6,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/r/ADHD/comments/1j21b9q/meds_are_wearing_off_so_quickly/",
    "id": "1j21b9q",
    "selftext": "My medication seems to be wearing off extremely quickly.\n\nI’m on both Vyvanse and Dexedrine (used as boosters). The Vyvanse is at 50 mg.\n\n- Vyvanse stops about 4-5 hours after taking it\n- Dexedrine stops about 3-4 hours after taking it\n- The crashes make it difficult to not be overly fatigued throughout the day\n\n\nIncreasing the Vyvanse dose seems to just make it stronger instead of last longer. \n\nAny ideas? Does anyone else go through this too? I’m not sure what’s going on.\n\nI’ve tried water, protein, supplements, etc and nothing really makes a difference.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScaffOrig",
            "body": "Being exhausted when the meds wear off suggests the meds are covering for that tiredness or are at a dose level that causes it on rebound.\n\nYou need to get to the root of what is causing the fatigue. Trying to combat tiredness with stimulants just leads to it coming back harder later. Fatigue and ADHD are not the same thing, though the former can make symptoms of the latter worse.",
            "score": 7,
            "replies": [
                {
                    "author": "adhd6345",
                    "body": "Not really trying to compensate with the stimulants & I’ve already worked with the director of sleep department of the local hospital; they recommended adding more “boosters” in the evening.\n\nFatigue aside, the ADHD symptoms are present when this occurs.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ScaffOrig",
                            "body": "Ok, interesting. It's challenging to know why you might be so fatigued then. Have they offered any explanations?\n\nMy experience with these meds has been that they make me less fatigued generally because a) I'm not dealing with ADHD symptoms all day and b) my calmer mind allows me to get to sleep easier. To achieve that I do sometime have an additional dex around 6pm if I sense that the chaos is returning. \n\nBut onto the the meds and ADHD symptoms, I have something similar. I would say my 50mg Vyvanse lasts till about 14.00, so I'll have the dex at that point. And yeah, that will run out early evening. There's usually enough left there to see me being a reasonably useful human to my family in the evening and getting to bed for a quiet sleep, but sometimes I do need that extra booster.\n\nBut like I say I don't get crashes, I just get the ADHD symptoms come back.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "adhd6345",
                                    "body": "At what time do you typically take the Vyvanse?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ScaffOrig",
                                            "body": "Between 7 and 8 usually.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "adhd6345",
                                                    "body": "Hmm short, but still a bit longer than in my scenario",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "dfunk4171995",
            "body": "I just think it’s all medications right now are not getting made like they used to especially the generics. I always take mydayis on an empty stomach soon as I wake up and have breakfast about 20 minutes after but then start crashing after noon I hate it lol",
            "score": 5,
            "replies": []
        },
        {
            "author": "ComfortableCoyote314",
            "body": "Boosters? Huh? Please explain.",
            "score": 3,
            "replies": [
                {
                    "author": "adhd6345",
                    "body": "Additional doses taken later in the day for this particular issue.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "itsaproblemx",
            "body": "Same for me!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Silver-Bad3087",
            "body": "Are you getting enough sleep at night? And what time are you taking your first dose?",
            "score": 2,
            "replies": [
                {
                    "author": "adhd6345",
                    "body": "About 7 hours. I take it at 9 or so",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Silver-Bad3087",
                            "body": "It’s something about our body chemistry (I’m paraphrasing my doc) but these stimulants are most effective taken the second you wake. Seven hours sleep is plenty so that’s all I can surmise. If I remember to take it asap it works fine until 6pm. When I forget and take meds as late as even one hour it makes a huge difference!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Redrick_Gale",
            "body": "From what I understand (regarding vyvanse), 4-5 hours is normal. What you might be looking for, instead of a higher dose, is for the meds to be in a timed release capsule. \n\nIt will basically release the first dose, then after 4ish hours, the second dose will be released. Of note: after the 4ish hours, before the 2nd dose hits, you might feel a little down, before picking back up.\n\nI’m not an expert, but that’s what I remember my doctor explaining to me when going over my own prescription.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cat-kuring-chat",
            "body": "Your circadian rhythm might be off",
            "score": 2,
            "replies": []
        },
        {
            "author": "Osmirl",
            "body": "How much sleep do you get? \nI need alot of sleep on vyvanse for it work best. Like i function with less sleep to but my adhd symptoms are alot worse.",
            "score": 1,
            "replies": [
                {
                    "author": "adhd6345",
                    "body": "I average about 7 hours",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Effective-Owl-3893",
            "body": "It lasts about 6-7 hours for me - I’m taking boosters to extend, which is great :-)\n\nUsually 40mg in the morning, 30 mg 7 hours later :)",
            "score": 1,
            "replies": []
        }
    ]
}