{
    "title": "I just realised methylphenidate was sapping my personality",
    "author": "recigar",
    "subreddit": "ADHD",
    "rank": 294,
    "score": 469,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 87,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2bdqj/i_just_realised_methylphenidate_was_sapping_my/",
    "id": "1j2bdqj",
    "selftext": "When I started on it I guess it helped me concentrate at work, and it sure made me less distracting of others. Fast forward a few years and I have this overall feeling of lack of motivation but also a sense that I am just becoming a boring person, but part of me thought that was just the cost of being able to focus. Now for reasons related to motivated I asked psychiatrist to try dexamfetamine and wow within like 3 days while I did find myself more motivated, what I really noticed was that I felt like myself again. I was gaining benefit from the medication, concentration etc is better, but I’m back to being convivial and light hearted and joking around. It’s made me realise I had no idea what methylphenidate had done to my personality. I know others go in the opposite direction but thought someone might find this interesting. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frosty-Error2157",
            "body": "I noticed that I'm more cold, I have a general sense of hostility (more common when the med is wearing off) that isn't funny to deal with. It's causing some trouble at work and in my relationship.",
            "score": 390,
            "replies": [
                {
                    "author": "Xane256",
                    "body": "I definitely notice my mood change as it’s wearing off, but the main reason that happens for me is that I’m actually really hungry - way past hungry in fact, and fast-tracked into “hangry” territory, and I only just start to realize it when the meds wear off. I’ve learned to identify other signs that I need food earlier, because the feeling of hunger is not one of them.",
                    "score": 175,
                    "replies": [
                        {
                            "author": "Minimum-Avocado-9624",
                            "body": "This is often overlooked",
                            "score": 29,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MattabooeyGaming",
                    "body": "I’m cool as a cucumber until my meds start winding down and then I get irritable and grumpy. Usually just get a small caffeine boost to help and understand I’m the grump not everyone else. Thought about asking my doctor for something to take during those times my meds are done but I’ve still got a few hours left before bed.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Finely_Tooned",
                            "body": "Whats something that may frustrate you when things are wearing off?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "MattabooeyGaming",
                                    "body": "Nothing specifically. Working 12 hour shifts overnight is take my meds right before work but around the 9-10 hour mark they’d be gone. Problems that would come up would just affect me more intensely. When I’m not at work my wife can tell when my meds wear off I get “extra spicy” and it’s tough for me to focus or remember things. That leads to being irritable. \n\nShe’s extremely patient and understanding. I’m on meds, going to counselling and working on me. Was just officially diagnosed last year. I’ve also gotta understand that when I get upset or irritated I’m probably wrong and gotta trust other people more than myself.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Finely_Tooned",
                                            "body": "Okay, i hear you. I also work long hours and often away from home on the \"road\". Things get tough and i certainly start to get volatile with my peers at times. \n\nWould you say irritability was present to a similar degree prior to medication use? Or have there been otherwise improvements? \n\nThats some good awareness with what you mentioned about being wrong. I admire that and have also been practicing that myself. \n\nTo further that point, at any point in time do you perceive others to be wrong or sense perceptions haven't lined up with others? What happened to make you trust others in those types of scenarios? Seems perceptive of you to make that call",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "MattabooeyGaming",
                                                    "body": "I was usually an irritable person before meds but I was able to hide it and deal with it. On the meds it’s harder because I get the relief I guess you’d call it of not being that way u too the meds wear off then I’m back to my old self. \n\nI often don’t line up with what other people think and get into arguments because of it. Sometimes I need to just be quiet and figure it out later because in the moment I can’t properly express myself and I’m volatile, I know it so I need to walk away from the fight and cool off. Other times if I know I’m right, I take a step back to think and realize I’m right I’ll fight tooth and nail. If I’m with my wife or a friend I lean on them a lot to find out if I’m wrong and seeing it incorrectly or if I’m rightfully upset. \n\nWalking away even for a few minutes is something I’m still learning to do more. Even if I’m not agitated or upset sometimes I’m just overstimulated and need a second. I’ve had people take that as being childish or that I can’t control my emotions when it’s the opposite that’s happening.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Finely_Tooned",
                                                            "body": "Aye man, again, I'm thankful you've continued to go through this with me. It is appreciated. Man-2-man. \n\nI tried a prescription for 6 months, and that was one of the best takeaways from the experience. I had so much patience for my family and friends. I often let impulsive thoughts go unsaid and socially. Things flowed in a different way. Although this didn't last forever and strangely as time went on, I found my patience thinned, and I became irritable. I stopped the use before the dose went up. \n\nI don't usually line up with others and what they're saying, either. Interestingly, now that I'm getting older, I do have a greater capacity to let people express themselves, and hopefully, in the end, I am heard as well. But my attachment to the outcome of being heard has lightened, so i just don't seem to be bothered as much as I had been before. \n\nWell, i recognize (and the right people will, too) the maturity in you being able to de-energize yourself. That takes maturity and good self-awareness.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "deepdishpizza_",
                    "body": "i found that i also experience this because the meds increase me testosterone and blood pressure. taking spearmint capsules has helped!",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Finely_Tooned",
                    "body": "Do you feel comfortable elaborating on the trouble it is causing you with work and your relationship? From your perspective, I'm curious as to what your observations may be. If you're more comfortable with messaging direct, let me know.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Finely_Tooned",
                    "body": "I broke off a 4-year relationship because of these medications. At first, noticed subtle changes and reactivity that seemed to be out of place in relation to a given situation. Over reactive, frustrated, and aggressive. I pleaded in the beginning that I noticed changes (as a partner i considered myself to be an accurate reflection for her self-awareness). Something to note was that the addiction or dependence to the medication made my partner rationalize in many different ways about the continuation of the medication. Refusing the idea (thought experiment) that she was in fact addicted which eventually turned backward unto me as now I was unnecessarily judgmental, when in fact all my concerns stemmed from love. \n\nThe personality of my beloved woman continued to worsen, and the rationalizing created more distance between us as time went on. I continued to plea with her that the addiction was creating delusions that she took as significant truths. Efforts to protect were taken as personal attacks. \n\nI eventually could not bare the yelling outbursts and misinterpretation. It broke my heart, truly. As I decided to leave a person I was still in love with. But over the span of 18 months I no longer loved this new personality/person as I did before. I felt like something stole my beloved and just realized this recently through therapy.",
                    "score": -27,
                    "replies": [
                        {
                            "author": "blueberrytrees",
                            "body": "my dude if there is a next time i would like to gently suggest not telling someone with a legitimate condition that can be treated with medication that they are addicted to their medication. would you say that about antidepressants to someone with major depression? would you say that about insulin to a diabetic? she probably could have benefitted from trying other meds, but calling her an addict almost certainly didn’t help.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "Finely_Tooned",
                                    "body": "I'll be waiting for you to continue the conversation 👍",
                                    "score": -7,
                                    "replies": []
                                },
                                {
                                    "author": "Finely_Tooned",
                                    "body": "I'll expand for you. Never did i use the word addiction to her. Apologies for the offense and describing my story incorrectly. \n\nI agree with you. No, I wouldn't say that to an individual suffering from any condition. \n\nIn this specific situation I believed she didn't need the medication and had suitable performance levels prior. What your comments won't permit me to do, is to deny my observations of a changing personality. \n\nMay you expand with any personal experiences you have in relation to that topic?",
                                    "score": -18,
                                    "replies": [
                                        {
                                            "author": "bonelessfishhook",
                                            "body": "“Performance” isn’t really a great metric to assess if someone needs medication or not— in fact, views like that are exactly what prevents people from getting diagnosed in the first place. \n\nI graduated top 10% in my state, went to UC Berkeley, and I’m always told I’m the smartest among my siblings. But my brain was exhausted and miserable, and I completely burned out by 19– which only then led to a diagnosis. I feel that if I was diagnosed and medicated sooner, I would have been able to pace myself better and have been able to continue on the path I was working towards. \n\nI also broke up with my partner of 5 years after I became medicated because I was finally able to perceive how manipulative he was; he absolutely took advantage of my imposter syndrome and low sense of self-worth that was a result of my overstimulated and unfocused mind.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Finely_Tooned",
                                                    "body": "I'm open to corrections. What is a suitable metric to use going forwards? \n\nThats really interesting about your relationship. So, taking medications improved your imposter syndrome? What was the main change?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "bonelessfishhook",
                                                            "body": "So in a sense, you could say my personality changed. When I recount the *awful* things my ex did to me, people (who didnt know me back then) are shocked that I had put up with that kind of treatment, as they can’t imagine me NOT kicking the ass of someone like that nowadays. \n\nYour perception of someone changing is just that- YOUR perception. Here’s a thought experiment: Maybe you preferred her before BECAUSE she was meek and compliant. Maybe you “loved” her because she didnt criticize your genuine downfalls, and now you can’t stand the fact that she’s pointing out your issues. Maybe she despised the fact that you criticized her path to treatment. It seems that you are essentially saying that HER getting treatment is bad for YOU because YOU dont like how it affects YOU.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Finely_Tooned",
                                                                    "body": "Well i appreciate your admittance on your personality changing. Also, very cool it was in the way in which you describe! I find that so interesting that you've built your self-esteem/reliance up so much from your experience with medications. \n\nAbsolutely.  Agreed. My perception of her did change. To further highlight what we're both saying. \n\nI loved her because she was patient, competent in breathing down and helping me grow as a person - overall. We had always done a good job at reflecting eachother, growing from criticism and it hadn't even felt like criticism, mor like my partner concerned about my growth, our growth, together. \n\nI hadn't liked how the treated began to affect her and the relationships within her life. I didn't like seeing her become more aggressive, short-tempered, and interruptive. Sure, I entertained these personality changes for a long time. Trying to understand her and the reasoning long before I decided to remove myself from the situation. \n\nI loved my partner and still do deeply even though I am no longer with her. So you don't make the false interpretations that I despise her or her treatment, that isn't true.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "bonelessfishhook",
                                                                            "body": "I mostly wanted to illustrate how she may have felt— as I’m sure you know, ADHDers are incredibly sensitive to criticism, so often times when someone says “hey I dont like how you’re doing X,” we instead hear “I dont like you, you are terrible.” \n\nIt’s tough from both sides, and I’m sorry that your relationship ultimately didn’t work out— but I would not blame meds for that.\n\nI would not describe my own experience as “reliance” on meds, as that is somewhat of a critical viewpoint when it comes to psychiatric medications, especially stimulants. If i stopped meds, I would still be myself. I would not suddenly vanish and erase all of the meaningful progress I’ve made over the years.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Finely_Tooned",
                                                                                    "body": "Hey boneless, I hope you've had a good day today. I'll say again, thank you for taking time out of your day to continue a discussion.  I'm just home from work. \n\nUnderstood. I'll apologize once more. I have been trying to correct the way I address topics as i have been pointed out for being insensitive in the past. I'll take the time to adjust my responses. Thank you for further explanatio. It doesn't go unappreciated. \n\nIn honest reflection of my relationship, I certainly did have other aspects of the relationship that contributed to its downfall. I just have also noted that we were able to work through these things before, but i couldn't ignore the results as our capacity to work through everyday things dwindled. We both put our efforts forwards, so i just resorted to searching for answer/results by comparing what had changed from past/present and targeting what was evidently different. It's a multi-fauceted discussion. Things are complicated. \n\nPardon my use of the word 'reliance'. If you were to correct me, what word would be more suitable to use? \n\nAbsolutely. All in which you've achieved, the revelations you've learned, and the growth you've undergone will not vanish, and is still a part of you - always. \n\nMay I pressure you on that point?  Have you had times where you decided to stop medications? If you have, what was it like, and did you have any thoughts about staying off of medications, etc?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "bonelessfishhook",
                                                            "body": "I dont think it’s your place to assess whether or not your partner or friend needs medication.\n\nMedication helps quiet the overwhelming noise of What Ifs and paranoid doubt in my mind. I have become much more confident and self-assured over the past several years. Like many people with ADHD, I also had/have depression and anxiety; these conditions are often amplified by untreated ADHD. Medication is not a cure-all, but rather a potential tool or stepping stone to help mitigate the difficulties that ADHD presents.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Finely_Tooned",
                                                                    "body": "I can't entirely agree with your first point. Having a partner in life does hold certain/inherent responsibilities (for self and the other). As dutiful partners, I think it is my place to step in and express concerns to my partner. As I do assess the well-being of that person. I mentioned in my initial comment that I noticed changes happening over time that were negative. Towards family, school, our partnership, and especially herself. I couldn't let it go. I personally believe as partners, we are each other's truest reflections of one another.\n\nHm. So I went through a 6 month trial with prescription use also. I did notice the positive benefits that you are also mentioning. I've struggled with depression too. I think I started to notice that the side effects were too much for me to handle. Speaking of my own case, of course.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "bonelessfishhook",
                                                                            "body": "The process of trial/error with psych meds is exhausting. It took me *years* to figure out the drug combos that are both helpful and tolerable. I experienced night sweats, irritability, nausea, panic attacks, and even a seizure induced by incompatible medications. But I was determined to do *something* because I didn’t like the idea of spending the rest of my life miserable and haunted by the ideas of how I could have done better.\n\nThat being said, it is not my partners duty to know that my quietness is due to my brain being zapped from an SNRI. We can discuss the pros and cons, but they are ultimately not the ones in our own brain.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Finely_Tooned",
                                                                                    "body": "When you mention *psych meds/combos*, does that mean adhd & antidepressants? I'm making an assumption.\n\nThat sounds scary. You're braver than I on that pursuit.\n\nDam. I feel your sufferge when you mention being haunted by a miserable life/feelings of failure. \n\nWhat is SNRI?  \n\nWell, possibly I have had differing experience in regard to dating but I believe that it is my duty to know, or at least create a space in which it is possible to communicate those kinds of things to eachother. Have you had people to open up about those feelings, or has it been a under discussed topic in relationships?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TLawD",
            "body": "Glad you found one that works better for you! I remarked to my girlfriend this weekend how more \"myself\" I felt on methylphenidate, so it can definitely depends on the person",
            "score": 169,
            "replies": [
                {
                    "author": "Mr_Pilgrim",
                    "body": "Agreed, it’s crazy how different it is for each person. \nDex made me so irritable and shitty.\nRitalin didn’t have as strong an affect as the dex but the trade off personality wise was worth it",
                    "score": 44,
                    "replies": [
                        {
                            "author": "BayLeafi",
                            "body": "I wasn’t on dex but lisdex. It made me so cold and it really removed my personality. Methylphenidate doesn’t give me the same drive to get everything done, but I am myself on it and better than I am unmedicated. It’s all about finding the balance!",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "legendz411",
                                    "body": "For me Lis does none of that. It’s so wild how that works",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "BayLeafi",
                                            "body": "I think meds address my hyperactivity insanely well which is good for being able to sit still, but I’ve realised that a lot of my personality comes from my hyperactivity 😭 so I feel calmer but also quieter, more serious and almost boring? If that makes sense",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "thatsyellow",
                                                    "body": "My psychiatrist noted in my journal one time \"meds work too well, she doesn't like it\". She told me that I was experiencing life like a person without adhd does. I felt blessed - and no longer take the \"optimal\" dosage of medicine.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "BayLeafi",
                                                            "body": "I relate to this immensely! Meds are genuinely great for my hyperactivity, but I think as an adult that my inattentive symptoms are the ones that present issues in my work. Finding a balance that addresses my inattentiveness without making me too calm and serious is tricky! I’ve learnt through titration that I actually love my hyperactive self, and I often find myself looking forward to the surge of energy and human zoomies that I experience when they wear off😅",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LazuliArtz",
                    "body": "That's my experience too. It's way easier to be me on methylphenidate \n\nIt does sort of level my emotions, but considering that I used to have panic attacks multiple times a week before taking methylphenidate, it's probably good that it mellowed me out lol",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Finely_Tooned",
                            "body": "Do you have an idea as to why you may be having panic attacks? Was there any triggers?",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "recigar",
                    "body": "yeah I’ve defo heard some describe what you have. Curious, what kind of ADHD do u have?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "TLawD",
                            "body": "Predominantly inattentive, which could have something to do with it now you mention it!",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "recigar",
                                    "body": "Hmm I’m inattentive too, but have the opposite, was hoping for some confirmation bias haha",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Certain-Dust-2082",
                                    "body": "Interesting. I also have Predominantly inattentive, ritalin didnt do anything for me, as from what i can tell, inattentive types lack motivation more then hyperactive types. We need a boost where they need to chill, if that makes sense. I tried lisdex and wasnt a big fan because i couldnt eat on it. It would make me actually nauseous at the sight of food.\n\nAdderall is what finally worked. There is some trade offs, I tend to hyperfocus sometimes way to much, and i def feel more irritable when its wearing off toward end of day but im a bit better at life with it then without it so ill take the trade.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Xane256",
                            "body": "I felt way less motivated when my dosage was too low last year.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pr1ncesszuko",
            "body": "I think this is super interesting cause while I did also feel like methylphenidate „dulled me down“ a bit, I didn’t experience it as something bad. I always felt like I was the one making decisions about my behaviour, what I say and do, instead of my brain just doing whatever (and a lot of the time annoying people in the process). I liked that quite a lot actually. \nI had the same issue with motivation though, so now on vyvanese, which took away that sense of calm and being in control. It’s not horrible, definitely worth the upside, but I kind of miss it, made me a lot more level headed too haha.",
            "score": 56,
            "replies": []
        },
        {
            "author": "Difficult_Standard_1",
            "body": "ADHD C \n\nWhen I was a child I use think the same thing, that my ADHD meds made me a boring person, however, I quickly remind my self that no I’m not the boring person, everyone else is, and my meds help me tolerate them better🤣 \n\nOp why do you think you’re a boring person?",
            "score": 58,
            "replies": [
                {
                    "author": "recigar",
                    "body": "Well I don’t think I am boring, generally. Even amongst ADHD people I’d say I am down the end of the scale of very wide interests and knowledge and skills. BUT I realise now methylphenidate was keeping me in my head. I’ll think before I speak, but go too far, and think “uh no one wants to hear that”, and say nothing at all. When I’d be driving my kids around, I used to just talk about all sorts of shit but I was more often than not just driving in total silence. And my motivation toward creative interests basically dropped off.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Agreeable-Farmer1616",
            "body": "When I tried it again for the first time since childhood I had a similar experience on it. Helped me concentrate a little, but much less than amphetamine based meds and it also made me a lot more anxious/uneasy too while making me a husk of a personality, just emotionally blunted. Plain IR adderall seems to be the bests fit for me since unlike methyphenidate/ritalin and Vyvanse my personality isn't muted and I can still sleep without obsessive levels of hyperfocus.",
            "score": 12,
            "replies": [
                {
                    "author": "recigar",
                    "body": "I would be interested to hear subjective differences between adderrall and dexamfetamine if anyone has any experience. because isn’t adderrall a combination of amphetamine salts so it’s racemic?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Agreeable-Farmer1616",
                            "body": "I think they're relatively similar from what I've heard, but I don't have enough chemical knowledge of it to say for sure. But in my experience ritalin was mildly stimulating, but upped my nerves and definitely muted my personality. Vyvanse was crazy hyperfocus and rapid pace feeling, but also too much even at lower doses, just absolute tunnel vision, no sense of humor, 50/50 on whether I'd be able to sleep at all before 3am, and increased irritability and much more argumentative. I took everything seriously on it. Adderall seems to work. There are irritating dips and a mild crashes with it as it wears off between doses, but that's nothing compared to the angst and insomnia of vyvanse.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "recigar",
                                    "body": "interesting .. word on the street is that dexamfetamine is more mentally stimulating and levoamfetamine is more physically stimulating (although that seems too much like a made up idea), so vyvanse may be more in your head than adderrall. also sounds like you metabolise it weird, you may know it’s a prodrug for dexamfetamine, but breaks down in your body",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Agreeable-Farmer1616",
                                            "body": "Never tried dextro, but if from what I hear that it's similar to short-acting vyvanse that would make sense because vyvanse was pure sit in one spot for hours and argue on reddit all day kind of focus and mood. At least for me. All mental stimulation craving, but no desire to even get a glass of water for my very dry mouth lol",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jxwillow",
            "body": "Does methylphenidate also cause a crash when it starts to wear off, and how long does it last before it starts wearing off?",
            "score": 13,
            "replies": [
                {
                    "author": "Pimise",
                    "body": "Yes, very much so. Psychiatrist says it should last about an hour, but for me it lasts forever until I take a power nap.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Lucidis",
                            "body": "I'm pretty sure your doctor meant that you should notice the methylphenidate begin taking effect about an hour after your dose. Ritalin is supposed to last 4-6 hours and Concerta should last up to 12 hours. So if you are on instant release, you may feel an afternoon crash without a booster. If you are on extended release, you may feel a crash in the evening. It's also possible that you'll be totally fine and not perceive any sudden loss of energy.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Pimise",
                                    "body": "Nono, what I meant is that after the effects (4 to 5 hours for an IR) the crash \\*should\\* last about an hour, as per my psychiatrist.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "recigar",
                            "body": "it’s got a surprisingly short half life",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "officedonot",
            "body": "Methyphenidate makes me more boring to be around... I totally second this. I gotta check out dexamfetamine... was there a dosage shift when you switched?",
            "score": 25,
            "replies": [
                {
                    "author": "recigar",
                    "body": "I went from 60mg methylphenidate daily and started with 10mg dexamfetamine, but have settled on 15mg being the sweet spot. So I did go “down” from the max (licensed) dose of methylphenidate to a very middle of the road dose of dex. I was also surprised to learn that methylphenidate has a much shorter half life, I kinda assumed dex would be more up and down but haven’t found that so far.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Buunnyyy",
                            "body": "I found dex to be way more smooth. Like super smooth coming up and coming down. I don't feel ups and downs aleither at all or they're not noticable like they are with methylphenidate.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Ashtheburnedone",
                            "body": "I take and thought the max dosage was 72Mg and a 10Mg quick act booster? Or is that like your states or countries law? Forgive me if im asking a stupid question Im just curious.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "recigar",
                                    "body": "In NZ the highest licensed dose is 60mg daily even though Concerta 72mg is on the market and I know of someone who was taking 180mg a day 🤯 This person now takes 210mg Vyvanse with another 20mg dex on top. Their brain must be fuckin deep frying",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Buunnyyy",
            "body": "Funny thing is I noticed the same thing. I got prescribed lisdexamphetamine five days ago, only been able to try it twice because I got sick now so not taking it. But wow I can instantly find a witty answer and be myself all while not being exhausted. Of course I'm just trying this out and it's still early days, but as a bonus it got rid of all of my anxiety. I don't feel anxious at all while on lisdexamphetamine even though I did using concerta.\n\n Concerta would spike my anxiety later in the day and I would become a boring person. When I knew I would be switching meds, I lowered my dose on purpose to see how I would react. To my surprise I did become more of myself but I got exhausted thought-out the day because of constant fluctuations which what makes concerta quite unbearable at times. \n\nSo I got to the same conclusion that concerta made me boring. Whenever concerta would start wearing off I would become all witty again, but at the cost of exhaustion. Concerta makes me feel as if  I'm closed in a box, even though I feel quite good on it, it's not ideal.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Belleaigle",
            "body": "Gosh, I have found that I'm less funny, fun or creative since being on Tyvense. I thought it was other factors, but this is making me wonder.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Sobolll92",
            "body": "The right medication and dose should make you more feel like yourself. What you’re describing seems more like overdose. How much methylphenidate did you were prescribed?",
            "score": 6,
            "replies": []
        },
        {
            "author": "cristinanana",
            "body": "Wow these comments are interesting. I've been taking methylphenidate since my diagnoses 2ish years ago and it's been great. The only side side effect I get occasionally is feeling cold,specifically my hands and feet",
            "score": 6,
            "replies": [
                {
                    "author": "YouNo2977",
                    "body": "Try Genkgo supplement",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "DepressedCunt5506",
            "body": "I’m so glad I found this post. Been taking methylphenidate for a month now, 18mg and I feel kinda down, sad and missing my ex again after 2 years. I lie more in bed now and have no desire to play games anymore after work. \n\nAnd to top it all off, I feel no gains when it comes to focus and overall mental energy",
            "score": 8,
            "replies": [
                {
                    "author": "Pimise",
                    "body": "I'm sorry for you :( I'm guessing from the dosage that you're on Concerta ? \n\nI switched from Concerta to ritalin for a few reasons, feeling depressed was one of em.\n\nI still feel depressed (but it's mostly due to my shitty life situation), and exhausted (I have to nap daily to make it through the day) but the horrible mood swings are a lot less frequent than on Concerta. \n\nJust my own experience of course.\n\nIf you need someone to talk to, don't hesitate.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DepressedCunt5506",
                            "body": "It’s weird cause I also take 150mg of sertraline daily for 2 years now and it helped me get rid of my depression and alcoholism but barely 18mg of concerta and I feel almost where I was before. \n\nOne time I actually took 54mg of concerta and besides a minor headache, i barely felt a boost in focus. And that headache went away after a took a few bites and drank some water",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "yesboss2000",
            "body": "I was prescribed this, Concerta, and took it for 4 days.  yeah i had focus to do all boring overdue tasks that needed to be done because i was not bothered about the result (like pay the bills, follow up emails that the sender thought was important), but my creativity (which i rely on for my work) was totally gone, i was a throughly boring mofo, no joking around, no interest, and I became irritatable in the evening and not interested in music or watching a movie.\n\nWorst 4 days of my life.  I use modafinil instead, have been for years (only when i have a working day, to keep tolerance at bay), it gives me that stimulation that i believe others get from caffiene (which i don't).",
            "score": 5,
            "replies": []
        },
        {
            "author": "jesteratp",
            "body": "Ritalin absolutely destroyed my childhood by doing the same thing. I would take it and have no natural social skills or anything to say to anyone. Unfortunately it was the 90s and 2000s and my ADHD symptoms were so bad (and I hid everything out of shame) that there were no options until Adderall came around",
            "score": 3,
            "replies": []
        },
        {
            "author": "reddititsis",
            "body": "Concerta is doing this to me. Aderall did too. I’m easily frustrated and sometimes can be upset for hours about the smallest things. At this point I wanna give up",
            "score": 3,
            "replies": []
        },
        {
            "author": "quantum_splicer",
            "body": "Barkley reports in a lecture on the advantages of a combination of stimulants and atomoxetine to counteract the dampening of the limbic system caused by stimulants and the associated reduced perception of emotions.\n\n\n( https://www.adxs.org/en/page/233/combination-medication-for-adhd#content-51-atomoxetine-and-stimulants )",
            "score": 2,
            "replies": []
        },
        {
            "author": "EasyFam",
            "body": "Just recently had a very similar journey. Ritalin had made me less personable and interested in others, it took friends to point it out before I really recognised it. Now on the dex for a month or so and it’s been so much better, my motivation/productivity and relationships have both improved a lot. \nI think it’s fairly frequent for this to occur. Happy for you and grateful for us that we’re able to access and try alternatives that work :)",
            "score": 2,
            "replies": []
        },
        {
            "author": "UncomplimentaryToga",
            "body": "As a life long drug addict I’d expect the same thing to happen with the dex.  In my experience,  your brain eventually gets used to its new normal and returns you to your shitty baseline until you feed it something new",
            "score": 4,
            "replies": [
                {
                    "author": "epizeuxisepizeuxis",
                    "body": "I feel like this could be worded better, but like.. sometimes something that feels different feels better, until it doesn't.\n\n\nI feel like this comment says, \"shitty baseline,\" and means something like, \"It's your circumstances that are hurting you, not the medicine.\" It's a delicate balance, but like.. it's okay to feel depressed, even if you're doing your best to attend to your 'personal problems,' i.e. it's not just your adhd, it's in conversation with your other circumstances (class, race, gender, etc. - all of the things that may put pressure on your general mental health).\n\n\nChasing different meds will not help one outrun what they can't.\n\n\nWe can't know this person's experience, and I'm glad they seem to be finding something that works at the moment, but I do worry that it opens a door for other folks to try to find a solution, without thinking through the other problems simultaneously.\n\n\nMedication is not a solution, it's a support.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "UncomplimentaryToga",
                            "body": "Couldn’t agree more.  That said, starting new drugs produces feelings of euphoria, which for me is always very short lived.  I’m sure most of us have experienced this with adhd medication.  Hopefully once that wanes op will still find it effective for a while like their last one was, but I got the impression they’re being fooled.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "recigar",
                            "body": "I need to get my ass to the gym",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Randomjackweasal",
                    "body": "He is right though.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "randomuser445",
            "body": "there’s definitely a change in personality",
            "score": 1,
            "replies": []
        },
        {
            "author": "False_Kaleidoscope78",
            "body": "Ritalin completely destroyed me. I cant feel emotions and i dont have the will to live anymore and now im..like..addicted to it",
            "score": 1,
            "replies": []
        },
        {
            "author": "cphoover",
            "body": "Hmmm interesting I’ve had the same experience to Ritalin in the past",
            "score": 1,
            "replies": []
        },
        {
            "author": "jib9001",
            "body": "I remember feeling like a zombie on methylphenidate. It caused me to avoid medication for years after I stopped. Glad I got different ones this time, they work much better for me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Omori_sviolin",
            "body": "definitely agree about the boring side effect. my boyfriend has been on it for about 8 years now and anytime he takes it he’s just so… dull. when he doesn’t take it (which is like, once every month for a break) he’s the most energetic, happy , fun loving person i know. idk, if affects people differently. i still love him, he’s just different on it",
            "score": 1,
            "replies": []
        },
        {
            "author": "rockrobst",
            "body": "Great example that these meds work differently on different people.  Too bad your doctor couldn't help you figure this out years ago.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Revan1988",
            "body": "To be honest, when I started it, I felt like my creativity was severely dulled. No longer was my mind at work with creative things. And my interest in my hyperfocus area was severely decreased.\n\nI complained about this to my wife and she asked me how much of that creative process I so felt being dulled, actually resulted in creative output instead of just creative thinking. And the answer was that I was just being creative and interesting in my head. I didn't do anything with it.\n\nWith methyl on, I actually did the stuff I was thinking about, with my hands. Without the creative processes racing in my mind only.\n\nI contiued doing Warhammer, I took up sewing again, I actually started plannening my D&D sessions instead of sandboxing them out.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Finely_Tooned",
            "body": "I appreciate you taking the time to comment. \n\nI'm open to correction in regard to what metric is more suitable. Further to anyone reading/participating in this conversation, I am open to corrections of any kind. \n\nWhat metric would you prefer to use? I acknowledge that you've better discernment than I.\n\nThat's really interesting. I have considered to a significant degree that I may have been the result of the break up. I took upon myself, as much ownership as I could.\n\nI'll continue to also voice my perceptions of the changes I had noticed growing over time. In no attempt to degrade or pass judgment to those that have been experiencing similar things upon either side of the conversation.",
            "score": -1,
            "replies": []
        }
    ]
}