{
    "title": "Sertraline making me Un-Productive",
    "author": "AlternativeSlip7724",
    "subreddit": "ADHD",
    "rank": 459,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2cul7/sertraline_making_me_unproductive/",
    "id": "1j2cul7",
    "selftext": "I am diagnosed with Adhd and Ocd and take Sertraline for ocd. It makes me lazy af. I can barely wake up early the next day. When I take it in the morning I get lazy and sleepy. If I take it at night I get insomnia. How do I get fresh and focused after taking sertraline???\n\n\n\n\n\nFch jf fuxtuxjgxjgxjfzjfzfjjfhfjcjcchdyhdg",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sadboy2k03",
            "body": "There's research now showing SSRI anti depressants like Sertraline make ADHD symptoms worse. I got off them a few years back I don't think they're good medications anyway",
            "score": 3,
            "replies": [
                {
                    "author": "AlternativeSlip7724",
                    "body": "True, should I go towards SNRIs?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Frosti11icus",
            "body": "I had the same problem. Anti depressants fucked my shit up bad. Not taking away their effectiveness for the people they do help, but for me they basically lit my adhd on fire. SNRIs might be a better option.",
            "score": 2,
            "replies": [
                {
                    "author": "AlternativeSlip7724",
                    "body": "So did you start taking Snris and did they work bettet? Also any guide to reduce the side effects of setraline and feel better after taking them?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Frosti11icus",
                            "body": "No they didn’t work for me either sorry. Cognitive behavioral therapy is the clinically proven approach to treating OCD.\n\nAnd I just had to stop taking SSRIs so no advice sorry. It got worse for me the longer I took them.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AlternativeSlip7724",
                                    "body": "So was SNRI slightly better in any way than SSRI?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Frosti11icus",
                                            "body": "Ya it didn’t cause devastating side effects. It was kind of meh for me, I gladly stopped taking them, but they were never like “holy fuck what are these doing to my brain” like SSRIs were. Again not bashing them for people for whom they work. My OCD wasn’t much of a problem for me on before I started SNRIs so can’t really speak to their effectiveness.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Mediocre-Special6659",
                                            "body": "SNRI helped more with sexual side effects, fwiw.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "AlternativeSlip7724",
                                                    "body": "I get what you mean. The brand name of setraline Zoloft actually gave me the worst sexual side effects whereas another non-brand name ssri made them better. I took 4 different brands of setraline so far the so called best one has been kinda the worst one for me. This probably isnt true but the pill shaped pill gave me worse sexual side effects than rounded ones lol.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lennon4239",
            "body": "I think that when you have ADHD you relly on anxiety and stress as a motivation to make you do the thing you have to do. \nWhen you take sertraline, it takes away what used to drive you. But this is just a theory of mine.\n\nSomeone made a well detailed post about this topic a few years ago.",
            "score": 1,
            "replies": []
        }
    ]
}