{
    "title": "Is there a name for this?",
    "author": "Icy-Donkey2506",
    "subreddit": "ADHD",
    "rank": 478,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2db5v/is_there_a_name_for_this/",
    "id": "1j2db5v",
    "selftext": "I’m wondering if there is a name for a pattern or habit I’ve been going through. I tend to only really get things done when I am in a dangerous or uncomfortable situation. I’m looking for more knowledge/understanding on this to help me get out of that habit.\n\nExample of this behavior: I’m from Chicago, I housesit as a full time traveler. I landed in Chicago without intentions to stay with family. I had a lot of plans and goals (as usual) but every day I just had no motivation or inner willpower to do them. The dog bit me and I ended up having to go stay with family. The discomfort of the home was really affecting me mentally and physically like I thought it would. The need to get out of there made me be more proactive about tasks in a way that I always want to be. I want to feel safe and comfortable while still having the willpower and inner encouragement to do tasks. \n\nI am the QUEEN at planning and I want to become a queen at doing as well. I’ve been working on my relationship with “doing” in therapy but I find that I am better at changing behaviors when there is a shift in mindset, belief, or understanding attached to it. Help me understand. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Icy-Donkey2506 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sobol2727",
            "body": "Procrastination\n\nYou do know you need to do something but only do it if there is no other option. In Polish we have a saying that roughly translates to \"it's burning around your ass\" with burning being fire, not an itch. At the same time procrastination doesn't exclude good planning - it's just a poor will of execution",
            "score": 2,
            "replies": []
        }
    ]
}