{
    "title": "Any tips on saving money?",
    "author": "PinkSunshine97",
    "subreddit": "ADHD",
    "rank": 349,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/ADHD/comments/1j32jfo/any_tips_on_saving_money/",
    "id": "1j32jfo",
    "selftext": "So, im over 25 yo, and I have less than 50$ on my bank account. Im currently looking for a job, but I need to learn how to save money. Even though I get around 250$ monthly, and I do not pay food, rent, water, electricity or any other appliances, somehow, i manage to have no money. Of course I feel like shit for not having money. I would really like to save, you know, like an adult, any tips? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/PinkSunshine97 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Liploxxx",
            "body": "It’s the little things that you’re spending your money on. You may think it’s just $10 here or $20 there but it all adds up in the end. Cut all the unnecessary things out and you’ll be surprised. If you ain’t literally dying without it, you don’t need it. \nBest xx",
            "score": 2,
            "replies": []
        },
        {
            "author": "SweetTea38",
            "body": "Visit the frugal blog",
            "score": 1,
            "replies": [
                {
                    "author": "PinkSunshine97",
                    "body": "Do you have any link?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Anonymous_Coder_1234",
            "body": "hey, I'm voice dictating this on my phone so the capitalization might be off. anyway, there are two things that helped me save money. one is having the Nerdwallet app on my phone. this app hooks into my bank account and lets me see a breakdown of my spending and money transaction history at any time. two is setting up alerts on my bank account. I set up alerts so that I get an email and a text message for every transaction above $0. it also emails and text me the remaining balance. that helps me keep track of how much money I have. note that some banks don't have this feature. the big ones like Wells Fargo do. small ones like some little credit unions might not.",
            "score": 1,
            "replies": []
        }
    ]
}