{
    "title": "If I eat a lot of food before taking ritalin does it take longer to work?",
    "author": "Flaky_Insurance_1558",
    "subreddit": "ADHD",
    "rank": 307,
    "score": 5,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/ADHD/comments/1j32j2q/if_i_eat_a_lot_of_food_before_taking_ritalin_does/",
    "id": "1j32j2q",
    "selftext": "If I eat a lot of food before taking ritalin does it take longer to work? I ate a big meal before taking ritalin now its been an hour and I can't feel it still. However, I'm not sure maybe its because of tolerance? This week I feel like ritalin isn't working like it used to. I'm asking cause I wanna eliminate the amount of food factor.\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ApprehensiveHouse320",
            "body": "Yes, if you eat heavy meal with medication, right or after, it will take hour longer to kick in ( my personal experience ), also depends on formula (Instant release or Extender release), i take IR without food in mornings, and XR after good breakfast.",
            "score": 4,
            "replies": []
        },
        {
            "author": "General_NakedButt",
            "body": "My prescription bottle says to take it 30 minutes to an hour before eating. Food is definitely going to affect the absorption so I’d try taking it before the meal.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Small-Tooth-1915",
            "body": "Yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "skatedog_j",
            "body": "Only eat something small. It will be slowed down if you eat. How much it's slowed down by depends on your personal gut motility",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent_Voice560",
            "body": "My friend was on Ritalin as a child, and now he has Tourette’s syndrome. Food for thought",
            "score": -24,
            "replies": [
                {
                    "author": "Extra_Cheesecake_263",
                    "body": "My sister took paracatemol as a child. Now she has autism.",
                    "score": 8,
                    "replies": []
                }
            ]
        }
    ]
}