{
    "title": "Cops with ADHD",
    "author": "Defiant-University-3",
    "subreddit": "ADHD",
    "rank": 393,
    "score": 0,
    "upvote_ratio": 0.14,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/ADHD/comments/1j341t8/cops_with_adhd/",
    "id": "1j341t8",
    "selftext": "Any police officers in this group? I take my physical and reading tests next week and I’m questioning the likelihood of my adhd getting in the way of the job.\n\nI know I can pass the physical part of the exam but the reading test is what will get me, since it’s timed and I tend to read things once or twice to fully grasp it.\n\nI can be extremely focused and detailed once I “get the hang of something” but if I can’t understand something I just space out, even if I try and force myself to pay attention. \n\nHow difficult was training? What are some things you do to manage your ADHD?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Defiant-University-3 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spiritual-Macaroon-1",
            "body": "I was a cop in the UK so experience will be different.\n\nHowever, for me the main challenge was self-motivation. I was very good at engaging with people, managing dynamic situations, de-escalating doing the hands-om aspect of the job, however the task of investigating my own crimes, doing paperwork and motivating myself to work independently without procrastination was a killer.\n\nAs someone who loves to talk and convince people, I finished my time with the police in a department where I presented fact findings to child protection conferences. Less requirement for self motivation and allowed me to work to my strengths.",
            "score": 2,
            "replies": []
        },
        {
            "author": "erwinscat",
            "body": "In my country you can’t become a cop if you have ADHD",
            "score": 1,
            "replies": [
                {
                    "author": "Defiant-University-3",
                    "body": "Where are you from? I’m in the US",
                    "score": 1,
                    "replies": [
                        {
                            "author": "erwinscat",
                            "body": "Sweden. But I checked now and they recently changed the rule so that you can enrol on condition of passing additional assessments. The training programme is 2.5 years and used to be quite selective, although they’ve struggled with recruitment in the last few years and have made it easier to get in.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Spiritual-Macaroon-1",
            "body": "I was a cop in the UK so experience will be different.\n\nHowever, for me the main challenge was self-motivation. I was very good at engaging with people, managing dynamic situations, de-escalating doing the hands-om aspect of the job, however the task of investigating my own crimes, doing paperwork and motivating myself to work independently without procrastination was a killer.\n\nAs someone who loves to talk and convince people, I finished my time with the police in a department where I presented fact findings to child protection conferences. Less requirement for self motivation and allowed me to work to my strengths.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WMDU",
            "body": "Where I love you can’t become a police officer if you have ADHD.\n\nIf you have ever been diagnosed with the condition, you need proof from a doctor that you have totally outgrown it and have not experience symptoms or been in medication for over 2 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strange_Hat9354",
            "body": "I've heard of cops asking their chief if they can allow Adderall scripts. They do make exceptions in the US",
            "score": 1,
            "replies": []
        }
    ]
}