{
    "title": "Has medication helped relieve your chronic pain?",
    "author": "PCOvarianCyster",
    "subreddit": "ADHD",
    "rank": 236,
    "score": 7,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/ADHD/comments/1j39wok/has_medication_helped_relieve_your_chronic_pain/",
    "id": "1j39wok",
    "selftext": "I’m 4 weeks into medication titration. I’ve been started on Methylphenidate, specifically Meflynate XL. I started on 20mg and have increased to 60mg. From the first dose this medication seems to have cured chronic pain that I’ve been living with but hasn’t helped my concentration or focus so my healthcare provider has suggested changing to Elvanse. Has anyone experienced similar chronic pain that they think is linked to their ADHD or improvements to that pain from the medication? Does anyone have any experience of Elvanse doing the same? \n\nUntil I started this medication, I’d never acknowledged the pain I was in as chronic- I knew it was bad but thought everyone experienced it and just didn’t complain. I’d never been to the doctor about it. I was never aware that ‘chronic pain’ was a symptom of ADHD. And I still struggle to find much that says it definitely is. I have reported this side effect to my titration nurse, but they’ve not made any real comment on it. \n\nHowever, on this medication I’m not finding myself to have any more focus, or concentration or ability to start or complete tasks that I’ve been putting off. And those are quite important for me. My prescriber has suggested changing to Elvanse to see if it is better. So I’m going to try it. I’ve had two days off of medication completely while I’m waiting on my new prescription and for those two days I have immediately felt the return of the aching and pain. And this has really opened my eyes to what I was living with. \n\nI now find myself in a dilemma- if Elvanse improves my concentration etc, but not the pain. I genuinely don’t know which solution I would prefer. I know medication is different for everyone, really just looking for anyone to share if they’ve experienced anything similar. \n\nMy titration period is only supposed to span 12 weeks with a private consultant before an annual prescription will be handed off to my GP so I’m keen to get as much out of this time as I can. \n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "itsalonghotsummer",
            "body": "I used to experience constant physical discomfort but don't now I'm on Elvanse. I'm not hyper-aware of my body during the period when it's effective.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Username_1379",
            "body": "I remember reading that for some people, because they’re less stressed and have some symptom relief when on the right ADHD medication, they notice fewer aches and some of their chronic pain decreases or goes away. \n\nI’ve had low back issues since my early 20s. (And I keep stress in my neck/shoulders.) Prior to me being prescribed Adderall, I would wake up each morning feeling like I got hit by a truck. I felt like someone in their 60s maybe. Not mid-30s. And I would experience my back pain off/on depending on my activity level, especially sitting on the floor with my toddlers. And I would also have off/on neck pain/stiffness. \n\nSince being on the medication, I have very few days where I have back and neck pain. It’s still there, but it’s so much less frequent. I wake up feeling more my age.\n\nEdit to add: I think because I just mentally feel so much better on the medication, my physical ‘stress’ has significantly decreased.",
            "score": 3,
            "replies": [
                {
                    "author": "PCOvarianCyster",
                    "body": "Thanks for sharing. I was wondering if it was linked to my mental stress improving too. I feel like I’ve been mentally clenching in a way, and that has relaxed since starting meds.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProtozoaPatriot",
            "body": "I think it helped with my chronic pain because I had the ability to not pay any attention to it, as if it wasn't happening",
            "score": 3,
            "replies": [
                {
                    "author": "PCOvarianCyster",
                    "body": "Ah that’s interesting, so maybe the pain is still there for you but you don’t focus on it?\n\nI had been going for quite regular massages and cupping therapy for the past few years to try and alleviate some of my pain. It would work a little maybe for a day or two. Both therapists used to always comment on how much tension they could feel in my back, in particular across my shoulders and neck. I had a massage booked in that happened to be during my first week of medication, almost immediately the masseuse stopped to ask me what had changed as she couldn’t feel any tension. It was such an unusual massage because where I used to find the pain of it extremely satisfying because it would ultimately work out some tension I didn’t feel any pain or tension for the whole 90 minutes. The downside though- was that I felt I couldn’t zone out at all like you usually would in a massage. I was so aware of where her hands were and how unusual it was for me not to be feeling any pain in my muscles. It really wasn’t relaxing in the way I was used to! All of that to say I think my body has shown a physical response to the pain going away.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "sneakydevi",
            "body": "My ADHD medication has never done anything for my pain, but I am now on Gabapentin and Duloxetine for fibromyalgia and it has made a world of difference.",
            "score": 1,
            "replies": []
        },
        {
            "author": "midnightlilie",
            "body": "You're probably better off adressing your pain separately.\n\nstimulant medication has a few things in common with stress hormones like cortisol and corticosteroids are sometimes used to disrupt chronic pain and inflammatory responses, the pain relieving effects probably won't last, so get something that works for your brain.",
            "score": 1,
            "replies": []
        }
    ]
}