{
    "title": "Tips for first timer to meds?",
    "author": "reezick",
    "subreddit": "ADHD",
    "rank": 286,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3dq8b/tips_for_first_timer_to_meds/",
    "id": "1j3dq8b",
    "selftext": "Posted here a few days ago but after a few years of trying to slay this dragon I (40M) got a ADHD diagnosis and am starting Adderall XR 10mg today!  What should I watch out for/not do/do etc?  So far after some skimming here I've found things like:\n\n\\-Don't take Vitamin C during the efficacy range of the meds (so for me, if I take it at 7am, don't take Vitamin C until 5pm?)\n\n\\-Don't drink caffeinated coffee (is that correct?)\n\nAnything else?  I'm starting on 10mg for 14 days then re-evaluating it with the doctor.  Any signs I should look out for when taking it as to if I should adjust further?  Really appreciate any input!\n\n[https://www.reddit.com/r/ADHD/comments/1j1qg1l/advice\\_for\\_meds/](https://www.reddit.com/r/ADHD/comments/1j1qg1l/advice_for_meds/)\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/reezick and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "llkiasll",
            "body": "I personally am not on Adderall but know some minor things and just some  usual don'ts for stim meds\n\nHigh amounts of caffeine is not suggested as it commonly elevates your heart rate normally and stim meds do that exactly well, it can lead to irritability fast heart rates and other issues.\n\nAlcohol is kind of another one that I am aware with stim meds, irregular heart rate, irritability, higher blood pressure. +\n\nCitrusy foods have the ability to impact how well your body absorbs says a few studies.\n\nMedications(ex. Prozac) that usually effect things like serotonin receptors and other mood based receptors can lead to things like serotonin syndrome. Any concerns with other meds you may take is best to talk to a doctor if they can be mixed or brought lower in dosage.\n\nHonestly a very helpful thing I've been suggested as I am new aswell, although i am not taking those exact meds. Tracking how you're impacted  by your meds can be immensely helpful. Sometimes people are hard on themselves when they don't do something like focus and finish a project in a better amount of time on meds they blame it on meds not working good. Seeing notes about things you slowly notice through your journey is great for perspective but if you find the notes you make don't show changes then you can absolutely go back to your provider to talk about it.\n\nI say your best bet is take these as a starting point if you want. Being educated and informed to your specific medications and other needs is important. Maybe some research into them would make sure you have the full answer. I am of course not a doctor.\n\nProud of you for taking that step for yourself!",
            "score": 1,
            "replies": []
        }
    ]
}