{
    "title": "What is your personal experience with ADHD medication?",
    "author": "Sssweet-lemon",
    "subreddit": "ADHD",
    "rank": 211,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3jgad/what_is_your_personal_experience_with_adhd/",
    "id": "1j3jgad",
    "selftext": "After a lifelong struggle with managing ADHD symptoms (ex. executive dysfunction, distractibility, conversational self-restraint, etc.) I was recently diagnosed. I started my medication (20mg Adderall XR) today and would love to hear about other ADHDer’s experiences with ADHD medication, especially Adderall. I.e what are some changes you have noticed before and after starting medication and how can I know if my medication is working? FYI I am not looking for medical advice. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoonMacabre",
            "body": "I took adderall and it definitely worked to help my focus. I’m extremely inattentive and can barely focus for a couple minutes, but it helped me immensely. I will say though, you have to plan to be productive, or you’ll just hyper focus on bed-rotting activities like scrolling tiktok.",
            "score": 1,
            "replies": [
                {
                    "author": "Sssweet-lemon",
                    "body": "I feel that. I hyper focused on organizing my medicine cabinet today. It looks so good now; it’s very neat and orderly, but definitely something I didn’t need to get done today. Thank you for your advice 👍",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}