{
    "title": "Expired meds?",
    "author": "Environmental_Cat227",
    "subreddit": "ADHD",
    "rank": 180,
    "score": 1,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3wkpa/expired_meds/",
    "id": "1j3wkpa",
    "selftext": "Hey. ADHD symptoms have been hitting me extremely hard lately. I am struggling in my college classes and am finding it harder and harder to catch up with each passing week. My psychiatrists office has been yanking me around for over a month now and I’m just exhausted. I have a bag of 15mg Adderall XR capsules that, before a month ago, had been sitting in a dark shelf in their original container since spring 2022. Would these be safe to take? They’ve been on my desk now for some time in a little zip lock bag. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "hazazelle",
            "body": "Safe to take? Most likely yes. FDA says to not but many pharmacists say that there shouldn’t be any extra side effects from taking most expired ADHD meds on the market. The efficacy has plummeted tho after sitting for years, so you’ll probably feel the difference between unexpired and expired drugs, expired ones not relieving symptoms as well. I only advise to not take double or triple doses to compensate cause that actually might lead to increased side effects.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Effective-Owl-3893",
            "body": "No worries - as long as it's pills or capsules with dry contents, no issue :-)  \nYou might notice slightly less effect though.",
            "score": 2,
            "replies": []
        }
    ]
}