{
    "title": "Well... You know how the song and dance goes.",
    "author": "WoomyWobble",
    "subreddit": "ADHD",
    "rank": 10,
    "score": 57,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j4619o/well_you_know_how_the_song_and_dance_goes/",
    "id": "1j4619o",
    "selftext": "Got diagnosed a week ago with what they used to call ADD at the age of 37 (I'm still young dammit!) and tried me some methylphenidate for the first time yesterday. Just 5 mg instant release at first to make sure my eyeballs don't explode or something. Have to check my bloodpressure too and everything. Honestly I didn't feel much. Maybe my legs were a little more relaxed? Maybe the fingies were a little more...woozy? I dunno.\n\nI remember vividly standing up from working, grabbing a big mug of water, Sit right back down and CONTINUING WITH  THE WORKING.\n\nWait a second... I was working? But I feel so... normal? Like I had a switch in my brain slip from \"just about not do a thing\" to \"just about do do the thing.\" And that really is about it. \n\n  \nToday I had 10 mg of the stuff and it really was pretty much the same story. In the afternoon I took another dose because I liked doing productive things.  I did in 8 hours what took me 11 days previously. \n\nI think a dose of 7,5 grams a pop would suite me the most. Maybe take one pill of 5 mg and then take another 2 hours after that? To even it out around the day? There are no signs of a bad comedown or something like that. In fact I wrote this when the medication shouldn't be in my system anymore. \n\nIt's all very fascinating. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ermacia",
            "body": "I'm glad you found out. Better late than never!\n\nWork out a drug schedule with your doctor. It really depends on how you react and how much it lasts. Mine likes to prescribe 2 different doses/types of releases daily, stronger in the morning for an extended duration, with a smaller dose afterward in case I need to top off.\n\nAlso, be mindful that there is an initial honeymoon period with stimulants where they work perfectly. After a while, they may lose effectiveness and require a higher dose or even switch types. If this happens, go back to your doctor and work out a new schedule. I hope you're able to make it work.\n\nIn my case, I became resistant to amphetamines after 6 months. The highest doses of all the ones available in the US do nothing for me except make me sleepy or angry after the effect wears off. I had to switch to methylphenidate, and that one is marginally better.",
            "score": 5,
            "replies": []
        }
    ]
}