{
    "title": "Executive Dysfunction Spiral While Alone",
    "author": "cselisondo",
    "subreddit": "ADHD",
    "rank": 21,
    "score": 5,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j4f7ke/executive_dysfunction_spiral_while_alone/",
    "id": "1j4f7ke",
    "selftext": "I usually live with my partner, and external necessities usually keep our routine on track. Currently, she is out of town visiting family for 2 weeks and after 1 week alone I have found life snowballing onto me. It's hard to clean up, hard to do work, hard to feed myself, and hard to go to the gym and shower. I know all of these things will make me feel better, but now that they're all undone I feel trapped in a sinkhole and get sucked into screen time and more dysfunction and keep spiraling down. How does a person pull themselves out of this when the external people and things you usually rely on for support aren't there?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/cselisondo and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Twentie5",
            "body": "it can take every bit of me to burst into motion, gravitate towards it. isolate find it, and just move.\n\nmy therapist says \"task pairing\" combining something you dont like with something with you like.\n\nits hard to get out of chair",
            "score": 2,
            "replies": []
        }
    ]
}