{
    "title": "Roofing: Why All or Nothing?",
    "author": "MtHood_OR",
    "subreddit": "HomeImprovement",
    "rank": 2,
    "score": 37,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.reddit.com/r/HomeImprovement/comments/1je6nf3/roofing_why_all_or_nothing/",
    "id": "1je6nf3",
    "selftext": "I know I will need a whole complete roof sometime in the future, but right now I got one damaged peak shingle, a venting problem in one corner causing mildew and a need for a couple pieces of new sheeting. \n\nWhy are roofing systems just all or nothing? Is this how it really is or how the roofing sales people want you to think? I have read all the roofers arguments for a whole new roof. \n\nIf I had a portion of my house’s siding that was damaged, we would fix that damage and not reside the whole house. Is that just because I can paint the house and cover the fix? Why can’t the shingles be better matched? Is it a wear and fading that just doesn’t allow partial fixes? Do these shingle companies not design a product that can be repaired? Are asphalt roofs just a product of our throwaway culture? Because if they are, a 30k throwaway product that is “30 year” only lasts 15years (even with annual maintenance and cleaning) might be the biggest fucking scam in history. \n\nLast year, Historic Timberline Lodge suffered a fire and a huge hole was burned through the roof. They repaired what was damaged with new cedar shake shingles and it was ready again to winter feet of snow and rain, and huge winds. They didn’t have to reroof the whole damn thing. \n\nThis is more of a general questioning. ",
    "comments": [
        {
            "author": "No_Difference2763",
            "body": "Roofers don’t want to take on that type of liability. They touch one portion of your roof and suddenly there’s a leak somewhere else close by. 9/10 customers would say that they caused the leak and demand they fix it. There’s enough work out there for them to get jobs that are entire roofs that they don’t need to deal with the headaches that come with patch work.",
            "score": 82,
            "replies": [
                {
                    "author": "EverythingBland",
                    "body": "Yep, I learned that the hard way just as a homeowner. \n\nRain was getting into my soffit and had damaged a good portion of my decking. I spent $300 and 15 hours fixing that portion of my roof.  However, after the next rain storm I found out that the leak was coming from somewhere higher. Needless to say, I paid to have someone replace the entire roof a month later.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "pgriz1",
            "body": "With roofs, \"you touch it, you own it\".  The way I handled it with my clients is that I told them up front that the repairs (whatever they were) would be done on a \"best efforts\" basis and there would be no warranty of any kind, with the clients having to sign off on that formally (prior to us starting any work).  Those who came to me through referrals generally agreed with this, while those who did not know our work usually balked.  \n\n>  \nWhy can’t the shingles be better matched? Is it a wear and fading that just doesn’t allow partial fixes? Do these shingle companies not design a product that can be repaired?\n\nGranule application on shingles is generally pretty close in terms of reproducibility, but not exact.  When picking up the product at a distribution warehouse, it's really important to check that all the bundles came from the same batch/lot. Otherwise, the smart contractor will not install a mix of lots on the same visible surface because lot differences are often apparent, especially if they are on the same surface.\n\nAs for repairs, don't forget that the shingles are just part of the roofing system - the underlayment, flashings, waterproofing, etc. also need to be taken into account.",
            "score": 12,
            "replies": []
        },
        {
            "author": "ncroofer",
            "body": "1. It is completely possible to repair asphalt shingle roofs. Not sure who told you otherwise. It is also possible to replace larger sections as well, but most roofers would prefer not to for a couple reasons:\n\nAs others have said, we don’t want the liability. In general once we touch a roof we tend to be blamed for any problems. It’s an easy way to collect bad reviews. \n\nAnother reason is it’s just not financially viable lots of times. We have overhead, we need enough profit to cover that overhead. For repairs and partial replacements we have to charge a much higher profit margin to make it worth it. So in the long run you’re paying more. \n\nFurther, it’s just not best practice. Shake roofs and slate/ tile aren’t as interconnected as shingles. You can lift and replace individual tiles without disturbing other tiles. Shingles all overlap, you only see 50% of a shingle when you look at a roof. Also ridge shingles are nailed onto both slopes. Replacing just one slope will lead to distributing the slope you don’t replace. When you go to replace the old slope, you will disturb the newer one as well. Further, woven valleys are common. This makes it difficult to tear off one slope without completely messing up the other. It’s easier on an up and over roof \n\n\n2. It would be impossible for manufacturers to match shingles. Shingles get their color from dyeing crushed up slate we call granules. They are produced in runs from dye packs. Even the exact same shingle brand and model can have a slightly different color depending on the lot. It’s why we always order extra. If we have to run to a different store and mix up lots we risk having different colored shingles on the roof despite it being the “same color”.",
            "score": 28,
            "replies": []
        },
        {
            "author": "Aromatic_Ad_7238",
            "body": "Totally depends on roofer and what needs done.\nOf course most want an entire roof.  I had a small outback building need some roof repairs.  Called half dozen places.   Except one all said too busy for that size job.   I did get a good one I had used in past. But waited 7'weeks till they could fit me in.",
            "score": 5,
            "replies": [
                {
                    "author": "TAforScranton",
                    "body": "If it was during cold weather the 7 week wait might have been because that roofer is more honest than others. We got hit by a tornado in November. Almost everyone in my neighborhood got a new roof this winter while the temps were sub 40f. If shingles are installed while the temperature doesn’t stay above 40 degrees for at least 24 goes it can cause them to crack and lead to poor adhesion. If they split, blow off, or don’t adhere probably and they were installed while it was too cold out *they won’t be covered under warranty.* I would have never guessed that was a thing unless my contractor said something about it.\n\nWe just got our new roof and we actually might have been the last house to get it done. Almost everyone else got theirs done while the temps were below freezing. My contractor refuses to do them under conditions that would void the warranty of the shingles. This week he took me on a walk and pointed out all the issues that are already popping up on the houses around us. Our heating costs were high as hell this winter but at least our roof is done right! He upgraded us from cat3 to cat4 shingles for free for being patient and trusting him when he asked us to wait.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kaylakayla28",
            "body": "The previous owner of my house found a leak like 2 weeks before closing and had it repaired and patched the next day. The new shingles are significantly lighter than the old ones, but I don't care that they don't match. I just care that it doesn't leak and it holds me over until it's time to replace the whole thing.",
            "score": 5,
            "replies": []
        },
        {
            "author": "upstateduck",
            "body": "the best reason is that customers are likely to complain next year when a leak in an unrelated area is blamed on the roof repair.\n\nOTOH if you are only talking to the salespeople? you get sales pitches. Of course we can't see the roof you are talking about.\n\nedit  greetings from Central Oregon. How much new snow have you gotten from the atmospheric river?",
            "score": 9,
            "replies": []
        },
        {
            "author": "jimmyqex",
            "body": "Most roofing companies don't consider small repairs because they make more money on full replacements.  You'll have to DIY or find a handyman type contractor.  Roofs can definitely be patched, but if it is up there in age, you'll continue to have issue until it is replaced.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Born2Lomain",
            "body": "Honestly there is great $ in offering affordable repair services. Not everyone has the $ for a total replacement. Many of the guys I worked with have revamped their businesses as they aged. My one buddy makes a killing doing strictly repairs. Chimney caps, counter flashing, tab replacements, and overall TLC will get a homeowner an extra decade out of an old roof.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Appropriate-Disk-371",
            "body": "I had a trouble section replaced.  The caveats are that it was nearly impossible to even get anyone to consider doing it and I had to call in a personal favor just to find some that would do it.  And, no warranty on anything related to the fix - just too much liability if they aren't doing it all.  For what it's worth, it did work.",
            "score": 3,
            "replies": []
        },
        {
            "author": "flying_trashcan",
            "body": "Try finding a handyman or a single roofing guy looking for some side work.  Most roofing companies are geared up to do whole roof replacements - doing small repairs doesn't fit their business model.  \n  \nThere are roofing systems that last much, much longer but they are substantially more expensive than asphalt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "phoonie98",
            "body": "I had my roof repaired last year- they replaced a decent sized section with new plywood and shingles, etc- didn’t require me to replace the whole thing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok-Entertainment5045",
            "body": "I’ve had people come out and do small repairs. One time there were three different spots that got a couple new shingles, a new vent boot and some new wall flashing. There are people that can do this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "runningabithot",
            "body": "I was able to find two roofers that would repair my roof, I just needed one piece of sheeting and new shingles. My roof was only five years old though so they couldn't really sell me on a new roof.",
            "score": 1,
            "replies": []
        },
        {
            "author": "baodingballs00",
            "body": "its totally possible to fix a leak in your roof.. check out thumbtack or other handyman services. they don't have the same liability and work hourly usually. but make sure they know how to use flashing and sealant. some fixes are fairly complex.",
            "score": 1,
            "replies": []
        },
        {
            "author": "q0vneob",
            "body": "I had a patch done for a leak\n\nCost me like $1500 which wasnt terrible considering the problem but they couldn't get the original type shingles because that color wasnt made anymore and it looked obvious.   They tore it down to replace decking then put it back reasonably well, but it never matched or lined up like a new roof would have.   \n\nI then dealt with two years of every door-to-door sales goon showing up and trying to sell me a roof, until a new leak developed and I had to get it all redone.   Was out that extra $1500 repair in the long run when I should've just bit the bullet.\n\nThat roof was ~15 years old, but also incorrectly installed.   Just half-assed to save money before sale.   Idk if my new one will make it 30 years, but its off to a much better start because I had it done right.  Also added a soffit and ridge vents that I was lacking, and bigger gutters which were totally worth it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Collapsosaur",
            "body": "I thought I would get by with only replacing one half of the roof before solar install. I found out in hindsight that it was better to do the whole roof and for a good price. They included my little tool shed, replaced 2 wood pieces from leaks, gave me 25+ year shingles, put in proper underlayment especially in perimeter areas, included mildew avoiding tech, and better matched the color on my newly painted siding. I'm so glad I did it, especially with all the inflation and tariffs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "in_a_blink_of_an_I",
            "body": "Needed some eaves repaired, but roofers would only touch the project if the whole roof was replaced. What wat? Hired a carpenter and a painter to do the work and saved 75%.",
            "score": 1,
            "replies": []
        },
        {
            "author": "freeball78",
            "body": ">product that is “30 year” only lasts 15years \n\nIf your insurance company will let you get away with even 15 years.",
            "score": 1,
            "replies": []
        }
    ]
}