{
    "title": "How do I fix a door that is difficult to close?",
    "author": "Patr3xion",
    "subreddit": "HomeImprovement",
    "rank": 11,
    "score": 3,
    "upvote_ratio": 0.72,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/HomeImprovement/comments/1jejd0i/how_do_i_fix_a_door_that_is_difficult_to_close/",
    "id": "1jejd0i",
    "selftext": "I just replaced an interior door and hinges with a new one. When I go to close the new one, it resists as it gets to the closed position. If I let go, it springs back open. The hinges appear to be moving as if they're being pried off the frame when I shut the door. What can I do to fix this?",
    "comments": [
        {
            "author": "TAforScranton",
            "body": "I think your hinges might be on backwards. Can you post a pic? If so it’s an easy solution. All you have to do is flip them around.",
            "score": 3,
            "replies": [
                {
                    "author": "Patr3xion",
                    "body": "This was it. I realized it right after I submitted this post. I am a moron ",
                    "score": 7,
                    "replies": [
                        {
                            "author": "TAforScranton",
                            "body": "Omg glad you got it figured out! \n\nWith the pulling and prying that went on while you were trying to figure it out I’d be worried about the holes being stripped. If the screw holes are a little loose I would take the door down, dip a few toothpicks in wood glue, then shove them in the holes and snip the ends off. Come back  the next day and proceed.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Patr3xion",
                                    "body": "The screw holes are fine. I was being really ginger with it and going really slowly. Moving too fast too soon can make expensive noises. I don't need that in my life haha",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok-Sir6601",
                    "body": "yep",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chilling_Storm",
            "body": "Youtube - search fixing door hinges and you will find the solution",
            "score": 0,
            "replies": []
        }
    ]
}