{
    "title": "ELI5: Why are Thunder-snow storms not as common as regular thunderstorms?",
    "author": "Jrand01",
    "subreddit": "explainlikeimfive",
    "rank": 18,
    "score": 22,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/explainlikeimfive/comments/1jdwbyw/eli5_why_are_thundersnow_storms_not_as_common_as/",
    "id": "1jdwbyw",
    "selftext": "Here in N",
    "comments": [
        {
            "author": "firemarshalbill",
            "body": "Warm air causes turbulent air flow. Updrafts are the primary reason for lightning. \n\nCold air is more stable",
            "score": 1,
            "replies": []
        },
        {
            "author": "aleracmar",
            "body": "Thunderstorms form when warm, moist air rises quickly, cools, and condenses into storm clouds. The temperature difference between the warm ground and cool atmosphere allows lightning. \n\nSnowstorms usually happen in cold weather when air is stable, meaning there’s less rising warm air. The air is also drier in winter, making it harder for big clouds to form.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hedronist",
            "body": "I have only encountered [thundersnow](https://en.wikipedia.org/wiki/Thundersnow) in the high mountains of Colorado. In the winter of 1968 I thought I was going to die at the top of [Loveland Pass](https://en.wikipedia.org/wiki/Loveland_Pass). At just under 12,000 feet, it is one of the higher passes in the Rocky Mountains that has a road over it.\n\nI don't know at how low of an elevation it occurs, but I do know it requires a strong uplift as part of its dynamics, which mostly means *mountains*.",
            "score": 1,
            "replies": [
                {
                    "author": "VaMeiMeafi",
                    "body": "I've seen it 3 times here in metro Detroit over the past 50-odd years. I don't know what the secret ingredient is, but all 3 times it was snowing HARD.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "crsgln",
            "body": "Because to have a thunder-snow storm you have to have a regular thunderstorm and snow but to have a regular thunderstorm all you need is a regular thunderstorm",
            "score": 1,
            "replies": []
        }
    ]
}