{
    "title": "ELI5: How do airports work, from walking into the airport to getting to your seat on the plane?",
    "author": "clerbird321",
    "subreddit": "explainlikeimfive",
    "rank": 5,
    "score": 252,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 126,
    "url": "https://www.reddit.com/r/explainlikeimfive/comments/1jdy6rz/eli5_how_do_airports_work_from_walking_into_the/",
    "id": "1jdy6rz",
    "selftext": "I’m going to be going on my first flight in a couple months and the whole airport process is overwhelming to me, from checking in to security to gates, everything. ELI5!!\n\nEdit: You all are AMAZING, thank you for your help!! It’ll be a nonstop domestic US flight, about 2.5hrs long with United. I’m excited 🤪",
    "comments": [
        {
            "author": "Jale89",
            "body": "This is mostly from the perspective of UK-EU flights. I haven't flown to the US in a long time, and I don't know much about other parts of the world.\n\nPart 1: check-in \nFirst, you \"check in\". This can usually be done online, or in person. If you do it online, you may have to print a ticket at home, use a ticket that's on your phone, or print the ticket from a machine at the airport. If you go in person, you'll need to find your flight on an information screen and find the right desk to check in for your flight. \n\nAt this stage they will ask you some important-sounding questions to make sure you don't have any forbidden items in your luggage, and that you packed it yourself. Look up the rules for your airline when you are packing, and always say yes you packed it yourself.\n\nIf you have a large suitcase, you will need to hand over the bag at this stage. If checking-in in person, it's just part of the process. If you have checked in online, there is sometimes a \"bag drop\" service near the check-in desks, or you can just check in again.\n\nPart 2: security\nOnce that's over, you can go through security, where they will check all the items that you can take on the plane. Basically, don't try to take anything sharp on, and usually there are restrictions on liquids, so either pack these in your checked-in case, or take small bottles. You may need to put these liquids in a clear plastic bag.\n\nLook up the specific rules for your airport before you go, because they do vary by country and by equipment. In an older system you have to separate a lot of items - remove laptops from bags, liquid bags from main bags, etc....you place these things, and your coat and pocket contents, in a plastic basket which then goes through an x-ray machine. You'll then be asked to step through a metal detector arch.\n\nNewer systems don't usually require you to unpack your bag, and you'll be asked to pose while facing a special wall. These are increasingly common in Europe.\n\nWith any luck you will just need to collect your things and move on, but they may search your bag, or your body. It's nerve-wracking but just keep calm and remember they are just doing their job. Answer their questions and it should all be fine.\n\nPart 3 Passport Control\nA lot of the time, you won't have passport control when departing, you'll only have it on arrival. However, sometimes you will, particularly in Europe where they check everyone *out* of the Schengen area, and all flights to non Schengen countries will be in an international terminal of the airport. So I will mention it now.\n\nQueue up in the correct line - usually there's at least one for more local passports, and a different line for everyone else. Just wait your turn, and then show your passport and any other relevant visa documents. They may ask you questions like where you are staying, what you are doing on your trip, etc. so just answer honestly.\n\nPart 4: waiting\nOnce through security, you are just waiting to be called. There will be shops and restaurants. Keep an eye on information screens. About 30 mins before the flight you will be told a gate to go to. It's usually sensible to move there as soon as it comes up. There won't be more than a cafe and some toilets at the gate, so make sure you have what you need before you go to the gate.\n\nThen you have to wait again at the gate. Staff will eventually call you to board. This is usually done in groups, like first class first. They will check your boarding pass and ID (usually passport if flying internationally) before you board.\n\nPart 5: boarding\nSometimes you will just walk over a bridge to the plane. Sometimes you will walk across the tarmac and climb stairs into the plane. Sometimes you will board a bus that takes you to the plane, and then you climb stairs.\n\nOnce you are on the plane, find your row and seat. Place your larger bags in the shelf bins above the seats - don't worry if you need to use one that isn't over your seat, it's a first-come-first-serve free-for-all. You can place smaller bags under your seat. Read the safety card, adjust your seatbelt, and get comfortable.\n\nEventually they will move off and give a safety presentation. Then the flight will take off!\n\nPart 6: in-flight\nJust relax and follow the staff instructions. There's a light indicating if you are allowed to leave your seat, and really you only want to do this if you need to go to the bathroom. Otherwise, stay in your seat.\n\nThey may hand out food, particularly on longer flights. Look up what you get included, and what costs extra. \n\nPart 7: arrival\nEventually you will land. Don't try to unclip and get up until the seatbelt light turns off. It's usually a little fraught getting off - just let people in a rush get off and you can get off in your own time.\n\nFollow signs and the flow of people. If you have gone to a different country, usually passport control will be the next stage - see part 3. Then you will be directed to an area to collect suitcases. If you had checked bags, then you'll need to look at an information screen to find your flight, and then go to the correct carousel. Eventually, your bag will appear.\n\nFinally, you'll pass customs. There's usually a green arch that says \"nothing to declare\". If you have checked the rules on what you can bring into the country, you can walk through this. You might be stopped and asked some questions, and they may search your bags, but it's never happened to me.\n\nYou are now out and free!",
            "score": 1,
            "replies": [
                {
                    "author": "Smooth_Beginning_540",
                    "body": "About Part 4: in the U.S., possibly elsewhere, you have an assigned gate as soon as you have checked in—not 30 minutes prior to flight as stated above.\n\nThe wait time between check in and boarding may be short or long. Regardless, I personally prefer to be close to the gate unless if I know I have a few hours. \n\nDouble check the departure gate and time, either on a view screen or the airline app. Flights can change gates and times.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Gizogin",
                            "body": "This can vary considerably. Even in the US, you might not know your gate until half an hour before boarding.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Jale89",
                            "body": "Yes probably more of an EU thing, thanks for supplementing with the US information.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "shnu62",
                    "body": "Fantastically comprehensive. Bravo",
                    "score": 1,
                    "replies": [
                        {
                            "author": "uggghhhggghhh",
                            "body": "It was! However, I could see that amount of information being overwhelming to a first time flier. If OP just shows up early and then follows the posted signage, they'll be totally fine!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nrdvana",
                    "body": "Missed an important detail: You absolutely want to check in as soon as possible, because if you aren't checked in an hour before the flight they might give away your seat!  In the US at least, they overbook just about every flight.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ThatBassPlayer",
                            "body": "I've never heard of anyone having their seat given away anywhere in Europe.\nIt might happen - happy to hear any examples - but I wouldn't be surprised if there wasn't an EU law or regulations against it.\n\nIt just sounds so American -\n\"How do we make more money?\"\n\"sell more tickets than we have seats!\"\n\"GENIUS\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "zoobatt",
                                    "body": "It's not an American thing, overbooking happens everywhere",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Antiochia",
                                            "body": "But how does this happen? In Europe you get your setting place already when booking it. Do they just randomly book various seats twice from the beginning, and whoevef comedian first gets it?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Despruk",
                                                    "body": "they will give you a different ticket/seat at the gate before boarding\n\nas for how they free up space if everyone has showed up, it probably depends on the airline but I've heard they first look for volunteers who would switch to a another flight with some additional benefits\n\nif this fails, they have algorithms how they select someone who is forcefully \"volunteered\"\n\nyes this feels like ass if it happens to you, but it's legal in Europe",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "rabid_briefcase",
                                                    "body": "> But how does this happen? In Europe you get your setting place already when booking it.\n\nOverbooked seats are sold without a specific seat assignment, and it happens all over the globe.\n\nIf there are explicit cancellations and re-bookings they are available seats that get assigned at that point.  Before boarding they may have a connecting flight that was delayed, and that's a source of available seats that also get assigned when the connecting flight delay is announced.\n\nNext, when they start boarding (typically 30-45 minutes before departure) people who haven't checked in are the next group bumped, that's why checking in as early as possible is important. If you can do it online the day before, it tells the airline you'll be there. Often they'll call people up at the gate and assign the seats.  If someone arrives late to the airport and hasn't checked in they'll be put at the top of that unassigned seat queue, still able to claim a seat if they manage to get there quickly enough.\n\nFinally, if there are still people in the queue when all the other passengers are on and they're doing the final call for boarding, if any boarding pass hasn't been scanned yet they'll fill those seats. It doesn't happen often, but people in the airport get distracted, stuck in the toilets, have medical issues, or whatever, and end up missing their flights getting filled by someone else because they missed the final boarding call.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "gyroda",
                                                    "body": "Hotels will do the same thing. \n\nThe idea is that, when there's 200 seats on a plane, *someone* will probably cancel or reschedule or otherwise not be on the flight. The airlines can predict this very well, so they'll oversell to ensure the flight is full even if someone cancels. Sometimes they don't have enough cancellations.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "nrdvana",
                                    "body": "My only examples are for America, but I never took chances in Europe or Japan and always confirmed immediately when the time window opened up.  I lost my fligt once in the US by attempting a checkin at the kiosk 50 mins before my flight, and it denied me and said \"see ticket agent\".  The line for the agent was insanely long (the airport had a bunch of cancellations that day) and didn't make it to the front until the plane was already gone.  The agent informed me that the plane had been full anyway, and that I need to check in sooner next time.  Basically, as soon as the hour-before-departure hits, if they have a backlog of passengers (or deliberate overbooking) they start filling the empty seats.  That was ... almost 15 years ago!\n\nEven checking in many hours in advance, it might give a message \"see gate attendant for seat assignment\".  That's code for \"we overbooked\".  Then at the gate they announce that they'll give rebates to anyone who is willing to take a later flight.  They do kind of an auction where they keep upping the incentive until someone takes it, and then they finish seat-assignment, then board a 100% full flight.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "malakambla",
                                    "body": "This did happen to my friend when flying from UK to Poland with Ryanair. They were going around and offering incentives for people to agree to reschedule to a different flight, I imagine it would be a lottery if they didn't get volunteers.\n\nI think you get a notif that you're not guaranteed a seat or that it'll get assigned while boarding after checking in, they might have been looking for volunteers anyway so nobody can technically complain if they got compensated, but I don't really know.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "This_Site_Sux",
                                    "body": "This happened to me two months ago in Canada!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AlkaKr",
                            "body": "I don't think I've ever heard this happening outside of the US or at the very least anywhere in Europe where I've traveled.\n\nThis seems like it's a purely american thing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Swaqqmasta",
                    "body": "Yeah that pretty much covers it all, I would add that many US airlines at least it's common to use the mobile app for check in and ticket scanning, which will also tell you what gate to go to.\n\nSo you should really know as soon as you check in exactly where you're going to need to be, not waiting until boarding to be told. Also, depending on the size of the airport, you probably want to head there immediately and then wander around the gate depending on how much time you have. \n\nIndividual preferences vary, but I like to arrive at the airport drop off 60-90 minutes before takeoff at most airports, and sometimes 2+ hours if it's a crazy big airport that I know will be a nightmare to get through.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "albertcn",
                    "body": "Pro tip regarding security scanning: after the check in process, put everything in your pockets, phone, passport, belt, watch, sunglasses, etc in one of the small pockets of your carry on.\n\nThat way you don’t have to take all of this off and stress about them at the security line (good way to avoid a phone “misplacing” incident).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TimothyOfTheWoods",
                            "body": "I would say to keep phone (if you're using it as a ticket) and passport in pockets at least. Most airports I've been to (US and Canada) have the expectation that you'll have them in hand while in line going up to security. Most folks will just hold passports while getting scanned if allowed",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mikel145",
                    "body": "I would just add keep an eye on the screens in the airport in case your gate changes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "StretchArmstrong99",
            "body": "0. Book a flight\n1. Check in. Get your boarding pass and check any bags you have\n    - you can usually check-in online within 24 hours of your flight\n2. Check which terminal your flight is leaving from\n    - many airports will have multiple separated terminals especially for domestic vs international travel\n3. Go through security\n    - make sure you don't have any banned items in your carry-on \n    - empty your water bottle before getting in line\n    - be prepared to take out any electronica or toiletries from your bag\n    - this can often seem like the scariest part but don't stress you'll be through in no time\n4. Find your gate\n    - I like to find my flight's departure Gate first thing so that I know where I need to be when it's time to leave\n    - this should be listed on your boarding pass but if not look around for departure boards. These list all the upcoming flights departing \n5. Go grab a snack, fill your water bottle, use the washroom, hangout, relax\n6. Be at the gate for boarding\n    - this will depend on the size of the flight but I'd be ready at the gate ~30-45 mins before the departure time\n\nAirports generally have tonnes of signage so you shouldn't get lost but if in doubt just ask someone official looking if can help with directions",
            "score": 1,
            "replies": [
                {
                    "author": "justinram11",
                    "body": "Only other thing to add, is most airports generally advise being *at the airport* 3 hours early for an international flight, and 2 hours early for a domestic flight.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "highrouleur",
                            "body": "In Europe I generally aim for 2 hours. And it is worth noting the gate is often only announced just before boarding starts. Flew from lcy to mallorca on Friday, 0650 flight, gate number only appeared at 0610",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Jetztinberlin",
                                    "body": "> lcy\n\n\nLol thought this was a new nickname for Iceland for a minute 😂",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "sombreroenthusiast",
                                    "body": "Also your check in counter usually doesn’t even open until 2 hrs prior, so there’s no point arriving any earlier.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Talkycoder",
                                    "body": "To be fair, LCY is a very tiny airport. The gates show a lot earlier at say, Heathrow or Gatwick.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "zennok",
                                    "body": "is that a european thing? u.s flights usually have the gate available well before departure time",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jmlinden7",
                                            "body": "Yes, in Europe, the airports themselves will randomly assign a gate as needed in order to better manage traffic flow. In the US, the gates are leased by airlines which manage their own traffic flow internally, which allows the airline to give you a general estimate of what gate they use way ahead of time (barring some last minute rescheduling).",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mfb-",
                            "body": "Apart from extra Covid stuff, I have never needed to be at the airport that early. Have some contingency if your trip to the airport can be delayed, however. A train or bus can be cancelled, there can be traffic jams, and you want to be at the airport at least 1.5 hours before departure even if that happens.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hannahbay",
                                    "body": "For someone that's never flown before in their life, being 2 hours early is probably a good idea.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "biggles1994",
                                            "body": "For something as expensive and important as a flight I'll happily get there 2+ hours early and chill somewhere with a book than risk missing out on the whole trip.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PrincetonToss",
                                                    "body": "Think of the extra expense from all of the overpriced airport crap you'll buy while you're there for more time.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "biggles1994",
                                                            "body": "Strange though it may seem, I am able to resist the urge to purchase overpriced junk at the airport. Between a good book, some plane spotting, and the company of whoever I’m travelling with the time goes quickly enough.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "mfb-",
                                            "body": "Oh sure. Just saying that the airport recommendations are very conservative. They don't want someone to miss their flight and then blame the airport.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Gurtang",
                                    "body": "I'd say planning on getting there 3 hours in advance is the contingency for delays getting there !",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NegrosAmigos",
                            "body": "If you fly domestically a lot. Get TSA precheck it's  $85 for 5 years. Save the hassle",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "trmbn65",
                            "body": "Not necessary most of the time. Depends on the airport. International makes no difference in the US as we don’t have immigration checks upon departure.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ImInterestingAF",
                                    "body": "And most international flights have an ACTUAL scheduled departure about an hour after the published scheduled departure.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Iforgetmyusernm",
                                            "body": "This is completely untrue. What?!",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "FRESH_TWAAAATS",
                                            "body": "Say what now?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "princekamoro",
                    "body": "> this should be listed on your boarding pass but if not look around for departure boards. These list all the upcoming flights departing\n\nLook at the departure boards anyway. Your boarding pass doesn't know if there's a gate change.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Viv3210",
                            "body": "Also, sometimes the boarding gate isn’t know yet. They might write the terminal on the boarding pass, so you’ll be relatively close to the gate. But indeed, always keep an eye on the information screens.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wonderful_Nerve_8308",
                    "body": "On number 4 - Do remember to check again periodically. Its not common but sometimes the gate changes after initial announcement. No need to constantly check religiously, but once every 15 min would be fine.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Siberfire",
                    "body": "The most important part to realize is that your 0700 flight will most likely leave the gate or take off at 0700. The boarding process begins much earlier, as u/stretcharmstrong99 pointed out. You want to make sure you get to your gate before the boarding process begins. Boarding can take a long time, or a short time depending on how full the flight is.\n\nThe sooner you get on the plane the sooner you can relax, and ensure your carryon will fit in the overhead bin. This is especially important if you don't fly often and will most likely be the last to board. Flight attendants are there for your safety first, and only get paid when the doors close, so they are interested in getting going. If you are running late for boarding you may get your name awkwardly and embarrassingly called over the pa system throughout the terminal.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "This_is_a_tortoise",
                    "body": ">- be prepared to take out any electronica\n\nDefinitely remove any daft punk you may have brought with you",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Purple-Way-2527",
                            "body": "They are contraBAND",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Casper042",
                    "body": "Some edits/additions:\n\n4 - have your ID and your ticket ready when you get to the front of the TSA line.  Those are the only 2 things they will need.           \nIf you are wearing a mask (airports and planes are germ fests), you will need to drop the mask for a sec for the TSA agent.\n\n4 - Toiletries - most liquids are still limited to 3oz.  If you need anything specific in terms of shampoo/conditioner/soap/etc vs what will be provided at your destination (friend/relative/hotel), see if your local Walmart/Target/etc has a Travel size.  I refill my travel size shampoo from a large bottle before each trip, the 3oz is good for about a week.\n\n4 - Pro Tip - if you have a jacket with zipped pockets, I wear this through the TSA line, and stash everything from my pants pockets into the jacket while waiting in line at TSA.  Add your Ticket and ID once you hit the TSA agent, then zip those pockets closed, and you can take off the entire jacket, drop it onto one of the buckets they use for scanning your luggage, and when you pick it up on the far side you just slip it on, grab your shoes and bags and go.          \nIt just makes it easier than dealing with putting 9 things in the scanner bucket and then having to find a place for all 9 things again in your pockets on the far side.\n\n3 and 5 - Google your Flight Number  DL1234 or similar for Delta.                \nThis will often tell you the terminal and closer to departure the gate.          \nHowever it's best to check the big TV screens past security to confirm the gate number.\n\n8 - Got Girl Scout Cookies for sale in your area?  Bring a box of thin mints for the flight crew.  Hand them to the Flight Attendant who will be about 3 feet inside the plane when you first step on.  Tell them you appreciate what they do and brought them a little snack.             \nThey might ask what your seat is, so have that in mind.        \nI've gotten everything from a quick thank you once, to the entire FA crew and even one of the pilots thanking me for the thoughtful gift, and one of the first times I did it they came by with free drinks for me.        \nNot mandatory, but certainly has gone a long way for me (I travel domestic at least 2-3 times a year for the past 15 years).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Secret_Elevator17",
                    "body": "Also, you don't have to check all of your bags. \n\n I travel often for work and usually bring my carry-on size suitcase on the plane along with a backpack as a personal item. So I don't have any bags to check.  \n\nIf you plan to not check bags then you need to make sure your bag meets carry-on requirements and that you can lift it over your head to put it in the overhead bins.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "justacpa",
                    "body": "Other clarifications:\n\n0.  Arrive at the airport at least an hour early. Flights usually begin boarding about 1/2 hour before departure. Arrive even earlier if it's a holiday. \n\n1.  When checking bags, most airlines have kiosks. Use the QR code, reservation number, or credit card to pull up your reservation.  Attach the tag to your luggage then take them to the counter. Have your ID ready to show the employee.  Keep the claim ticket for your luggage in case your bag gets lost. \n\n2.  When going through security, have your ID once again.   You'll need to remove your shoes and put them in the bin. Remove everything in your pockets. \n\n3. After going through security, there will be a back of monitors with gate assignments. Find your destination, confirm the gate number on your boarding pass, and go there. \n\n6.  If you are flying Southwest, you will not have an assignment. Rather, have a boarding group/number on your boarding pass that dictates the order in which you board the plane. There are physical columns or similar that are numbered to indicate where to line up when verbally when instructed. \n\n7. If you have a carryon, put it in the bin above or your seat (or above a row BEFORE yours) for easy access. Otherwise you will be fighting the outflow of passengers when getting off the plane. If it's a small carryon or personal item, stick it under the seat in front of you. \n\n8. If you have to use the restroom while on the plane, do it at least 20 minutes before you land. After that point, they require everyone to remain seated until landed.  \n\n9.  Once you land, follow the signs to Baggage Claim. There will likely be a bank of monitors around there indicating which carousel to retrieve your bags. Each carousel will have a monitor indicating which flight the bags are coming from.  If you are missing a bag, there are offices for each airline in that area. Go in and present your bag tag for assistance.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HimikoHime",
                    "body": "Addition to check in: I try to find out when the check in booth opens to be there when they do cause I’m paranoid about time. In the time before online check ins this also allowed you to get nice seats. If the airport is a hub for your airline (like Bangkok for Thai airways) you can expect that there’s always a booth open though.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Sunflier",
                    "body": "You can also ask for help/guidance if you get stuck",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "skylinenick",
                    "body": "This is great advice OP. \n\nI personally think you can aim for 10 minutes before departure to be back at the gate. Unless you’re a frequent flyer or flying first class you’ll be in a later boarding zone anyway\n\nEdit: 10 minutes before boarding. This is why I was (fairly) downvoted to oblivion. I meant boarding y’all",
                    "score": 1,
                    "replies": [
                        {
                            "author": "meental",
                            "body": "Boarding door is normally closed 15 min before departure,  probably want to be there before they are calling your name on the PA speaker.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "skylinenick",
                                    "body": "Yes yes I miss typed",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "redmandolin",
                            "body": "Do you mean boarding? 10 min before departure is wild.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "skylinenick",
                                    "body": "I do indeed mean boarding",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MaximumSeats",
                            "body": "Brother you are insane I'm 1.5 hours early to every flight 😭\n\nGrowing up next to Atlanta in the immediate aftermath of 9/11 and only really flying for holidays has forever warped my sense of how long it takes to get through airport security",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "skylinenick",
                                    "body": "10 minutes back at the gate at the end of the entire process StretchArmstrong described. Like once you’re through security, have found the gate, then go off to get food/bathroom etc. I don’t think you need to then return to your gate until 10 minutes or so before boarding (and that’s my conservative answer) \n\nIf flying for the first time, get to the airport 2 hours ahead of the flight I totally agree. Assuming not a holiday etc",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mfb-",
                                            "body": "10 minutes before boarding is fine, 10 minutes before departure can be too late.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "skylinenick",
                                                    "body": "Yeah I miss-typed",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "igikelts",
                                    "body": "\"to be _back_ at the gate.\" No one is arriving at the airport 10 minutes before their flight takes off.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Long_Repair_8779",
                            "body": "Yeahhh don’t do this. Some trips it works ok on especially if there is a bridge from the terminal to the plane. If it’s a low cost airline or whatever other reason there is a bus from the terminal to the plane on the runway, you’ll be screwed",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "skylinenick",
                                    "body": "I meant 10 minutes before boarding",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jvn1983",
            "body": "The best thing you can do is give yourself plenty of time, especially if you’re nervous! Others have laid out the process better than I could, but I’d really advise you get there a little extra early since it’s your first time navigating the process. Have a wonderful flight!",
            "score": 1,
            "replies": [
                {
                    "author": "no_stairway",
                    "body": "Yes! I love air travel, specifically airports, but I remember not being able to sleep the first night before taking a train and then a bus abroad. I had no idea what to do. Show up early, and don’t be afraid to ask for help.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jvn1983",
                            "body": "Asking for help is a big one too!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fml86",
            "body": "Walk through the doors in the departure section. Look for an area that dedicated for your airline (there will be signs for each airline). Wait in line to give them your bags. They'll ask you for ID and give you a boarding pass (piece of paper). They will direct you towards security. Go to security and put your stuff in the provided bins. This is always hectic. Take your time. Once through security walk to your departure gate (the gate # is on your boarding pass).",
            "score": 1,
            "replies": [
                {
                    "author": "princekamoro",
                    "body": "> the gate # is on your boarding pass\n\nAlways check the departure boards, those are up to date on any gate changes.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GoBlu323",
                    "body": "Nobody uses printed boarding passes anymore. You’ll want to check in well in advance of arriving at the airport anyway. \n\nBoarding passes are on phones now",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mostin78",
                            "body": "You sure about the boarding passes?\n\nI've seen loads of paper boarding passes in my job. That can be printed at the desk or you can print them at home.\n\nSource: Me, an airport security officer.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "seobrien",
                            "body": "Hate boarding passes on phones.  I always get the print out.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GoBlu323",
                                    "body": "Why? It’s just something to lose. You already have your phone you might as well use it as a boarding pass",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "seobrien",
                                            "body": "Pull out Phone, unlock, open app, pull up boarding pass\n\nPull out paper.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Heisenberg_235",
                                                    "body": "Pull out phone.\n\nBoarding pass is on Lock Screen.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "nonyyy",
                                                    "body": "And turn up the brightness!! I prefer paper too",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fml86",
                            "body": "You're right about using a phone. I tried to keep it as short as possible. If you're checking a bag, you need to deal with the airline anyway. I assume they'll still print you one?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ShadowOps84",
                                    "body": "If you go to the check-in desk for your airline, they will absolutely still print one for you.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GoBlu323",
                                    "body": "Not usually, they’ll scan the pass on your phone to check the bags",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "martphon",
                            "body": "For the international flight I regularly take, I get a boarding pass on my phone, and then when I check in at the airline counter, they invariably say they're still using printed boarding passes and give me one anyway.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Long_Repair_8779",
                            "body": "Depends on your country. In the USA and Europe maybe not so much. In South Asia at least it’s extremely common, particularly for international flights, to need a printed boarding pass as they have to stamp it etc multiple times.   Maybe in 10 years they’ll go digital but right now it’s absolutely not.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "exorah",
                            "body": "I like my printes boarding pass thank you very much",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Jale89",
                            "body": "Flying regularly in the EU and UK, I see people use a pretty even mix of phone boarding passes, print-at-home boarding passes, and passes printed by the airport. OP can use whatever they are most comfortable with, and I personally prefer not to rely on my phone having charge.\n\n Invariably the airlines I use (A variety of UK and EU carriers) will automatically print an additional copy of the boarding pass if you check luggage, regardless of whether or not you have already got a boarding pass.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Rufnusd",
                            "body": "This isnt true. I just flew from Dakar to Paris to Houston yesterday. Everyone had paper tickets leaving Dakar.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Previous_Road3852",
            "body": "Travel comfortably. Bring a sweater. Where shoes that are easy to take off to go through security. Don’t be afraid to ask the airport staff for directions, I’m sure they get first timers a lot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EntrepreneurOk7513",
            "body": "Make sure you have the proper ID to board a plane.",
            "score": 1,
            "replies": [
                {
                    "author": "clerbird321",
                    "body": "I will be bringing my regular driver’s license and my passport card, that will be enough right? I’m flying within the US in May of this year",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Aeron_311",
                            "body": "Yes, that should be enough.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PapaDuckD",
            "body": "\n\nFirst- I see you’re flying United.  The United app is beyond fucking fantastic.  I’m sure someone’s done a walkthrough of it on YouTube, but it will give you a map with walking instructions through the airport.  It’s sort of insane how good it is.  Use it.  That will solve 75% of your problems.\n\nSecond - Give yourself plenty of time.  They say get to the airport 2 hours early.  If you want to make it 3, you’ll have *plenty* of time.  \n\nThe biggest pain in the ass is going through the TSA checkpoint.  Just listen to them when they speak.  They’re not mean - just direct.  And if you ask questions most will be reasonable about it.  \n\nUnited boards by groups.  Yours will be on your boarding pass.  When it’s your group’s turn, go in the green lane (it’s labelled #2) and get in line.  The agent will scan your boarding pass and you walk on the plane.  \n\nIf you don’t know what seat is yours, ask the flight attendant.  They’ll point you in the right direction. Also every seat is labeled on the edge of the overhead bins.  You’ll see it.  It’s pretty easy.  \n\nMy daughter flew solo at 14.  I’m not saying that to fuck with you… just that a kid could do it.  It’s not that hard.\n\nThe trick is to not freak the fuck out and shut down.  Let people help you if you need it.  And enjoy the process.\n\nSafe travels!",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoSnackin",
            "body": "https://youtu.be/HY87FIQMdnI?si=8lwS-VdtYoVq8Fdw\n\nHere's what to expect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vorpal8",
            "body": "One tip I haven't seen so far, or might have missed. This is kinda male-specific.\n\nIf you're someone who (like me!) tends to carry a lot of stuff in your pockets, Airport Security is a good place NOT TO DO SO. Yes there is a tub for your \"pocket things,\" but gathering them up at the same time as your shoes etc.can be a huge pain in the ass.\n\nInstead, before going through the X-ray portal, put everything from your pockets--phone, wallet, keys, change if any--IN YOUR CARRY-ON BAG. This will make things simpler once you're on the other side of the security gate. Hats, necklaces, bracelets etc should also go in your carry-on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "InjuredSandwich",
            "body": "Remember: the number of people doesn't affect how complicated or simple things are. \n\nThey're just lines to get to the thing you gotta do. \n\nAlso don't be afraid to ask strangers for help!",
            "score": 1,
            "replies": []
        },
        {
            "author": "GamesGunsGreens",
            "body": "Dude it's the same as walking into a grocery store and buying a cart full of food. There are signs everywhere. There are employees who will help you everywhere. Just show up 1.5hrs earlier than your flight time and you'll be fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DavidKarlas",
            "body": "Hi 5yo, you like cartoons, right?  \nGo watch this one: [Conni’s first plane journey - Conni](https://www.youtube.com/watch?v=rrYaAxjVz7o)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glennmorangie",
            "body": "Most (all?) airlines allow you to get your boarding pass online 24 hours before. Boarding pass is kind of like a ticket. You buy your ticket by then get your boarding pass which has your seat number closer to departure. If you can't do this online early, there are kiosks at the airport and probably Customer service desks for your airline. \n\n\nWalk into airport -  find the door that is nearest to the airline you're flying. Makes for less walking. You need to arrive sufficiently before scheduled takeoff. This depends on how busy you expect the airport to be. If you miss a flight because the airport was busy you're out money \n\nFind your way to the security area for your gate. Gate number is on boarding pass. Gate is where you board the plane. Lots of singe to guide you. Follow the instructions from the security people. Best to have next to nothing in your pockets...makes it faster \n\nWhen done, follow signs to your gate. Walk around the area or sit at the gate until they make an announcement your seat is boarding.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KittyGal0re",
            "body": "When it comes to going through the more crowded areas like security, just listen to the directions TSA gives (they usually repeat them every minute or so as people are moving through) and just copy the people ahead of you. Also, make sure your electronics, boarding pass, and wallet/ID are very easily accessible",
            "score": 1,
            "replies": []
        },
        {
            "author": "Esc777",
            "body": "It’s not that complicated. Airports are public places that have tons of signs and indicators to let you know what to do. Just looking and reading will keep you fine. \n\nMost airlines in the US allow you to check in beforehand, online, which means your boarding pass (printed paper or on your phone) will be active. \n\nYou go to the departure terminals and follow the signs to security. A security agent will scan your tickets and look at your ID. \n\nThen you pass through the metal detectors. Just follow the directions of the signs. All your possessions in the tubs to go through the machine and you yourself through a scanner. \n\nOnce through security you’ll be at the “gates” area which can be large and sprawling (since the gates are for planes to connect to and they’re large) look at signage to easily see which gate your flight is at and look at a screen to see if it’s on time. Most gates are split into different hubs. Sometimes these hubs require taking a tram, so be prepared. You can look at a map of the airport beforehand if it helps you. From there you just go to the gate and wait until the boarding agents tell you to start lining up. \n\nPlan to get there at least 2 hours before listed boarding time. Security lines and walking to areas can take time and you don’t want to be late. Planes like to board a little early if they can to shave off time. You don’t want to be rushed. \n\nHaving some time waiting at the gate for your departure is good, you can snack, use the bathroom, stretch your legs, or purchase last minute items. \n\nRemember to have your water bottle empty and your toiletries in a separate clear bag. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "evangela61",
            "body": "You can often find somebody doing a walk through on YouTube - you could see if there is one of the airport(s) which you'll be going through! Which can help you at least get an idea about what the signage looks like and where things might be. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silvagadron",
            "body": "Firstly: which country are you from? It’s going to be slightly different dependent on the country. Several people have immediately assumed you’re from the US and are using some terms/scenarios that only exist in a US airport, which will confuse you even more if you’re not from there.\n\nEdit: nvm, post history says it’s a domestic US flight. But be aware different countries will have slightly different approaches and authorities, so if you fly out of your country one day, be aware of that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "trd2000gt",
            "body": "Will you have bags? Depending on airlines, delta, for example, allows one carry-on and one personal item per person. Carry on  is a small 20lb suitcase, and a personal item is like a backpack or purse. \n\nIf you're bringing more than 20lb, then you'll need to \"check\" a bag. Take it to the airline ticket desk when you enter the airport. There will be a baggage \"check\" line for your airline. Airlines usually allow bags up to 50lb to be checked. This will be weight. Some airlines allow free bag check, most do not.\n\nIf you don't not check a bag, and take a carry-on through, make it to your gate, and the plane is \"full\" they might make you check your carry-on at the jet bridge.\n\nDepending on the airline, your bag will be brought back to you at the jet bridge (connecting flight) or at the baggage carousel. Just ask the agent where your bag will be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "businessmanzzzzz",
            "body": "Go on YouTube and type in \"[whatever airport you are flying from] walking tour departures\". There will almost certainly be someone with a camera who has just filmed themselves walking through the front door to their gate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CheeseheadDave",
            "body": "Your airline probably has an app. Download it, log in, and find your flight.\n\nTurn on notifications as some airlines will use the app to detect your location so it knows when you're at the airport and keep you notified of what gate you need to go to, boarding delays, etc. It can also pull up your boarding pass for you.\n\nSome are now also sending you a confirmation when your checked bags make it onto the plane and what baggage carousel you need to go to when you arrive to pick them up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gtu160",
            "body": "You didn't clarify if your flying Domestic or International. Domestic you will need a REAL-ID to fly domestic and if traveling International you will need a Passport which can take some time depending on your circumstances. \n\n\n\n\nThe REAL ID enforcement deadline, requiring a REAL ID-compliant driver's license or another federally acceptable form of identification for domestic air travel and access to certain federal facilities, is May 7, 2025. \nHere's a breakdown:\nEnforcement Date:\nBeginning May 7, 2025, you'll need a REAL ID-compliant driver's license or photo ID card, or another form of federally acceptable identification (like a valid passport or military ID), to board domestic commercial flights or enter federal buildings or military installations that require ID\n\n\n\n\nTo clarify if you have a Passport it is good for both Domestic and International travel. \n\n\nAlso if you  hold a Drivers License with Hazmat Endorsement or TWIC Card you can use that for TSA Precheck when going through security (essentially a fast pass to get through the security line quickly)\n\n\nAnd certain Credit Cards may offer TSA Precheck through Enrollment as added benefit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stompedyourhousewith",
            "body": "Bite the bullet and download and sign up for the app of the airline you're taking. It will give you your boarding pass so you don't have to go to a kiosk and print it out and it will give you updates on your flight and if there is a gate change",
            "score": 1,
            "replies": []
        },
        {
            "author": "Future_Importance_",
            "body": "Follow the signs and ask for help if needed. Staff on site everywhere along the way. You got this!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShakeAgile",
            "body": "All staff are very used to questions. Every day there are hundreds of first time flyovers on an airport. You will be in good hands.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guilty_Ordinary1730",
            "body": "Which airport specifically, I know you might now want to dox yourself but we could maybe give specific tips for specific airports.",
            "score": 1,
            "replies": []
        },
        {
            "author": "veggie_saurus_rex",
            "body": "Are you someone who could benefit from visiting the airport and doing all this ahead? I know that, for example, Washington Dulles Airport has a \"Wings for All\" program that lets people with special needs practice all this. I believe many other USA airports have similar programs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JerHat",
            "body": "It’s pretty simple. Depending on the size of your airport, like if it’s a major one, there will be multiple terminals. So make sure you’re dropped off at the proper terminal. Don’t worry, there will be signs directing you to the correct terminal. Like, signs listing all of the airlines with directions to the terminal they’re in. Like Southwest, Spirit, American to the right, Delta to the left, etc. \n\nOnce you’re going in the right direction to your terminal, You’ll want to make sure you’re following the signs to Departures. \n\nThen once you reach your terminal, it’ll be a long stretch of building, and along that building will be a bunch of different entrances, above them will be signs of the airlines nearest to that entrance, slowly drive that stretch and find a spot nearest to your airline. If you don’t live super far from your airport, and are nervous about it, I’d recommend just taking a test drive the day before around the airport to familiarize yourself with where you’re going. \n\nOnce inside, if you haven’t checked in online, you can get in line to check in at the counter, or some airports will have kiosks for you to check in at. \n\nThen go get in line for security.\n\nAfter security, just follow signs towards your gate. \n\nMy best tip if you’re anxious about it, just get there like an hour earlier than you think you should and once you get through security and find your gate, and are confident about navigating to your gate, just go get a coffee or something and relax until it’s time to start boarding.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rotten_maevv",
            "body": "One of the best things that I did was look up videos of my specific airport. Where the parking is, the layout, all that good stuff you can find on YouTube. You’ll get a little bit of a look at the airport you’re landing in, but you’ll also probably want to watch some videos on that one too. This is what made me feel very relaxed as I could see what the inside of the airport looked like and security without going to the airport",
            "score": 1,
            "replies": []
        },
        {
            "author": "LolthienToo",
            "body": "FYI, for your first flight I would definitely get paper tickets or print outs. It's so much easier to handle, and you don't have extra shit on your phone.\n\nIf you aren't an old fogey like me, and you do want to use your phone because you live in the modern era, make sure you turn off auto-rotation on your phone screen. It's such a pain in the ass when you have to turn your phone upside down to scan the code and the auto-rotate resizes the barcode or moves it off the screen.\n\nI use paper because I can just beep through and when I sit down I can throw it away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jgacioch",
            "body": "Just wanted to chime in with some extra advice. Make sure you eat a bit and stay hydrated. I get a bit of travel anxiety sometimes, which can make it hard to eat. \n\nNot eating or being dehydrated makes my airsickness much worse. I do my best to either bring some snacks or just bite the bullet and buy some overpriced airport food. I also normally take some Dramamine to help with the motion sickness, but that's not a necessity unless you normally get motion sick.\n\nGood luck!",
            "score": 1,
            "replies": []
        },
        {
            "author": "atastyfire",
            "body": "Here are 10 thorough steps for you to follow:\n\n1. Before you even book a flight, make sure your passport is current. You’ll also want to identify any requirements for entering your destination (visas or anything similar) and handle those.\n\n2. Book a flight through your website/agency of choice. Look at the departure/landing times/dates and keep in mind they may be in a different time zone from your current one. You’ll also want to identify how much luggage you’re cleared to bring for free and how much you’ll have to pay for when booking your flight. Make sure you pay attention to what you can put in your luggage and what you can’t put in.\n\n3. You may also want to arrange for other necessities such as transportation and cellphone service at your new location. You can usually get them at the airport but you may need to make reservations.\n\n4. About a day prior to your departure, you can generally check in online through a link provided to you and get your boarding pass emailed to you. On the day of departure, make sure you have your passport. I recommend arriving to the airport 3 hours prior to your departure time to give yourself some time to account for check in, security and finding your gate. Make sure you are at the right terminal because some airlines have multiple terminals for domestic or international flights.\n\n5. When you arrive to the airport, the first thing you’ll do is check in. This is where you line up at your choice of airline’s desk and check in your luggage and can get physical boarding passes. Your boarding passes are the actual tickets which will get you on the flight.  “Checking your luggage” means the airline will transport your luggage in the bottom cargo of the aircraft. “Carry on luggage” is luggage you bring with you to place in the overhead compartments/under the seat in the flight. Large suitcases and bags are checked in. Backpacks and small suitcases are often carried on. When you are checking in luggage, they will weigh your luggage and put tags on them before putting them on a conveyor belt. Keep any tags/tickets they give you. Checking in is one of the two things that can take a lot of time.\n\n6. After checking in, you have to head to the security checkpoint. This is the other part where it can take a bit of time. Get in line and do what everyone else is doing or what the signs/guards are telling you to do. Typically, you’ll take off your shoes, remove your jacket, remove all items from your pockets and put them into trays. If you have any carry on luggage, you’ll also put them into a tray. Sometimes you will need to remove any laptops/tablets from your carry on luggage and place them into the trays as well. You’ll then walk through a metal detector body scanner thing.\n\n7. After you get through the body scanner, you will have to grab your items from the trays. Sometimes they will do a more thorough inspection of your carry on luggage and request you to open the luggage. Simply show them what is in your luggage and then when you are cleared, you can take your stuff back and put on your shoes/jacket. \n\n8. Find your gate. It should be on your ticket. You can also cross reference your gate on the ticket with one of the many departure screens at the airport which displays flight info to see if anything has changed. For example if your ticket says Flight UA882, look at the screen for UA882 to see if it matches your ticket. The screen will also usually show the most up to date info on your flight so you can see if it’s been delayed or the gate has changed. You should check these screens periodically so you know if anything has changed.\n\n9. Flights will usually begin boarding about 30-45 minutes prior to the departure time. Flights will also close their doors much earlier than their stated departure times. Once their door is closed and you are not on the flight, they will not open for boarding again which means you missed your flight. The departure times are when the flight is expected to depart which means the few minutes prior to it where the doors are closed will be for pre-flight checks and taxiing. Flights usually break boarding up in sections or groups. When they call your group, you can line up for boarding. Your ticket will have the boarding group you’re in. You will need to scan your boarding pass prior to boarding. Your ticket will have your alphanumeric seat number such as 33B. The number represents the row and the letter represents the seat in that row. Find your seat and put any carry on luggage you have into the overhead compartments above it. Sit down, buckle in your seat belt and put your phone on airplane mode. After boarding is complete, the flight attendants will do a pre-flight safety brief. The flight will take off shortly afterwards.\n\n10. After your flight lands and begins taxiing on the runway, you can switch your phone off airplane mode. Wait for the seatbelt sign to turn off before grabbing your carry on luggage from the overhead compartments. After you get off, make your way to baggage claim by following the posted signs. Find the carousel marked with your flight number and wait for your luggage to show up. Grab your luggage and follow signs for exit. You may need to show receipts for your luggage as proof it’s yours. Once you exit the baggage claim area, you can now go get the necessities you may need such as portable Wifi box, eSim card, car rental, etc. Otherwise you can get transportation out of the airport any which way you need.",
            "score": 1,
            "replies": []
        },
        {
            "author": "destinyofdoors",
            "body": "Hokay, so. Here's the deal (from someone who has been flying since infancy, and has worked in airports for five years):\n\n1. About 24 hours before your flight, you will get an email and/or a text from the airline reminding you to check in for your flight online. If you have the app for your airline, you can use that (I see you are flying United, so their app is pretty user friendly), or you can use a regular browser. If you are checking in on the browser, you will probably need your confirmation number, which should be in the email you got confirming your booking. If you checked in on the app, it will give you a digital boarding pass. If you checked in on the browser, it will enable you to print a boarding pass at home.\n2. Make sure you are packed correctly - there are things that can't go in carry-on bags and have to be sent in checked luggage. Check [TSA's guide](https://www.tsa.gov/travel/security-screening/whatcanibring/all) for some commonly asked about items. Of particular note, any liquid or gel or paste or spray more than 3.4 oz is not allowed in your carry-on, so if you have a water bottle, it needs to be empty before you go through security \n3. Once you get to the airport, if you are checking a bag, didn't check in online, or need to get a boarding pass printed, look for the ticket counters, which are usually right in the entrance area. If you don't need to do any of those things, you can head straight to the security checkpoint. Depending on the setup, you may need your boarding pass, but you will definitely need your ID ready.\n4. At the checkpoint, you will need to remove your shoes, jacket, and anything in your pockets other than air and dryer lint. It's also recommended to take your belt off unless it will cause you to lose your pants. You may need to take stuff out of your bag to be x-rayed separately, but that depends on the airport and what equipment they are using. Pay attention to the instructions the security officers are giving and you should be all set for that airport's setup.\n5. You will go through a body scanner, and any areas that the scanner flags, an officer of the same gender will pat down. At the same time, your stuff is going through the x-ray. If there is anything that is possibly an issue, the bag will get pulled aside to be searched (you'll see it on the other side of the x-ray rollers from the rest of the bags). If that is necessary, the search will be done with you present, generally in the order the bags were pulled.\n6. Once you've collected your belongings, there should be screens nearby with gate assignments. Find your flight on there and make sure you are going to the right gate. Depending on the airport, you might need to take a tram or a shuttle to the gate area.\n7. Once you have located the gate area, you are free to relax until you are called for boarding (this usually starts about 39 minutes before the scheduled flight time). Your boarding pass will list a boarding group - the gate agent will call the groups one or two at a time, and when you hear yours, line up to board. They will scan your boarding pass to make sure you are getting on the right plane, and may ask you to gate check your bag (particularly if you are in a later boarding group, space for carry-ons might get full). This can take one of two forms. They may put a (usually colored) tag on it and have it brought up to the jet bridge when you land, or they may print a normal baggage tag out and send it like a normal checked bag, in which case you will get it from the baggage claim carousel at your destination. Important note: If you have a connection (you are changing flights before getting to your final destination), the first type of gate check sees you picking up the bag as you get off the plane in that intermediate airport, while the second will reunite you with it at the final stop.\n8. Once you board the plane, find your seat put your carry-on bags either in the overhead bin or under the seat in front of you, and buckle your seatbelt.\n9. Have a safe flight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "odinskriver39",
            "body": "TSA-PreCheck or better Global Entry. Get it. Put your Known Traveler Number in when buying the airfare. Waltz thru the quicker security line and customs.  \n\nWe hate phone Apps but using them for travel /airlines/ airports/ hotels/ guides/ rides has been very helpful. \n\nTravel is comfortable and convenient if you're prepared , packed sensibly, patient & polite and use situational awareness for safety.",
            "score": 1,
            "replies": []
        },
        {
            "author": "peds4x4",
            "body": "Check your passport now against the country you are flying to. ( UK Gov website)\nAs most countries even if your passport is valid today it often needs at least 6 months before expiry or you may be turned away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tantalicatom689",
            "body": "Well kiddo, first we got to let them know we’re here by checking in. The desks for that are labeled by airline and by domestic/international flights. That’s where we give them our big bags too, they put them in a special carriage under the the floor of the plane.\n\nNext we have to go through security. They check to make sure no one’s bringing on dangerous stuff. It’s a bit of a process, but they navigate us through  it pretty well.\n\nThen we walk to the gate labeled on our tickets and wait for them to tell us to board! Bing bang book all done.\n\nWhole thing takes time so we’re going extra to be there a few hours before our flight. You never know how long the lines may be! Better to sit around and wait then risk missing our flight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Ladder7740",
            "body": "Lots of good advice on this thread but the main thing is if you turn up in plenty of time, show patience, follow instructions, and ask when you are unsure then you will be fine. Airports are teeming with staff who are there to help you get on your flight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aeron_311",
            "body": "Different airlines fly out of different terminals. Make sure you find the right terminal.\n\nShow up two hours early.\n\nYou can check in online 24 hours ahead of departure, or there in-person at a kiosk.  I like to write the flight confirmation no. on a sheet of paper in case I need to refer to it, or if the kiosk doesn't like scanning your documents. You will get a boarding pass. If you are checking luggage, you will be directed to the luggage desk. Check for your gate number on the pass and screen. It might not yet be available, but check the TV screens on the walls frequently in case of delay. The screen is more correct than the pass.\n\nLiquids go in your checked luggage, not your carry-on. No knives beyond cartridge disposable razors allowed through security. No drinks/water. Refill a bottle post security. Airport snacks are very, very expensive. If you want to, get a dry snack the day before your flight and pack it. Firearms must be in checked luggage in an approved case. Flammables are not cool either. List of approved or not approved items here: [https://www.tsa.gov/travel/security-screening/whatcanibring/all?page=30](https://www.tsa.gov/travel/security-screening/whatcanibring/all?page=30)\n\nCarry as few items in your pocket as possible. put them all in your carry on and/or backpack ahead of security. Airports do not like tablets/laptops in your carryon/backpack. They will ask you to put that in a bin/tray separately. Make sure the laptop or tablet is easily accessible so you can remove it. TSA will ask to see your photo ID and boarding pass, so those are the two items you should have ready.\n\nThere is likely going to be a camera that will take a picture of your face and compare it to your ID, or you can kindly request \"no photo please\" before you hand over your ID, and they will visually verify you match your ID.\n\nYou then go through security and remove your shoes, belt, and jacket and place them in a bin alongside your carry on or backpack/personal item. Those will be X-rayed. They will have you stand in a body scanner.\n\nThe airplane might be a little chilly. I advise wearing a second layer like a light jacket. Good wired earbuds for in-flight movies on the seat screens. Keep a cell phone charger or power bank handy somewhere so you can charge on the plane or in the airport.\n\nMake your way to the gate. Boarding ends a handful of minutes before the departure time. Check your boarding pass regarding when boarding actually ends. Not departure time.\n\nGet a drink or snack as you wait. Eventually, you will board in different boarding groups. Your pass will indicate which group. You will present your boarding pass to the gate agent, and will make your way to your assigned seat that should be on your pass. Carry-ons go in the overhead compartments above or near your seat. Personal items/backpacks can go under the seat in front of you.\n\nListen to flight attendant instructions regarding flight procedures. You will be fine.\n\nWhen you land, do not immediately stand up and make your way to the front. Wait until most of the people in front of you have/are offboarded.\n\nMake your way to baggage claim, posted on the airport signs. Baggage usually gets there within 15 mins of landing. Might be delayed. Check the baggage claim screens to see which carousel is the one for your flight and claim it from the carousel.\n\nThen you can either make your way to the car rental counters, public transportation/uber pick up spots/taxis, or passenger pick ups. If you are being picked up, the various columns outside should have numbers on them to help whoever is picking you up locate you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JAParks",
            "body": "Eli5 there will be plenty of signs. Just make sure you get there early enough and you research which part of the airport you need to start from. Also don’t forget any travel docs you’ll need",
            "score": 1,
            "replies": []
        },
        {
            "author": "jaysire",
            "body": "I don’t want to be too much of a smartass, but this sounds like the prime candidate of a question to ask ChatGPT or similar. What makes it so powerful is that you can ask a million follow-up questions and the discussion will move in the way and direction you want. \n\nAnd yeah, yeah, it can hallucinate and be inaccurate, but honestly it really feels like alarmists are blowing that issue way out of proportion. Just be mindful and consider the answer. Double check if it feels implausible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "GoBlu323",
                    "body": "Chat GPT responses are specifically banned in this sub. If OP wanted an AI answer they’d ask AI.\n\nDon’t karma farm with AI",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LittleBlueCubes",
                            "body": "Okay. Will delete.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Noman_Blaze",
                    "body": "OP. This is basically the standard procedure at every airport. I have travelled to 3 different countries using 5 different airports. The process was exactly the same on all 5 including my home country.\n\nSome airports now have eye scan gates. So you don't even go through security. Simply scan your eyes and passport and voila. One of the examples is the Dubai airport.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WheezyGonzalez",
                    "body": "Want to add that your gate number should be on your boarding pass as well. The screens are good to check for last minute gate changes (especially if you do not have your airlines app installed)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "redskins78",
            "body": "In USA - why do so many people check in stcthe fate? Is it to beg for class upgrade? How does that work? If I rarely travel (so no “miles” with airline) so I be checking in at gate too?",
            "score": 1,
            "replies": []
        }
    ]
}