{
    "title": "ELI5-Why do some types of bird have clear features to tell genders apart but others don't?",
    "author": "Ok-Yesterday4633",
    "subreddit": "explainlikeimfive",
    "rank": 8,
    "score": 20,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/explainlikeimfive/comments/1je8upo/eli5why_do_some_types_of_bird_have_clear_features/",
    "id": "1je8upo",
    "selftext": "Why do male and female crows look so similar, same with seagulls, but birds like ducks and cardinals have very different coloring to tell the sexes apart? ",
    "comments": [
        {
            "author": "heyitscory",
            "body": "The birds with sexual dimorphism had evolutionary pressures to do so.\n\n\nThe birds without it did fine, or did better without it. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "helloiamsilver",
            "body": "It’s important to remember that “birds” is a very large category of animals. There’s as much diversity among all birds as there is among all mammals. This is kind of like asking why do deer have antlers to tell the sexes apart while male and female squirrels look the same. They’re very different animals with different evolutionary processes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mabunnie",
            "body": "Just chiming in to add to what will be better explanations:\n\n\nBirds can see colors we can't. There are a bunch of animals that may look drab or samey to a human, but nah. The colors bro. The colors.",
            "score": 1,
            "replies": [
                {
                    "author": "I_Am_Robert_Paulson1",
                    "body": "I came here to say this. Sometimes, if you look really close, you'll see a dull shimmer in certain birds' feathers when the light catches them the right way. That doesn't look like much to our human eyes, but if you were a bird, you wouldn't be able to look away.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Umikaloo",
            "body": "Birds with highly distinct features tend to either have highly distinct roles, or some sort of courting ritual that incentivises that look. Male and female eagles look almost identical since they both do eagle things. They both roost, they both search for food, etc.\n\nChickens on the other hand, have distinct gender roles, where one will be in charge or rearing young, while the other defends the flock while competing with others.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jorost",
            "body": "Female blue jays and male blue jays look just the same. They are members of the family *Corvidae* just like crows, ravens, and magpies. Corvids are sexually monomorphic, meaning there are no distinct visual differences between males and females. (Males are often larger, however.)\n\nIn sexually dimorphic birds (where males and females look different), most often it is the case that males have more colorful plumage, usually for attracting mates, and the females have more \"plain\" or earth tone colored plumage to enable them to hide themselves and their young from predators.",
            "score": 1,
            "replies": [
                {
                    "author": "Naraee",
                    "body": "Additionally, in sexually monomorphic birds, their courtship rituals tend to be acrobatic and/or involve gifts since they don't have fancy plumage to go off of. It's almost always the male that initiates and the female picks--kind of like humans!\n\nFor blue jays and Steller's jays, the males bow to the females and give her gifts of food and nesting materials. If she likes it, they're mates for life.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ok-Yesterday4633",
                    "body": "I had to change it because you are right, male and female blue jays are identical. For some reason, I thought female blue jays had muted colors. Thanks for pointing that out and your comment!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Jorost",
                            "body": "Were you thinking of cardinals? They are definitely dimorphic!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "flippythemaster",
            "body": "Its a very complex topic and depends a lot on the particular species you’re discussing, but I do know that in the case of geese, they mate for life so it’s pretty important to get the sex of your mate right. \n\nDucks on the other hand don’t mate for life, so I don’t think that applies there.\n\nAlso, this is the quibbliest of quibbles, but I don’t think it’s quite correct to say “gender” for animals. They don’t have the concept of gender identity, so it’s okay to refer to their biological sex as, well, “sex”. Which is different than “gender”.",
            "score": 1,
            "replies": [
                {
                    "author": "Ok-Yesterday4633",
                    "body": "Yeah, I thought about that after the fact. This question just came to me suddenly and I didn’t have much luck finding an answer online so I wanted to post it before I forgot it. I changed it in the description, I don’t think I can edit the title unless I’m doing it wrong. Thanks for the comment!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ocelot_piss",
            "body": "That's just how they have evolved. There is never a why to these questions.\n\nYou'll find most/all of the corvid family have very little sexual dimorphism. Then again they are very intelligent birds and I'll speculate that they don't need it to be able to tell or communicate male and female apart.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unique_username1",
            "body": "Typically, obvious gender differences like colorful and large plumage is designed to show off and attract a mate. This is similar to antlers on elk or horns on sheep used to fight over mates. \n\n  \nThis is a bit of a strange adaptation when you think about it - on one hand it doesn’t seem like it benefits the individual or the species on the whole to put so much energy into these showy body parts, let alone \\*fighting\\* and potentially getting hurt, when that energy could be used for each individual to just be healthier or stronger or take care of their young better.\n\nOn the other hand it does sometimes result in the strongest/healthiest genes being passed down, and it certainly results in the flashiest, most aggressive or most “attractive” genes getting passed down. So if flashy mating displays are a common trait in a species, every member of the species basically needs to compete in that way or risk dying out.\n\nBasically these traits do not actually help a species on the whole in all cases, but the traits tend to get passed on anyways. So it’s not clear if you expect a really colorful or different-looking bird to actually be a successful survival strategy or not, and sure enough, sometimes it works out and becomes a prominent trait, sometimes it does not.",
            "score": 1,
            "replies": []
        }
    ]
}