{
    "title": "Have a question about the game or the subreddit? Ask away!",
    "author": "AutoModerator",
    "subreddit": "2007scape",
    "rank": 0,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 39,
    "url": "https://www.reddit.com/r/2007scape/comments/1jdrtfh/have_a_question_about_the_game_or_the_subreddit/",
    "id": "1jdrtfh",
    "selftext": "# Welcome to the daily /r/2007scape question thread!\n\nYou can ask anything about Old School RuneScape here. They are designated for you to ask anything you like that is relevant to the game or this subreddit. Remain respectful to your fellow 'scapers when answering questions; there are stupid questions, but it does not mean you should not be respectful whilst answering them.\n\nKeep in mind that *this is not a developer Q&A thread* - questions for the game developers should be posted in developer Q&A posts.\n\nClick [here](https://reddit.com/r/2007scape/search?q=author%3AAutoModerator&restrict_sr=on&sort=new&feature=legacy_search) to view the archive of /r/2007scape \"ask anything\" threads.",
    "comments": [
        {
            "author": "SniperSly",
            "body": "So I've been watching a lot of osrs videos lately and been thinking of playing myself sometime soon but one thing I've encountered confuses me to no end, splitting raid loot. How did this come about and what are the rules behind it, like what if I get a high value item that I want to keep to use, do I just have to pay everyone else a fee or something, what if I don't have that kind of money am I just forced to sell it otherwise I'll be labeled a scammer? If that's the case what's even the point of everyone getting their own loot if you just have to share with everyone else",
            "score": 2,
            "replies": [
                {
                    "author": "skullkid2424",
                    "body": "> like what if I get a high value item that I want to keep to use, do I just have to pay everyone else a fee or something, what if I don't have that kind of money am I just forced to sell it otherwise I'll be labeled a scammer?\n\nAssuming your group has agreed to split, then yes - you would be expected to pay an equal share to each person in the group. If you don't have that on hand, you would sell it so you can pay the split. You wouldn't have the item, but you would have a portion of the split, and you can buy the item after several splits.\n\n> If that's the case what's even the point of everyone getting their own loot if you just have to share with everyone else\n\nNot everyone splits. FFA is the other common method, where everyone keeps what they get, but you don't get anything when someone else gets a good drop. There are also other gamemodes, like ironmen - who can't trade with other players, and therefore only can get the item if it actually drops in their name. Note that they can use a second unrestricted account to \"split\" for any drops in their name.\n\nAlso note that most new accounts won't be raiding for quite some time. The leveling *is* the game, unlike other MMOs where you speed through leveling because max level is the game. So probably not something you'll need to worry about for quite some time.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "2-2-7-7",
                    "body": "you typically agree on either splitting or FFA (free for all) before starting the raid.  FFA is standard if you're raiding with randoms, or someone with an ironman that can't afford to pay you a split\n\nif you agreed to splitting and get something you want to keep, then you're expected to still give your teammates their share worth of the value",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "alynnidalar",
                    "body": "There's two approaches, splitting and FFA (free for all). With FFA, everybody keeps whatever drops they get. If someone gets a great drop and you don't, too bad, but also if you get something good, you can keep it. So you _can_ sometimes find groups that will do drops this way.\n\nSplitting works the way you describe. If someone gets a unique (potentially over a certain value, depending on the group), then yes, they are expected to sell it and split the money evenly between the group.\n\nThis might seem like a bad deal if _you_ get a good drop, but consider the reverse: if you're raiding with someone else who gets a unique, _you get a lot of money_ even though your own drop wasn't worth much. And money can be exchanged for goods and services. That is, save up the money from a few splits and you can just buy that thing you wanted outright. You can earn enough money from splits to buy it without ever actually getting the drop yourself, even.\n\nSplitting basically just evens out the RNG. If anybody in the group gets lucky, the whole group gets paid. So it doesn't matter so much if you go dry, as long as someone else in the group doesn't.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheDinerIsOpen",
            "body": "I created a new ironman account but I actually want to try HC. I want the name from the first account though, is that going to cost me a bond and force me to wait 35 days? \n\nI have a Jagex account, I’m not sure if the name is reserved to the character or to my Jagex account. \n\nIf it’s going to cost me a bond and make me wait 35 days I’ll probably just skip creating a HC till later",
            "score": 2,
            "replies": [
                {
                    "author": "DivineInsanityReveng",
                    "body": "The name is reserved to the character, not the jagex account.\n\nYou can double name change to have the name available instantly, which is 1 name change for free (if member) and 1 for a bond (otherwise 2 bonds). Then the new account can use the new name. Or you can name change and wait a month up to 90 days till the name is no longer reserved (should be more like a month if it's a new account)\n\nThere is a risk the name gets sniped in this time, if it's a rare low character name I would not risk this.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "2-2-7-7",
                    "body": "names are tied to the character, and unfortunately there's no mechanic that lets you move it directly from one to another\n\njust gotta change it on the first account, wait long enough for it to become available (or double name change), hope some bot doesn't snipe it, then set the name on the other account",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheDinerIsOpen",
                            "body": "Thank you. Can an F2P account do a name change or will that still cost me a bond? Sorry for the basic questions",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "2-2-7-7",
                                    "body": "no worries. f2p can't change names for free, so it'd cost a bond if the regular iron isn't a member",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "TheDinerIsOpen",
                                            "body": "Ok got it, thank you!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "meirionh",
                                                    "body": "I know this isnt very helpful, but Jagex have floated the idea of allowing name swapping between your own Jagex Accounts for a while now, so it may happen in the next few months, but you could also be waiting years, there's no way to know how high a priority they have for it",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bennn470",
            "body": "Can someone explain in detail how tick eating works? I’ve read stuff on wiki / watches videos but it’s not clicking for me. \n\nFor example, in fight caves when a mager shoots his attack can i tick eat any point the projectile is in the air or is it the tick before it hits me. Furthermore, I’ve been trying to tick eat the orb attacks in Warden phase 1 and can’t figure out timing and die lol",
            "score": 2,
            "replies": [
                {
                    "author": "DivineInsanityReveng",
                    "body": "For the *most part* you can tick eat standard mage and range attacks at any point after the animation starts.\n\nThe idea of tick eating is this:\n\n* Monster begins attack\n* Monster checks your current HP, and decides it's max hit based on that.\n* Monster rolls damage (0-Your current HP)\n* During this animation you eat a shark. Your current HP is now Current + 20.\n* The monster ends up max hitting you, which reduces your HP by what was your previous current HP. Leaving you on 20 HP.\n\nThis is why you can't tick eat melee attacks, as the animation is instant, and damage is calculated in the same tick it's applied to you (so you have to do incredibly more complex stalls to regen-tick eat and such, which isn't important here).\n\nNot all monsters and not all attacks can be tick ate. Some monsters have projectile based damage, so the tick eating window is either non existent or much smaller. For example you can tick eat the Soteseg big ball attack at the very last game tick before it registers. Any earlier and it's still able to 1 hit you.\n\nI don't know personally if you can tick eat the Warden P1 balls. I assume they could possibly work the same as Sote though.\n\nSome things like Zuk attacks and PvP damage can \"overhit\" where they do not care about your current max HP (and in the case of Zuk, jt can hit well over your max HP). This makes tick eating this damage in the traditional way impossible",
                    "score": 2,
                    "replies": [
                        {
                            "author": "bennn470",
                            "body": "Thanks!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Clueless_Otter",
                    "body": "You have to eat the piece of food *after* the attack rolls its damage (which for older mobs is the start of their animation but for newer mobs might be when the projectile hits you) but *before* (or at the same time) that damage is applied to your hp (which is basically always when it visually hits you). So in something like fight caves, damage is rolled for non-Jad, non-melee mobs when they start their animation, so you simply have to eat in the large window between when their animation starts and when the projectile hits you. If damage is calculated at the same time its applied, like on many newer mobs or Sotetseg or something, then you have to eat on the exact tick the damage hits you.\n\nFor Warden p1 balls specifically, you generally do really finnicky stuff with rapid heal or locator orb+redemption since you probably have Dehydration on if you're at an invo level where you'd need to tick eat. [See video](https://www.youtube.com/watch?v=RwuzLbKKioM). If you aren't at that high of an invo level you shouldn't really need to tick eat tbh, you're making mistakes elsewhere if you find you do. But you can if you really want, you just eat immediately before the ball damage impacts your hp, same as usual. If I had to describe the exact timing, it's basically when the big ball is like.. mostly \"inside\" your character but the ball itself is still visible. It's just something you have to practice tbh. Just run regular a 10 (turn Ancient Haste on so you don't have to wait forever for the balls) and rush to Warden. You'll get Honey Locust every death to practice with.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "bennn470",
                            "body": "Got it, thanks!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ermac81",
            "body": "If I upgrade my account to a Jagex account, will runelite remember all my settings when it's opened through the Jagex Client? As in profiles, bank tags, ground markers, Menu Entry Swapper changes etc.",
            "score": 2,
            "replies": [
                {
                    "author": "Clueless_Otter",
                    "body": "Yes. The Jagex Launcher just opens the RuneLite file on your computer in the same place that you'd be opening it manually. \n\nIf you're *really* paranoid, you can sync RL with a Google Account and then it'll upload your settings to the cloud and download them anywhere you use RL. Or you can use the \"Export profile\" button on the Profiles Tab (next to the Plugin Hub tab), save that file wherever, then import it to any other copy of RL. \n\nBut again, for just a Jagex Account upgrade it will just work without doing any of this. This is just if you were really paranoid about losing your settings from something like a whole new computer or a hard drive reformat or something.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ermac81",
                            "body": "Wow thanks for the response. Super helpful :)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Peechez",
                            "body": "> If you're really paranoid, you can sync RL with a Google Account and then it'll upload your settings to the cloud and download them anywhere you use RL.\n\nYou should do this anyways tbh. Never know when you'll have to do a surprise reformat or whatever",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nyquiiist",
            "body": "First time doing tormented demons. For my range switch, I have a DCB as the heavy / slow wep, what should my \"regular\" range wep be ? Dont have a Tbow or a scorching bow. I have heard the blowpipe isn't that good here. What are my options ?\n\n  \nEdit: Just looked up a few guides and magic seems like a viable option as well. Perhaps I can try Melee / Magic instead of Melee / Range.",
            "score": 1,
            "replies": [
                {
                    "author": "Clueless_Otter",
                    "body": "Magic is better than ranged so long as you have a reasonable magic level. It's just more expensive to use.\n\nBut blowpipe is very good on the 100% accuracy phases. The rest of the time your DCB is fine tbh if you don't have tbow/scorching bow/bowfa. Atlatl might also be worth considering.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "skullkid2424",
                    "body": "I'd highly recommend using magic until you get a scorching bow. Blue moon chest/legs are great hybrid pieces so you minimize switches. Blue moon staff can autocast demonbane spells. Casting mark of darkness is annoying, and it eats through fire runes soooo fast...but the damage is better than ranged.\n\n* Camp slayer helm, bllue moon chest/legs, aranea > dragon boots, zerker ring, blessing, maybe barrows gloves\n* Melee swap: Arclight, defender, fire cape, rancour>torture>fury, optionally ferocious gloves\n* Mage swap: Blue moon staff, MA2 cape, occult, optionally torment\n* Melee punish (on crush!!!): Dharoks axe > dragon 2h > godsword \n* Melee spec weapon for when the flames on their back goes out and you have 100% accuracy: Burning claws > abyssal dagger > dragon dagger\n* No mage punish\n* Runepouch with runes for mark of darkness, demonbane, and thralls.\n* Keep the ranged thrall up - as overheads will block the thrall hits. Theres also a small chance it will be the final hit and the TD will pray ranged, so you can continue using arclight\n\n\nTDs are pretty easy to learn. The punish mechanic and the flames going out are rewarding extra effort, but not punishing if you miss out - so you can honestly ignore them and do just fine. Its definitely worth doing the punish mechanic with a dharoks axe whenever it comes up. Make sure autoretaliate is off and be sure to switch your defense prayer first, *then* figure out the punish. Also note that the shield goes down after the very first attack - so you can punish at the start of the fight.\n\n\n\nOnce you get a synapse, the scorching bow is a fantastic pickup. It does solid damage, but it also makes TDs less annoying since you don't have to deal with mark of darkness and you can bring a ballista/crossbow (not on rapid!) so you can hit every punish. Not to mention it makes zammy in GWD almost trivial.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "againgoagaingoagain",
            "body": "Are Australian servers cosmetic or should I be getting decent ping playing on them? If cosmetic, is tick based training/prayer flicking etc possible for a high ping player?",
            "score": 1,
            "replies": [
                {
                    "author": "bip_bip_hooray",
                    "body": "there was a period where they were being routed through the u.s. for ddos prevention but that is no longer the case afaik\n\nping STABILITY (jitter) is much more important than actual ping for prayer flicking",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Prior-Fun5465",
                    "body": "Assuming you get decent ping on Australian servers that aren't OSRS, they're probably cosmetic. Flicking should be possible, but you'll have to compensate for the latency.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "alynnidalar",
                    "body": "Shouldn’t be cosmetic, no.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fluffynuckels",
            "body": "What clothing items in the game allow me to show off the most skin?",
            "score": 1,
            "replies": [
                {
                    "author": "alynnidalar",
                    "body": "Male or female character?\n\nBCP and the dwarf shorts are probably a good place to start.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "fluffynuckels",
                            "body": "My avatar is male but I will change it if need be",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "velon360",
                                    "body": "Gonna do some GE begging or is your clan crazier than mine?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "fluffynuckels",
                                            "body": "Just doing some fun fashion scapeing",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kingcrackerjacks",
                    "body": "https://oldschool.runescape.wiki/w/Shorts_(yellow) or https://oldschool.runescape.wiki/w/Anti-panties\n\nhttps://oldschool.runescape.wiki/w/Verac%27s_brassard\n\nhttps://oldschool.runescape.wiki/w/Tribal_top_(blue)\n\nhttps://oldschool.runescape.wiki/w/Woven_top_(brown)\n\nhttps://oldschool.runescape.wiki/w/Graceful_top_(Varlamore)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "fluffynuckels",
                            "body": "Looks like it's time to do more agility unfortunately. But may your rng be blessed today",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "After-Vermicelli7871",
            "body": "Hey guys. I lost my backup codes but cant generate new ones. Do i have to disable autenthicator to generate new ones?",
            "score": 1,
            "replies": [
                {
                    "author": "Throwaway47321",
                    "body": "You should just be able to hit the “generate new codes” button. Do you actually a 3rd party 2fa active or is it set to your email?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "After-Vermicelli7871",
                            "body": "I do not use any autenticathor other than codes on email",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Throwaway47321",
                                    "body": "Okay so you won’t even have backup codes until you enable something like Google Auth. \n\nBackup codes only let you bypass 3rd party 2fa.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "After-Vermicelli7871",
                            "body": "But cant seem to find generate new codes",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}