{
    "title": "Redditors with depression, what helps you keep going?",
    "author": "asharhileigh",
    "subreddit": "AskReddit",
    "rank": 18,
    "score": 95,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 502,
    "url": "https://www.reddit.com/r/AskReddit/comments/1jeer9s/redditors_with_depression_what_helps_you_keep/",
    "id": "1jeer9s",
    "selftext": "",
    "comments": [
        {
            "author": "looneybin55",
            "body": "Death is eternal. Death is the opposite of life. Therefore, we were dead before we were born. We were dead for trillions of years before and will be dead for trillions after.\n\nWhat’s another 40-60 years of life in retrospect to trillions?\n\nDeath is guaranteed, so fuck it, might as well see what happens. It’s not like it can get worse than this, and if it’s does, oh well.. I’ll be dead in less than a century anyways",
            "score": 294,
            "replies": [
                {
                    "author": "BeachBoyZach",
                    "body": "I want to step foot in as many foreign countries as possible before the day that I will inevitably become maggot food\n\n (or cremation dust if there will even be people who will care enough about me to have me cremated)\n\nSome people are content with having a mundane existence and being in the US forever. I AM NOT ONE OF THOSE PEOPLE",
                    "score": 27,
                    "replies": [
                        {
                            "author": "r6sweat",
                            "body": "Being in the US doesn’t mean mundane. Just different values and carrying levels of responsibility and what’s important in your life vs others. Best wishes to you and your goals. Much love.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "BeachBoyZach",
                                    "body": "I DON’T WANT TO BE STUCK IN THE US UNTIL THE DAY OF MY DEATH\n\nI want to fulfill my specific international bucket list aspirations",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "r6sweat",
                                            "body": "Right. As anyone else does. Just clarify just because someone stays in this great country does not make their existence mundane. It may in your eyes. But many people have different life goals than you. God bless.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "rSlashWtfh",
                                            "body": "Come to Canada! We will accept you <3",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BeachBoyZach",
                                    "body": "I DON’T WANT TO BE STUCK IN THE US UNTIL I’M 65 YEARS OLD DUE TO FINANCIAL CONSTRAINTS\n\nThere *are* 194 other nations that do exist, ya know?",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Daniels998",
                            "body": "Come to Italy we are lovely people",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BeachBoyZach",
                                    "body": "Awwwww\n\nMy uncle’s wife’s brother is having a destination wedding in Italy, and Italy is definitely a bucket list destination for me",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Daniels998",
                                            "body": "I love talking and helping strangers. Many people are like me. We are the one looking at strangers and always smiling. Come looking for us we are all around the world :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "warpus",
                            "body": "> I want to step foot in as many foreign countries as possible\n\nEach time I travel to some new and in some way foreign to me place, I learn more about the world and more about myself.\n\nLast trip took me to Taiwan, it's such a unique culture and such an interesting look at the world.  Also really cheap, really safe, progressive, modern, and it just makes you think about some things in life you took as rock solid fact..  You see a different approach to life in the most minute of ways and scenarios, and it can lead to significant realizations.  \n\nIt's relaxing to take in new cultures and alternate approaches to life in a way.  It shows you that there is another way, in a way you might not have been expecting.  It shows you new options.  I think it helps you get through life a bit easier, as you're able to tackle the issues in front of you from different angles instead of just always the same 2 dimensional attack from the back.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WhatWouldPicardDo",
                    "body": "This is the right answer.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Low_Vegetable_3117",
                    "body": "Honestly that's really smart. I wish you good luck in the future 💪",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "nedryerson77",
                    "body": "I was trying to put the words together in my head today.  This is literally it.  Thank you.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Jazzlike-Antelope202",
                    "body": "My brother death is not the end. You will be brought into account for your actions and then sentenced to either paradise or fire. I am only giving a clear warning that Islam is the only way of life acceptable by God.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sweet-Competition-15",
                            "body": "That is why *I do try* to live a Christian existence...I frequently fail, but pray that God will be merciful.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ndundu14",
                    "body": "This is beautiful 🙇🙇🙇",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PsychologicalAide300",
                    "body": "If I had awards I would give you one. That is perfect.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bilusional22",
                    "body": "“Death is guaranteed, so fuck it, might as well see what happens” the literal only reason I keep going most days.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Sorbet-Same",
                    "body": "This is so pessimistic that it’s optimistic",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Professional-Most718",
                    "body": "If death is eternal, how were we dead before we were born? Following that logic, when we were born we became undead, giving death an end, hence making it transient",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "common_grounder",
                    "body": "Nope, death is not eternal. We've all been here numerous times in various incarnation and dimensions, you just don't remember that in your present one. But that's okay and by design. You wouldn't be doing the work you came here for with the distraction of those memories.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "tellitothemoon",
                            "body": "How are you so sure of this?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "CremeComfortable7915",
                                    "body": "I myself had a profound spiritual experience at 19 years old. What I realized was that everything is in order. Our life here on earth is nothing more than a classroom. Our spiritual lives are eternal and everything else is our karma. I’m explaining it badly but “heaven” is bliss and nirvana. Because of this Ive tried to keep that in mind although being human I’ve misstepped many times along the way. I am looking forward to being reunited with the people I love and my grandson, who recently passed. There is so much more out there than we realize. Just be open.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SPACEFUNK",
                                    "body": "Shush, I can work with this. I'll bet this dumb dumb would die for me if I told them the right combination of inspiring lies. At the very least, I can get like 10% of their income as some sort of informal afterlife tax.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "90CaliberNet",
                            "body": "If I don’t remember any of it, then it wasn’t me as I am now so that points pretty irrelevant. If I’m reincarnated and I’m a completely different person entirely then it’s just Theseus’ ship when do I stop being me? Who I am now dies forever the moment I die. Spirit or not what’s left is not who I was.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Friendly_Exam258",
                            "body": "It makes sense in a way",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Magrathea_carride",
                            "body": "prove it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "anteru",
            "body": "that even if I don't think so sometimes, there are many people that care deeply about me. I carry on for them.",
            "score": 56,
            "replies": [
                {
                    "author": "Kesse84",
                    "body": "I understand it. I have been there. It helps, even if you resent them a tiny little bit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adept-Wolverine-6122",
            "body": "The thought that if you end it you don't stop the pain, you're only moving it to your loved ones",
            "score": 90,
            "replies": [
                {
                    "author": "SeriesSensitive1978",
                    "body": "As someone who lost a parent to suicide while I was still a teen, this is true. But it also sounds way harsh. I believe his pain was so great he could hold on no longer. I’ll carry some of it so he doesn’t have to.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Acceptable_Mode_3633",
                            "body": "Thank you for this answer. I get so tired of people saying that people who say you shouldn't kill  yourself because of the hurt you will cause. What about the hurt the person with depression/trauma is feeling? \n\nAnd - I'm still sad for  your pain. So sorry that you hurt. Hugs.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MichaelJamesDean21",
                    "body": "That’s if you have family, and who’s to say the family isn’t the reason you’re struggling with depression. But, what the hell do I know. I’m still struggling after 30-40 years.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Dazzling-Project-812",
                    "body": "This is a very interesting perspective!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "idkijustworkhere4",
                            "body": "it's actually very toxic.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WesleySh12",
                    "body": "Totally this! I cant let them to suffer too",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Snoopy_Club69",
            "body": "Not courageous enough to kill myself and Romance manga and twitch streams.",
            "score": 36,
            "replies": [
                {
                    "author": "Vinny_Lam",
                    "body": "Same. It’s the simple things in life that keep me going. I enjoy being alive just so I can play video games and eat my favorite food.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Extreme_Reality_2506",
                    "body": "Ongoing manga fr (and unfinished book series). Best romance manga rec? Haven't read many of those",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Snoopy_Club69",
                            "body": "I highly recommend both of kocha agasawa's work. As long as you can get behind the art style and seemingly overdone premises.\n\nThey both have the best representation of teenagers I've ever seen.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Extreme_Reality_2506",
                            "body": "Will def check them out, tysm",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kangaroosarefood",
            "body": "A large amount of edibles.",
            "score": 35,
            "replies": []
        },
        {
            "author": "cjongeling",
            "body": "My Mom is 95 and I have a cat. Responsibility keeps me going.",
            "score": 25,
            "replies": [
                {
                    "author": "riklil69",
                    "body": "Same. I live alone with a cat and kind of promised him to never abandon him. (He already had that experience before he moved in with me)\nAnd I don't want my mother to experience the death of one of her sons.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Ok_Guard_8024",
                            "body": "I have 5 cats. I live for them honestly. They are my best friends and keep me going to. I’ve been super depressed tho and stuff at home. People being rude to me and them too. Be rude to me all you want. But leave my animals out of it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Designer-Pound6459",
                    "body": "My dad is 93 and I also have a cat. Those are literally the only reasons.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "eggs_erroneous",
            "body": "Fear of homelessness, basically.  Like, shit is bad, yes, but being homeless would make it SO much worse.  So, I roll my bitch ass out of bed every morning and go to work.  I would give anything to stay at home and go full-on hermit.  Shit is getting real dumb out here in the world.  I want no part of it.",
            "score": 24,
            "replies": []
        },
        {
            "author": "yer-aul-ones-growler",
            "body": "I decided to just live by \"fuck it we will try again tomorrow\".",
            "score": 21,
            "replies": []
        },
        {
            "author": "OutlandishnessOk3310",
            "body": "Sertraline",
            "score": 30,
            "replies": [
                {
                    "author": "CeleryCommercial3509",
                    "body": "Where's my venlafaxine peeps at?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "DD230191",
                            "body": "Honestly wish I'd never been prescribed venlafaxine",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CeleryCommercial3509",
                                    "body": "May I ask how come?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Own_Magician_7554",
                                    "body": "Duloxotine is so much better.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ladyteruki",
                    "body": "There's currently a [supply crisis in France](https://ansm.sante.fr/disponibilites-des-produits-de-sante/medicaments/sertraline-25mg-et-50-mg-gelule-sertraline-chlorhydrate-de) for Sertraline (for small dosage only, for now), and it's terrifying if it worsens. Not that I feel like my treatment has been very effective, but I dread having to switch overnight to something else, or worse.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Sweaty_Bookkeeper921",
                            "body": "I’m in the US but I’ve thought about what would happen if they suddenly decided to just not give me my sertraline anymore. It’s a terrifying thought. I’ve weaned off of it a couple times myself and even doing it that way is freaking awful 🥴 cold turkey would probably lead to death for a lot of people. Especially the ones who don’t have a good support system.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ladyteruki",
                                    "body": "Most people would probably be prescribed another AD, hoping for good results, but it's true that messing with dosage, molecule and so on can have side effects anyway. Not to mention, people respond differently to different medication, and finding the right one again can be a months-long challenge. I know I have 3/4 of the side effects listed on the Escitalopram's notice, for instance, so it'd be bad if I had to switch.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ludakris7",
                    "body": "Sertraline sent me into a psychosis",
                    "score": 5,
                    "replies": [
                        {
                            "author": "OutlandishnessOk3310",
                            "body": "Makes it a lot harder for me to cum, but makes me feel better",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Stayin_yourlane75",
                                    "body": "I can relate!",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Sweaty_Bookkeeper921",
                                    "body": "Smoking weed helps combat that",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "indecisivennyl",
                            "body": "That was me with Prozac",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Stayin_yourlane75",
                    "body": "Samee!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Sarelbar",
                    "body": "Zoloft gave me baaaad anhedonia. \n\nLamictal changed my life. I just wish I could stop Pristiq and live off of lamictal. \n\nFor me, what sucks the most about being clinically depressed is being unable to get off of the SSRIs/SNRIs I’ve been on for nearly 17 years now. The withdrawal would ruin me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LiveLaughFartLoud",
            "body": "the fact I am someone’s mom and wife… but mostly mom.",
            "score": 13,
            "replies": [
                {
                    "author": "tonyblow2345",
                    "body": "I’m no longer a wife, but the mom part is literally the only thing keeping me here.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "60s_girlie",
            "body": "My dogs keep me going. They are always happy to see me.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Whole_Anxiety4231",
            "body": "SSRIs.",
            "score": 24,
            "replies": [
                {
                    "author": "Catshit-Dogfart",
                    "body": "Same here, more for anxiety but yeah they actually help.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "WestCoastHibernian",
                    "body": "My god I wish they helped me. Nothing works.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Sweet-Competition-15",
                            "body": "I do hope that you'll keep trying. Anti-depressants aren't like Tylenol. It takes patience and perseverance to find what works *for you!* But it's worth it.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "troeavey",
            "body": "My husband. He’s a good man, and he doesn’t deserve to be a widower.",
            "score": 24,
            "replies": [
                {
                    "author": "chelfea_",
                    "body": "This is a great answer. My husband also keeps me going! 🫶🏼",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Ghost_of_Carabelli",
                    "body": "Ditto! And I’d be super jelly if someone else got him. 😱",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dear_Investment6064",
            "body": "As far as I'm aware I'm not clinically depressed so take this with a grain of salt. But when I realized I was actively struggling with my mental health I took a super pragmatic approach.\n\nI work out between 3-4 times a week and I don't play about that. Even if I just walk on a treadmill for an hour, it helps so much (which sucks because I hate working out lol). I started an office job and had stopped going to the gym for about a year and that was when my mental health took the steepest decline.\n\nThe endorphins do make a difference idc what anyone says. We aren't meant to sit around 9 hours a day.\n\nI make a point of going outside twice during my workday bc my office doesn't have windows (lol) and lack of Vitamin D will fuck your brain up.\n\nI have a journal and do a ton of stream of conscious writing no matter how cringe or ridiculous or self-pitying the thought is I write it down, it feels better to just get it out of your system.\n\nI also pick up art projects, I crochet/yoyo/color/doodle. I have a bunch of activities I do that allow you to zone out and it feels meditative.\n\nI push ignore on SM content that makes me upset. I block pages that are all doomer etc. I did all I could do to keep the world from getting like this. There's no use in me crashing out every other day because half the country can't think critically.",
            "score": 23,
            "replies": [
                {
                    "author": "Maximum-Nobody6429",
                    "body": "It’s so interesting to hear this from someone who just experiences the natural lows of life. Bring human means you experience highs and lows, but my depression makes my lows so much lower and harder to pull myself out of. On the flip side my mania makes it so hard to pull myself out of the highs.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Dear_Investment6064",
                            "body": "I have PTSD, ADHD and an anxiety disorder so I'm not neurotypical by any means. I've experienced depression as a response to sexual trauma and struggled with self harm and suicidality apparently ADHD can expedite impulsivity which made it very important to get my mental health shit together. So I hear you. There's just a difference between depression as a literal trauma response and a chemical imbalance that's there regardless of the circumstances and that's why I made the distinction.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "LetzGetzZooted",
                                    "body": "You’re not alone! ADHD is just the icing on the cake right?!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BigDawgg_420",
                            "body": "I feel you bro, I’ve done too many drugs since a young age and experience all types of mental health problems, I’ve had 30 - 40 jobs and I’m only 23. The biggest thing I’ve learnt in my 23 years is to stay outside of your own head. Distract yourself with positive things, make sure you do those things DAILY. Instead of focusing on the bullshit side of life eg, money, sad things that have happened to you, all the things you are missing, just focus on the real world. Get a bike put some earphones on and start riding everyday. Your life and mind will change for good. Lots of love",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Maximum-Nobody6429",
                                    "body": "I’m 26, have a stable job, graduated college while running d2. I do all these things daily, but sometimes if I miss one or the season changes, or a fight / breakup happens, etc., I start spiraling and sometimes it takes medication to pull me out. Usually not, but there are depressive episodes that just can’t be avoided. Or manic episodes. Just how my brain works.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BigDawgg_420",
                                            "body": "Nah I get you bro it’s hard to get your thoughts in order, I’ve quit so many jobs this past year just because I’ll have a bad day with my gf then regret it strait away",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "looneybin55",
                    "body": "I think an issue a lot of people run into, including myself in the past, is the depression is so bad that it interferes with the willingness to fix it.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "MichaelJamesDean21",
                            "body": "Interferes with the willingness to fix it.  This is depression defined in one sentence.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tolse19",
                    "body": "10/10 advice. I am clinically depressed, but not medicated. All of these things have made a huge difference in my life. Self care is important for everyone, but these habits have made my depression manageable.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SeriesSensitive1978",
                    "body": "Yeah this is not clinical depression. I’ve had severe clinical depression for 30 years and I do all the things you mention plus many more (volunteer, meds, therapy, i have a great family etc) and I still want to off myself daily. There is literally nothing I can do that I have not done, and yet here I am still depressed. HOWEVER I will say it is doing all these things that keeps me from suicide, so in that regard it is doing SOMETHING. It’s just not making me not depressed.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Dangerous-Bit484",
                    "body": "What is SM content?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PaintedWoman_",
                    "body": "This",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Sarelbar",
                    "body": "Are you suicidal?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "asharhileigh",
            "body": "The love and support of my friends has had a big impact on me",
            "score": 9,
            "replies": []
        },
        {
            "author": "awkwardquesti0ns",
            "body": "The tiny human we made.",
            "score": 28,
            "replies": [
                {
                    "author": "CleaveIshallnot",
                    "body": "100% this. \n\nI just can’t do to my son what my father did to me.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Ludakris7",
                    "body": "I’m holding on for my future kids",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "tolse19",
            "body": "I've come out alive on the other side of worse depressive episodes before, so I know for a fact it gets better. I just wait for it to pass and do the things that give my brain/body a fighting chance to recover. Vitamin D, movement, and some sort of nutritious food. Oh and constantly reminding myself that just because I think it doesn't mean that it is true.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Shaolan91",
            "body": "Not thinking about it.... \n\nOh fuck i'm thinking about it",
            "score": 3,
            "replies": []
        },
        {
            "author": "Leeser",
            "body": "It just helps to remind myself as often as I can that it’s my brain having a neurochemical  imbalance and it’s not a reflection of who I really am or who I want to be. You have to fight it tooth and nail, but medication, therapy, and healthy living are good tools.",
            "score": 7,
            "replies": [
                {
                    "author": "PenguinPotatoPudding",
                    "body": "Actually, neurochemical imbalances is a theory and doesn’t have much of a leg to stand on. While it’s commonly used by doctors to put people (especially women) on drugs, and lots of influencers promote it, many, MANY studies have shown there’s not really an imbalance or “perfect levels” in your brain. \n\n“While neurotransmitter function is crucial for brain communication and mental health, research indicates that mental illnesses are likely caused by a combination of factors, including genetics, environmental influences, and individual experiences, rather than a simple chemical imbalance. The theory is slowly be thwarted out of the mental health scene.”",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Leeser",
                            "body": "Yeah! You’re the second commenter to say that. I have to say, I’m learning something. Thanks!",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Diablosbane",
                            "body": "Don’t believe everything you read on Reddit. There are a lot of factors that go into what causes depression. Environment, diet, childhood all have an effect, which can cause certain hormones and chemicals in your body to be adjusted. Long term it can have a bigger impact on these changes in your body, this is directly from my medschool teacher who is a medical doctor.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Leeser",
                            "body": "Yeah, I haven’t explored the physical causes of depression as much as I probably should. But it makes sense that many factors play a role. And believing everything I saw on this site would make me one maladjusted and ignorant person, that’s for sure.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "PenguinPotatoPudding",
                            "body": "It’s important for us all to know! I thought the same thing. Doctors are especially keen to make women go on it. Not a huge feminist here, but the studies that show women being forced into this “depression” drugs are awful. \n\nFrom my research into other research, I can safely say the best form of medication for depression is: EMDR therapy, CPT, social interactions (making a social group for weekly hangouts), living close to family (or your support system), muscle training, yoga and cardio daily. Some studies also showed self love practices, like journaling, talking to one self in the mirror, and treating yourself as if you were a family member or someone you love (so you aren’t an arsehole to yourself) can grow to help your self esteem. \n\nIt’s not that it’ll get rid of it, or that one won’t experience depression, but these things are the best natural medicine for depression (at least from the studies I read)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Leeser",
                            "body": "This is immensely helpful. I appreciate it!",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Turtleboi321",
                    "body": "The chemical imbalance thing has been debunked pretty much",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Leeser",
                            "body": "Really? Do you have a source?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Pretend_Accountant41",
                                    "body": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1518691/",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Leeser",
                                            "body": "Thank you! I had no idea.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Pretend_Accountant41",
                            "body": "Yeah. This upset me so much. But any credible psychiatrist will admit that they don't know what antidepressants do exactly or how. ",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "VeggieLomein",
                            "body": "Well, my brain needs more serotonin than what my body naturally produces or whatever and the med really help me not want to die",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Turtleboi321",
                                    "body": "I'm not saying the meds do nothing. Welbutrin helps my anxiety, but no meds have done jack for my depression. Lots of sources/studies say it isn't a chemical imbalance though. But if it helps keep taking it ofc",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SleepIsTheForTheWeak",
            "body": "Drugs",
            "score": 4,
            "replies": []
        },
        {
            "author": "LaraTabby7",
            "body": "Sertraline😅😂",
            "score": 4,
            "replies": []
        },
        {
            "author": "sick-dying-girl",
            "body": "a box of frozen mozzarella sticks i have in the freezer",
            "score": 4,
            "replies": []
        },
        {
            "author": "Comfortable-Ruin8694",
            "body": "Wellbutrin and Sugar",
            "score": 5,
            "replies": []
        },
        {
            "author": "Stella_G_Binul",
            "body": "religion. That's the only thing keeping me alive. If I didn't believe in God i would have died decades ago.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ok-Attention-663",
            "body": "R u n n I n g",
            "score": 3,
            "replies": [
                {
                    "author": "Urchshur",
                    "body": "Absolutely.  Exercise is huge. Keep on moving!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rottenredmatos",
            "body": "Prozac",
            "score": 3,
            "replies": []
        },
        {
            "author": "notgerardb",
            "body": "Telling myself every day, \"you'll break the cycle as long as you don't quit\" plus reading a good book",
            "score": 3,
            "replies": []
        },
        {
            "author": "Mr_herkt",
            "body": "For me over the last few months,  it's been lego. Big technic car sets.  That and cycling up mountains till I vomit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GipsyDanger79",
            "body": "Medication, therapy, daily gratitude practice, taking care of my dog. Promising myself and my family that I will get to the natural end of my life.",
            "score": 3,
            "replies": []
        },
        {
            "author": "malexandrap",
            "body": "Vitamine D3! I ve been taking it for almost 2 weeks. It s not much time but i honesly feeling an improvement in my morning mood. \n\nAlso, therapy. For the past 6 years, on and off, depending on my needs (both clasic therapy and holistic approaches). I ve also changed therapist (after aprox 2 years each). Currently working with a therapist specialised in somatic therapy.\n\nSunshine. Gym but only for 2 weeks/months, i ve been observing and understood that this helps me when and around ovulating but not in my premenstrual week. \n\nPeople, sometimes, but only those that i m feeling myself with. No need for big effort when i m low.\n\nMy relationship. My partner. His support. (It s not the first on the list because i also tend to be co-dependent and with mixed attachment style (disorganised) and i am learning not to cling and to express my needs in a healthy way). \n\nSleep. \n\nBooks. \n\nJust being depressed. Indulging in some comfort food for an evening. Or in a movie, tv show, tv series. Or doing nothing. Really nothing. \n\nCrying.\n\nJournaling. \n\nPainting. \n\nA blanket. \n\nWarm/hot baths. Showers. Lots of showers.\n\nHiking (in the warm seasons). \n\nTaking care of my insulin resistance (lifting some weights, quit smoking, better diet). \n\nI ll come back if i ll remember anything else.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RA1NB0W_RAVE",
            "body": "My meds",
            "score": 2,
            "replies": []
        },
        {
            "author": "Important-Bet-7932",
            "body": "Going outside and being in nature",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zuulbat",
            "body": "Two cats that give me emotional support and a couple purposes to drive me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Im_Chris_Haaaansen",
            "body": "I can't kms until my mom passes away (my only real family... I have distant cousins). Once that happens, I'm out.",
            "score": 2,
            "replies": [
                {
                    "author": "manuredujour",
                    "body": "I hope you fall in love or get a dog before that happens",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Glum_Lock6618",
            "body": "My daughter",
            "score": 2,
            "replies": []
        },
        {
            "author": "ywnktiakh",
            "body": "Meds.",
            "score": 2,
            "replies": []
        },
        {
            "author": "4noman",
            "body": "SSRIs and not wanting to upset my mum",
            "score": 2,
            "replies": []
        },
        {
            "author": "kit_brown",
            "body": "My marriage and my medication",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pink_Flash",
            "body": "Brother is disabled, cant really leave him alone with my aging mother. Once they both go ill peace out unless I find something or someone I suppose.\n\nMeh",
            "score": 2,
            "replies": []
        },
        {
            "author": "pokemon12312345645",
            "body": "My dad has already gone through the death of a kid and I can't put him through another",
            "score": 2,
            "replies": []
        },
        {
            "author": "smack54az",
            "body": "Some days, pure spite, I refuse to let my depression rule my life or let those who hurt me win.  Most of the time, it's hope for a better tomorrow.  I've never let go of that little shred of hope that my life will get better.  My parents always told me, \"Death is the easy way out.\" \n\nPlus these days I have my cats to care for and I'm blessed to have a wonderful partner who helps keep me going.  But the above is what got me through the dark times when I was alone.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jeish_1996",
            "body": "I don’t even know what keeps me going honestly. I would have to say my loved ones are the only reason why I’m alive still",
            "score": 2,
            "replies": []
        },
        {
            "author": "Calorus_Rex",
            "body": "was the phrase “MAMA AINT RAISE NO BITCH” now it’s that and my girl. I think imma make it :)",
            "score": 2,
            "replies": []
        },
        {
            "author": "ijustliketocrochet",
            "body": "Medication. Without it, I'm a mess. Some people need it. I'm one of them.\n\nI have a severe form of PMDD. To the point of suicidal ideations that become very, very scary. \n\nThey have me on wellbutrin, Lamictal, and strattera. And when I go into my luteal phase of my period I start taking Lexapro until my period starts.\n\nThis combo has saved my life. I feel like a completely different human being.",
            "score": 2,
            "replies": []
        },
        {
            "author": "paisleydarling",
            "body": "My kids. My sole reason to be alive still is because it would destroy their lives and I never want them to suffer like I have. I have researched my method and semi planning. But I can’t, not for a long time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ballslaw",
            "body": "The lack of a choice. I have no choice but to continue.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RickHunter84",
            "body": "My kids, I don’t want them to think of why I did, why all the whys that come after suicide. To make them feel the what if I talked to dad more, what if I sat with him to watch that show on the tv, why was he alone in the garage. If I didn’t have kids I wouldn’t be here.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Whole-Researcher93",
            "body": "Booz helps … \nnot gonna lie. And I’m not even an alcoholic… yet :/.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nosedive888",
            "body": "Absolutely fucking nothing. I wake up, I have a piss, I get back into bed and play games on my phone or look at Reddit until early afternoon, if/when I get hungry, I'll get dressed and walk to the sandwich shop to get my lunch coz I'm certainly not motivated enough to make my own lunch. \n\n\nThen I lay back on my bed and I'll either fuck around on my phone some more or watch TV...while fucking around on my phone. If I don't watch TV, then at some point I'll be motivated enough to do something productive but by this time it's late afternoon and I ultimately decide it's too late in the day to start doing something. \n\n\nDinner time rolls around and I vow I will cook a homemade meal and then order take out. Depending on what I order I'll either feel bad about myself for eating junk food or I'll just feel ill due to the vast amount of junk food I ate. \n\n\nThrough the course of the evening I'll either watch TV and fuck around on my phone or I'll spend, literally over an hour looking for something to watch, realise it's now 10pm and too late to watch anything and fuck around on my phone until I can't keep my eyes open. \n\n\nI'll have a shitty nights sleep, wake up feeling like hammered shit and repeat the whole thing over. \n\n\nThere are outliers. Sometimes I'll go on a hike in the countryside, be in an incredible amount of pain for a week after, vow to never hike again but ultimately start planning my next hike soon as I feel better. Sometimes I'll do laundry, change the sheets and get a shower, that depends on how much I smell. Approx every 6 weeks, I'll have a shave and a haircut.\n\n\nSometimes I'll do an art project. But if I make a mistake or get bored it'll go unfinished indefinitely. \n\n\n\nMedication doesn't help. Therapy doesn't help.",
            "score": 2,
            "replies": []
        },
        {
            "author": "vanmc604",
            "body": "My dog.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JayTheGreat0164",
            "body": "im too lazy to kill myself im not even kidding that's actually why",
            "score": 2,
            "replies": []
        },
        {
            "author": "Captblue1",
            "body": "A few years ago I was living alone in a small apartment above a garage in Maine. I had originally moved to Maine to live with my best friend but due to a sudden pregnancy I had to move and find my own place. This situation led to me becoming very depressed over the span of a year or so. It was at that point in my life I hit rock bottom and quit my job deciding it would be better to end it all rather then continue on the way I was going. I picked a small spot next to a river, it was some kind of reserve and it was beautiful. I had picked that place mostly because it was still the off season so no one would be there. I sat in my car with a rifle staring out at the river and trying to pull the trigger, when an older man driving a truck pulled up not too far from my car. I immediately panicked and put the rifle down out of view, thinking that if he called the cops I would end up in a mental hospital. I planned to just wait for him to leave since most people who would come by tended to take a few pictures and leave, but he didn't do that. Instead he began to unload wood from his truck for fencing. I couldn't believe my luck...on that day at that time this man just had to be here. The man proceeded to start repairing a fence that just happened to be in complete view of my car. After a while I completely lost my nerve and ended up leaving. That day was a turning point in my life. I now look back and think just how lucky I was to have been saved by his presence and I don't even know who he was but I will never forget him for the rest of my life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ubermouth",
            "body": "Shredding two hours a week of old man soccer \nIt tops me off every time even when I don’t shred, which is rare ;)",
            "score": 1,
            "replies": []
        },
        {
            "author": "spaghetti_63",
            "body": "If I die, nobody will water my plants and feed my fish. I love them too much for them to die. Hence I have to wake up and get going every single day. If not for me, then for them.",
            "score": 4,
            "replies": []
        },
        {
            "author": "BeachBoyZach",
            "body": "I will one day do tons of exciting world travel if I save up a certain and specific percentage of every paycheck towards budgeting for it",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aggravating_Lack4628",
            "body": "Pay my rent and bills",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leeb_Leefuh_Lurve",
            "body": "The support of my fiancé and the bakes goods I make every Sunday.",
            "score": 1,
            "replies": [
                {
                    "author": "Quick-Insect7364",
                    "body": "How do you maintain a relationship while being depressed?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Leeb_Leefuh_Lurve",
                            "body": "Open communication. I told him that I get depressed to where I physically feel like I can't do anything and he said \"okay, I will help\". He consistently checks on me when I am depressed and makes time to just be with me.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Training_Winner3659",
                                    "body": "This. My wife and I do daily check ins  helps a lot. Also because they are made aware how much I'm able to take on that day.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "toodog",
            "body": "homelessness",
            "score": 1,
            "replies": []
        },
        {
            "author": "Professional_Plan_54",
            "body": "Ketamine microdosing through joyful.com helped me a lot. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "songbird-harbinger",
            "body": "New experiences. From trying a new thing on the McDonalds menu, to checking something off the bucket list",
            "score": 1,
            "replies": []
        },
        {
            "author": "mattsocks6789",
            "body": "Too cowardly to deal with the pain involved with suicide.",
            "score": 1,
            "replies": []
        },
        {
            "author": "signaturefox2013",
            "body": "Having bills",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anxious-Mood665",
            "body": "Some days, knowing that taking any action would be inconvenient and/or upsetting for those I care about is the only reason I try to keep pushing thru, even though my brain has me convinced they'd all be better off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gracie_loves_sunsets",
            "body": "my family especially my siblings, I need to experience the life they deserve",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feeling_Ad_1034",
            "body": "When I was at my darkest months, it was the people I chose to surround myself with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JuanG_13",
            "body": "I do things to keep my mind off of it, I spend time with the people that make me happy and I just learn to navigate around it, because that's really all you can do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ari_Fuzz_Face",
            "body": "Focusing on my hobbies, and reminding myself I want to do more of them at the end of each day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fatbeard2024",
            "body": "Food",
            "score": 1,
            "replies": []
        },
        {
            "author": "Do_You_Like_Cupcake",
            "body": "Hard question.... beloved ones keep me alive, like my nephews... every time I think i could go down... deeper and deeper... into the darkness... i think about them....",
            "score": 1,
            "replies": []
        },
        {
            "author": "Heavy-Apartment-4237",
            "body": "Just finally told my divorcing wife how she abused me and she didn't believe me.  She said that it was the first time I said anything.  Im sure the shouting and tears during our years of marriage were just for my entertainment I guess?  Breakthrough helps.\n\nCommunication surprises people.  I like surprises",
            "score": 1,
            "replies": []
        },
        {
            "author": "nin1332",
            "body": "Knowing each day is a step closer to the inevitable end....\n And well that's worth getting out of bed for !",
            "score": 1,
            "replies": []
        },
        {
            "author": "JDMWeeb",
            "body": "Idk honestly",
            "score": 1,
            "replies": []
        },
        {
            "author": "potsandpole",
            "body": "Waiting patiently and taking care of myself as best as I can until it changes. Depression only gets really bad for me these days if I spiral and freak out about it. Often when I’m feeling depressed and having really negative thoughts I’ll pause and take a few minutes to breathe and meditate and check in with what I’m actually feeling in the moment without the stories attached. Often it’s tiredness or even relaxation. And if I can lean into that and let it be it eventually lifts on its own",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jtannerv",
            "body": "Not knowing what’s after life",
            "score": 1,
            "replies": []
        },
        {
            "author": "neo_geijutsu",
            "body": "\"Might as well..\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vanilla-GOrilla_TRD",
            "body": "Don’t let them win. Staying alive is defiance to the sadness",
            "score": 1,
            "replies": []
        },
        {
            "author": "Reasonable_Wasabi124",
            "body": "I get out of the house. Even if it is just to walk around town for an hour or two. Staying inside makes me feel like the world is closing in on me. It takes my through the roof.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Transicon21",
            "body": "I'm to scared to kill myself and I'm afraid of dying so I have to go on even if it hurts to, i get constant headaches everyday and I'm freaking tired of this dull feeling I feel everyday it's ridiculous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pretend_Accountant41",
            "body": "I recently grieved my cat. He died tragically and was six. I raised him from a kitten. The grief I felt for him was unimaginably aggressive, and it made me realize that my mother and sisters would feel something much worse if I ever did kms \n\n\nThings that help: distraction (tv shows, movies), quitting substance use, taking my Rx as prescribed, openly communicating with my family doctor, and having a rich network of loved ones",
            "score": 1,
            "replies": []
        },
        {
            "author": "cryptorchid30",
            "body": "Most things are made up, knowing that takes off a lot of the pressure of day to day living.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Turbulent_Throat_654",
            "body": "Having depression since I was like 10, I've learned to sometimes slip into my mind for twenty minutes or so. Sounds crazy I know. \n\nIt's like doing a bit of reassessment of your thoughts. Replay some good memories or just dream for a bit. At least it works for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kierarktina-1234",
            "body": "I fear more that my family finds out I'm depressed (would not be able to handle the judgement and lack of knowledge on the topic) so much that I force myself to get out of bed everyday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "florida_man_1970",
            "body": "Alcohol",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheRealDoomsong",
            "body": "Spite!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FuckkPTSD",
            "body": "Pure spite",
            "score": 1,
            "replies": []
        },
        {
            "author": "mostirreverent",
            "body": "My depression doesn’t cause sadness, it’s more about apathy, and a genuine lack of motivation. I will do things when others plant things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "high-im-stupid",
            "body": "Idk man, I just keep smoking weed whenever the bad thoughts come around.\n\nBasically I just spend my time hopping from one distraction to the next, all in an attempt to avoid the unavoidable fact that the world we live in is complete shit.\n\nIf my distractions don’t work, sometimes I’ll write in a attempt to express myself which doesn’t often work since in the process of expressing myself I find that there is a limitless void of depression inside me which wants nothing more than to stop existing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wildhardsrosaur",
            "body": "Initially, medication. Now, my family.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ARoodyPooCandyAss",
            "body": "Self care, goals, exercise, travel, socializing, hobbies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bjjlui",
            "body": "Working out. I started with just showing up after a couple decades. Now I look forward to a morning workout. I am there EVERYDAY. It’s the only thing that makes me feel at peace.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crazytimegal",
            "body": "My dog has been keeping me alive for 2 yrs now. He’s 2 now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "davidreaton",
            "body": "Meds and my church family.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DanielBaldielocks",
            "body": "My kids, if it weren't for them I'd have ended it years ago.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ppparanoia",
            "body": "my dog. he was a stray before i adopted him, i don’t want to put him through all of that stress again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kamarandi",
            "body": "I must see Monkey D Luffy find the One Piece.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BubblyAd9996",
            "body": "Positivity, positive thoughts and thinking of positive fun things",
            "score": 1,
            "replies": []
        },
        {
            "author": "Panicwhenyourecalm",
            "body": "I have depression and ocd. For a while, the thing that kept me going was giving my word to two people who I value more than myself (not great but it worked at the time). \n\nAt this point, it’s the fact that I know life sucks. I’ve seen the worst (maybe) but what if things don’t suck, yknow. Idk if it gets better, but I guess I’m willing to find out. \n\nAll I gotta do is make it to 80 anyway. If I make it that long, I am actively trying every illegal drug and dying. Ima be hitting the fent pen in peace.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Conscious_Hunt_9613",
            "body": "Solo Leveling",
            "score": 1,
            "replies": []
        },
        {
            "author": "IamNachoFriend22",
            "body": "My dog and meds. But mostly my dog. I love her so much. Taking a nap with her is bliss",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quick-Client3191",
            "body": "Weed",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rancor_Keeper",
            "body": "Knowing that a few people who legitimately care about me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "poornegotiations",
            "body": "Waiting for my kids to graduate high school and become legal adults",
            "score": 1,
            "replies": []
        },
        {
            "author": "AtomicCat82",
            "body": "Spite.  Pure and simple.  I know my ex mother in law wishes misery and death on me so I’m going to live a happy full life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "itsaburneryaknow",
            "body": "I really like video games. Like really. Like addicted. Better than being dead tho! Death is basically my best friend. We just hang out and I play video games to ignore him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "foodporncess",
            "body": "Meds, therapy, exercise (it took me a long time to find my thing exercise wise though), puppy snuggles, plants, and oddly, unloading the dishwasher (it gives immediate order when everything feels out of order)",
            "score": 1,
            "replies": []
        },
        {
            "author": "CeleryCommercial3509",
            "body": "The living think about death, however the dead don't think about life",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kinda_Constipated",
            "body": "Money. I used to be depressed. But now I'm depressed with money which makes it a whole lot better. I dream of the day I quit and retire. Which by my calculations I can do anytime and move to a country like Vietnam for the rest of my life which is a comforting thought.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SunnySanDiego44",
            "body": "Mushrooms",
            "score": 1,
            "replies": []
        },
        {
            "author": "Reasonable_Whole_398",
            "body": "My meds.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TotallyNotViden",
            "body": "Technology. It moves so fast and amazing things are happening in my lifetime, i'm depressed but i'm eager to see what humans can create.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShopIndependent6509",
            "body": "Venlafaxina and occasionally Clonazepam.\n\nThe first was a game changer for me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glum_raccoon5971",
            "body": "My dog",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amazing-Rooster1961",
            "body": "I haven't decided on a day to unalive myself so i just keep going until I decide to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedPanther1",
            "body": "Usually the thought of how it will hurt other people who care about me more than it hurts me to exist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tehPaulSAC",
            "body": "Kids",
            "score": 1,
            "replies": []
        },
        {
            "author": "MJD3929",
            "body": "I very much would like to not be dead. That’s about the extent of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unlucky_Author4998",
            "body": "Kids",
            "score": 1,
            "replies": []
        },
        {
            "author": "chelfea_",
            "body": "My children. I will NOT allow them to grow up without a mom or without a present mom. Even on my worst days, I will get out of bed and have fun with them. Also antidepressants help 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "R1CHARDCRANIUM",
            "body": "I’m inept enough to mess it up and make things worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kink4202",
            "body": "My 3(soon to be 4) grandkids",
            "score": 1,
            "replies": []
        },
        {
            "author": "carbonstealer",
            "body": "The smell of grass after it rains, my fave songs, my job (somedays), my car, my cat, Trintellix, family. Also going to an empty field and looking at a completely dark sky, you see so much and it's soo grounding.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AvoidingStalkingElf",
            "body": "This is a good Question \nRemind me to answer when I found the answer\n\n\n(The Delusion that there is still some Purpose for me in life to find on my way through this dumpster fire)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Annnyy123",
            "body": "Vitamina D",
            "score": 1,
            "replies": []
        },
        {
            "author": "LabRat_X",
            "body": "Spite? Spite.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShiftOk4346",
            "body": "Being institutionalized after a failed attempt was so much more unbearable than raw dogging life. I also drink a lot. Don't do that though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MisterPuffyNipples",
            "body": "The answer to this is becoming more difficult to come up with. My dad and brother are alive so I guess that’s the answer for now",
            "score": 1,
            "replies": []
        },
        {
            "author": "allthingskerri",
            "body": "My daughter. As much as I don't want to be here at times - my love for her never stops and I don't ever want to break her heart or know I let her down by not being here. Even on my worst day I'm still the best thing in the world to her. She sees what I don't and gives me love. \nGetting pregnant triggered a lot for me. I still have long lasting impacts - but I medicated the hallucinations stopped and I'm in a much better place now. I can spot my triggers easier and I'm glad I got my support system right so that I can do the best I can for her. I don't always get it right but I try.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gendryll",
            "body": "The knowledge that I'd leave my kids without a father.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bipplebop",
            "body": "I don’t want my friends and family to wonder what they could have done to prevent it. I continue to suffer so they won’t have to",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thehaylestorms",
            "body": "My son is the only reason I’m still fighting. I am so tired.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1cem4n82",
            "body": "My wife and daughter. My inner need to work and support them keeps me above ground. It’s the only thing i have that i feel proud of. The only loophole for me is some kind of premature heroic end. I could be ok with that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DropoutMakesMeBUST-",
            "body": "fujimoto is still alive making masterpiece after masterpiece. can't die before csm part 2 is done. can't die before fujimoto retires",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unique-Point-8818",
            "body": "Gym, baking, family, friends, and music",
            "score": 1,
            "replies": []
        },
        {
            "author": "hb_339",
            "body": "As someone with PCOS who is TTC, the mental toll can be overwhelming. Every cycle feels like a rollercoaster of hope and heartbreak, and it’s exhausting. What helps me keep going is reminding myself that my worth isn’t tied to my fertility. I try to focus on small wins, whether it’s seeing progress in my hormone levels, taking a break when needed, or just treating myself with the same kindness I’d give a friend in my shoes. Therapy, journaling, and leaning on my partner and online TTC communities have also been lifesavers. Some days are harder than others, but I hold onto the hope that one day, this struggle will be part of my story, not the whole thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ISureAfWill",
            "body": "When I was depressed dreaming and fantasy stories etc helped me a lot. Basically I just drifted into a whole other world and stayed there. That’s why I don’t judge people in different fandoms. Sometimes the fantasy helps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "alldayieatsushi",
            "body": "My kids",
            "score": 1,
            "replies": []
        },
        {
            "author": "OmNamoShivaya44",
            "body": "What keeps me going is 5 hour meditations.",
            "score": 1,
            "replies": []
        },
        {
            "author": "qu33nof5pad35",
            "body": "Getting sunlight, traveling, doing stuff I enjoy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vectrex71CH",
            "body": "Suffered more than a decade, then 6 Weeks psychological clinic , since then daily antidepressiva and meanwhile once a month psychologian. Feel like a new human. M(53)",
            "score": 1,
            "replies": []
        },
        {
            "author": "manuredujour",
            "body": "I have depression but I’ve never been suicidal. If you are suicidal, you need extra intervention and should reach out for help because it’s too big to have to cope with alone. I’ve had two close family members who have been suicidal, one who made multiple attempts.\n\nWith my depression, there have been days and long periods when nothing kept me going and I couldn’t even get out of bed. Knowing in the back of my head that my depression is cyclical and things will get better makes things tolerable when I’m at my worst. My family, especially my kids, make me want to get better. I think sometimes depression is just chemical or hormonal and it’s not a matter of motivation. Medication has helped and so has managing my stress levels.\n\nMy dog and knowing he depends on me to walk him, feed him, and care for him has helped establish a routine. Getting outside even for a short walk makes a big difference. Getting sunlight early in the morning, if possible. Little things like buying tickets to a concert so I have something to look forward to. Lots of baby steps can add up and make a difference. Not thinking about how overwhelming it all is and just focusing on one little thing a day like “Yay! I washed the dishes.”\n\nThere have been times when nothing helped. So I just slept or watched TV and wait for it to pass. That’s ok, too",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alastornematode80085",
            "body": "My 10 year old son",
            "score": 1,
            "replies": []
        },
        {
            "author": "bigexpl0sion",
            "body": "Anti depressants and exercise. Lately not much honestly, Im finding it hard to be motivated.\nBut life is mandatory so you might as well try.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fuchsiaashley",
            "body": "My daughter. I was hospitalised due to my postpartum depression being out of control. Before postpartum I already had an extensive history of poor mental health including several attempts to end my life due to major depression, complex ptsd, bpd and ocd (all diagnosed).\n\nI still feel suicidal at times. I've been in a phase of feeling like that every day for the last 6 days.\n\nHowever, she is now 7 months old and reflects the love I've always given to her so much now. She's a very happy baby. I've always felt bonded to her which I feel very grateful for. I just couldn't fight my demons on my own when she was smaller.\n\nI feel like I hate myself a lot of the time, but she came from me and in my opinion she is perfect. Because of her, I have some value in this life. \n\nWhen I'm in the depths of it all, ultimately my view is that I may want to kill myself but I wouldn't kill my daughter's mother. \n\n❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Justsittinghere1711",
            "body": "Cymbalta.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpecificSet9605",
            "body": "Surrendering to spirituality (Jesus) Music, exercise, journaling, writing shitty poetry, reading, planning and making a list for everything",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShortSponge225",
            "body": "Whenever I'm overwhelmed and feel like not existing would be easier, I tell myself this:\n\n\\-Taking a nap is like death but without the commitment. \n\n\\-Su\\*c\\*d3 is a permanent solution to a TEMPORARY problem and will only hurt others.\n\nAlso meds, more meds, Vitamin D, my pets, my husband and the good friends I keep in my life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wheresthefuckinfaith",
            "body": "I still haven't gotten what I want",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProximaeB",
            "body": "I can't do that to my boyfriend. He's the sweetest man I've ever met.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unable_Radish_2925",
            "body": "I keep going to spite my dad who thinks I am weak and can’t cope with life because I had problems with adolescent suicidality. I don’t want to prove him right so I keep trying to learn new ways to cope.",
            "score": 1,
            "replies": []
        },
        {
            "author": "taurus_bitch13",
            "body": "Someone very dear to my heart needs me.\nFuck only knows why. I'm not deserving of love, and it wouldn't matter if I died. But, I am a woman of my word, for whatever that's worth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SerJustice",
            "body": "Knowing that succumbing is a one time event and I will never know if things got better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MtlKdee",
            "body": "Depression is a disease of the brain. I will not wilfully succumb to it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Motor_Inspector_1085",
            "body": "Medication and my son.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MentallyAdvancedPone",
            "body": "Suicide is difficult and my cat",
            "score": 1,
            "replies": []
        },
        {
            "author": "GeofySaint",
            "body": "My gains 💪",
            "score": 1,
            "replies": []
        },
        {
            "author": "Panjo98",
            "body": "Understanding there is someone out there right now that would trade their life wirh mine in a second. People receive bad news daily and today I have not. I'm healthy and my immediate family are here. I'm grateful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThatguycalledFinn",
            "body": "Kind of a classic but: Mum would be sad & she doesn't deserve that",
            "score": 1,
            "replies": []
        },
        {
            "author": "MochiMochiMochi",
            "body": "Defiance.\n\nI want to outlast every overpaid corporate twat currently making my life difficult.",
            "score": 1,
            "replies": []
        },
        {
            "author": "helpmeiamarobot",
            "body": "Gotta feed the cat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EnamelKant",
            "body": "Inertia.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mrlustyou",
            "body": "Death is forever I've died trying. At the end I have hope I'll find people eventually and hopefully fill my void of loneliness. It's so impossible at the moment I'm beyond broke so I can't do any kind of hobbies to meet people. But yeah I have a small bit of hope that maybe I'll eventually find some friends. It's a downfall when you have nothing to offer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tomaesop",
            "body": "I find beauty in the ridiculousness of the world. So, uh, laughter. \n\n\n\nAnd the occasional gasp of creative energy. \n\n\n\nWife and kids. Dog (when I had one).\n\n\n\nFeeling that the world can be better and most people who accomplish anything are also deeply flawed therefore it's not out of the realm of possibility that I could pull it together enough to accidentally make a difference.\n\n  \nLooking to give another dog a home this year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExternalSelf1337",
            "body": "As crappy as depression is, it would be a lot worse if my family was homeless, and far worse for them if they were fatherless.\n\nI get up and go to work every day because it's better than the alternatives.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hyperactive_Sloth02",
            "body": "Responsibilities.",
            "score": 1,
            "replies": []
        },
        {
            "author": "arubbishseagull",
            "body": "Tbf probably guilt and laziness.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OakenCotillion",
            "body": "My cats",
            "score": 1,
            "replies": []
        },
        {
            "author": "mandie243",
            "body": "Spite",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ap0th1cR3d",
            "body": "Food. If I don't work or get up, I don't get to eat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jo_yEAh",
            "body": "i still got a lot of things to accomplish and i believe in myself from the bottom of my heart",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kimikohiei",
            "body": "My parents, sister, other close relatives, are still alive. I couldn’t do that to them.\n\nAll bets are off when they pass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Forsaken-Try8738",
            "body": "Really knowing what makes it worse. If I don’t eat good, socialise and exercise, it creeps in. So I base my routine around doing those things",
            "score": 1,
            "replies": []
        },
        {
            "author": "HistoricalMeat",
            "body": "My cat. He loves me and would never understand why I didn’t come home. He relies on me for everything. I need him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deaththirteen00",
            "body": "My siblings, I can’t help but think how sad I would make them if I left.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chrissystark",
            "body": "My pets. They are my everything and they’d be devastated if I passed away. I don’t know what I’d do without them ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Borgoroth",
            "body": "Spite,  mostly",
            "score": 1,
            "replies": []
        },
        {
            "author": "Evakotius",
            "body": "Work, food, games, hope.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoSummer1345",
            "body": "First, it was my little sisters who looked up to me. Then it was my kids until they were independent. Now just waiting for parents to kick it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "369damngurlfione",
            "body": "My fiancee, after he went out to take the trash out and didn't bring his phone but didn't end up coming back for several hours, I was sick with fear that something had happened to him. I thought about how awful I felt going through that and realized that if I killed myself I would put him through that same type of pain which I couldn't do to him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Publichealthnerd1984",
            "body": "The thought that it isn’t about me. What makes life worth living is how well we can learn to love others. It is such a hard skill. \nI think also remembering in a weird way, nothing is that serious even though all of it is. I think about people who laugh in the midst of wars, people that write beautiful songs in times of despair and people that dance amidst so much death. We can do our best to save each-other from death, but what a great gift it is too to save each-other from despair.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thecrowfly",
            "body": "Pizza.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JimAbaddon",
            "body": "Mostly that I'm afraid of death. Once being alive overpowers that, I am out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glad_Conference6021",
            "body": "Sometimes, only my dog - having a responsibility (and a super cute and loving one at that) is often the drive for me to get out of bed",
            "score": 1,
            "replies": []
        },
        {
            "author": "yoshie97",
            "body": "Routines helped me with my depression. Everyday at least trying to do chores, or hobbies. Talking to my freinds helped too, they draged me outside, \"forced\" me to live a little...  and therapie.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CognitiveDig64",
            "body": "Drugs",
            "score": 1,
            "replies": []
        },
        {
            "author": "ofTHEbattle",
            "body": "Nature, it has a mental healing factor for me. I live near the city and don't get away from it as much as I want but when I do it feels like a complete reset.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sparkles3383",
            "body": "Sure, I’ll share.  Having social support networks,\nGetting the right amount of sleep, keeping a routine. Avoiding ruminating. Eating right. Rewarding myself or treating myself when I’m low energy to get myself to do things. Sometimes I spoil myself.  I learned techniques to stop myself cycling on thoughts that kept me in depression too",
            "score": 1,
            "replies": []
        },
        {
            "author": "CosmosGuy",
            "body": "Reading books helps me a lot - and also listening to Alan watts",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chance_Middle8430",
            "body": "I’m grateful for this miracle. Yes COL is drowning us but survival has always been the game. I’m also an eternal optimist and believe things will change. You just have to crawl through the tunnel of shit first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EndSlicesOfBread",
            "body": "I’ve failed every suicide attempt so far, so I just feel like I don’t have a choice but to keep going",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheZeigfeldFolly",
            "body": "My children and husband. And dark humor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "urano123",
            "body": "Venlafaxina",
            "score": 1,
            "replies": []
        },
        {
            "author": "ASimpForChaeryeong",
            "body": "Mom will be sad",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Confusion2353",
            "body": "I try to look at the beauty of the small things in life and really appreciate them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Just_Persist808",
            "body": "Honestly? Creating new music",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ukulelelol",
            "body": "Well I am not depressed but the reason I would live is because of my family and my goals of being a good person.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moo_ny_",
            "body": "my cat....without him I wouldn't be moving through life at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "10F1",
            "body": "Medicine and my wife.",
            "score": 1,
            "replies": []
        },
        {
            "author": "420Itch",
            "body": "Prozac",
            "score": 1,
            "replies": []
        },
        {
            "author": "Decent-Raspberry8111",
            "body": "As much self-hatred as i have, I still have other people that care about me, and i don’t want to make them sad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Individual-Use-7621",
            "body": "might as well keep living in case it ever gets better you know",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Addendum_3188",
            "body": "Spite, mostly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Evening_Skirt_4681",
            "body": "Knowing I can’t put my debt onto my father",
            "score": 1,
            "replies": []
        },
        {
            "author": "Evening_Skirt_4681",
            "body": "Knowing I can’t put my debt onto my father",
            "score": 1,
            "replies": []
        },
        {
            "author": "RefriedBroBeans",
            "body": "The hope that someday I might feel better. I assume it's worth the wait.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Major_Bee4483",
            "body": "My daughter. My greatest achievement. She deserves to have a great mom & I try every day to give her that ☺️",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZealousidealSet8880",
            "body": "spite tbh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuyu_nokoohii",
            "body": "My cat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blorrain",
            "body": "My cocktail of meds. Therapy, I go 4 times a week and my niece and 2 nephews.",
            "score": 1,
            "replies": []
        },
        {
            "author": "logosfabula",
            "body": "Benzos, sleep, CBD, meditating on the ones I truly love, and a plush toy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feisty_Feeling_6415",
            "body": "I'd say video games. Recently I'm maintaining almost no contact with \"friends\" and \"family\".\n\nVideo games helps me not to think at my problems. Doing God of War 2018 rn, a nice trip !",
            "score": 1,
            "replies": []
        },
        {
            "author": "Automatic_Scholar651",
            "body": "Its important to know depression is very treatable, temporary and joy will return. Ive seen this very close up- discuss with a Dr., stay involved with friends and family and know that things will improve- give your recovery time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "corvally315",
            "body": "My dog's ridiculously cute face. I know she depends on me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wingd",
            "body": "I’m gonna jump in on the train that says death is the biggest preventer, but I’m gonna elaborate. \n\nI have a form of treatment resistant depression, and I’ve been in therapy for over 20 years. For 17 years in my life, I was in a relationship, and the most important reason preventing my wish to die was to not make my partner sad. When my marriage ended, I was extremely suicidal, but what prevented me at that point was making my family sad. I went on ketamine treatment for two years, which helped keep me stay kind of surface level. \n\nI ended up being medically retired from my career due to my mental health. It was that point that I decided that I was just going to travel. However, my plan was to travel until I ran out of money and when the money ran out, I was going to end it all.\n\nWhat was unexpected was I met someone who I fell in love with when I traveled. That relationship didn’t last all that long, but it was the spark of falling back in deep connection with another human at such a real level, that gave me hope. \n\nTook a few months after that, with some other major life blows and started focusing on myself. When I finally kind of came into my own and had a very relieved feeling of depression (but still not functioning like “normal” people), I found myself in another relationship with someone who I had met briefly and we talked long distance for a long time. This led for me being the happiest that I’ve been in forever. We finally reconnected in person and dated for a while, and that relationship ended about a month ago. \n\nI’m still traveling and I’m almost out of money, but the thing is, I no longer want to die. What I managed to prove to myself, while running through my life savings, is that life presents wonderful things at random moments and there are so many just amazing things and experiences that I’ve had that I wouldn’t have had if I killed myself.\n\nI’m still very depressed and honestly feeling the worst that I have felt in a long time, because of the end of my last relationship that had instilled hope, but the thing is is I don’t feel like giving up the same this time. \n\nI don’t know what I’m gonna do financially I don’t know how to get my mind right in order to be a functioning member of society in the same way again, but what I did realize is that my values do not coincide with the society in which I exist back home I realize that there are so many great things in life just don’t exist where I’m from, but that doesn’t mean they’re not out there. So now my job going forward is gonna be to just figure out how to make things work, because the good things tend to find me when I allow them to, and the biggest way for me to not allow them to would be for me to remove myself. \n\nSo I’m not going to quit anymore. I’m not going to resign myself to death to which I don’t believe there’s an afterlife. I’m not going to allow the rules of the world which I was born into to control my life and just keep me down. I’m going to keep going out there and looking to pave my own way like I have for the last few years and I’m sure the other good things will find me.\n\nI have been extremely risk-averse which is caused both phenomenal payoffs and horrible mistakes and I only lived that way because I didn’t care what happened. That has also told me just to maybe say yes to a little more things and be a little less worried about shit. Because realistically my worst case scenario is a part of my brain’s best case scenario so what do I have to lose by just going out there and trying to find something that will make me want to wake up every day",
            "score": 1,
            "replies": []
        },
        {
            "author": "Illustrious-Tale683",
            "body": "My cats , my grandkids and my husband keep me going and lots of time on the beach .",
            "score": 1,
            "replies": []
        },
        {
            "author": "stargazer4645",
            "body": "Playing guitar hiking and making sure my mom doesn’t become suicidal",
            "score": 1,
            "replies": []
        },
        {
            "author": "luna__000",
            "body": "my dog",
            "score": 1,
            "replies": []
        },
        {
            "author": "Big-Waltz8041",
            "body": "That I need to survive so that I can help others some day…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Taupe88",
            "body": "theres simple easy things i enjoy. and i focus on being grateful. also, the knowledge that everyone will die allows me to try to make a meaningful life. ill die like everyone, did i do some good today wo looking for any payoff. the good for itself?  is there anything beyond  that? that is a reason to live.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MadMuffinMan117",
            "body": "Magic mushrooms",
            "score": 1,
            "replies": []
        },
        {
            "author": "thebadwolf79",
            "body": "small, measurable successes",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComprehensiveMall165",
            "body": "Knowing that I have defeated depression before and I can’t let it win this time either",
            "score": 1,
            "replies": []
        },
        {
            "author": "Turbulent_Tiger_2794",
            "body": "The cats still need their next meal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "abramN",
            "body": "I can't quit because there are others depending on me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Custard_8273",
            "body": "Both of my parents are still around and so is my sibling. If they weren't here I wouldn't be either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweet-Competition-15",
            "body": "Occasional glimmers of hope do perp through like sunlight on an overcast winters day. Usually though, I just exist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "d00md0ll",
            "body": "The need to know what the One Piece is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rjd2point0",
            "body": "My kids and my dog.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MacabreMori113",
            "body": "God and Zoloft",
            "score": 1,
            "replies": []
        },
        {
            "author": "IllExplanation3626",
            "body": "My love of others. Having seen firsthand (many times, unfortunately) what losing a friend/relative too young or soon does to family and friends REALLY keeps my head together. Even during those times when I tell myself “they’d be better without me”— no, they *absolutely* would not be. I know it, and I love them too much, even when I feel like a bag of shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "drillthisgal",
            "body": "Sometimes I feel better. I just try to think about those moments and that they will keep coming eventually.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Piece_3546",
            "body": "Walkig bare foot, cold showers, and no too much screen time",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThatsItImOverThis",
            "body": "Spite. I figure after all that crap the law of averages has to give me something at some point. And if it doesn’t? I’ll still be glad I fought.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wholemelt96",
            "body": "The intensity and fear of having to show up everyday. I don’t wanna get out of bed but I have to so I can have a bed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hi-d-ho",
            "body": "My nieces lost their dad and their grandfather last year, and they are both under 8. I couldn't bear being another dead family member to add to their trauma.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirVictorious",
            "body": "My family",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mother_Second368",
            "body": "My pets. I don’t know what I would do without them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impossible-Film4781",
            "body": "Escitalopram 10 mg everyday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wendyhuman",
            "body": "Existing is required.   My presence might not be desired but Existing is. So keep the meat suit alive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DukeNeverwinter",
            "body": "Meds",
            "score": 1,
            "replies": []
        },
        {
            "author": "Saltedpirate",
            "body": "The only thing I have left to hope for is upvotes on this comment",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArticleIndependent83",
            "body": "My parents. I HAVE to live longer than them. After that, fair play",
            "score": 1,
            "replies": []
        },
        {
            "author": "superleaf444",
            "body": "Exercise. So much exercise. \n\nAnd food. The good kind not that unspiced or salty processed shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FondantCrazy8307",
            "body": "Duloxetine and venlafaxine but if someone offered to shoot me in the head or give me a cyanide pill I would take it tbh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Straight_Ticket4065",
            "body": "Future you will thank now you, make better choices now and don't put things off just get it done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "outside8901",
            "body": "1. Micro dosing Magic Mushrooms. Full stop, nothing else even comes close.  2. Exercise helps especially when using heavy weights.  3. Getting enough sleep without sleeping so much you're avoiding the world. 4. Avoiding alcohol. Limiting sugar intake. 5.  Practicing controlling my emotions. 6. The constant love from my dog. \n\nWhat didn't work for me... 1.  Therapy.  2. CBD or THC 3.  Did I mention Therapy?\n\n3 years doing as I suggested above and life has never felt better, for me.\n\nJ",
            "score": 1,
            "replies": []
        },
        {
            "author": "str4vri",
            "body": "My dog.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cloistered_around",
            "body": "Eh, might as well see what happens.\n\n\nI wasn't *interested*, I didn't *care* but between \"end it\" or \"don't, and maybe it'll wear off eventually\" I chose the latter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jdtpx",
            "body": "My kids & beer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MundaneMeringue71",
            "body": "Caffeine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlashySock8899",
            "body": "I've started using an app called Finch, and it has really helped me get motivated and out of my slump. It is mainly a fun task app. Daily tasks, like getting out of bed, getting dressed, brush teeth, etc. You can also set up other tasks that you maybe do once a week or once a month, etc. As you complete tasks, you gain gems and then use the gems to dress your finch or send them on adventures and decorate their birdhouse. Also, it has depression tools like breathing exercises, and 5 senses, etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ADisappointingLife",
            "body": "My kids, and the fact that my Dad killed himself, so I have a hard time reckoning with the collateral damage.\n\nBut, fuck, I wish I'd just die. Every day, for a long time, now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CreefGehtNicht",
            "body": "decision paralysis",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kesse84",
            "body": "Duty. I got depressed while pregnant. I know that postpartum is a thing, but it got to me before. I was not ready to have a baby. Everybody around me cheered, and I felt like a villain and very much alone. And then baby was born, and it got darker. But I had to get up, to pump, to feed, to burp. I had no excuse, good husband, healthy baby, good life. So I just woke up 5 times per night and did my thing. It took me awhile, before I smothered the feelings down. So logic..?",
            "score": 1,
            "replies": []
        },
        {
            "author": "YankeesNeedPitching",
            "body": "Dont want to hurt my family. If it wasn’t for them it’d been over a long time ago",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key-Lead-3449",
            "body": "My dog",
            "score": 1,
            "replies": []
        },
        {
            "author": "Midir_Cutie",
            "body": "Dessert",
            "score": 1,
            "replies": []
        },
        {
            "author": "Belle0516",
            "body": "My students. I teach elementary and they're my pride and joy. I might not be perfect and we definitely have our rough days, but they need me. They need someone who cares for them and is there for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spooky_Sushii",
            "body": "The song lyrics: “don’t kill yourself time will do it for you just wait” There is an end eventually",
            "score": 1,
            "replies": []
        },
        {
            "author": "makemedoit-1",
            "body": "I have found that my best cure for depression is to do something good for somebody else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ayesha_reditt",
            "body": "Hope. Hope keeps me going that it will all be better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "flumpdoria",
            "body": "Meds and inertia, mostly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnarchyForPeace161",
            "body": "My chihuahua, people ask me what will I do when he dies. I tell them I'll get two more chihuahuas! It's a beautiful thing to rescue a life to save your own.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Pedro_Parker_",
            "body": "Weed & Music.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrincessPeach_100",
            "body": "Focusing on one hour/day at a time has helped me a lot in the past.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PracticalSoup2870",
            "body": "I keep going for a new record poop size each time",
            "score": 1,
            "replies": []
        },
        {
            "author": "AccumulatedFilth",
            "body": "Antidepressants helped me. And unlike most depressed people, I'm not lonely. I have people around me that truly care about me and care for me. I'm truly blessed by the people around me.\n\nThen why am I depressed? --> poverty",
            "score": 1,
            "replies": []
        },
        {
            "author": "killbuckthegreat",
            "body": "Adequate sleep.  Camping/hiking trips.  Dream of my own cabin.  Literature, art, and music.  Keeping an open mind. Quality time with friends when they're available, as you get older the good times from socializing slow down.  Not wanting to cause my family pain that can't be resolved.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yetanotherweebgirl",
            "body": "At this point, spite. The things that depress me are beyond my control, be it the selfishness of older generations, the corruption in politics, the horrors being committed that prove humanity never learns from its past (beyond how to be more evil) and even the fact that there are elements who want me and my kind dead or at the very least ostracised from public life.\n\nI refuse to die, refuse to be invisible because it pisses those assholes off no end to see me continuing to live, continuing to breathe the same air as them and continuing to point out their hypocrisy, their lies and ignore their propaganda. It drives them mad that no amount of their cruelty nor their desperation to shutdown dissent or challenge stops me from living or stops me from calling their bs when i see it.\n\nMy reason to live is to piss off every transphobe, homophobe, every right wing loon, every soulless fascist, every capitalist pig, every religious zealot who cant stand people who wont bow to their imaginary friend.\n\nThat’s what keeps me going",
            "score": 1,
            "replies": []
        },
        {
            "author": "MisterMoogle03",
            "body": "Life is good even when I’m numb. It’s just not as enjoyable without all the colors, but they show up in the best of moments.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lavender-n-Lipstick",
            "body": "Fear of death. Fear of non-existence, specifically.\n\nEven if it feels like a good thing every now and then, it’s still too soon. \n\nOn the other hand, I’m taking care of my health now and I’m getting better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pando5280",
            "body": "My dog.  Time in nature. House plants.  Color changing led lights.  Cutting toxic people and toxic media out of my life as much as possible. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "MountainMan2_",
            "body": "I am remarkably good at forcing myself to do things despite my emotions. When I was a kid I was bullied literally to tears every day, and my family only found out because I started throwing up on the way to school. I absolutely would not miss class no matter how afraid I was, and i pushed myself till i ended up in the hospital. I was in 5th grade. My bully eventually got suspended for trying to slit my neck. \n\nSo basically, I brute force my way through, getting life done because I have decided that no matter how much I want to give up, I have to work for tomorrow, even if I don't believe it will get better. Even a pointless task has to be done if it's on the list. \n\nLuckily, one of the tasks I forced myself into was therapy, about a year ago. The medications are helping now. I just hope they don't weaken my willpower, not having to fight as hard against my demons, because I know they will one day return in force.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hall711",
            "body": "Bong riffs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lemonwizard",
            "body": "When I feel like ending it, I make an appointment to donate blood. Somebody needs help and I can stick it out a few more days for them. I always feel better. So much of what I do is tedious and pointless, it is nice to know that I've made a big difference for somebody else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "katievera888",
            "body": "My grandchildren. And my kids too. I don’t want my legacy to be “oh she killed herself”.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Star_BurstPS4",
            "body": "Down votes it makes my day like a tween reviving an up vote",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dry-Double-2816",
            "body": "I have been telling myself I have to at least see my 25th birthday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "andy11123",
            "body": "Sertraline",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adhesiveness269",
            "body": "The fact that something wonderful might happen tomorrow. I don't want to miss it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chucktayz",
            "body": "Bc no matter how deep depression is it’s finite. Someday you will feel happy. Why miss out on that?",
            "score": 1,
            "replies": []
        },
        {
            "author": "supercutepol",
            "body": "I just think that some things might change but everything evolves. Also, you only live once.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spoollyger",
            "body": "Consuming liberal tears.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Antique_Software3811",
            "body": "Cowardice and indecisiveness.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radiant_Gas_4642",
            "body": "Waking up to “mommy where are you?”",
            "score": 1,
            "replies": []
        },
        {
            "author": "NamelessMonsta",
            "body": "Next month's pay if not fired.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EmbarrassedDay246",
            "body": "Kids, spite, thc, coffee and exercise.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zinnuvial",
            "body": "If I kill myself the republicans win and I can’t have that",
            "score": 1,
            "replies": []
        },
        {
            "author": "User_Error1975",
            "body": "Bills",
            "score": 1,
            "replies": []
        },
        {
            "author": "dieforu_19",
            "body": "Let me put y’all onto a secret. \n\n*Depression has a harder time hitting a moving target* \n\nMake it make sense to you in whatever manner you feel right and watch the magic. \nThis helped me overcome my severe depression back which I had battled at 16.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bangbang995",
            "body": "Working out. It’s the only time I feel calm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oizys_Nyx",
            "body": "Removing the word 'should' from my vocabulary. Don't say it or hear it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad-Twist4604",
            "body": "Habit and the slim chance I'll get laid again some day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Internal-Neat-9089",
            "body": "My anxiety lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Krektonix",
            "body": "Hopefully before June I'll find a girlfriend. I just want to make a girl happy, my depression is just intense AF loneliness which goes away instantly and completely when I'm in a relationship. It's confusing but just accept it. If not before June then... let's just say I won't have to use my heart anymore if yk what I mean.",
            "score": 1,
            "replies": []
        },
        {
            "author": "not_another_sara",
            "body": "Books. Losing yourself in a completely different world can help for a while. \n\nPets/Animals! They are a huge help mentally and physically. If you can't house or afford a pet, a lot of shelters provide everything and just require you to foster the animal, or you can volunteer at a humane society because they always need people to play with the animals or walk the dogs. \n\nMy husband... He's my main reason.",
            "score": 1,
            "replies": [
                {
                    "author": "Professional-Most718",
                    "body": "Book rec’s?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "not_another_sara",
                            "body": "Depends on what you like to read... I have a recommendation for almost everything from romance to horror.\n\nWhen I am depressed though I hate reading about other people being happy, so I'll give you my horror/adventure/sci-fi list. \n\nSpiders - The Hatching trilogy by Ezekiel Boone \n\nMermaids - Into the Drowning Deep by Mira Grant\n\nCreatures - The Anomaly by Michael Rutger (I really enjoyed this one. It reminded me of an 80's horror movie)\n\nCreatures - Awakened by James S. Murray ( I don't want to say more and spoil it)\n\nSpace \"creatures\" (not stereotypical aliens) - The Last Astronaut by David Wellington\n\nSharks - The Meg by Steve Alten (better than the movie for sure)\n\nPrehistoric creatures - The Loch & Vostok by Steve Alten\n\nGorillas - Congo by Michael Crichton\n\nUndisturbed ecosystem - Fragment by Warren Fahy\n\nDemons/supernatural - Ararat & Pandora Room by Christopher Golden\n\nCreatures - Annihilation (the entire Southern Reach Trilogy) by Jeff Vandermeer (they released the movie a few years ago I think; I haven't seen it yet. The first book is good, and the last 2 are subpar).\n\nSquid - The Beast by Peter Benchley (he also wrote Jaws) \n\nPhantoms by Dean Koontz (not sure how to describe it, but Affleck was da bomb in the movie, lol)\n\nThe Ridge by Michael Koryta. I went into it thinking it was a ghost story but it totally went a different but amazing way. Really emotional but definitely worth it. \n\nSub-Zero by Matt James. It's set on a research vessel near Antarctica. Off the coast of McMurdo Station, in the frigid waters of the Southern Ocean, a new species of Antarctic octopus is unintentionally discovered. \n\nSubterranean by James Rollins or The Maw by Taylor Zajonc (both involve undiscovered caves and their unique ecosystems).\n\nHopefully this helps a bit! Let me know if there's a different genre you'd like.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "timewastingkinger",
            "body": "Instagram reels",
            "score": 1,
            "replies": []
        },
        {
            "author": "Miss-Indie-Cisive",
            "body": "If I die my children will be split up by their fathers and never see each other again. Hurts too much to think about.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AzuleStriker",
            "body": "don't want my kid growing up without me. past that... i'd be gone. Definitely not here for me, cause i'm truly not worth it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "keep_it_kayfabe",
            "body": "My wife and kids need me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thedisciple516",
            "body": "My family would be devastated. It would be a big huge giant mess literally and figuratively.  It's slowly getting better on it's own.  There's a chance I'll be myself again before I get too old.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Acceptable_Mode_3633",
            "body": "Ketamine. Ketamine takes most of my depression away. \n\nBefore I discovered ketamine therapy, it was a promise I made to myself when I was 19 that I would find out why I felt the way I did.",
            "score": 1,
            "replies": [
                {
                    "author": "Acceptable_Mode_3633",
                    "body": "And ... my cat. Best cat out of all best cats. I want to give her a life in the same space. I figure if everything goes perfectly she's got about 8 years left, though that's unlikely.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "togo901",
            "body": "I saw this somewhere- that even the mundane days is something I rmr as being the best in my life. And that hit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RevolutionaryMail747",
            "body": "The sun coming up. Putting one foot in front of the other. Reminding myself that changes is happening and that depression is a function in of itself. Forcing myself to fake it was actually key to recovery. Doing things I didn’t want to do but needed to do was next. Hope does spring eternal and the sun does come up. Tiny progress is progress. All these things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "D0G3D0G",
            "body": "The gym and weed",
            "score": 1,
            "replies": []
        },
        {
            "author": "wtfishappening29",
            "body": "Gym",
            "score": 1,
            "replies": []
        },
        {
            "author": "moldrickx",
            "body": "People in my life who I know love me deeply. On days of true mental health crisis, like wanting to impulsively end it and not seeing any way out, it's the only thing that's kept me going - not necessarily that their love makes me feel better (on good days it does), but just that I couldn't bear to bring so much pain into their lives by ending my own.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bozobot",
            "body": "My daughter made me promise that I would not unalive myself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nevermoreravencore",
            "body": "My nieces and nephew. I knew I wasn’t meant to be a mom, but I *was* meant to be an aunt. While my logic isn’t controlled by this - I want to be someone they trust (when they’re older). I can’t do that if I’m not here. I want to see their major life milestones - that’s what keeps me going.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hash-slingin_slashrr",
            "body": "I have nothing to fall back into.\nNobody will take care of me if I lose my shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "YoshiTree",
            "body": "My kids",
            "score": 1,
            "replies": []
        },
        {
            "author": "3nigma_f0rce5",
            "body": "I have 2 babies that need me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rubystang91",
            "body": "Drugs",
            "score": 1,
            "replies": []
        },
        {
            "author": "PussyCompass",
            "body": "Family",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic_Top_616",
            "body": "😐Food and binge watching shows. Then I stay hydrated. Also I wear comfy clothes and snuggle under my covers. For once I’m not concerned with how I look. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "StickEducational8221",
            "body": "My love for prophet Ali mainly. And how prophet Ali suffered on hands of Sunni and Jews.\n\nThis is what keeps me together, if even our beautiful, smart, generous, righteous prophet had it rough, why wouldn’t me, someone who isn’t a prophet have it any less rough ? If I live life easy mode it means I would be sucking the devils c*ck",
            "score": 1,
            "replies": [
                {
                    "author": "StickEducational8221",
                    "body": "And my hate for my enemies, it’s not even that I hate my enemies that much ( I do but it’s like saying the sky is blue) it’s more of how much I hate the kids that suck the c*cks of my enemies and gobble them for nothing. Not money , nothing. They just love it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ReplyGuySupreme",
            "body": "Hey there, I'm really sorry to hear you're feeling this way, but I'm unable to provide the help that you need. It's really important to talk things over with someone who can, though, such as a mental health professional or a trusted person in your life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bananaman9020",
            "body": "A lot of medication.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dk_deadXD",
            "body": "if die il prob end up in hell and if not i would prob end up in nothing so better stay living in this hell that might bring me joy once year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "the_addict",
            "body": "Mom and cat",
            "score": 1,
            "replies": []
        },
        {
            "author": "1beerattatime",
            "body": "Honestly, I don't know. It's been especially tough recently. No matter how hard I work, I can't seem to get any kind of financial or romantic headway in my life. It feels like I'm destined to die poor and alone, and that's not a future I'd care to see.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ILoveToTour-9987",
            "body": "Just remembering that there's someone watching me: my brother.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Novel-Office288",
            "body": "Fasting",
            "score": 1,
            "replies": []
        },
        {
            "author": "Time_Outcome5232",
            "body": "I have loved ones that died before me. I need to live to share their memories, their ambitions, and their adventures with others. A second death is when all those that remember you die as well. I want my loved ones dreams and goals to live on through me. When I accomplish something in a way they have too. Those passed on cheering me on from the otherside keeps me going.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_anne_shirley",
            "body": "Being active. Getting in the sunshine when you can. Music.",
            "score": 1,
            "replies": []
        },
        {
            "author": "True-Researcher-1233",
            "body": "Prayer and crying at least once a month to let out my emotions",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neat_Barber9671",
            "body": "High dose of Zoloft",
            "score": 1,
            "replies": []
        },
        {
            "author": "lamemayhem",
            "body": "Too afraid to kill myself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HobbittBass",
            "body": "What helps me is knowing that it comes and goes. It might be a few days, or it might be months in a deep pit. It’s impermanent. Also, Prozac did wonders for me. It didn’t stop my feelings, but it made the pit less deep and inescapable. Oh, exercise and being active socially are crucial.",
            "score": 1,
            "replies": []
        },
        {
            "author": "InTooManyWays",
            "body": "Nothing. I’m living on thin ice",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silver_Pilot_1922",
            "body": "Medication",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gorditacrunch40",
            "body": "That I have family that cares about me. I wouldn’t want to put them through the pain of me tapping out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rawchallengecone",
            "body": "I’ve never wanted to end my life without any seriousness but I have considered it a time or two because why not? \n\nWhat keeps me going is my daughter. She’s 15 months.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KalbertFriedstein",
            "body": "\"Drugs and music get me where I want to go now...\" -Uncle Howie",
            "score": 1,
            "replies": []
        },
        {
            "author": "happydayz02",
            "body": "I have accepted that we are not here to be happy. We are here to find meaning. So when I have days that I feel extremely depressed and exhausted, I do try to focus my energy on doing something for someone else. If I can do one or two things a day when I'm feeling extremely low, that will help improve the day of someone else that means my life has meaning. Happiness is a fleeting emotion. We have to try an anchor ourselves in purpose and in service. I've accepted that my brain doesn't work the way other peoples does but I'm not going to let it destroy my life or completely ruin my potential. I can still do much good in the world even if feeling good is not something that happens for me everyday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tea_Hermit",
            "body": "If I’m gone my wife will struggle to do a good portion of daily tasks and care for herself. I need to take care of her and help her live a fulfilling life. If she goes before me I will follow her into the end. I really hope I can see her again once we go. I’m more scared of leaving her to suffer alone than I am of dying. I really don’t want to be here anymore.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fruitbasketinabasket",
            "body": "Saw a video someone saying that death is a permanent solution to a temporary problem",
            "score": 1,
            "replies": []
        },
        {
            "author": "egretstew1901",
            "body": "The ideas of stoicism are slowly starting to permeate my inflexible mind, and as they do, the world is coming together slowly. Still a long way to go, but it feels like the right way. I haven't even read all of it yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slow_Objective9321",
            "body": "Spite. I must outlive my enemies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KrimboKid",
            "body": "Stoicism. Look up “How to Think Like A Stoic” by Massimo Pigliucci, as well as “The Daily Stoic” by Ryan Holiday. Both have tons of YouTube videos as well. \n\nAlso antidepressants. I recommend those too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KeyTheZebra",
            "body": "My mom killed herself when I was 18 and it made me sad.\n\nMy suicide will make SOMEBODY sad in ways I can’t imagine. \n\nI don’t want to make anyone sad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vanity-della23",
            "body": "Waiting for the headline of the orange doofus’s death, that’s the only thing keeping me here, I want to be alive to see it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electrical-Hall5437",
            "body": "Cat",
            "score": 1,
            "replies": []
        },
        {
            "author": "millenz",
            "body": "Seriously, medication - legit and self (weed)",
            "score": 1,
            "replies": []
        },
        {
            "author": "cripple2493",
            "body": "I set up the next thing to do.\n\nMajor depressive sucks, and over the eyars I've found the only way to keep it somewhat at bay is to set up things to do that both take a long time, but have smaller achievable goals that keep an element of dopamine boost. These could be small things like \"It'd be cool if I learnt how to cook a good macaroni\" or larger things like my PhD study or sports practice. \n\nWithin these goals, I still have to deal with burnout and all the other nonsense that comes along with life - but having a set \"I need to have acheived <thing> in X time\" helps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThyArtisMukDuk",
            "body": "Thinking about the reactions of my friends and loved ones when they hear the news. Knowing how devastated my father would be is what keeps me trudging through and being here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kopikobrownwsugar",
            "body": "Death is expensive for those you'll leave  behind ",
            "score": 1,
            "replies": []
        },
        {
            "author": "New-Definition3848",
            "body": "A dream of a happy life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crispier_creme",
            "body": "I'm too much of a coward to actually take myself out. That was my reasoning for a long time.\n\nNow, I'm realizing I deserve better than what I've had, and I owe it to myself to try to better my life. It's slow, it barely works, but with professional help and supportive friends I'm slowly but surely making my life slightly better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CharlesDudeowski",
            "body": "Meds, weed, mantras, movement",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkPickle2474",
            "body": "I don’t want my brother to have to explain it to his kids. \n\nThere are a lot of people who count on me. \n\nAnd sometimes things are great. They’re probably always somewhere between fine and great, I just don’t know it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pete3382",
            "body": "Therapy",
            "score": 1,
            "replies": []
        },
        {
            "author": "This-Masterpiece-219",
            "body": "Pure hate",
            "score": 1,
            "replies": []
        },
        {
            "author": "Uvtha-",
            "body": "The crushing weight of my responsibilities.  :D",
            "score": 1,
            "replies": []
        },
        {
            "author": "Presspass479",
            "body": "I don’t have a choice. As a parent I have to be strong enough for her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pmel13",
            "body": "Multiple medications. My family & friends and most importantly my cats. And recently a determination to outlive tr*mp, I want to be part of the celebrations when it happens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sarelbar",
            "body": "**An extensive medication regimen**\nPristiq, Lamictal, Adderall, Wellbutrin, Trazodone (sleep)\n\n\n**Vitamins** \nL-Theanine (swear by this), Magnesium L-Threonate, Vitamin D, Fish Oil, Evening Primrose, B12 \n\nYears of therapy. \n\nMy dog and my family.\n\nGratitude and hope.",
            "score": 1,
            "replies": []
        },
        {
            "author": "milfl0ver420",
            "body": "my dog",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emz423",
            "body": "My kids 💞",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leviathan650",
            "body": "To be honest knowing I passed through worst time, similar times helps me. I try to be extra nice with myself and remember how I'll just have to go back to the tutorial mode: how to breath, how to wake up, Shower, etc. If it doesn't work I tricked my brain to do self-harm that's actually good for me ( ex: cold baths)\n\nI accepted my messed up brain and when it's going very badly, I'm trying to do as much as I can in this moment. If it's just to go fetch water or wash one cup, I'll try. And if it's too much, I tried and there are days like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Professional-Most718",
            "body": "Ah idk depression has sucked the life out of me, Video games and books help me escape for a few hours a day. I don’t really want to continue but I don’t have a choice. Not sure how I’m going to get my life back but I do whatever I can keep whatever sanity I have left.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cute_Boysenberry_167",
            "body": "My volunteer work. It snaps me back, keeps me going.  I teach art to homeless youth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Own_Magician_7554",
            "body": "Medication.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Royal_Ad_9033",
            "body": "Lots of Zoloft!!  Seriously, if I don’t take my meds I feel off, unfocused, cloudy, and feelings start to creep in.   Sertraline allows me to focus and keep my mind occupied.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Guard_8024",
            "body": "I just I came here to get an answer. Cause a little bit ago I was wondering why. Other than my cats and my partner. But they could be happier with someone better than me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "missblooperson",
            "body": "forcing myself to find things to look forward to. when i was thinking about ending it all, the only thing that kept me going was the curiosity of \"but what is going to happen in the next chapter?\" of something i was reading at the time. this can be a new episode or a new chapter or a small plan i made with someone. it can be incredibly hard to feel excited about things when you are depressed but forcing myself worked for me. it is still an ongoing battle and i imagine it will never end but small things to be excited for keeps me alive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DreamyDudeBobby",
            "body": "Continually looking for something that is the opposite of depression",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jbarlee",
            "body": "Ssri- citalopram",
            "score": 1,
            "replies": []
        },
        {
            "author": "eyeaye_cruiseship",
            "body": "Vyvanse lmfao. Escitalopram never helped but this new meds gave me a push off the edge. \n\nAlso the fear of disappointing people and getting criticized after death lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChanceForce111",
            "body": "Zoloft. I’m done trying to outsmart a chemical imbalance",
            "score": 1,
            "replies": []
        },
        {
            "author": "Less_Chocolate_9761",
            "body": "My kids",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accidental_Taco",
            "body": "Mom can't take care of herself due to health issues and I have a toddler nephew that thinks I'm pretty awesome. More than those, nobody loves me more than my dogs. Once I lose those then, we'll, I guess we'll see.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoistKite1",
            "body": "My girlfriend of 3 years admitted to cheating on me over 15 times in 2.5 years. Brought me across Canada to live somewhere i didn't want to. Set me back super far. Even though I am incredibly devastated. What keeps me going and not give up on life is the fact I'll only have this life once. Once I'm gone, I'm gone.  I'd like to experience stuff and things.\n\nSo yeah, even when depressed and that happens, you have to keep going. Spite your depression",
            "score": 1,
            "replies": []
        },
        {
            "author": "NorthernCobraChicken",
            "body": "My son",
            "score": 1,
            "replies": []
        },
        {
            "author": "GhostOfYourLibido",
            "body": "To tired to kill myself so I don’t gotta choice",
            "score": 1,
            "replies": []
        },
        {
            "author": "Poverty_welder",
            "body": "Procastination",
            "score": 1,
            "replies": []
        },
        {
            "author": "soggylamps",
            "body": "I think of people like Mitch McConnell and MTG and know that I deserve to outlive them and party like hell when they’re gone",
            "score": 1,
            "replies": []
        },
        {
            "author": "MissionSlight2332",
            "body": "Until today...I always thought my purpose in life was to give the most loving and incredible life to some children some day (teaching, birth, adopt, foster, whatever). Any time I've really wanted to end it I literally would say \"I can't there are children out who need a mother to love them\" \"you can't go you have to be someone's mother first\" \"they need you\" All this love I have in me with nowhere to go it's drowning me. I can't breathe. I thought at least I'll be able to give it to them. It's the only reason I've made it this long.\n\n\nUntil today that would help. I don't know what to do now ",
            "score": 1,
            "replies": []
        },
        {
            "author": "DueSize8477",
            "body": "Gotta outlive that motherfucker.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nippyhedren",
            "body": "My dog.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Best-Discussion5570",
            "body": "I want to live, I want to have a future. I want to see where my life will go, I don’t want to end it early. I don’t have a life purpose, I just wanna see myself grow up and then I can say “I made it” because I really did.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Significant-Math6799",
            "body": "I have had therapy and by far the greatest impact for me has always been a very good therapist and ideally long term therapy with that therapist. This is rarely a possibility for many but for me it was a lifesaver. I found a therapist who charged concessionary fees, still more than I could afford but I was happy to go without because I realised pretty early on how much of an impact it made for me and how much I held on to the hope that therapy offered and which I couldn't form for myself purely because I had been battling for so long and despite my best efforts couldn't see any way ahead. Therapy at least helped me to hold on at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cryptooptimist77",
            "body": "Weed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "u6crash",
            "body": "The hope that things will get better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infinite_Duck77",
            "body": "Fuck idk I just haven't blown my brains out yet, maybe there's some part of me thats hopeful for a better future but if there is i don't associate with it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aliphese322",
            "body": "My parentss. I been dead for a long time",
            "score": 1,
            "replies": []
        },
        {
            "author": "AwkwardlyTwisted",
            "body": "My daughter isn't ready for me to leave her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kellysuepoo",
            "body": "Zoloft helps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Common-Impression-24",
            "body": "Meh. I just want to try to make it to 58 and see what happens in the coming years. That's about it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pixieprxincess",
            "body": "Losing my cousin to suicide. I saw what it did to my family and I couldn't do the same to them, even when it gets so hard. Also my nieces and nephew really help out. I wanna see their achievements",
            "score": 1,
            "replies": []
        },
        {
            "author": "naes41091",
            "body": "I don't want to participate in this society anymore but I still want to participate in life, and after having weighed the pros and cons of lying in bed until I'm homeless or kill myself, I've decided to go to work instead",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lilith_Immaculate_",
            "body": "Spite.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jazzysmaxashmone",
            "body": "Bingo! Why did it take me so long to find this comment? Literally some days it's simply spite. Other days Prozac picks up the slack. But I am one determined mother fucker. Spite has carried me through many a day",
            "score": 1,
            "replies": []
        }
    ]
}