{
    "title": "Group chats with homeowners/clients?",
    "author": "Ok_Package1111",
    "subreddit": "Construction",
    "rank": 18,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Construction/comments/1jejo18/group_chats_with_homeownersclients/",
    "id": "1jejo18",
    "selftext": "I’m a project manager for a contracting company doing high end residential work. Do you guys thinks it’s normal to have group chats with homeowners regarding the project where they can text you in the evenings and on weekends? This has become a thing and I find it very intrusive even if I put the text threads on ‘do not disturb’. I tried pushing keeping this sort of thing in emails only, however my boss doesn’t care. I’m curious if this just comes with the territory of working in Construction… \n",
    "comments": [
        {
            "author": "JJxiv15",
            "body": "Nope. Absolutely not. \n\nI have a work phone for this reason. After 530pm, that one goes on DND. A true work-related emergency will find its way to my personal phone. \n\nCan't let people intrude on your personal time.",
            "score": 6,
            "replies": []
        },
        {
            "author": "KarpGrinder",
            "body": "I'm not in residential, but that sounds like shit.\n\nAre you getting paid for your \"on-call\" hours at least?",
            "score": 3,
            "replies": [
                {
                    "author": "Ok_Package1111",
                    "body": "So I’m not expected to answer, he tells me to just ignore it, and I do. But it feels like this looming thing over me when I don’t answer, and then I’m not enjoying my time outside of work.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "M_Meursault_",
                            "body": "Set boundaries. I’m in the same market segment, also a PM. Usually clients respond pretty well - unless you’re dealing with the RICH rich. Sometimes even just having a tactful conversation STARTING WITH “you can email me at any time of the day, and I will get back to you ASAP, but….” Can go a long way.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "KarpGrinder",
                            "body": "Is it on your personal phone?\n\nIf you're expected to participate in these chats your company should be providing you with a company phone. \n\nTurn it off when you're not working your regular hours.\n\nUnless you have negotiated for an additional financial compensation for working in your leisure time.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comfortable-nerve78",
            "body": "This comes in the high end market. What a sweet hell you’re in. No not normal. How the hell do you get away? No no no. It’s a high end home buyer thing. I deal with retirees in a subdivision I have worked in for 25 years they have chat boards to bitch. Luckily we don’t have to deal with it but it’s fun to see the shit they talk about us. No way I’m chatting with those people no way. This better not become a thing in the lower ends of residential.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Informal_Post3519",
            "body": "Hey, fellow coordinator here - this isn't desirable.  I feel you on the group chat creep, it’s brutal when homeowners text at 8 PM on a Sunday. \n\nI’ve been moving to email and one trick I've been using is an email reflector. I use EMail Parrot and it bounces to the group without sharing email addresses or numbers. They email, not text, so you control when you check it and reply. I keeps it pro by setting up the lists on my domain.  Tracks project stuff better than chat threads.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Livid-Armadillo-5561",
            "body": "I do try to be responsive and will often take a call or respond to a text after hours. I do occasionally have to draw the line if it gets out of hand. I have an established cadence for site walk/ owner meetings and try to cover everything then. But sometimes people get to peruse Pinterest and send screenshots at midnight or find the perfect range hood while at a resort in Maui, and we gotta talk about it now. You can always add a bitch tax to change orders and make it worth your time if it gets too crazy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beneficial-Ambition5",
            "body": "Absolutely not. I’m working in custom residential in project management and communicating with clients is high on my job description. They can email all they want, and they have my phone number for urgent issues but no group chats at all, and definitely not on the weekends. I consider anything outside of 7-5 M-F to be my own time and I’ll respond to calls and emails at my own discretion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fairlyaveragetrader",
            "body": "I'm on call 24/7, it doesn't really bother me, the reason I exist is to make money. \n\nThat said if you get to the point where you have, I don't know not a lot but maybe 5 million?, I can see wanting to turn your phone off and only have set hours and work when you want to\n\nJust depends on how driven you are. The more interactive you are with customers, the more business you're trying to get the more you're trying to grow your business, get reviews, be out there, get people to know your personality, the more involved you're going to be",
            "score": 1,
            "replies": [
                {
                    "author": "Ok_Package1111",
                    "body": "This is def how my boss views it. I think I’m just getting tired of it. I’ve been doing this for 10 years and I feel like I’m ready to move on.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "fairlyaveragetrader",
                            "body": "Yeah I can't even imagine working for someone else that long. If you have the skills, set your own schedule because a boss is just going to exploit you, you're there to make money for him \n\nYou need to be there to make money for you, you can bust it until you get enough wealth accumulated that you can back off, it's a much more rewarding life. I mean I honestly treat the two guys that work for me like rented mules. They are disposable money makers",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}