{
    "title": "Ordered a mystery t-shirt, was this a limited edition?",
    "author": "RubikOwl",
    "subreddit": "LinusTechTips",
    "rank": 8,
    "score": 1341,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 37,
    "url": "https://i.redd.it/kpjd8gxswbpe1.jpeg",
    "id": "1jdq87a",
    "selftext": "",
    "comments": [
        {
            "author": "FinallyStarborn",
            "body": "It's the first Float Plane exclusive shirt. Only available for a short period a few months ago",
            "score": 822,
            "replies": [
                {
                    "author": "RubikOwl",
                    "body": "That’s what I thought, but I wasn’t sure. I remember being really bummed because I found out about it too late and it had the dinosaur on it.",
                    "score": 260,
                    "replies": [
                        {
                            "author": "Mango-Vibes",
                            "body": "You were bummed out about the dinosaur?",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "nsfdrag",
                                    "body": "> because I found out about it too late",
                                    "score": 69,
                                    "replies": [
                                        {
                                            "author": "Mango-Vibes",
                                            "body": "> and it had the dinosaur on it.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "herkosta",
                                                    "body": "Because he likes dinosaurs, yes i know, English is weird",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FinallyStarborn",
            "body": "I ordered one and it was sent the wrong address. When attempting to correct it I was told they couldn't and it would be returned and destroyed. Still not over it.",
            "score": 181,
            "replies": [
                {
                    "author": "spacetr0n",
                    "body": "Returned and….Sent to that guy. ",
                    "score": 96,
                    "replies": []
                },
                {
                    "author": "edwardK1231",
                    "body": "They told you it would be returned and destroyed? Why not just send it to you? Seems like a weird thing for them to say",
                    "score": 14,
                    "replies": [
                        {
                            "author": "FinallyStarborn",
                            "body": "It was due to it being shipped back to the distributor. Part of how their process works, I guess. I did get a refund.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "edwardK1231",
                                    "body": "Ah that makes more sense I guess. Still weird though, I thought they shipped everything themselves. Good you got the money back though, its annoying for limited edition stuff if you can't get another.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "FinallyStarborn",
                                            "body": "Yeah it sucks but what can ya do? At least I not only got the second one but was there during the stream and contributed during the making. Little wins.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "edwardK1231",
                                                    "body": "Yeah thats cool",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AvarethTaika",
            "body": "omg that's so cute i want one",
            "score": 64,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -11,
                    "replies": [
                        {
                            "author": "lutzy89",
                            "body": "don't support people stealing designs from others",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "PokeT3ch",
                                    "body": "Considering the design is no longer available.  Could it not be argued that this is no different than emulations and roms?",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "lutzy89",
                                            "body": "you could argue that, yes, and that's between you and your morals. The people profiting from the sales of it though... that's less arguable.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "PokeT3ch",
                                                    "body": "Thats a fair take.  The profiting solely by someone else does change things a bit.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AvarethTaika",
                            "body": "you made a whole account just to post a broken link? weird",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sorry-Series-3504",
            "body": "Nice! I'm glad I got mine early before they sold out, I got one of the LTX 2023 and a green Gone Phishin' shirt!",
            "score": 17,
            "replies": []
        },
        {
            "author": "ChickenFeline0",
            "body": "https://preview.redd.it/4jr5e3nyefpe1.jpeg?width=527&format=pjpg&auto=webp&s=58a4922ede416c2c81ae7cd22b25b5538d18c749",
            "score": 9,
            "replies": []
        },
        {
            "author": "Commercial_Hair3527",
            "body": "I might be out of the loop, but what does the dino signify?",
            "score": 4,
            "replies": [
                {
                    "author": "hgs25",
                    "body": "It’s just a cute character. Linus started approving more Dinos after the success of the LTX exclusive Tech Graveyard deskpad.\n\nSarah is the creator of the lil dino.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "lioncat55",
                    "body": "Sarah really likes Dinos and is one of the excellent artists that does a lot of the merch designs. Linus was originally thinking it would likely not sell well with the Dinos. A few small projects happened and everyone loved it, so it's been added to more things.\n\n  \nIt's also just really cute.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "RubikOwl",
                    "body": "I don’t know, I think it may just be a lovable character.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BartLanz",
            "body": "I ordered and got one of these in black as a mystery. I also ordered it when it was released in green. Not disappointed at all. Every time I wear it my wife says a very cute “nom” when she sees him on the back.",
            "score": 11,
            "replies": []
        },
        {
            "author": "zrevyx",
            "body": "NICE! That was a floatplane exclusive. I ordered mine within minutes of them announcing it. It's one of my favorite tees now. =D",
            "score": 6,
            "replies": []
        },
        {
            "author": "dzone25",
            "body": "How is there not more of this cute dino baby everywhere",
            "score": 4,
            "replies": [
                {
                    "author": "hgs25",
                    "body": "I remember Linus said in a WAN show that he wants to keep the LTT merch tech themed. Sarah’s Dino art will be an occasional thing.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "sxegti",
            "body": "I got a ltx 23 shirt! So happy",
            "score": 1,
            "replies": []
        },
        {
            "author": "lioncat55",
            "body": "I have this shirt and it's just so cute. I love the bite in the other wing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CadeMan011",
            "body": "Looks like it. Lucky you!",
            "score": 0,
            "replies": []
        },
        {
            "author": "pikkuhukka",
            "body": "omg thats so cute :3",
            "score": 0,
            "replies": []
        },
        {
            "author": "Own_Cause_7301",
            "body": "lucky you!",
            "score": 0,
            "replies": []
        }
    ]
}