{
    "title": "Ryzen 9950X3D performance when gaming with a video on the side/multitasking",
    "author": "pimpao10",
    "subreddit": "LinusTechTips",
    "rank": 14,
    "score": 5,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/LinusTechTips/comments/1jebvpt/ryzen_9950x3d_performance_when_gaming_with_a/",
    "id": "1jebvpt",
    "selftext": "I know there's a video on this subject, but not taking account 9950X3D and this new feature AMD is using to increase performance in games by using only the cores with 3D-V Cache. Does having other applications running could impact AMD software and \"confuse\" the CPU to use the wrong cores?\n\nI mainly game on my PC, but I would like the extra performance for other applications that I sometimes use. But since this is new, I'm a little worried of making a bad purchase. Like many, I sometimes play a game watching a video on the second monitor. I couldn't find somewhere if someone tested 9950X3D while gaming and having a other task on the background, like watching a Youtube video, Netflix, Live chat, streaming... Anything!\n\n",
    "comments": [
        {
            "author": "Banzai262",
            "body": "during the nfl season, on most sundays I play something like battlefield while streaming 4 nfl games on my tv, which is connected to my pc. the difference in performance vs not streaming anything while playing is basically negligeable. in both case I average about 280 fps. I have a 7800x3d and a 4080.\n\nTLDR: it’s not a concern",
            "score": 1,
            "replies": [
                {
                    "author": "spacerays86",
                    "body": ">TLDR: it’s not a concern for single ccd CPUs.\n\nFTFY. Yours has 3d for the whole CPU so it isn't going to provide a reasonable conclusion to OP, we need more people to test this scenario the 9950X3D. We already know it stays on the correct ccd for just gaming on the 9950x3d, no info for multitasking yet or I have not seen any yet.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Banzai262",
                            "body": "yeah I get that. But let's be real for a sec, even if the performance decreases by a few percent, OP won't notice it at all if he has the GPU to back the CPU",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pimpao10",
                    "body": "I might be wrong, but the on the 7800x3d all cores have extra cache, while on the 9950X3D and 7950x3d it's only half. That's why the 7950x3d have worse performance on games compared to the 7800x3d.\n\nBut on the 9950x3d, idk if its on the bios or windows update, when a game is launched, it only uses the cores with extra cache (as seen on the short circuit video). My concern is that, when multitasking, the processor starts using the wrong cores for the game and it impacts the performance.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Banzai262",
                            "body": "yeah there are cores with and without 3d cache on the xx50x3d, but you’re overthinking it. it’s a beast of a cpu, and with an adequate gpu you won’t feel the difference. or just buy a 9800x3d and you will be fine",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}