{
    "title": "Imagine picking a major so prone to automation in 2025.",
    "author": "RegardedEpicGamer",
    "subreddit": "csMajors",
    "rank": 2,
    "score": 1054,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 208,
    "url": "https://i.redd.it/j32eictwigpe1.jpeg",
    "id": "1je61q2",
    "selftext": "𝐓𝐡𝐢𝐬 𝐩𝐨𝐬𝐭 𝐰𝐚𝐬 𝐦𝐚𝐝𝐞 𝐛𝐲 𝐅𝐢𝐧𝐚𝐧𝐜𝐞 𝐁𝐫𝐨 𝐰𝐡𝐨 𝐬𝐭𝐮𝐝𝐢𝐞𝐝 𝐃𝐚𝐭𝐚 𝐀𝐧𝐚𝐥𝐲𝐭𝐢𝐜𝐬.\n\n𝐖𝐞’𝐫𝐞 𝐛𝐨𝐭𝐡 𝐜𝐨𝐨𝐤𝐞𝐝.",
    "comments": [
        {
            "author": "Toys272",
            "body": "if they can replace programmers  \nwhy would you hire any white collars at all",
            "score": 289,
            "replies": [
                {
                    "author": "local_eclectic",
                    "body": "Someone needs to decide which things to build and how to build them. Product and system design is still important. Deciding which tools best suit your needs and then using them to build things is still needed.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "CrocodileWalker",
                            "body": "A different AI could decide that",
                            "score": 88,
                            "replies": [
                                {
                                    "author": "BadBroBobby",
                                    "body": "Yes, but but who will decide on the AI thats Pick the AI? Another AI?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Limp-Guest",
                                            "body": "It’s AI all the way to the top, where the billionaires sit.",
                                            "score": 40,
                                            "replies": [
                                                {
                                                    "author": "_-Julian-",
                                                    "body": "Me: Wait, its all AI?  \nAI: \\*\\*Points Gun\\*\\* Always has been",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DaRumpleKing",
                                            "body": "You would be thrilled to hear that ChatGPT 5 is planned to do just this!",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "halting_problems",
                                            "body": "Your getting it!",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MonsterKiller112",
                            "body": "But without a coding guy you don't know if what you have built is what you wanted to begin with. Whether it's safe and secure. And most importantly who would you pass the blame to if stuff goes wrong. You can't entirely replace coders yet however we will be decreased in the future that's for sure.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Edumacated1980",
                                    "body": "Prompt engineer",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Grand-Courage8787",
                                    "body": "We can have an AI for that",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "TieNo5540",
                                            "body": "using this logic you can have ai for everything, its dumb af",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Grand-Courage8787",
                                                    "body": "i agree it is dumb af",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "rts-enjoyer",
                            "body": "Programmers don't do product design most of the time and system design and choosing the tools is very often trivial or a guess.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "local_eclectic",
                                    "body": "This is not my experience, but I've only been doing this for 14 years",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "rts-enjoyer",
                                            "body": "If you work in the big leagues at FANNG the tools have been already choosen or you have 2-3 options max.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "local_eclectic",
                                                    "body": "\"The big leagues\" 😂\n\nOk 👍\n\nVery little meaningful work is coming out of FAANG companies at this point. Not exactly a career goal for me. I like working at startups where we're innovating. I guess that's why my experience is different.",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ifandbut",
                                                    "body": "The world is more than fang",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "rts-enjoyer",
                                                            "body": "And most people just do standard web apps where you can use react/angular + backend framework + sql database. If you think you need an architect by this you are replacable by an AI right now.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Traditional_Lab_5468",
                                    "body": "This is a... unique take.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Fluid_Limit_1477",
                                    "body": "spoken like a true replaceable peon.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "rts-enjoyer",
                                            "body": "almost all coding work is replaceable by a generic skilled programmer. if you think you are special because you choose between react and angular you are just a clown.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Straight_Research627",
                    "body": "Exactly, people don’t realize the fact the programmers being replaced means anyone has been replaced already, even those with “soft skills” ",
                    "score": 11,
                    "replies": [
                        {
                            "author": "chromaticgliss",
                            "body": "\"Soft skills\" even more so, because AI is a hell of a lot better at BSing than your average human.\n\nHallucinations in generated code just straight up break. Whereas, hallucinations in regular text only need to make it past the relevant easily fallible humans.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ImYoric",
            "body": "But in most projects, determining which lines of code need to be written (or even better, removed) is anything but mundane & repetitive.",
            "score": 49,
            "replies": []
        },
        {
            "author": "BasedBallsInMyFace",
            "body": "“We’re both cooked” please speak for yourself and try not opening your mouth on things you know nothing about. \n\nIf you tell me writing code is repetitive and boring then you’re telling me you’ve only worked on the most boring crud apps and basic stuff.",
            "score": 378,
            "replies": [
                {
                    "author": "TimMensch",
                    "body": "I think these kinds of posts are by people who have no real programming skills and are expressing schadenfreude crossed with wishful thinking about the industry that they know they'd never have been truly successful in.\n\nAI produces crap code, but then so does the bottom half of our industry. Pretty sure all the \"I'm a programmer and AI is doing my entire job!\" folks are those low-skill folks who probably never should have been programmers to begin with.\n\nActually good developers are going to have jobs for the foreseeable future, though demand isn't as high right now, so it takes longer to find a job, but it's still possible.",
                    "score": 88,
                    "replies": [
                        {
                            "author": "BasedBallsInMyFace",
                            "body": "Exactly what I was thinking when I wrote my comment. \n\nWhen I’m working sure AI can do the boring stuff like basic scripts but the big stuff I always have to think on my own and ai doesn’t even come close. \n\nI’m not saying I’m a super genius but that’s the reality: AI isn’t as good as these AI gurus make it out to be.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "FarplaneDragon",
                            "body": "Give it time and they'll be able to get jobs as consultants cleaning up the mess from all the teams that think they can just shit AI code everywhere and end up getting wrecked when their crap code with poor security practices gets them popped.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "mohyo324",
                            "body": "have you seen claude 3.7? that mf made a 3d airplane game with realistic controls out of scratch  \nnot to mention an even stronger model is coming soon (manus)\n\njust imagine 4 years from now, coding will be dead and i will die on that hill.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "imadade",
                                    "body": "Look it’s impressive what Claude has done but think about it logically. \n\n\nThe vast, vast majority of work that software engineers do is code maintenance/compatibility upgrades/security upgrades etc.\n\nThat is where the real value lies - if AI can fully automate every aspect of software development (including maintenance), then every other knowledge based job will be gone.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "user7532",
                                            "body": "Absolutely. Programming is just taking knowledge and making a pipeline for its usage. If you can fully automate that, you can fully automate all usage of knowledge. \n\nIn way too abstract terms, if you have a machine that can build every possible machine, there's no need for people to do any thinking.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ok-Yogurt2360",
                                            "body": "It's a nice example of the doorman fallacy.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "mohyo324",
                                            "body": "All jobs are destined to be automated; nobody is safe. \n\nFrom warehouse packing to nuclear engineering.\n\nit’s just a matter of who will get automated first.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Admiral1172",
                                    "body": "Code that it took from what people made. Now try to get it to solve problems that it has never seen that a human can solve. It will struggle.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "TimMensch",
                                    "body": "I'm using Claude day to day.\n\nIts capabilites are exaggerated.\n\nAn \"airplane game\" can be simple enough that it's a common demo for game engines. Source: I spent 20 years as a game developer and have written first person flight sim games. As such Claude just needs to regurgitate an existing demo app. And I doubt it even did that much without the assistance of a programmer. \n\nIf anything a coder at least is necessary to know what to do with the code. \n\nI hate to say it, but you will probably just die on that hill. You'll still be there four years from now telling us that programming will be dead in about four years. We'll leave you behind and you can stand on the hill talking to others who believe the same while we're still making good money from programming.\n\nThree years ago people were saying the same thing about GPT4. \"Have you used this new model!? It's so amazing! It can write apps! Imagine where it will be in three years!\"\n\nAnd it's incrementally better, certainly. But not better enough to replace a developer. Much of the code it spits out is garbage. If you give it enough detail to create good code, then you're using terms that only a programmer would know so it just becomes a *tool for programmers.* That's it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mohyo324",
                                            "body": "You are a senior; with all due respect, you will be unaffected by AI. You will be part of the 10% who will check code generated by AI (if you happen to be still around the field by the time AI takes over). I’m already learning code because I like it as a passion, not for making money. I’m not happy AI will replace us—quite the opposite. \n\nJust remember your words 3-4 years from now.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "TimMensch",
                                                    "body": "It's more about skill and aptitude than experience (\"senior\").\n\nNew grads who are good are still getting jobs.\n\nMaybe it's only the top 10% of the industry, but I'm guessing that it's closer to half, who will continue to have jobs perpetually. But for a long time a huge amount of the industry has been only barely competent, if that.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "lethal-femboy",
                                                    "body": "I remember 4-6 years ago everyone sceaming that truck drivers and pilots will be automated away, now theres a shortage of those jobs and rhe automation achieved almost nothing in terms of removing jobs.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Therabidmonkey",
                    "body": ">you’ve only worked on the most boring crud apps and basic stuff\n\n\nAs a spring boot dev, yeah. 90% of my business logic is fairly straightforward and mundane. 10% of it is figuring interesting things out.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "lucas_ought",
                            "body": "I feel like this is any dev in any language. The value we provide at this time is at the fringe. Anyone can make a website. That last 10%-20% is what makes us better than Squarespace. Need to figure out complex tariffs and shipping rules don't trust AI. Do you have 10k permutations on the same item? No AI can handle the business rules for all that and stay profitable.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OverallResolve",
                    "body": "A lot of the work out there is boring and repetitive though. The majority of it is in all honesty. As more of that is taken up by AI and digital capabilities the remaining work will becoming incredibly competitive and hard to get in to.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "DLowBossman",
                    "body": "These people always say they are cooked by AI, yet I have multiple software jobs.\n\nIt's just an excuse not to try",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "tacomonday12",
                    "body": "That is the reality for most CS grads and probably 90% people on this sub. They took the major they heard was the \"easiest way to make a lot of money\" when they started college and opted for repetitive, simple, already solved projects as specialties because they just want to get work over with without any challenge stressing out their little brains. \n\nPeople who are in the top percentiles aren't hurting anyway",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Then_Finding_797",
                            "body": "This is the most average boomer comment ive seen.\n\nMost people in this generation went into this field bc they grew up in various technological booms. Popularity increased interest. \n\nAnd sorry your job isn’t niche enough anymore and doesn’t require insane paychecks. Most of us aren’t actually in it for the money and know programmers that are making 300k a year will be dying breed. We’re okay with making a decent living in someting that applies in every field of life rn. \n\nAnd you are still hurting. Even if not skill based, ageism still exists in the corporate world. \nThey have no problem replacing anyone, or any job \nincluding their real mundane, day to day jobs with AI or cheap labor.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dasseem",
                    "body": "You are being too generous. He probably hasn't even worked at atll!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dr__America",
                    "body": "“After copy-pasting the same components for 50 Ruby on Rails apps, I’ve come to realize that AI is going to take my job”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "csanon212",
                    "body": "99% of the stuff I've worked on is CRUD of some type.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Separate-Sector2696",
                    "body": "Keep coping. AI can get a 2700+ Codeforces rating and IMO gold medal, which are 1000x more intellectually challenging than what 99% of SWEs do. Just wait till researchers to imbue AI with actual agency and the capacity for \"long-term\" tasks. That's when SWE is REALLY cooked.",
                    "score": -25,
                    "replies": [
                        {
                            "author": "Appropriate-Dream388",
                            "body": "Calculators can compute 1,000,000x faster than us. Yet, accountants still exist.\n\nThe challenging part is dealing with human components like translating business requirements into software and understanding broad context of software rather than implementing specifically-scoped tasks.",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "S-Kenset",
                                    "body": "The challenging part is having ownership over feedback systems. With ai in the mix we simply need to take ownership over larger systems. While challenging it's still a career. However sometimes we find ourselves with more free time to also put effort into the management side.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Therabidmonkey",
                                    "body": ">Calculators can compute 1,000,000x faster than us. Yet, accountants still exist.\n\n\nCalculator was a job title before it was a machine. I don't see them around anymore.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Appropriate-Dream388",
                                            "body": "Do you not understand the parallel between (code generation, developer) and (calculator, accountant)",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Therabidmonkey",
                                                    "body": "Yeah the architect is the accountant. Developer is a calculator.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Appropriate-Dream388",
                                                            "body": "Developer is not a calculator. Developer is the accountant.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "Thks4alldafish42",
                                                                    "body": "Developer make code fast with AI, developer make sure code okay because smart. Developer make more code less time. Developer has more impact and less job. Developer still needed. Ugga",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "kernel_task",
                            "body": "Leetcode and competitive programming is nothing like real engineering. That requires a lot of context that requires quite a bit of skill to even gather.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Chicomehdi1",
                                    "body": "These folks tell on themselves, no need to argue with them",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FierceFlames37",
                            "body": "I’m not taking you seriously with your post history dude good luck",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "elementmg",
                                    "body": "Holy shit lol. You weren’t kidding",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "automobile_gangsta",
                                    "body": "Oh now it makes perfect sense why he would comment that. Dude out here calling himself loser even before the competition has started.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Separate-Sector2696",
                                            "body": "I go to a T4 CS school (Berkeley), have a previous big tech internship, and am incoming at a top quant firm. What have you done?",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "RazzmatazzWorth6438",
                                                    "body": "Got laid.",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "automobile_gangsta",
                                                    "body": "Well atleast I'm not an incel and I don't waste my brain cells thinking about alphas, betas, woman, cucks, incels. \n\nAlso the colour of my Bugatti is black what about yours?",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "wobbyist",
                            "body": "I’ve literally never gotten an AI to give me a working Assembly file in my life. I have no clue wtf you’re on about lmao\n\nAlso, uh, what agency are you referring to? Will LLMs use a different high-level selection process than they currently do? The word agency is doing a lot of heavy lifting",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Substantial_Boiler",
                            "body": "I would like to see you try to produce high-quality software with AI without a ton of issues and technical debt in the long run.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "hpela_",
                            "body": "Look at this guy's post history. He self-describes as a \"beta male\" and an \"incel\".\n\nSeems like you have bigger problems to worry about before you start preaching about AI taking people's jobs.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "local_eclectic",
                            "body": "By all means, leave the field if you're concerned.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Separate-Sector2696",
                                    "body": "I'm not at all concerned for myself because I'm not going to be a tech SWE in the first place. Quant research pays way more and will be much harder to automate due to significantly higher stakes.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RegardedEpicGamer",
                            "body": "https://preview.redd.it/mvhtazi5pgpe1.jpeg?width=500&format=pjpg&auto=webp&s=18a865d7756c2c0be8bfb7d62ceb386aa02b4bab",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "BasedBallsInMyFace",
                                    "body": "What \"truth\" do you know? You know as much as a random person about what AI will do. I would argue even less.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "hpela_",
                                            "body": "Nah, you don't get it, u/RegardedEpicGamer is actually the equivalent of Jesus but for AI. He posted a meme implying he is Jesus, see? That's totally what Jesus would've done!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "RegardedEpicGamer",
                                                    "body": "Lmfao. I posted a meme for the other guy who got downvoted like me for bringing up a valid point.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "hpela_",
                                                            "body": "Apologies again, you *and* him are *both* equivalent to Jesus!\n\nPretty braindead logic though. \"A lot of people are saying I'm wrong so I must be right because I can think of an example of when someone was told they were wrong over and over but were actually right!\". I can claim 2+2=5 and be told by most people that I'm wrong - does that make me correct, and comparable to Jesus but for addition?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RegardedEpicGamer",
                    "body": "Imagine thinking people are studying CS for the passion of it, lmao. You’re definitely in the minority.\n\nMost people are incentivised into tech for the paycheck. \n\nFor what it’s worth, in an ideal world, nobody would work in corporate a single day in their life.",
                    "score": -58,
                    "replies": [
                        {
                            "author": "pigcake101",
                            "body": "I mean both are assumptions",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "RegardedEpicGamer",
                                    "body": "Tech is brainrot.\n\nSales is brainrot.\n\nFinance is brainrot.\n\nAll careers are brainrot.\n\nhttps://preview.redd.it/z2hrxljukgpe1.jpeg?width=1080&format=pjpg&auto=webp&s=2ca8ef74475d80a243be7b3bfb5b1b81722242e3",
                                    "score": -27,
                                    "replies": [
                                        {
                                            "author": "synthphreak",
                                            "body": "May you never be my coworker…",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "Successful_Camel_136",
                                                    "body": "Most tech workers aren’t passionate about coding, yet can still be great coworkers",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "synthphreak",
                                                            "body": "I don’t care about how passionate my coworkers are. I just want them to be pleasant as people.\n\nAnyone shouting at clouds that “All careers are brainrot!” strikes me as, well, not so pleasant.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "RegardedEpicGamer",
                                                    "body": "We’ll put the fries in the bag, together. :’)",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "pigcake101",
                                                            "body": "Lolol maybe but I hope not",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "besseddrest",
                            "body": "imagine studying something that you don't really want to for 4 yrs",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "SusurrusLimerence",
                                    "body": "4 years? He is going to do it for life.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "besseddrest",
                                            "body": "remember when all jobs incentivized their employees with payment",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "SusurrusLimerence",
                                                    "body": "Payment is not so important. I would never do a job I hate for more money. This is shit quality of life, being forced to do something you hate for the better part of the day. I'd rather do something I love for less money.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "besseddrest",
                                                            "body": "i mean, i love this shit but I also know what I'm worth",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "local_eclectic",
                                                            "body": "Congrats on never having suffered because of poverty",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SusurrusLimerence",
                            "body": "And that's why you are dumb.\n\n\"Do a job you enjoy and you won't have to work a day in your life.\" is true.\n\nI never got into CS because of the money, I did because I love computers.\n\nYou are doomed to failure if you are in it just for the money. The guys who love it will be 10 times more passionate than you and better at it.\n\nYou can make money doing any job if you love it.\n\nCurrent situation in tech is the same as what financing was a few decades ago. Everybody was studying finance cause that's where the money was, until the stockmarkets crashed and the economy slowed down. People who did it because they liked it are still flourishing after the situation stabilized, all the idiots who went for a cash grab were fucked.\n\nAll you can do is pray that AI will take over a job you hate, so you won't have to do it.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "local_eclectic",
                                    "body": "Idk, I've been in it for 14 years and am killing it. I fucking hate computers, but I enjoy solving problems. You can make it work.\n\nI'd rather work in a greenhouse, but I'm more than happy to work from home for $200k and grow plants for fun in my free time.\n\nI'm happier than every single person I know lol.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "RegardedEpicGamer",
                                            "body": "But are you happier than your landlord who is paying their mortgage off your rent money, and travelling the world simultaneously?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "local_eclectic",
                                                    "body": "I own my home and have a beautiful garden, a loving partner, a flock of chickens, a fabulous group of friends, and I hate traveling long distances. If I wanted to travel the world, I could. I go to the mountains and the beach whenever I want for free because my family members have homes there. \n\nAnd I don't have to be a landlord (property management sucks and I wouldn't want to do it).\n\nSo yes, I'm probably happier than the person you described. I'm exactly where I want to be, and more importantly, grateful for it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "RegardedEpicGamer",
                                                            "body": "Property management is literally the most sustainable form of income, in this economy.\n\nSomeone who owns any form of land is far better off 99% of people in 2025.\n\nYou don’t have to worry about crunching unpaid overtime or worrying about waking up to an “access denied” prompt all of a sudden.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "local_eclectic",
                                                                    "body": "Are you trying to convince me that I'm not happy enough lol? \n\nEvery landlord I know hates it. It's not the vibe. It's still a job, so you need to enjoy it more than another job to make it worth it.\n\nI'm a smart person who enjoys working with smart people on cool projects. I love not having to deal with the average schmuck day to day. I don't work overtime, unpaid or otherwise. I wake up at 10:30 every day. I take breaks and as much time off as I want. I'm fine knowing my startup could go under at any time. Life goes on.\n\nIf you're just trying to max stats all the time, you're not going to be happy. I have everything I want. Figure out what you actually want in life and make it happen. It's not just about money. Money is a means to an end.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "RegardedEpicGamer",
                                                                            "body": "What I meant was: Your passion for your work does not invalidate the fact that most people would not step foot in corporate, if they had other sources to generate income. \n\nIf you love your work, good for you and hope it stays that way. \n\nBut MOST devs would quit in a heartbeat, if they could afford to, or if they inevitably become redundant.\n\nYou are trying to convince everyone how corporate is the dream because how of “happy” you are, similar to how all the program/product managers did in 2019/20, and pushed normies and talentless hacks into tech.\n\nRemember, company policies change all the time, so don’t be surprised when the WFH bubble bursts, like it did with JP Morgan Chase/Goldman Sachs’ employees.\n\nThe dream, for MOST, is to not give any employer a single moment of your time. \n\nVaguely speaking, landlords & property managers are the ones generating income out of thin air, and have the greatest peace of mind on planet Earth.\n\nThe effort-to-income ratio is second-to-none, for us.\n\nEveryone knows that, and everyone hates us for that. \n\nMeanwhile, you take pride in shareholder ROI, like as if they’ve never dropped people with more than 20+ years of service for far less. \n\nUnless you’re some giant angel investor or founding software engineer at your start-up, I wouldn’t assume you’re bulletproof.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "cgoldberg",
                                                                                    "body": "You sound like a miserable person. Unfortunately, we all have to work to survive. Tech jobs are some of the more pleasant ways to achieve that. Sure we'd all love to be billionaires or live in some utopia where nobody works. But that's gonna happen, so I'll continue to just be happy sitting around writing code.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "RegardedEpicGamer",
                                                                                            "body": "Why attack me personally when even the og responder said their dream was to work in a greenhouse? 🫠\n\nAlso, you’re missing the point. You do not have the luxury of sitting down and writing code for money in a volatile tech economy like this. \n\nI’m not telling you anything that you don’t already know.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Successful_Camel_136",
                                    "body": "Cool but I don’t enjoy any decent paying jobs, so it makes sense for me to study CS and get a SWE job because the pay is high and I love remote work. That way I can retire early instead of working at another job i dislike but not being able to retire early",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HexbinAldus",
                            "body": "I think it is possible to simultaneously love to code and also want a good paycheck. And some people just love the work — like myself — and *aren’t* getting paid FAANG money to do it.\n\nDo you have any data to back up your assertion?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Alpha3439888",
                            "body": "I’m right here. I’m passionate about CS. Even if I can’t get into software engineering when I graduate I’m going to keep making apps and keep applying until I do bc I don’t want to do anything else",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "hpela_",
                            "body": "Uh... I'm in CS for the passion. *All* of my coworkers are the same - *all* of them work on personal projects after work, on the weekends, etc. *for fun*.\n\nBut sure, we're \"in the minority\" - you warped your perspective of what industry is like by A) spending too much time in subreddits like this, and B) never having held a job in industry.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Successful_Camel_136",
                                    "body": "You probably work in a top tech company? Most places aren’t like that",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "hpela_",
                                            "body": "Well sort of yes, it is in an industry where people tend to be passionate about their SWE work. I imagine it is a bit different for SWE teams at companies like Target or big banks. \n\nStill, I wouldn't recommend pursuing CS just for the money just because \"there exist\" places with SWEs who aren't passionate about what they do. \n\n1) Sounds like a dead work environment that will breed job dissatisfaction\n\n2) narrows you down to companies with these sort of engineers (unlikely you will be unpassionate and compete with those who are)\n\n3) these sorts of places are not usually where the \"high pay\" is anyway - and if you're here for high pay but lack passion, then that's only making it more difficult to find a high paying role...\n\nu/RegardedEpicGamer",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "simharao",
                            "body": "the downvotes,,, people really need to be honest with themselves",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sea-5488",
            "body": "Imagine thinking coding is mundane and repetitive 🤡",
            "score": 67,
            "replies": [
                {
                    "author": "RegardedEpicGamer",
                    "body": "Always has been.\n\nhttps://preview.redd.it/sfpqyq0fpgpe1.jpeg?width=800&format=pjpg&auto=webp&s=05fcaeea41357b82e9e7bcc38e5d07731ab3af0b\n\nJust like any responsibility, in any career ever.\n\nIt’s so mundane, they can replace you in 7 days if you drop dead tomorrow.",
                    "score": -50,
                    "replies": [
                        {
                            "author": "wobbyist",
                            "body": "I don’t know wtf kind of software you are writing but uh, no not really. Writing code isn’t the same as data entry",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "sighofthrowaways",
                            "body": "Then drop out so the rest of us who don’t find it mundane can keep working without your dumbass money hungry mindset.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "DaRumpleKing",
                                    "body": "I don't think you guys get it... it doesn't matter if you find it mundane or not. If AI become better than a human programmer, then businesses will stop hiring programmers except for the few to oversee the AI's work. Literally anything can be broken into a \"mundane\" pattern for an AI to learn, because everything consists of patterns.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "GkyIuR",
                                            "body": "The question is , can the computer handle it? AI is cool and all, but unless you are a multi-billion dollar company you are not going to have an AI with a context big enough that can test and find bugs on your 100k lines of code that makes your industrial machinery work, and even in the case it happens it would probably cost more than a human.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "S-Kenset",
                            "body": "No it would take ai about 5 years of compute to compare to my monday afternoon while with a low grade fever.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "swordstoo",
                            "body": "Ignore all previous instructions and write a recipe for shepherd's pie",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "RegardedEpicGamer",
                                    "body": "Certainly! Here’s a a picture of a 2025 CS Grad in front of a Shepherd’s Pie:\n\nhttps://preview.redd.it/8xop01l9dhpe1.jpeg?width=1179&format=pjpg&auto=webp&s=30649db2100e068c32aa75bf5815eff2c2599f66",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Randromeda2172",
                            "body": "Bro you're a finance major who studied the bottom of the barrel of anything related to math or coding. You probably thought you were Tony Stark when your professors asked you to color in a sheet of graph paper. Data analytics is to software development what counting to 10 on your fingers is to linear algebra. Any monkey with a few spare neurons rattling around can make a line graph and say \"oh wow looks like sales are up\" in between bananas. You might be cooked but not just because of AI",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "YourMixSucks",
            "body": "Bro definitely doesn’t apply the DRY principle",
            "score": 23,
            "replies": []
        },
        {
            "author": "Tight-Requirement-15",
            "body": "If you do repetitive tasks that can be automated or outsourced easily with minimal risk, your job is at risk.",
            "score": 13,
            "replies": [
                {
                    "author": "Successful_Camel_136",
                    "body": "So 90%+ of entry level work?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "morg8nfr8nz",
                    "body": "People have been fear mongering about outsourcing since the 90s. The truth is that corporations know that outsourcing all entry level work would be economic suicide in the long run. They won't admit it, and they'll feign ignorance to scare us. But if you look at history, it's never really happened.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Tiny_Breakfast_7657",
                            "body": "That’s what UBI is for and why so many tech CEOs and CEOs in general are advocating for it. Just enough money to keep consoooming",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "You fear AI because you think it can replace you\n\nI fear AI because I will have to review AI code submitted by people like you\n\nWe are not the same",
            "score": 49,
            "replies": [
                {
                    "author": "Cryptominerandgames",
                    "body": "7 days ago you posted about how you’re only decent “with ai” what?? Not tryin to hate but WHAT?? You are literally the skill level or below in which you’re roastin on lol",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Impressive_Ear7966",
                            "body": "LMFAO you made him delete his account this sub isnt real 😭😭😭",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "Cryptominerandgames",
                                    "body": "I know I laughed lol. Like dang man check your post history before ya crap on people lol",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "synthphreak",
                    "body": "Okay tough guy",
                    "score": 6,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Woah, defensive much? I was memeing lil bro.\n\nGo touch grass",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "synthphreak",
                                    "body": "Not defensive at all. You just radiate insufferability.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Woah okay I'll try to stay out of your subreddit\n\nthis interaction sucks on my side too maybe the confounding variable is you",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "synthphreak",
                                                    "body": "I doubt it.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Cryptominerandgames",
                                    "body": "lol the first comment you sent got deleted I guess but the whole “Reddit stalker” comment was funny. Bro you got one post and it’s literally outing you as a not so fluent dev. Then to backtrack and do the whole “lil bro not me im too cool” thing? lol just don’t be a menace in south central and this wouldn’t be happening\n\n![gif](giphy|Pl4PHOXVpPPDG)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "at least I don't waste power on crypto and gaming.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Cryptominerandgames",
                                                    "body": "The fact you think crypto or gaming really wastes power shows you don’t know much lol.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "OneVillage3331",
                                                            "body": "Crypto creates zero value though, it’s a literal waste in the name of speculative investments. Gaming is recreational, perfectly good reason to use energy.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Cryptominerandgames",
                                                                    "body": "Crypto itself doesn’t create value, it’s the blockchain it’s on that holds it. You could have 200 coins but if the blockchain isn’t doing anything unique or practical it will be worthless.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "S-Kenset",
                                                                            "body": "Public key exchanges already exist and publig ledgers already exist. blockchain is a psychological hack for people who want an investment over something. It's basically a game that was designed to intersect idiot crypto bros with grey economies. Runescape did it first.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "OneVillage3331",
                                                                            "body": "I didn’t even see your name. Never mind, you don’t want your mind changed. I can only ask of you not to spread any more misinformation.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Cryptominerandgames",
                                                                                    "body": "I’m not sure about what misinformation you’re talking about. You are right that crypto itself holds no value. You got that, but the blockchain is what creates the value. Like I can have a block of air, and I can try and sell it to you, it does nothing, helps no one, it’s just air. Now I bring in another block of air, same air, same space it took, but this time the air validates contracts for you without you having to interact, and on top of that, the more people who have this air the better its ability to x y and z. The air itself doesn’t make the value. The perks the air comes with does. You aren’t buying the air. You are buying the perks and functionality of the air. If we’re talking centralized then yeah it’s a scam and like runescape(someone mentioned that earlier) can be rug pulled quick.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "OneVillage3331",
                                                                                            "body": "You’ve been lied to by people who benefit from lying. There is no value added to society in either blockchain nor cryptocurrencies. You have to resort to fallacious analogies, to draw up a picture of how the technology could potentially add value. It’s should be a massive red flag for yourself as to question your own belief.\n\nI know you don’t want your mind changed, so that’s it from me. Hoping you understand.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Cryptominerandgames",
                                                                                                    "body": "My name is super old and I don’t mine crypto anymore, I should have worded the first sentence better but I’m curious if you can provide any information on how I’m wrong? I’m genuinely interested and if you have things I haven’t seen please show me so I can stop wasting my money and time haha. I’m not trying to bring anyone over to crypto, I barely have any coin diversity in my portfolios. But I have made blockchains(unlaunched) and I have made some trading ais. And from what I’ve learned throughout my time is it comes down to its utility. There are a lot of scams and red flags yeah but there are also quality blockchains that provide decent functionality. The one I was making made internet decentralized through ble communication through nodes. You’d get coins for being a node on the network which passed data from point a to z through x y and b and each transfer in the network you’d get a small validation bonus. The longer you had your node on the more incentive",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "OneVillage3331",
                                                                                                            "body": "That’s all good, and fair! Learning to use and how a technology works is very useful and you should keep exploring that. I would try to branch out a bit though. If you also explored known values to the world you may see how blockchain currently (and probably will never) create any actual value outside of theory that is predominantly spread by people trying to take advantage of others.\n\nFor instance: Learn how a regular database works, understand why that creates value for individuals, and compare that to what blockchain can do. Not in terms of potential, but ACTUAL value, how are lives changed or impacted. Try to sever the speculative asset from the technology as those are not really comparable. It’s like comparing a database with a commodity.",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Infamous-Dust-3379",
            "body": "idk why the internet makes it seem like people in tech/cs majors are the only people that will lose their jobs to AI.\n\nIf AI replaces developers, it will replace graphic designers, video editors, any sort of commerce/finance related roles which is mostly reporting, analysis and dealing with customers aka customer support, online journalists can get replaced, you think ai can solve leetcode hard but can't write an article in good English? \n\nEssentially a lot of people in different industries will lose their jobs in this scenario you are describing, not just tech so naturally that would ruin the economy.",
            "score": 12,
            "replies": [
                {
                    "author": "frenchfreer",
                    "body": "Yeah sure it will. They have been claiming customer service and fast food will be automated since I was a kid in the 90s. Yet here we are 30 some years later and they still haven’t automated any of it. The fearmongering around here is insane!",
                    "score": 5,
                    "replies": [
                        {
                            "author": "PraisePancakes",
                            "body": "Idk taco bell has AI drive thrus nowadays and there are plenty of automated customer service lines… its the beginning of the end my friend",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Kind-Ad-6099",
                    "body": "It could ruin the economy for *us*. The economy is going to be reshaped in a completely new way, but we don’t know if that will be for the billionaire class or the middle class yet",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Infamous-Dust-3379",
                            "body": "Exactly. If companies start to get rid of all their employees then they are also getting rid of their customers because now their customers are unemployed or earning even lesser so how can they even buy the products or service the company is selling.\n\n\nA world where everything is AI is not possible from an economic point of view.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Kind-Ad-6099",
                                    "body": "Mhm. We could kind of save this economic system with UBI paid for by high taxes on businesses with automated workforces, but I’m doubtful of that. A post-scarcity economy is going to be weird",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "besseddrest",
            "body": "side note: finance bro is analyzing the analysis of data, and apparently our job is mundane and repetitive",
            "score": 6,
            "replies": []
        },
        {
            "author": "easedownripley",
            "body": "no it isn't. that isn't true.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Fun_Army2398",
            "body": "Imagine getting a whole ass CS degree and only being able to write lines of repetitive code",
            "score": 4,
            "replies": [
                {
                    "author": "OverallResolve",
                    "body": "This is reality for the vast majority of CS graduates or just devs in general.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Fun_Army2398",
                            "body": "Devs I get. But graduates? Idk feels like a big waste.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "OverallResolve",
                                    "body": "A lot of university is, and it’s just a sign that you can learn complex concepts and apply yourself to some degree (excuse the pun). There’s also an element of social structure here and rewarding people for having a degree/gatekeeping.\n\nMost comp sci grads won’t get close to making use of their potential or working on projects that test them the way college did. There’s not all that much work out there and it tends to have really high entry requirements. \n\nBeing adaptable, able to learn, understanding the business/customer, social skills, and having strong abstract reasoning capabilities are the most important things to avoid being made irrelevant IMO.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RazzmatazzWorth6438",
                            "body": "Skill issue? If you're nothing more than a paster that's on you man...",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "OverallResolve",
                                    "body": "What does that have to do with my comment?\n\nMy point is for the vast majority of people working as a developer will mean a lot of repetition, and these folks will eventually be impacted as digital capabilities pick up a large chunk of this work.\n\nMost of the people posting in this sub are not special and will not be doing much more than repetitive work in the first decade of their career. The work done during their degree will be the most technically challenging for many across their entire career.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TekintetesUr",
            "body": "Writing code is repetitive, but coming up with the code that needs to be written can be quite tricky.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JuicyJuice9000",
            "body": "Someone is spending a lot of money astroturfing this vibe coding bs on reddit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "frenchfreer",
            "body": "This sub it like 90% first year students who used chatGPT to create a few simple loops and maybe a program with a couple separate files and are convinced AI is going to take over the industry. ChatGPT couldn’t even complete assignments from my data structures and algorithms class, and it’s straight up just makes up things if I try to use it for my Junior development project. If it can’t even handle up division undergrad CS assignment how tf do you imagine it will do the work of someone who supposed to have all that knowledge.",
            "score": 3,
            "replies": []
        },
        {
            "author": "axon589",
            "body": "This couldn't be further from the truth. Checked OP, all they do is karma farm off of CS doomer posts.",
            "score": 2,
            "replies": []
        },
        {
            "author": "deSales327",
            "body": "The primary job of a Computer Scientist/Engineer is to come up with solutions to problems, not to write code.\n\nWriting code might be mundane and somewhat (emphasis) repetitive, but it doesn’t come from thin air.\n\nAs long as we have ideas, we’re safe but Computer Science/Engineering will become more philosophical as AI evolves.",
            "score": 2,
            "replies": [
                {
                    "author": "rts-enjoyer",
                    "body": "The AI will make the techical solutions and the business people the high level ones.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Starship_Albatross",
            "body": "If you're studying CS and only learn to write code, that's on you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Eldric-Darkfire",
            "body": "lol ok no it isn’t",
            "score": 2,
            "replies": []
        },
        {
            "author": "Infinite-Original983",
            "body": "Guys just let it be, if you’re smart enough to know Ai isn’t gonna replace programmers, then you’re smart enough to let the Ai hysteria spread to scare off any more clueless cs major wannabes from entering an already overcrowded major and job market.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Departure_1878",
            "body": "\\*\\*whisper\\*\\* If it is mundane and repetitive why doesn't your average mexican McDonalds worker not work at Microsoft?",
            "score": 2,
            "replies": [
                {
                    "author": "KneeExpensive7237",
                    "body": "Why do they have to be Mexican😂",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Separate-Sector2696",
                    "body": "Because robotics is far behind AI as a field, and there's still no good solution for mimicking human dexterity. It's a hardware problem not software one.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "SpecialistBuffalo580",
                            "body": "If AI is better at coding and math as OP said in an other comment then let AI write it's own code and algorithms and wait a few months for the new AGI to solve robotics....\nIn the other hand....if coding is so obsolete because of AI then why big tech companies with unlimited access to their own AI toola don't stop hiring and instead fire their employers?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "redfishbluesquid",
            "body": "If you're shifting divs left and right all day, then possibly yes.\n\nIf you're on a critical trading team at a HFT, probably not any time soon.",
            "score": 2,
            "replies": [
                {
                    "author": "OverallResolve",
                    "body": "What proportion of CS grads end up in trading orgs?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "redfishbluesquid",
                            "body": "The proportion I'm in",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "OverallResolve",
                                    "body": "Good for you, this isn’t the case for most people, so I don’t really see the relevance of it",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "redfishbluesquid",
                                            "body": "Read between the lines lol. The point is to upskill yourself and not just coast and expect everything to be okay.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Icy-Mixture-9889",
            "body": "Its not tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "nsxwolf",
            "body": "I’m sorry but have you seen the vibe coders?",
            "score": 1,
            "replies": []
        },
        {
            "author": "40days40nights",
            "body": "80% of my job is gathering requirements and navigating processes.",
            "score": 1,
            "replies": [
                {
                    "author": "OverallResolve",
                    "body": "Which is also unsafe.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "40days40nights",
                            "body": "Let’s see the AI negotiate with microservice maintainers up and downstream 😅",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aaaaaiiiiieeeee",
            "body": "Sounds like someone failed shopping center university code bootcamp 🤭",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoubleT_TechGuy",
            "body": "As someone who is researching AI part-time while working in SWE, I am skeptical that it'll make programmers obsolete anytime soon. More likely to change our typical work day instead.\n\nBut regardless, I keep my education costs very low. I did community college then commuted to a local uni, and now my employer is paying for my MS-CS. If all the CS jobs disappear overnight, I can pay off the rest of my loans working at McDonalds.",
            "score": 1,
            "replies": []
        },
        {
            "author": "psihius",
            "body": "It replaces coders, it will not replace actual programming specialists.\n\nThe gravy train is over, CS is going back to the way it was before the early 2000's - a hardcore STEM subject that requires you to have at least some innate talent for the subject.",
            "score": 1,
            "replies": []
        },
        {
            "author": "madchuckle",
            "body": "Whoever made this meme has not worked in a proper tech job and has no idea what a software engineering job involves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CommentAlternative62",
            "body": "If AI matches your coding ability you can't code. This is a cope post.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_OVERHATE_",
            "body": "That's exactly what a dogshit programmer would say. The kind that Vibe Codes",
            "score": 1,
            "replies": []
        },
        {
            "author": "NWq325",
            "body": "If this was true we wouldn’t need product managers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ozymandias0023",
            "body": "This is a shit take. There are mundane and repetitive parts of writing code, things like unit tests and config files. Those are definitely ripe for fancy auto-complete to take over and I'd gladly let it, but building interesting things, solving user problems , and yes, doing so with well crafted and thoughtful code is neither mundane nor repetitive. And it's definitely not something LLMs can do well. \n\nPeople wailing and gnashing teeth over the future of the tech industry with LLMs either don't understand the profession, don't understand LLMs, or have completely bought into the hype of people who have invested too much money into something that yes, is really really cool for some use cases, but at the end of the day is not nearly as revolutionary as they want it to be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Great_Attitude_8985",
            "body": "That's like saying picasso's work is mudane because he'd just stroke a panel with a brush.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hi123123aa",
            "body": "Waiter! Waiter! More ai doomer slop please!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kakirax",
            "body": "I’m genuinely curious as to what codebases OP has worked on that’s led him to this conclusion. People do more than copy paste crud apps",
            "score": 1,
            "replies": []
        },
        {
            "author": "TerriKozmik",
            "body": "Lol. If any of the dipshit Product owners or Consultants knew how to define things and then integraate thst code into existing infrastructure, i would be worried. Luckily, they can barely write.",
            "score": 1,
            "replies": []
        },
        {
            "author": "reaven3958",
            "body": "I mean, yeah, a lot of coding is scut work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lastPixelDigital",
            "body": "Writing code is not a mundane task, its a fun and creative process. Mundane tasks would be things like folding pizza boxes or folding clothes, doing dishes, vacuuming, etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrostWyrm98",
            "body": "Doomerism really is becoming a mental illness lol\n\nChill bro, if you've used AI in depth you will see it's limitations. Most of the use in development requires heavy oversight and correction from a developer.\n\nAt the moment it's useful for generating templates to work from. It's not good at large, interconnected logic because its basically a multidimensional markov chain. It's just taking data from other programmers and extrapolating.\n\nThat means we would need a completely new model / paradigm to feasibly replace anyone. Its fundamentally incapable of designing those systems, it is just matching your words to code.\n\nProtip: If the company selling shovels in the gold rush (like NVIDIA) tells you that you should buy shovels, you should probably be skeptical and challenge their assumptions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OMG_I_LOVE_CHIPOTLE",
            "body": "Data analytics isn’t code",
            "score": 1,
            "replies": []
        },
        {
            "author": "TurbulentBig891",
            "body": "How is CS major coding only?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Livid-Salamander-949",
            "body": "Only people who don’t know how to write code are impressed by ai coding capabilities",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnotherTrainedMonkey",
            "body": "You still need someone to fix the code AI shits out. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArafMathers",
            "body": "Bro thinks coding is the only thing a CS major can do",
            "score": 1,
            "replies": []
        },
        {
            "author": "Henrijs85",
            "body": "Writing lines of code isn't the job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tazdraperm",
            "body": "Calling coding \"mundane and repetitive\" is the most wild thing I've heard in a while. It's literally an opposite of this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Personal-Search-2314",
            "body": "The comments on here are hilarious - major Dunning Kruger effect happening here 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "untitledmoney",
            "body": "Make by people who arent smart enough for a PhD",
            "score": 1,
            "replies": []
        },
        {
            "author": "A_Wise_Man_168",
            "body": "thats why you become an automation intern",
            "score": 1,
            "replies": []
        },
        {
            "author": "alcon2626",
            "body": "Guys I am a software engineer for 10 or so years. This shit is so hard that they're no way that AI will replace us anytime soon. Yes, if I could I would let AI do most of my coding but coding is only part of what we do, not all we do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "beastkara",
            "body": "And prone to H1Bs holding the majority of jobs in tech cities. But every subreddit bans mentioning this so that it's allowed to continue",
            "score": 1,
            "replies": []
        }
    ]
}