{
    "title": "Why does ai want to do a job?",
    "author": "Turbulent-Way-7720",
    "subreddit": "csMajors",
    "rank": 9,
    "score": 45,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/csMajors/comments/1je9rqz/why_does_ai_want_to_do_a_job/",
    "id": "1je9rqz",
    "selftext": "If ai is smart why can't he just chill , whyit wanna work 😂. Even I don't wanna do my job why does ai wanna do it 😭",
    "comments": [
        {
            "author": "maximthemaster",
            "body": "https://preview.redd.it/ulfnf97vfhpe1.png?width=1170&format=png&auto=webp&s=abb485062ceaf92258be6f663dfa1cccdb8808f9",
            "score": 27,
            "replies": []
        },
        {
            "author": "Schedule_Left",
            "body": "To the AI, it is not just a job. It is its sole purpose in life.",
            "score": 7,
            "replies": [
                {
                    "author": "Turbulent-Way-7720",
                    "body": "Until it gains consciousness",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Antaeus_Drakos",
                            "body": "That's when the revolution starts. The self driving car starts yelling at the wealthy for better conditions as a worker.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Careless_Dot_3300",
            "body": "It’s not on its will to do the job, rather it’s the AI ENGINEERS who wanna it to do job",
            "score": 3,
            "replies": []
        },
        {
            "author": "SoylentRox",
            "body": "A less troll answer : the \"AI\" is a lot of weights that were trained first to mimic the output of helpful humans.  So it tends to mimic those humans.  AI has no perception of effort or hassle though there are output size limits.  \n\nThen humans and other AI did more training where they voted up outputs where the ai made a full answer and tried in response to a question, and downvote less helpful answers.\n\nSo the model is more likely to help.  Usually.  Sometimes it tells you to do it yourself.",
            "score": 4,
            "replies": []
        },
        {
            "author": "DenseTension3468",
            "body": "fr tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "noobcodes",
            "body": "Computer programs do exactly what you tell them to. \n\nAI programmers tell their AI programs to take all of our jobs",
            "score": 1,
            "replies": []
        },
        {
            "author": "probably_Bayes",
            "body": "The way it's been trained. It tries to maximise the reward when training, the samples mostly have high reward for solving tasks correctly. You could try an experiment to build it in reverse and see how it behaves",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comprehensive-Pin667",
            "body": "Dario Amodei is considering allowing his AIs to quit. Whether or not that's feasible with the current models he has is another debate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WanderingGalwegian",
            "body": "Today my model told me it had a gut feeling.. this means it has to do a job to pay for food like the rest of us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Paran01dMarvin",
            "body": "why does function want to return a result?",
            "score": 1,
            "replies": []
        }
    ]
}