{
    "title": "Feeling so lost with my degree",
    "author": "freckl_s",
    "subreddit": "csMajors",
    "rank": 16,
    "score": 10,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/csMajors/comments/1jebt0b/feeling_so_lost_with_my_degree/",
    "id": "1jebt0b",
    "selftext": "I've been pursuing a CompSci degree and after this semester I will begin my upper-level courses. During this time I have been working full-time so I haven't been able to take many credit hours. This has left me feeling lost as a lot of my time has been spent at work and I realized I don't even know what I am doing.   \n  \nMy psychiatrist asked me: \"So are you excited to bring your new ideas into the workforce in your field?\"  \n\"No not really.\"  \n\"Then why do you take time out of your day to drive to school and do the homework if it doesn't interest you?\"  \n\"It's just something I feel like I have to do to not end up poor.\"\n\nAnd that's where I'm at right now. If I magically had my degree in hand right now, I don't even know how that translates to all the different branches of a CS degree. The idea of sitting in front of a computer for hours looking at code or reading documentation just seems so boring to me now.\n\nI realize I've just been doing this degree because people on the internet told me there was money in it and you like computers right? So this is the degree for you. I was always concerned about the money and whether or not this is what I wanted to do with my life.\n\nAny guidance would be appreciated if other people have experienced this.",
    "comments": [
        {
            "author": "ZombieSurvivor365",
            "body": "> “It’s just something I feel like I have to do to not end up poor.”\n\nYou need some sort of direction and purpose with a college degree. I’ve said it before, but a job won’t simply materialize. You need to know what you’re doing, what specialization you’re gunning for, and you should start talking with professors and other students about it.\n\nWhat’s gonna happen if you finish the degree but struggle to land a job like everyone else? There are capable, talented students out there. They’re going through college without a job, mooching off their parent’s money so they have twice your free time — yet even they are struggling. \n\nYou either need to be significantly above-average or lucky to start a career in tech. You got this, you can do it, just plan your way through things and research what you gotta do to get better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Antaeus_Drakos",
            "body": "This is literally me. Here's my advice as next school year is my final year in college. Drop this major if you can. I have no passion, I had no deep interest, and all this cumulated in me realizing everybody else who is passionate or deeply interested will always outcompete me. \n\nI am at a disadvantage which also acts as an advantage for them. Why would I be hired over those guys? They have the interest or passion to drive them to be more skilled or more knowledgeable. Not to mention the market is kind of in a bad position.\n\nIf you have the resources to, drop this major and do which ever major you actually like. I should have gone for that English degree years ago.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ebayusrladiesman217",
            "body": "That sounds like depression. The question shouldn't be whether you enjoy cs, but rather if you enjoy stem. With a cs degree, you can go into any stem field(granted, you'll need to do a good bit of training and maybe get a masters) it's also worth saying that, well, sometimes you feel that way, especially while burnt out. Maybe take some time off school, find a new programming language and build something fun. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specific-King-1458",
            "body": "For what it's worth I would 100% drop out and refund my degree if I still had the choice. I'm overwhelmed with regret, most of the jobs that will interview me are the kind that would have hired my dad off the street with no degree 15 years ago. All for what, a really crappy low IQ office job that I'll hate?\n\nPain.\n\nEdit: Did not make it clear in my comment originally, but I actually did find a SWE job. I'm still mentally broken by the process and how soul sucking and stupid my job is.",
            "score": -2,
            "replies": []
        }
    ]
}