{
    "title": "got a faang-adjacent swe role after graduating 7 months ago. should i make a linked post about it?",
    "author": "kumba7",
    "subreddit": "csMajors",
    "rank": 15,
    "score": 9,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/r/csMajors/comments/1jeek38/got_a_faangadjacent_swe_role_after_graduating_7/",
    "id": "1jeek38",
    "selftext": "I worked my ass off for 7 months, grinding leetcode doing projects and interview prep — rejection after rejection. It seemed that I hit a new low every week. And now I got my dream role in a challenging economic environment and im so grateful. \n\nObviously I’d love to share the news with my network and let my circle of supporters and professional contacts know about my new milestone and share the same thrill as me. But when I was unemployed I remember hating on these types of posts and even the people who posted it. Linkedin obviously is to blame for promoting fake jobs and spreading so much toxic content of cringey self-congratulating posts. But I genuinely want to let my network know what I’m up to and maybe even build my technical brand. I don’t want to ruin someone’s day when they see my post or make them feel low — because I’ve been there so many times. \n\nWould it be better if I shared resources (cold-email templates, strategies, leetcode notes) in my post? Would that give off elitist vibes? Or should I just not make the post altogether? Ultimately I’d like to build my brand so recruiters can find me easily and I can even find cool people online to build projects. \n\nthank you so much for your time reading all of this. i know people have much bigger problems than mine that need discussion — this is clearly a very good problem to have and I’d appreciate your 2 cents.",
    "comments": [
        {
            "author": "Sorgair",
            "body": "i think including resources is cringe and it's better to just treat it as a status update and that youre really happy and hopeful or whatever",
            "score": 8,
            "replies": [
                {
                    "author": "kumba7",
                    "body": "yeah good point",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "TonyTheEvil",
            "body": "Recruiters don't care about your \"brand\" and I can only see downsides to trying to build one on LinkedIn (see r/LinkedInLunatics for some examples). I wouldn't do anything other than the autogenerated post LinkedIn makes for you since any more is cringe.",
            "score": 5,
            "replies": []
        },
        {
            "author": "GiroudFan696969",
            "body": "Yeah man you deserve to post it. Definitely post it with some advice for the people still looking so your post has some greater purpose.",
            "score": 2,
            "replies": [
                {
                    "author": "kumba7",
                    "body": "yeah, do you really think that would be a positive spin on it? or would it still be frustrating and annoying to the average cs grad?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Defiant_War8030",
                            "body": "Look, you read those posts. You first hand found what was cringe or highly arrogant in those posts . So try that when you write the same, it does not come the same way. Your method of preparation may help someone, and they will forever be in your debt and will always be thankful to you.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sea-Independence-860",
            "body": "Bro just lowkey update your profile and don’t make a post about it. Just share your tips to me :)",
            "score": 2,
            "replies": [
                {
                    "author": "kumba7",
                    "body": "bro tryna gatekeep💀💀💀i aint even mad at the attempt ngl",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Sea-Independence-860",
                            "body": "Imma gatekeep you bro",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Organic_Midnight1999",
            "body": "If it’s Tesla I wouldn’t post at all. Otherwise keep it short and just say that ur happy to share some exciting news that you will be joining X company. I wanted to give a special thanks to ABC people. That’s about it. Everything else just comes off as punchable but like straight in the throat",
            "score": 2,
            "replies": [
                {
                    "author": "ElJalisciense",
                    "body": "X company...I see what you did there",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Examination_8878",
            "body": "Honestly its up to you. I personally don't like making linkedin posts but thats just me. I've heard others say that making posts is a good way for recruiters to notice you.",
            "score": 1,
            "replies": [
                {
                    "author": "kumba7",
                    "body": "yeah its like a personal brand building thing. normally I’d want to do it away from Linkedin bc its cringe asf but that’s where the recruiters are 😭😭😭 im thinking i just build my brand separately on threads or sum shi",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nsxwolf",
            "body": "Make sure you take the “open to work” banner off",
            "score": 1,
            "replies": [
                {
                    "author": "ElJalisciense",
                    "body": "\"Oops forgot to take that off...\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Known-Tourist-6102",
            "body": "you should probably just post that you started the new job on linkedin.  \nOther then that, nothing is really relevant. everybody has the same resources.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lazy_Contest_1670",
            "body": "Mind sharing the company name that you got an offer from?",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "spliche",
                            "body": "uber",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Economy-Detail3211",
            "body": "If u get upset from others posts you’re just a baby lmao",
            "score": 0,
            "replies": []
        }
    ]
}