{
    "title": "In my opinion this man should be seen on the same level as RDJ and Chris Evans for the role of Doctor Strange",
    "author": "Bowiescorvat2",
    "subreddit": "Marvel",
    "rank": 4,
    "score": 5180,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 299,
    "url": "https://i.redd.it/jexwpvk2kcpe1.png",
    "id": "1jdt1ga",
    "selftext": "",
    "comments": [
        {
            "author": "BucketsAndBattles",
            "body": "In a hypothetical Phase 4 Avengers movie that they should have made to tie stuff together, he’d have been the Iron Man-level character for sure in terms of prominence. I’d have liked to see that",
            "score": 673,
            "replies": [
                {
                    "author": "TruthEnvironmental24",
                    "body": "This is where they dropped the ball post Endgame. How have we not had an Avengers since then? We should have already had 2 minimum.",
                    "score": 247,
                    "replies": [
                        {
                            "author": "casual_creator",
                            "body": "Well the lack of Avengers has kind of been the point, post-Endgame - the team disbanded. Nearly every movie since then has made a point to say “the Avengers are gone; who’s gonna take their place?” The two upcoming Avengers movies are the answer to that question.",
                            "score": 152,
                            "replies": [
                                {
                                    "author": "TruthAndAccuracy",
                                    "body": "> The two upcoming Avengers movies are the answer to that question.\n\nWhen are those coming out though? It's already been 6 years since Endgame. That's too damn long of a wait. I was all in on the MCU up through Endgame but boy do I just find it hard to care about any of anymore, because it's just been unfocused and disconnected.",
                                    "score": 54,
                                    "replies": [
                                        {
                                            "author": "Desperate-Shine3969",
                                            "body": "Real fans know that the happiest state of mind is pretending the story ended with Endgame",
                                            "score": 42,
                                            "replies": [
                                                {
                                                    "author": "ambal87",
                                                    "body": "That story did end. Everything since then has been supposedly building towards a new story, but what that story is seems less and less clear.",
                                                    "score": 45,
                                                    "replies": [
                                                        {
                                                            "author": "timeywimmy",
                                                            "body": "I'm still made about that whole ass build up for kang than they just stopped doing the kang thing completely instead of just getting a different guy to play kang he'd be a different kang anyway",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "ambal87",
                                                                    "body": "Right. It’s the multiverse. We had a fucking alligator Loki. We couldn’t get a slightly different looking Kang?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "timeywimmy",
                                                                            "body": "No because marvel doesn't know the whole point and idea of what the multiverse is they turned it into a boring cash grab",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ambal87",
                                                                                    "body": "To be fair there is no point and the cash grab was “holy shit these movies are fun and entertaining!” The results speak for themselves. Boring content means people just won’t watch. I didn’t miss a single piece of content building up to end game and aside from a couple of things since I couldn’t care less. Just all so dull and pointless.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "timeywimmy",
                                                                                            "body": "The only reason disney made yhe multiverse saga was for as much nostalgia bait as possible ot could've been such a cool thing but there was like 2 movies with it and a show that actually had any multiverse stuff",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Desperate-Shine3969",
                                                            "body": "Honestly the biggest problem is that they tried to blend the stories. They should have just made a whole new run, made it clear that this was a “different universe” or whatever and restarted. But instead we got Multiverse of Madness and NWH that continued the storylines of important Endgame characters and shoved them into the Multiverse Saga, which it seems they didn’t even plan out.",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "pseudo_nemesis",
                                                                    "body": "I'm pretty sure they did have it planned out, but they had to change the plans entirely because they had to swap out their new big bad due to controversy.",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "vashoom",
                                                                            "body": "Majors' arrest happened in March of 2023, almost 4 years after Endgame.  There were 8 films and 8 TV shows released before then.\n\nThe problems with the Multiverse Saga started way before the issues with Majors.",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "ambal87",
                                                                            "body": "They could have always recast him.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Smiith73",
                                                                                    "body": "That's what I don't get... the role is wide open for a recast. I can't think of a better scenario for it :/",
                                                                                    "score": 7,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "osiris20003",
                                                                            "body": "They did have it planned out but a lot of factors in phase 4 messed up their plans. Covid happened, which ruined releases and the order of releases so films had to be cut certain ways to still make sense, and reshoots had to be done with a limited cast. Some films had new directors/screenwriters added who had loads of time to mess with scripts they didn’t write and make changes. This last reason is partly why Multiverse of Madness turned out the way it did. They were also filming/releasing multiple projects at one time and writers/directors were meant to keep things cohesive but they couldn’t see finished projects to the project they were working on because those previous project were still in development this was due to Bob Chapek forcing multiple projects on Marvel all at once splitting the studio between film and Disney + series due to MCU popularity. Again this happened to impact MoM. Raimi never saw Wanda Vision, and Elizabeth Olson was on set trying to guide Raimi through her characters previous development. There are other factors to like over working cgi artist and stuff, also as you mentioned the J Majors issues. A lot happened from 2020-2023 that majorly impacted the MCU.  \n\nA lot of this is why Marvel studios is now split again between two divisions, TV and Film, and Bob Iger is in change once again. Also why they only released DP and Wolverine in 2024. They needed to get their bearings back and flesh out the full plan for the remainder of phase 5 and 6 so things could get back to cohesiveness.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Eccohawk",
                                                                            "body": "They also had COVID shutdowns and a writer and actor strike.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "vishalb777",
                                                            "body": "Having to change the big bad in the middle of the phase is definitely a detriment",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ambal87",
                                                                    "body": "They didn’t have to! They chose to. Just recast.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Doctor_Milk",
                                                    "body": "The story ended at Infinity War for me… what does that say about me I wonder?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Personal_Corner_6113",
                                            "body": "I think if they didn’t want to do full Avengers movies, they should have at least gone with more team ups like strange in spiderman. Chris Evan’s was basically appearing as Cap in a solo movie or avengers movie every year or two, and iron man was similarly prolific. Now we see characters every few years if even that and with so many projects being lackluster, it’s hard to care about anything going on",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "utkarshmttl",
                                            "body": "No thanks to you for reminding me it's been SIX FREAKING YEARS. \nTime really did speed up after covid?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Sharticus123",
                                            "body": "The more material they produce the more I find myself thinking Endgame should’ve been the end of that run. \n\nWhat came next should’ve been a completely new run with a completely different team. Didn’t even have to be Avengers. Could’ve been the FF, The X-Men, The New Warriors, or whatever. \n\nTrying to tie a connected multiverse together for so long has bitten Marvel in the ass. They’re all over the place and nothing feels cohesive. It’s just a bunch of random shit that ranges from ok to bad.\n\nI’d honestly be perfectly fine if they announced tomorrow that they were going to scrap everything and start fresh.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sufficiently_tortuga",
                                    "body": "They were disbanded post Civil War too.  That didn't stop them",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "Planeswalkercrash",
                                    "body": "I think this is one of the big failings, phase 4 established a lot of new characters and plot lines. It should’ve all been tied together with an avengers film, get characters established solidly and get them together!!",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PennStateFan221",
                            "body": "Instead we got movie after movie with basically zero interconnection. That was fine pre avengers. Now it just feels odd and completely unlike the mcu.",
                            "score": 50,
                            "replies": [
                                {
                                    "author": "qwadzxs",
                                    "body": "and then for every complaint about not enough interconnection there's someone complaining they have to do homework to watch whatever big movie is coming next",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "PennStateFan221",
                                            "body": "Well those people are wrong lol",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "Training-Antelope550",
                                                    "body": "Well to be fair everything is still connected. Every movie since endgame has been a sequel to something with the exception of Shang Chi and Eternals (and the upcoming fantastic four but that's not out yet). Most of the TV shows are also sequels, only ones that aren't really are Ms Marvel, Moon Knight, Werewolf by Night, and What If. You can watch she-hulk, Loki, and Hawkeye with no prior knowledge but it's definitely expected. \n\nOne of the biggest issues is that the TV shows, are starting to become \"essential reading\" for the movies, which is an issue cuz people are willing to sit thru a 2-3 hour movie but not as much for 5-6 hours of television. Dr Strange was a wandavision sequel The Marvels was a sequel to Ms Marvel, and Captain America was a sequel to FatWS. Plus a lot of things are sequels to Endgame, which itself is held up by 20 years of continuity.",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "ExplorationGeo",
                                                            "body": "> Every movie since endgame has been a sequel to something with the exception of Shang Chi and Eternals\n\nAnd even Shang Chi had enough stuff around the edges (Wong vs. Abomination in the fighting arena, Trevor Slattery, and then Wong, Danvers and Banner at the end of the movie) to be connected. The real injustice here is that Shang Chi hasn't had a sequel yet, that movie slaps.",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "Independent-Green383",
                                                                    "body": "That right there is the thing. Its not the interconnectedness, its the lack of sequels and the lack of heroes working together.",
                                                                    "score": 10,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "wordwords",
                                                            "body": "I wouldn’t even count ms marvel since she got her sequel in the marvels, and so much of ms marvel was built off her love of the mcu, so of any of the shows with “never before seen” characters, it was the only one steeped in the MCU. She-hulk is similar, it’s built into the world and existing characters heavily. \n\nNot seeing moon knight have any connection yet has been crazy in comparison.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Crowlands",
                                    "body": "No interconnection would have been fine if done well, look at the early phases where the films stood strong on their own merits with credit scenes doing the connecting. \n\nWhat we have actually got since then are movies with more interconnecting that don't do that well nor do they stand up well enough on their own merits either.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AramFingalInterface",
                                    "body": "People like Paul Rudd, Taika Waititi and Brie Larson should be making studio comedies. The problem is that Marvel movies replaced studio comedies, and they’re too joke heavy now because of it. Even DC did it with Flash and Blue Beetle dripping with broad humor.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Embarrassed-Gur-1306",
                            "body": "Agreed. It would've been huge for characters like Shang-Chi, Moon Knight, Ms. Marvel, etc. to be featured in a couple Avengers movies to establish their importance.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Totally_TWilkins",
                                    "body": "I think getting a Young Avengers project before Doomsday, or at least between Doomsday and Secret Wars would have been a good idea to build up some more momentum for these characters; at least we’re apparently getting a second Hawkeye project for Kate. \n\nUnfortunately, the MCU’s audience do have huge a problem with being able to move on and enjoy new characters. Ms Marvel, Wiccan, Kate Bishop, all had enjoyable projects, and unfortunately two of those got ignored by a large part of the fandom because of ‘woke’, and to some extent, that makes Disney more hesitant to continue things. Too people just don’t want to enjoy anything new, because they just compare everything to Endgame; I think that’s what’s making Disney a lot more cautious when they’re making projects. \n\nAgatha All Along was a prime example. It had a tiny budget, but it managed to exceed Disney’s expectations and become one of the stronger post-Endgame projects. If more people had given it a fair shot, rather than just dismissing it because of ‘woke’, maybe we’d see Disney be a bit quicker when it comes to greenlighting sequels and expansions.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "TruthEnvironmental24",
                                    "body": "They've *introduced* enough characters to have two completely new teams, plus a main Avengers team with the holdovers. Thunderbolts should have been the latest crossover, not the first.\n\nOne big issue, imo, was that there were too many characters with solo introductions. In Phase 1, Clint and Natasha were introduced in Thor and Iron Man 2, respectively. Out of all the people introduced post Endgame, I think Riri is the only person to not have her own solo introduction.\n\nThe MCU was also way too micromanaged. There should have been different creative teams working on the different \"Avengers\" teams. Because it was supposed to be one consecutive story, we ended up with so many characters not returning for way too long. Shang-Chi came out 4 years ago, and we haven't seen anything to do with him since, and that's about par for the course. Pre-Endgame every single character averaged about 2 years between appearances.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Embarrassed-Gur-1306",
                                            "body": "You nailed it. Introducing new characters in an established character’s movie was their bread and butter. It worked well too so I’m not sure why they went away from it. \n\nHell, even a character as big as Spider-Man was introduced in a Captain America movie. \n\nThings seem to become disjointed and less connected when they started doing the TV series.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "TruthEnvironmental24",
                                                    "body": "I disagree on the TV part. I don't think it was utilized to the fullest, though. Use the TV shows to introduce B-list and below characters, and tell their stories there, then use the movies to introduce them onto the teams. Like, we could have had a show telling a Hawkeye/Black Widow/Shield story during Phase 1, and that wouldn't have taken away from the movies at all if you didn't see the show.\n\nI've heard the initial plan for Quantumania was for Scott and Hope to get trapped in the Quantum Realm, then Cassie was gonna put together the Young Avengers to go save them. So, Kate and Kamala were both introduced in TV shows, and Cassie, America Chavez, and Riri were introduced in another character's movies. That's exactly how they should have put together the other teams, too. Instead, we got everyone else getting their own movie/ show and no team ups.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "aelysium",
                            "body": "Frankly, while it doesn’t need to be the Avengers specifically, each phase definitely needs at least one ‘everyone teams up’ film to anchor the story.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TruthEnvironmental24",
                                    "body": "Exactly. They've introduced enough characters for the Young Avengers and the Midnight Suns and have enough leftovers from the Infinity Saga (and even a few new characters) to still have a pretty hefty main Avengers team. Probably enough to even do both the New Avengers and the Mighty Avengers simultaneously. And that's not even including the Thunderbolts*.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "free_britney_bish",
                            "body": "In my head...\nThere is no Black widow, Eternals, She-Hulk, Secret Invasion or Echo. MoM, Thor, Wakanda Forever, Quantumania & the Marvels were rewritten (no Love or Ironheart, less goofy)\nAnd to end Phase 4, Armor Wars focuses on Rhodey, Sam and Bruce trying to stop the mass theft of Stark Tech and forming the base of the new Avengers. \n\nBrave New World is rewritten as Avengers: New World Order which centers on a similar global conspiracy by the Leader involving President Ross. Bruce takes more of a center stage but by the end Sam is established as Captain America, Rhodey is trying to mend worsening relations between the government and superheroes, the Wakandans are mobilizing their military for a threat one of their seers perceives, Scott is paranoid about Kang & Shang Chi's Rings are out of control...(She-Hulk if better written can be brought in) \n\nThen come Thunderbolts and Fantastic Four, along with Doctor Strange 3, Spider Man 4 and then Doomsday...",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "tahoebyker",
                            "body": "It was pretty clear that they expected Black Panther to be the new Cap and lead the team and Chadwick's passing left them with a huge void.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Accomplished_Year_54",
                                    "body": "Maybe but thats just one out of three. Wheres the new Ironman? Or the new Thor? Of course Thor is still here but hes nowhere near to being a main character anymore. I think Wong had the most appearences out of anyone post endgame.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Abraham_Issus",
                            "body": "Feige's brilliant idea to have Avengers as saga capper. So no AV movies in individual phases.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Logical_Astronomer75",
                            "body": "Secret Invasion should have been a team up movie. Instead we got depressed Nick Fury and Skrulls impersonating characters who we don't care about.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TruthEnvironmental24",
                                    "body": "Ngl, I enjoyed the Fury part, but it definitely should have been a team up movie.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Logical_Astronomer75",
                                            "body": "Nick Fury in Secret Invasion and Captain Marvel 2 were very different characters ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Iceykitsune3",
                            "body": "I still say that Chadwick Bozeman dying screwed up the post endgame plans.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Kentucky_Fried_Chill",
                            "body": "They stopped because people got fatigue from all the multiversity connections and then the movies that's came out after flopped, eternal Marvel's and Quantamania, added with their main villan being a IRL villan and, they have been trying to recover ever since.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "daepa17",
                            "body": "It's not like there was a pandemic or anything that made it near impossible to produce solo movies for nearly two years, let alone Avengers ensemble movies",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Actevious",
                    "body": "We've had more hours of MCU content after Endgame than before it, yet there's been zero Avengers movies. Such a bizarre decision.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "an_african_swallow",
                    "body": "Yup, I feel like he was really being set up to be a senior member for the new version of the avengers that the MCU was setting up, but then that movie just never happened",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "forevervalerie",
                    "body": "That’s how I thought it should have been!!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Some-Common-9655",
                    "body": "They should've made Dr Stange 2 into a avengers 4.5 movie like Civil War. They could've taken the stuff that worked from MoM and mixed it with the Avengers Disassembled storyline",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "AshMCM_Games",
                    "body": "They did it.. for nwh",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MST3kPez",
            "body": "110%. Made for the role.",
            "score": 902,
            "replies": [
                {
                    "author": "MCbrodie",
                    "body": "The thing is, he does this to every role he plays.",
                    "score": 375,
                    "replies": [
                        {
                            "author": "Gandalf4158",
                            "body": "Peter Jackson couldn’t have picked a better Smaug…however, the rest of the The Hobbit trilogy was below average…",
                            "score": 128,
                            "replies": [
                                {
                                    "author": "MCbrodie",
                                    "body": "Dragon, narcissistic genius detective,  sorcerer supreme, brilliant father to modern computation, spy, KHAN!!!!!!!  The list just goes on.",
                                    "score": 76,
                                    "replies": [
                                        {
                                            "author": "ThreeEyeJedi",
                                            "body": "Spy in which movie?",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "sdwoodchuck",
                                                    "body": "*Tinker Tailor Soldier Spy* -- looking at the comments, I guess he's been a spy a few times.",
                                                    "score": 10,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "man_on_hill",
                                                    "body": "Spy Kids",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "MCbrodie",
                                                    "body": "The courier.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "spain-train",
                                                            "body": "He was more of a, well, courier in that film. He didn't actually do any of the spying.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MCbrodie",
                                                                    "body": "that is what most spying is.  Clandestine agent was probably a better word.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "spain-train",
                                                                            "body": "[That feels weird, but I'll allow it.](https://media.tenor.com/qqdaTMkDHqoAAAAM/dr-strange-spiderman.gif)",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MCbrodie",
                                                                                    "body": "I work for the Fed.  I'm projecting.  My life is weird right now.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "spain-train",
                                                                                            "body": "I can only imagine your pain, I hope you're okay. Hang in there, friend!",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "in_casino_0ut",
                                                    "body": "Zoolander 2",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sdwoodchuck",
                                            "body": "Don't forget both Dr. Frankenstein *and* Frankenstein's Monster.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TimBroth",
                                    "body": "Do you still recommend watching the trilogy, old friend?",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Ordinary_Release9538",
                                    "body": "Wow! I had no idea that he played Smaug! [This](https://youtu.be/sXN9IHrnVVU?si=Hm-3YPvjgm5ZdK73) is some amazing stuff.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Fit_Organization_824",
                                            "body": "My wife and I call each other a \"barrel rider\" when we think the other is fibbing or involved in some deception/subterfuge ",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MrPenman",
                                    "body": "Agree with the exception of Martin Freeman as Bilbo.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Dantien",
                                            "body": "Some of the dwarves were perfectly cast too!  Balin!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Wreckshoptimus",
                                    "body": "I would actually say average",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "heidly_ees",
                                    "body": "Casting in general was good for the Hobbit with the possible exception of Stephen Fry",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Detroitasfuck",
                            "body": "Exactly. Sherlock (too good on BBC, and Martin freeman!), The imitation game (amazing movie), great as Khan.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "havasc",
                            "body": "I am All.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "SSJAbh1nav",
                                    "body": "\"I understood that reference\"",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BigDaddyFatSack42069",
                            "body": "Benadryl Cabbagepatch hasn't been cast in a bad role yet",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MCbrodie",
                                    "body": "don't edit this.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thegreedyturtle",
                    "body": "It's not that he's on the same level, he was well above them before he even joined the MCU. So there's not much point in talking about how great a Dr. Strange he is. Of course he's fucking great. It's Benedict goddamn Cumberbatch.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "420xMLGxNOSCOPEx",
                            "body": "bendystraw cabbagepatch",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Solitaire-06",
                    "body": "Benedict Cumberbatch does not get enough credit for his performance here. A low-key talented actor all around. He showed Stephen Strange’s remarkable intellect and arrogance simultaneously.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "poteland",
                            "body": "Not to take away from him but we've been seeing him as an arrogant genius for so long that it's not really groundbreaking for him. He became famous playing Sherlock Holmes, and also portrayed Alan Turin. \n\nIt's not his fault that he's typecast but I'd like to see him doing something else - just not playing a dragon.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "foxfire_17",
                    "body": "I honestly think he would have been the most perfect actor for Mr. Fantastic.  But his Dr. Strange is pretty great too.  I’ve never seen him be less than great in any role.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaptRogersNbrhood",
            "body": "What are you, his ward?",
            "score": 120,
            "replies": [
                {
                    "author": "Dragonraja",
                    "body": "His Burt Ward",
                    "score": 14,
                    "replies": [
                        {
                            "author": "DINNERTIME_CUNT",
                            "body": "They’re calling the cops man, put the piece away.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "DukeOfRadish",
                            "body": "Hi Brad Wurst",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "FighterJock412",
                            "body": "Something Something, baby on board",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bcnjake",
            "body": "I put him above RDJ and Evans for Dr. Strange. They never played him!",
            "score": 353,
            "replies": [
                {
                    "author": "ybtlamlliw",
                    "body": "Oh you!",
                    "score": 48,
                    "replies": [
                        {
                            "author": "midgetsjakmeoff",
                            "body": "“Do YOU come with the car?”",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dragonraja",
                    "body": "Dr. Strange is my favorite Marvel movie.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "RippleEffect8800",
                            "body": "That and Guardians 1 are mine.  \n\nThe ending of Dr Strange was something I've never conceived or happening.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "ExplorationGeo",
                                    "body": "> The ending of Dr Strange was something I've never conceived or happening.\n\nOut-thinking the Big Bad and being willing to go through with the punishment to get them to give up shows the depth of the character, imo.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "fragglebags",
                            "body": "Watch Infinity War and Endgame. You will definitely have a new fav marvel movie, I promise! Dr Strange is good but the other two are masterpieces. ",
                            "score": -19,
                            "replies": [
                                {
                                    "author": "RippleEffect8800",
                                    "body": "Infinity War would be a masterpiece if 2 things happened\n\nRaging Green Hulk  \n\nEliminate or fixed the time travel paradoxes",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "RangerZEDRO",
                                    "body": "Lol, I like you're assuming they haven't watched Infinity War and Endgame. Which is good.\n\nBut the fact was, people were watching Infinity War and Endgame cuz of the hype and they havent seen a Marvel film since the first Iron Man.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Statically",
                                    "body": "He should study cage match and get back to you",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Dragonraja",
                                    "body": "Nah. I've watched them both. The story is ass. It's a very watered-down version of the comics.",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "author": "fragglebags",
                                            "body": "Paging r/unpopularopinion",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "FirstSnowz",
                                            "body": "You can like more than one thing. I like the Lord of the Rings books. I like the Lord of the Rings movies too, even though they changed some things and didn’t include the encyclopedia of information that you can learn by reading the books. \n\nIt’s also okay to not like something, and to give your reasoning when appropriate. But you swooped in to reply to a conversation didn’t involve you in any way, and gave your negative opinion on something widely enjoyed (that the person you’re replying to was just wanting to share with someone). You were just looking for an opportunity to say what you wanted to. Doing that doesn’t make you ‘smarter than all the sheep who haven’t read the comics or don’t understand why they’re better.’ It just makes you a dick.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "wandering_05",
                    "body": "RDJ gonna play dr strange. Got it Sherlock?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bcnjake",
                            "body": "MCU Phase 9: Every part is played by Robert Downey, Jr.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "cheapseats91",
                            "body": "I was hoping that at some point someone was going to make a \"no shit sherlock\" comment and RDJ and Cumberbatch would both look up.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wanderson90",
                    "body": "Give Disney enough time, and eventually RDJ will get a crack at it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "getemyosh",
            "body": "I feel like he was on his way. To me, Infinity War had put him in everyone’s view as that type of character going forward. \n\nI think them not landing his second movie set him back. Also with so much time in between his movies hurt as well.",
            "score": 158,
            "replies": [
                {
                    "author": "sneekopotamus",
                    "body": "I loved Madness. So fun.",
                    "score": 78,
                    "replies": [
                        {
                            "author": "krayniac",
                            "body": "same here. For all its faults, I think it's the MCU movie that most actually felt like a comic book and it's super enjoyable",
                            "score": 61,
                            "replies": [
                                {
                                    "author": "sneekopotamus",
                                    "body": "Yep! Very Raimi. The fight in the tower is one of my fave Marvel scenes ever.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "krayniac",
                                            "body": "Yes, I love the music fight and the zombie strange stuff it’s so beautifully cheesy and entertaining and just plain cool",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "roguevirus",
                                                    "body": "> it’s so beautifully cheesy and entertaining and just plain cool\n\nThat's what happens when you give Sam Raimi a budget and tell him to channel his early movies. Loved it.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "sneekopotamus",
                                                    "body": "Totally. Intense.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Stormsurger",
                                    "body": "I rewatched it recently and thought to myself what a miserable fuck I was last time watching it because it was actually super fun :D Yea I could poke holes in it but why bother?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TruthAndAccuracy",
                            "body": "I really wanted to love it, but man do I not like Raimi's style in the slightest.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Supermite",
                            "body": "Easily one of the best films to rewatch.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "mosquem",
                            "body": "Raimi gonna Raimi",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "sneekopotamus",
                                    "body": "Amen.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FakeNamePlease",
                            "body": "Same, I rewatch that and the first one all the time.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "mcon96",
                            "body": "I like it sooooo much more than the first Doctor Strange movie",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "benergiser",
                                    "body": "this one and quantumania is gonna age waaaaay better than people think.. already starting",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "extrastupidone",
                            "body": "Same!  Visually awesome. Great comic book feel to it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "asianwaste",
                    "body": "I'd rate Multiverse of Madness above Ironman 2 at least.  At the very least, he was great in No Way Home.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "extrastupidone",
                    "body": ">To me, Infinity War had put him in everyone’s view as that type of character going forward. \n\n\nYyyep",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "buddyruski",
            "body": "They really wasted his potential as torch bearer for the next few phases. His role in Spider-Man was hollow, and he hasn’t shown up anywhere else besides his own movie.\n\nAgain, MCU should introduce way less characters and build up the ones they have.",
            "score": 58,
            "replies": [
                {
                    "author": "Knobbbles",
                    "body": "He IS in Thor 3 as a reality cop.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Heisenburgo",
                    "body": "Absolutely. It's sad how they dropped the ball on Strange. \n\nThey inmediately character-assassinated him after Endgame (both in NWH and in his own movie), and they've kept his literal MANSERVANT and BUTLER Wong in the role of Sorcerer Supreme over him ([\"everything is YOUR fault, Wong!\"](https://youtu.be/6Pw-fjFFv4o?list=PL72362A49FB745604&t=222)), so the character is just not as cool as he was in the Infinity Saga... \n\nThis man once fought Thanos himself for crying out loud! the Mad  Titan threw a blackhole at him which Strange tacticly countered, showing his expertise as a Master of the Mystic Arts... \n\n...yet the new movies will have you believe Strange is some simple fool who cowers at the sight of the Scarlet Witch, gets outsmarted by literal TEENAGERS, gets replaced by his BUTLER in his iconic title of Sorc.Supreme, and can't think up a spell to dispel some simple webbing, making him get stuck in a dimension that he CONTROLS for over 12 hours... all the while they have him learn the same old lesson, that he shouldn't be arrogant or try to always be in control, in every project he's in...\n\nIt's absolutely CRIMINAL how Marvel has repeatedly dropped the ball on this RDJ-level character/actor combo, at every opportunity. He could have been the next Iron Man but he might as well be just some random low-level sorcerer at this point, since he's soooo weak and innefectual and he's not even the Sorc. Supreme anymore (was he, ever?), because having Alfred making cameos as Batman over Bruce himself in other projects (to use a crazy analogy) was apparently much more important than just building up Bruce Wayne himself... SAD!",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Sir-Fluf",
                            "body": "Since when was Wong his manservant? He’s always been his own independent character from what I’ve known",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "lcpm1992",
                                    "body": "Since 1963",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ten_year_rebound",
                                            "body": "Maybe in the comics but that’s not his character in the movies at all",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ten_year_rebound",
                            "body": "Wong is not his “butler” in the MCU, Wong has been studying magic longer than Strange has, it’s just that strange is a quick learner and talented. In all reality Wong “should” be Sorcerer Supreme",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SaintNutella",
            "body": "I just know he and Chadwick would've/should've been the new leaders of the MCU 😔",
            "score": 25,
            "replies": []
        },
        {
            "author": "sirburchalot",
            "body": "His vibe in the comics is just less known but Cumberbatch nailed it",
            "score": 15,
            "replies": []
        },
        {
            "author": "YareSekiro",
            "body": "I think just from performance wise yes, but sadly he just didn't appear in enough projects to truly tie things together. He was most prominent in the two Dr strange movies, infinity war but that's pretty much it and maybe No way home.",
            "score": 9,
            "replies": [
                {
                    "author": "king_gondor",
                    "body": "Prominent in two Dr. Strange movies!? He was the supporting character in MoM. That’s what pissed me off so much.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Power0fTheTribe",
            "body": "My favorite MCU character hands down. MOM did him dirty. I needed more Strange in it",
            "score": 10,
            "replies": []
        },
        {
            "author": "Winter_Incident1369",
            "body": "In this house Benedict Cumberbatch is Doctor Strange end of story",
            "score": 4,
            "replies": []
        },
        {
            "author": "Ghstfce",
            "body": "Um, isn't he already?",
            "score": 9,
            "replies": [
                {
                    "author": "asianwaste",
                    "body": "Eeeeh, RDJ is so far entrenched, they are already resurrecting him in a manner of speaking.  But Cumberbatch is probably a close second for me.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "DanFrom503",
            "body": "What is an opinion on the internet worth these days?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beneficial_Table_721",
            "body": "I mean he probably would be if he had even half the screen time as the other two.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Other-Marketing-6167",
            "body": "I mean…I bet if you asked a thousand MCU fans who their top 3 are, he’s probably pretty close. He came way later, his second movie was mediocre (which also happened to RDJ but that was during a whole different time for the franchise) and has had a lot less screen time - just the nature of things.",
            "score": 7,
            "replies": []
        },
        {
            "author": "YourMomIsMy1RM",
            "body": "There will be a lot of opportunity for him to have some big moments like Steve and Tony in Secret Wars if they keep the comics plot.",
            "score": 2,
            "replies": []
        },
        {
            "author": "deemoorah",
            "body": "I love him. You'll see me defending him and his Strange but the problem is he doesn't even get 30% treatment and privileges Rogers or Stark got during Infinity Saga and if you ask casuals, most of them think he's one of the main popular characters left and yet the level of hype isn't as big because the very reason I said. Once he's famous enough, they use his character to tell or plan the stories of other characters instead of trying to develop him as a character, this is the pattern he has during this saga.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Twisted-Mentat-",
            "body": "He's undoubtedly a skilled actor.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Solid-Move-1411",
            "body": "When did RDJ and Evans play Dr Strange lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jackielegs43",
            "body": "Agreed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Broad-Bodybuilder132",
            "body": "He is.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ikillsheep4u",
            "body": "It was only natural he be the new “lead” of the mcu. His sequel was overall good I just wish we had gotten an in between movie for Wanda’s heal turn. \n\nNow that I think of it I think that’s what this phase is missing the most of LEADERS.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CamaroDev",
            "body": "Agreed I cannot unsee Benedict Cumberpatch as Doctor Strange.. literally killing the role",
            "score": 2,
            "replies": []
        },
        {
            "author": "Reasonable-Branch529",
            "body": "He is.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DukeOfRadish",
            "body": "I want to agree but he's only had 1 movie that focused on Dr. Strange, his world, his circle of characters, etc.\n\nEverything else has been him playing support for Scarlet Witch or America Chavez or the noodle heads that let Thanos get away on Titan.\n\nI'd really like the third movie to focus more on the good Doctor.  Perhaps he can get back his title of Sorceror Supreme.  Triumph & Torment is a great arc to both bring us more Doom and highlight the powers and mindset of Doctor Strange.  It'd probably have to happen after FF because...well, read it if you haven't.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Knowlongerlurking",
            "body": "As a long-time Strange fan, when I was growing up reading the comics of the '70s and '80s, Dr. Strange appeared in my head looking like Jack Palance, but with a snooty side of David Niven mixed with the charm of a Micheal Caine.\n\nCumberbatch is honestly the closest I'm ever going to get to that fantasy headcasting.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Demon-_-TiMe",
            "body": "I think they should have be the new face of the avengers alongside captain america (falcon)",
            "score": 2,
            "replies": []
        },
        {
            "author": "theCoffeeDoctor",
            "body": "MCU Phase 1-3 did a lot of casting decisions equally well. We could say the same about Winter Soldier, Black Panther, etc.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheAdminsAreTrash",
            "body": "For sure, but Multiverse of Madness being an absolute POS movie didn't help.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BAT_1986",
            "body": "I agree. He’s a great Doctor Strange.",
            "score": 2,
            "replies": []
        },
        {
            "author": "blutoothcrockpot",
            "body": "Look at this photograph!",
            "score": 2,
            "replies": []
        },
        {
            "author": "sasi8998vv",
            "body": "The demolition of Strange's character began in No Way Home, where the universe's sorcerer supreme was reduced to a joking buffoon helping teenagers rewrite spacetime, just cuz he can. That just continued into Multiverse of Madness. \n\nIf only the character maintained the same level of gravitas presented in his first movie, and Infinity War.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thunderonn",
            "body": "Chris and Robert are on their own level. Then Scarlet and then maybe Strange with Spider Man and Bucky.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vegetable_Status_109",
            "body": "Yeah he did a pretty great job as Doctor strange. It's unfortunate they shafted him with a dog shit sequel to his first movie",
            "score": 2,
            "replies": [
                {
                    "author": "WeirdnessWalking",
                    "body": "They even set up the entire sequel plot in the first movie. And then abandon essentially everything established for the 2nd.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Vegetable_Status_109",
                            "body": "I know and they committed the writing sin of making the steaks so astronomically high that our hero becomes a villain by not immediately shooting America Chavez in the back of the head when he understands the potential universe destroying implications of her powers. There's no reason to make her powers capable of destroying the entire goddamn multiverse. It just sets up the world's stupidest trolley problem",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "WeirdnessWalking",
                                    "body": "Don't know or care what the 2nd movie was even about.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "VengefulAncient",
            "body": "Isn't he already?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Palmbomb_1",
            "body": "His story arch hasn't peaked yet. It will.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Affectionate-You3260",
            "body": "Absolutely.",
            "score": 2,
            "replies": []
        },
        {
            "author": "crossbutton7247",
            "body": "It annoyed me so much that doctor strange 1 was so good, then they just abandoned the character.\n\nHe hasn’t actually had a proper standalone film since, he’s just a plot device for the avengers/spider man/scarlet witch",
            "score": 2,
            "replies": []
        },
        {
            "author": "localystic",
            "body": "He was Sherlock first though. Cumberbatch will never ever not be Cumberbatch in anything I see of him. Here he was not that arrogant and alien, but he was still Cumberbatch. His face, mannerisms and voice are too unique for him to be anything but Cumberbatch.",
            "score": 2,
            "replies": []
        },
        {
            "author": "king_gondor",
            "body": "He should’ve been the face of MCU for the multiverse saga. They should’ve capitalised on the idea they set that Dr. Strange is the most dangerous threat to the multiverse. He should’ve appeared in more movies or shows.",
            "score": 2,
            "replies": []
        },
        {
            "author": "user87204",
            "body": "Agreed, simply and fully agreed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "anoet_hg",
            "body": "hes a phenomenal actor, everything ive seen from him is incredible",
            "score": 2,
            "replies": []
        },
        {
            "author": "Small_Gap3485",
            "body": "I think it’s to die with timing, CE and RDJ left just as the MCU stopped being beloved. SS only started in that era and is probably going to be most known during the MCU decline",
            "score": 2,
            "replies": []
        },
        {
            "author": "MBVakalis",
            "body": "Is he not?",
            "score": 2,
            "replies": []
        },
        {
            "author": "This_Low7225",
            "body": "He's good. The accent is annoying.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Over_Ad1461",
            "body": "I think it's the meh American accent. I mean it passes but not great",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheBillyIles",
            "body": "Iron Man was an interesting choice from the start because he was a 2nd tier character in the Marvel Universe.\n\nhad everything been perfect, Spiderman would have been the opener on the MCU films, but Sony held the license. \n\nI personally am glad it was Iron Man because i always liked the character. Dr. Strange was pretty good in the first movie, but the into the multiverse one wasn't that great. Way to many pregnant pauses and the dialog wasn't the best.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BigMack6911",
            "body": "You're right, he was perfect for Strange",
            "score": 2,
            "replies": []
        },
        {
            "author": "misterwilhelm",
            "body": "Nah. He was good but I could see other actors pulling it off. RDJ was born to play Stark. Every time Evans steps on screen as Cap he IS Cap. Benny just doesn't hit the same.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PersonalRaccoon1234",
            "body": "I wasn't a fan of the casting at first but its grown on me and now I think he's a fantastic Dr Strange.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PapaBoostO2010",
            "body": "His next title movie needs to be just him and no other established characters that could draw away from the film.  True solo.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DesperateRace4870",
            "body": "Agreed.  Based opinion",
            "score": 2,
            "replies": []
        },
        {
            "author": "cipher1331",
            "body": "But your man is already the Sherlock for our times. So much so that I completely forgot RDJ had also played Sherlock.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JamesRevan",
            "body": "I cannot stand his American accent.",
            "score": 2,
            "replies": [
                {
                    "author": "Fortyseven",
                    "body": "You know, there's SOMETHING off in there that I was _subconsciously_ aware of, but didn't really think about until you said this. It's not a deal breaker by any means for me, I'm used to it. But maybe it's karmic payback for Marster's accent as Spike on Buffy. :D",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "do_go_on_please",
                    "body": "I’m a huge BC fan but he cannot do American accents. Just let him have his accent like Denzel ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Arashii89",
            "body": " Cumberbatch is an amazing actor he was really good in Sherlock homes too",
            "score": 2,
            "replies": []
        },
        {
            "author": "bargman",
            "body": "MoM and NWH kind of messed up his character. He did a lot of dumb shit in those movies.",
            "score": 2,
            "replies": [
                {
                    "author": "mtamez1221",
                    "body": "I hated MoM. That part he went to Christine's wedding and made it about himself, like seriously?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aglet_Green",
            "body": "Well, you can honestly say that he's no Peter Hooten, but I guess he's done okay for himself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hammerheadshark55",
            "body": "He barely get his own time in his second movie",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrHeavySilence",
            "body": "The character needs a rival to push him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thatsuperheroguy8",
            "body": "Boontang cucumbersnatch",
            "score": 1,
            "replies": []
        },
        {
            "author": "Little-Efficiency336",
            "body": "Made for the role I’ll say.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wooden_Passage_2612",
            "body": "Cumberbatch is Doctor strange. One and only.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nagon117",
            "body": "Illuma-whati?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Senshji",
            "body": "He just doesn't get proper moments to expand on his character. Besides the first movie all he does in the later movies is move the plot along further or be a plot device for someone else. Cumberbatch is a really good actor, just doesn't get to really act his ass off or talk for a couple of scenes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guba_the_skunk",
            "body": "He was, wasn't he?  Like weren't people demanding he play strange YEARS before a movie was even in the works?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Knobbbles",
            "body": "Benny Cumb is just a fantastic actor, same with Tom Hiddleston’s Loki man, both the actors just nail like every movie",
            "score": 1,
            "replies": []
        },
        {
            "author": "Artoo-Detoowha",
            "body": "We should have Doctor Strange 3 and 4",
            "score": 1,
            "replies": []
        },
        {
            "author": "LegoFucker61",
            "body": "Strange is one of the few characters left in the MCU that’s keeping me on this train. The issue is it’s like there’s no push for him. Last time we saw him was 3 years ago now. I’m guessing he’ll be in Avengers, but where’s his third movie? Why haven’t we heard anything about a third movie with him? I feel like they don’t realise that they’re not gonna have these actors forever, they need to utilise them while they’ve still got them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wanlain",
            "body": "I can’t even think of anyone who would do this role justice… maybe RDJ?  /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sensitive_ManChild",
            "body": "I thought they were going to make him the kinda replacement for Tony, but we’ll never have that again",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zenule",
            "body": "but why lower his level?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fake_the_jaB",
            "body": "Illuminawhatty?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Abraham_Issus",
            "body": "1000%",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stauce52",
            "body": "I mean straight up, his movies just weren’t as good",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheQuatum",
            "body": "He needs better films, and to be more prominent in stories when he shows. He's excellent in the role, but he's either a side character or a secondary character (in his own film!).\n\nHe needs a chance to be cool, like RDJ's Ironman and Cap in TWS and Civil War.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Niitroglycerine",
            "body": "10/10 actor, underrated",
            "score": 1,
            "replies": []
        },
        {
            "author": "Better_Edge_",
            "body": "He is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guachito",
            "body": "He isn’t?",
            "score": 1,
            "replies": []
        },
        {
            "author": "forevervalerie",
            "body": "I’VE BEEN SAYING THIS! I still do not understand WHY Marvel Studios didn’t make him the lead man being mentioned and making appearances in multiple projects after Endgame. I thought that it would be obvious!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Affect_3374",
            "body": "Hell no lol. He always seemed like a dweeb cosplaying as a super hero. He’s terrible. And he looks silly as hell",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eastern-Team-2799",
            "body": "Same for charlie cox , vincent , jon , chris and many more imo .",
            "score": 1,
            "replies": []
        },
        {
            "author": "JorVetsby",
            "body": "In terms of the role itself, I agree. But his movies don't carry the same weight that the IM and Cap movies did.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bolshaw",
            "body": "yes!",
            "score": 1,
            "replies": []
        },
        {
            "author": "clintnorth",
            "body": "God, the first Doctor Strange was one of my favorites in the whole MCU. The second one was utter dog shit, but that wasn’t exactly Benedict Cumberbatch‘s fault.",
            "score": 1,
            "replies": []
        },
        {
            "author": "qui-bong-trim",
            "body": "he's seen as far better than them rightly ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beaver_Tuxedo",
            "body": "Ironman and cap are grounded characters. You don’t have to take a huge leap to believe their story lines. The government making super soldiers isn’t too far fetched. A billionaire creating a super powerful suit isn’t too far fetched. But a sorcerer with magic powers that protects time? That’s fantasy land stuff.",
            "score": 1,
            "replies": [
                {
                    "author": "PersonalRaccoon1234",
                    "body": "How many billionaires are flying around with supersuits?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Beaver_Tuxedo",
                            "body": "None, but it’s not a huge stretch of the imagination to think it’s possible. We also don’t have genetically modified super soldiers if you hadn’t noticed",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PTAndersonFan14",
            "body": "Lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fortyseven",
            "body": "Was he not?",
            "score": 1,
            "replies": []
        },
        {
            "author": "DarceTap",
            "body": "Respectfully disagree\n\nHis character always seemed to be just just saying the lines or going completely the other way and being overly dramatic.\n\nMy opinion is that this guy never really dialed in a good Dr. Strange.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Captain-cootchie",
            "body": "Dr. Orpheus? I agree, the order of the triad deserves more respect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iamnj-zx",
            "body": "Dr.Strange is ❤️‍🔥 also Benedict 🤌",
            "score": 1,
            "replies": []
        },
        {
            "author": "NightmareDJK",
            "body": "He is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Matsuze",
            "body": "On the same level as them? But why? They are iconic because they founded the MCU. What did the character Dr Strange or his independent movies contribute to the MCU?   \nWanting Strange to be on the same level as Iron Man or Cap, or wanting Benedict on the same level as RDJ or Chris is just a fundamental misunderstanding of what makes those characters and actors so special.",
            "score": 1,
            "replies": []
        },
        {
            "author": "madson_sweet",
            "body": "Marvel had Black Panther, Spider-Man, Captain Marvel and Doctor Strange to replace Steve and Tony as the leading face of the MCU and all found some problem (mostly poorly preparation), but yes, he should",
            "score": 1,
            "replies": []
        },
        {
            "author": "iin10ded",
            "body": "except that both of his movies have been crap",
            "score": 1,
            "replies": []
        },
        {
            "author": "sleepingchair",
            "body": "Nah, Hugh Laurie would have been a better Dr. Strange, but he was too old. Now we get Cumberbatch trying to use House's American accent instead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "renntier2k",
            "body": "Absolutely. Benedict Cumberbatch is generally a really great actor. And he once even played a dragon...",
            "score": 1,
            "replies": []
        },
        {
            "author": "deadkoolx",
            "body": "I would put Chadwick Boseman / Black Panther ahead of Benedict Cumberbatch / Dr Strange, but yes, he clearly made an impact with his performance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Knoy120",
            "body": "Same for paul rudds ant man in my opinion. He obviously didnt fit for hank pym but he plays the best scott lang i could hope for",
            "score": 1,
            "replies": []
        },
        {
            "author": "bateen618",
            "body": "Benedict Cumberbatch is on the same level as William Defoe and JK Simmons. They always bring their A game to everything they do no matter what",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grayx_2887",
            "body": "Yeah. 😞",
            "score": 1,
            "replies": []
        },
        {
            "author": "poopoobuttholes",
            "body": "I will always love this guy. The amount of torture he put himself through for the sake of the world, we will never be able to comprehend. It's a miracle he hasn't snapped and turned into a villain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alternative_Device71",
            "body": "Blame the writers for how badly he’s been treated",
            "score": 1,
            "replies": []
        },
        {
            "author": "AshMCM_Games",
            "body": "I think he is..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vaportrail",
            "body": "He doesn't have a weight lifting scene.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xxlordxx686",
            "body": "TBH he is, I couldn't imagine anyone else playing Dr. Strange",
            "score": 1,
            "replies": []
        },
        {
            "author": "turboiv",
            "body": "I have disliked him since frame 1. I could never root for such an egotistical prick. At least Tony had charm. Strange just insists he's right and that's it. No more discussion.",
            "score": 1,
            "replies": [
                {
                    "author": "Sad_Dig_2623",
                    "body": "Fair. Comic wise that’s the character. He nails it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bakedpotato_21",
            "body": "The only reason I watch Marvel movies is because of him. If there's no Dr. Strange in the movie...then I know it'll be trash.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit-Entrepreneur6538",
            "body": "He would if he was around more",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded-Area863",
            "body": "Sadly they didn’t give him much attention",
            "score": 1,
            "replies": []
        },
        {
            "author": "DarkShadowZX",
            "body": "In a perfect world, he should have been. But he hasn’t been given the same amount of respect (narratively and writing-quality-wise) from the studio that they gave to Iron Man and Cap. \n\nI get the feeling that Benedict Cumberbatch himself is kinda getting annoyed with what they’ve been doing to his character, but he’s too polite to ever openly say that in an interview or something. \n\nIn a perfect world Strange would be the wise leader of the mystical side of things and Black Panther would be the heart of the Earth-bound side of things like Steven Rogers was. But things don’t always go to plan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoatDifferent1294",
            "body": "How is he not? Especially his relatively smaller amount of total screen time?",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaftXman",
            "body": "Agreed!",
            "score": 1,
            "replies": []
        },
        {
            "author": "oharan124",
            "body": "I would argue that he should be seen on a higher level than RDJ and Chris Evans for the role of Doctor Strange. They’ve never even played Doctor Strange before.",
            "score": 1,
            "replies": []
        },
        {
            "author": "magvadis",
            "body": "They can't bother to give him a good script sadly. dS1 was about as good as we are getting. In the teamups they insist on him being dumb and MoM was awful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KB_Sez",
            "body": "Absolutely",
            "score": 1,
            "replies": []
        },
        {
            "author": "Swimming-Young-26",
            "body": "I think it’s just the fact that Strange isn’t a bigger character for the fanbase like Cap & Tin-man. They wasted his character, after watching MoM, I still liked the character but I almost wept seeing how weak they made him, he’s used as a cameo which is pretty sad but I’d say Mark deserved it more but unfortunately the character was never taken as a joke, not after The Avengers 1.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dibbiluncan",
            "body": "1.) His sequel didn’t land like it needed to. \n\n2.) He’s just not as charismatic or likable as Iron Man or Cap. Nothing against Benedict Cumberbatch, it’s just the character’s personality. He does an amazing job in the role, but it’s not as funny/inspiring of a role. ",
            "score": 0,
            "replies": [
                {
                    "author": "Leaflyy",
                    "body": "This. Iron Man is a charismatic asshole. Dr. Strange is a serious asshole. Hard for the audience to relate to the latter.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DifficultMind5950",
                            "body": "Very this. Hence JK simons is also popular and memeable.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BenCisco",
            "body": "Agreed!! ",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooSongs4451",
            "body": "I don’t think Chris Evans would make a very good Doctor Strange.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stamboolie",
            "body": "I was never a big fan of doctor strange when I was a kid, thought it was unbelievable but he really made the character real. This https://youtu.be/sXN9IHrnVVU shows what an awesome actor he is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "__XBlaze__",
            "body": "It's hard for me not to imagine Benedict as Dr Strange now. He fits the character so well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Minamischler",
            "body": "He is ppl just don't relize it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Murder_Hour",
            "body": "Is he not?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Meizas",
            "body": "He, Ant-Man, and Daredevil should be the new Big three",
            "score": 1,
            "replies": []
        },
        {
            "author": "SorryIreddit",
            "body": "He’s fantastic. Love him as Dr Strange. He just doesn’t have the natural charisma. Not his fault",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoirSon",
            "body": "You are not wrong but I am not sure if he wants that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Iocnar",
            "body": "People think Chris Evans was well cast? He maybe plays him well enough I guess but he's far too ugly. Even The Beyonder chose Steve Rogers to copy his exact appearance as the perfect human image.",
            "score": 1,
            "replies": []
        },
        {
            "author": "juanjose83",
            "body": "If he was, you wouldn't need to make a post about it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "princewinter",
            "body": "Isn't it personal preference? I can't stand the guy, so he didn't make me enjoy the character as much as I wanted to. And that's fine.\n\nEveryone has their own likes and dislikes for actors.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Jade_Bennet",
            "body": "After MoM I’ve lost all faith in this man.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Icy_Okra_5677",
            "body": "Benedict Wong is clearing his throat",
            "score": -1,
            "replies": []
        },
        {
            "author": "Calm-Glove3141",
            "body": "Mcu is trash and has been since iron man 1",
            "score": -2,
            "replies": []
        },
        {
            "author": "Blammo32",
            "body": "Why? For doing a RDJ impersonation?",
            "score": -8,
            "replies": []
        },
        {
            "author": "baiacool",
            "body": "Love Benedict, but I'm still sad that Joaquin Phoenix didn't get the role, I think he would've done an AMAZING job.",
            "score": -3,
            "replies": []
        },
        {
            "author": "Least-Ad5986",
            "body": "He had a great start the first Doctor Strange was a great movie one the best in the all Mcu but then came the horrible  woke Doctor Strange 2 and ruined everything followed by a meh Spiderman movie",
            "score": -34,
            "replies": [
                {
                    "author": "dmoney5101",
                    "body": "How....how exactly was it \"woke\"? Lol.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "ThatsTheName",
                            "body": "Probably because America Chavez is a Mexican American woman. Dude’s a fool, ignore.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "OldSixie",
                                    "body": "... born to two gay mums from outer space.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Least-Ad5986",
                            "body": "There is an all video on it of how this was woke crap it ruin Doctor Strange and Wanda at the same time.   \n[https://www.youtube.com/watch?v=dHa9J5RL51g&t=6020s](https://www.youtube.com/watch?v=dHa9J5RL51g&t=6020s)",
                            "score": -26,
                            "replies": [
                                {
                                    "author": "FA-Cube-Itch",
                                    "body": "Someone made a video saying it so it must be true!",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "dmoney5101",
                                    "body": "Not gonna watch that. You tell me, rather than regurgitating someone else's words.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "FA-Cube-Itch",
                                            "body": "I’m not sure he could form a coherent sentence, let alone have independent thought.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Least-Ad5986",
                                            "body": "I just remembered  more details about this horrible movie. how about the complete humiliations of Reed Richards (The smartest man in the universe), Charles Xavier and The Guy with the sound. They all died by Wanda hand in the most humiliatingly and stupid way but they are man in a woke movie so that make sense. How about replacing Steve Rogers with Agent Carter another woke move  (I don't care about Captain Marvel change they are both horrible ).  Not to mention America Chavez two lesbian moms which is completely not woke :)",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "OwnPack431",
                                                    "body": "Clown",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Least-Ad5986",
                                                            "body": "Snowflake",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Least-Ad5986",
                                            "body": "He just gives more detail than I can give you.  It is enough that America Shavaz was given birth by two lesbian woman and I know this is a woke crap movie",
                                            "score": -7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "redmerchant9",
                                    "body": "Of course it's a Mauler video. You do realize that grifters like Mauler make money by rage baiting and calling everything woke, right?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Least-Ad5986",
                                            "body": "Everything in the new MSheU is woke yes starting with Captain Marvel",
                                            "score": -8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "NateDawg80s",
                                    "body": "Maybe watch it and form your own opinion, lol?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Least-Ad5986",
                                            "body": "I don't need watch it after I was explained what is the plot like the memory store or horrible characters like America Chavaz. the complete humiliations of doctor strange",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "NateDawg80s",
                                                    "body": "Tell your friends' parents you were allergic to broccoli, too, lol?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}