{
    "title": "The writer's barely disguised fetish: Sue Storm threatening to do something very illegal to teenagers [Marvel Knights 4 #2]",
    "author": "AporiaParadox",
    "subreddit": "Marvel",
    "rank": 5,
    "score": 376,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 86,
    "url": "https://i.redd.it/4pk8il4yigpe1.jpeg",
    "id": "1je63il",
    "selftext": "",
    "comments": [
        {
            "author": "AporiaParadox",
            "body": "By the same guy who gave us Riverdale, by the way.",
            "score": 327,
            "replies": [
                {
                    "author": "Queen_of_Gremlins",
                    "body": "Christ that…that makes it so much worse.",
                    "score": 105,
                    "replies": [
                        {
                            "author": "LoveAndViscera",
                            "body": "Insta-theory…\n\nThis writer is gay. Maybe he sees the power dynamics in hetero relationships as inherently predatory.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "dread_pirate_robin",
                                    "body": "Gay or not it feels like the problem with the scene is it's overtly predatory threat that doesn't feel like it's being acknowledged as predatory, the idea of stripping teenagers isn't introduced as a satire of toxic heteronormative power dynamics (and if it were it probably would be done with a more toxic character than Sue). It's just talked about like a rudimentary embarrassment.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "LoveAndViscera",
                                            "body": "I got villain vibes off the panel. I would have to read the rest to know if it wasn’t acknowledged.\n\nBut if you believed something was inherently predatory, you would write as predatory without necessarily acknowledging that aspect of it. So, it may be less the author’s thinly veiled fetish and more the author’s unconscious biases.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "dread_pirate_robin",
                                                    "body": "I don't necessarily think it's the author's thinly veiled fetish so much as them not thinking through all the implications they maybe should.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Grayx_2887",
                    "body": "That one CW show?!🤢🤢🤢🤢🤮🤮🤮🤮",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Competitive_Rule_395",
                    "body": "Was it mark millar?",
                    "score": 24,
                    "replies": [
                        {
                            "author": "InfiniteSpaceExpanse",
                            "body": "Nah [Roberto Aguirre-Sacasa](https://en.wikipedia.org/wiki/Roberto_Aguirre-Sacasa)",
                            "score": 66,
                            "replies": [
                                {
                                    "author": "The_Dark_Soldier",
                                    "body": "He’s even worse!",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "Competitive_Rule_395",
                                    "body": "Oh my bad because this feel like it was written by him ",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "Juliiju04",
                                            "body": "It's probablly because its the same artist from Civil War and Millar did write some Civil War",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Juliiju04",
                                                    "body": "did write some Fantastic Four\\*",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mhfarrelly25",
            "body": "The whole FF knights run with its “mature” themes was an *interesting* choice…the main title was far superior.",
            "score": 158,
            "replies": [
                {
                    "author": "AporiaParadox",
                    "body": "Not to mention it was the title that did Bill Jemas' dumb idea he fired (and then unfired) Mark Waid for not wanting to do in the main title.\n\n>A few weeks ago, Bill \\[Jemas\\] phoned and tried to convince me to jettison our high-adventure approach and everything else we've been doing in favor of making the FF a wacky suburban dramedy where Reed's a nutty professor who creates amazing but impractical inventions, Sue's the office-temp breadwinner, the cranky neighbor is their new 'arch-enemy,' etc.\"\n\nSo in this book suddenly Reed loses all of his money because reasons and the FF all have to get \"real\" jobs like substitute teacher or construction worker even though Reed should easily be able to invent something that makes millions in his sleep and the rest of the FF are celebrities who could easily get a high-paying job in anything if they tried.",
                    "score": 96,
                    "replies": [
                        {
                            "author": "Triseult",
                            "body": "To be fair, Ryan North had Thing and Johnny Storm get a regular job in his current FF run and it was really great.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Eternalm8",
                                    "body": "It was really great, and part of what made it so great was them acknowledging that they didn't HAVE to get jobs.\n\n  \nCan't speak to whatever this is that we're talking about, because I haven't read it.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "glglglglgl",
                                            "body": "The \"didn't have to\" is because Alicia is supporting them from her sculpture, and Ben's Aunt has lent them a farmhouse, so they're still without their own funding more or less.\n\n\nThe argument is that NYC has liens (?) on their income so all the money is frozen.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Zyconis",
                                    "body": "That's because Ryan North is a fantastic writer!",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Apart_Tip776",
                                            "body": "Yeah a good example of how it's not always the idea that matters but who's writing it.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tourniquet2099",
                            "body": "Man, i forgot all about that drama. I was reading the book when it came out and it was bonkers. Waid’s run was the best the book had been in over a decade and Jemas was high on his ego & thought he knew better.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "cyberpunk_werewolf",
                                    "body": "Jemas had no idea what he was doing.  Remember how he got into a fight with Peter David and it led to the creation of Marville, one of the worst comics ever made?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Jay_R_Kay",
                            "body": "Yeah, there's definitely a lot of dumb things to get the plot going and that moment is...unfortunate, but they're was some great moments in that run.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Quomii",
            "body": "This doesn’t seem like something the Sue Storm I knew growing up would do",
            "score": 51,
            "replies": [
                {
                    "author": "SpaceShipwreck",
                    "body": "Maybe Malice got the teaching job instead...",
                    "score": 29,
                    "replies": [
                        {
                            "author": "DisposableSaviour",
                            "body": "Same. Sue wouldn’t act like this, but Malice possessed Sue? Would have worn a deeper V-neck than that sweater.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Otherwise_Arrival_47",
                    "body": "True.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Relevant_Scallion_38",
            "body": "First time I actually paid attention to the students. But why are the female students drawn legs spread out or straddling their chairs like that , especially with skirts.",
            "score": 131,
            "replies": [
                {
                    "author": "curious_dead",
                    "body": "...the artist's barely disguised fetish?",
                    "score": 124,
                    "replies": []
                },
                {
                    "author": "frozen_scv",
                    "body": "In one of the panels they're actively being lifted off the ground so likely grabbing the seat for dear life so they don't fall over. After that panel, your guess is as good as mine.",
                    "score": 53,
                    "replies": []
                },
                {
                    "author": "Plebe-Uchiha",
                    "body": "I always thought that it was to highlight how uncomfortable they get after Sue shares her powers. They cross their legs afterwards. Could've been shown a different way though [+]",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Antonater",
                    "body": "The comic is written by Roberto Aguirre Sacasa. What did you expect? This is the same guy who wrote Riverdale (TV show)",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "didthathurtalot",
                    "body": "It's not just that, you never see camera angles with only that characters ass in view unless it's a woman",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "curious_dead",
            "body": "You either die a hero or live long enough to become a ~~villain~~sexual predator.",
            "score": 68,
            "replies": []
        },
        {
            "author": "addage-",
            "body": "Weird that someone with her power set is working as a teacher",
            "score": 26,
            "replies": [
                {
                    "author": "AporiaParadox",
                    "body": "It was an editorial mandate that the FF had to get \"real\" jobs in this series because they'd lost all their money due to plot, logic be damned.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "addage-",
                            "body": "Thanks for the context, think there would be well paying private industry work for someone who can create force fields and make items transparent at will. \n\nEditors just wanted her in sexy teacher mode.",
                            "score": 21,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Otherwise_Arrival_47",
                    "body": "I mean Emma Frost was a teacher and she is way worst. Sue is natural genius but thus panel really doesn't do much to her character.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "peppermintvalet",
                            "body": "I mean being a natural genius has nothing to do with whether you're a good teacher or not",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "The_Asshole_Judge",
            "body": "She is playing with fire.  She has been arrested for this before.\n\nhttps://www.reddit.com/r/Marvel/s/8XhiZ3sbg4",
            "score": 19,
            "replies": [
                {
                    "author": "ThomasSirveaux",
                    "body": "Why is everyone in that comic Slenderman",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "LaylaLegion",
            "body": "Someone in the back: “If you can turn others invisible, why don’t you turn Namor invisible so Reed doesn’t catch you having sex with him?”\n\nSue: “Namor, leave the class.”\n\nNamor: *sadly stands up and leaves*",
            "score": 80,
            "replies": [
                {
                    "author": "DisposableSaviour",
                    "body": ">Someone in the back: “If you can turn others invisible, why don’t you turn Namor invisible so Reed doesn’t catch you having sex with him?”\n\n>Sue: “Namor, ~~leave the class~~ put on a shirt.”\n\n>Namor: sadly stands up and leaves\n\nFTFY",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Lucicactus",
                    "body": "LMAO",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "SneakyKain",
            "body": "Why does Marvel always draw these heroes dressed as super sexy when they're teaching kids??  \n\nGod damn it, those poor young Mutants at Xavier's or even Emma's school.... you'd think half the class's secondary mutation was 24/7 erections.",
            "score": 12,
            "replies": []
        },
        {
            "author": "HappyHappyJoyJoyJoy6",
            "body": "did they accidentally hire a porn writer again",
            "score": 12,
            "replies": []
        },
        {
            "author": "Nightingdale099",
            "body": "Wouldn't it be a felony for her ?",
            "score": 24,
            "replies": [
                {
                    "author": "AporiaParadox",
                    "body": "Yes, yes it would.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Nightingdale099",
                            "body": "I wanna say why would she threatened to send herself to jail but this guy also wrote about teens doing cheerleading for no reason. Didn't even understand what cheerleading is.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Frankenpresley",
            "body": "That’s some shitty, exploitative work there.",
            "score": 31,
            "replies": [
                {
                    "author": "Major-Safe-9736",
                    "body": "Seriously. What even the fuck is Marvel these days?",
                    "score": -7,
                    "replies": [
                        {
                            "author": "Stars_And_Garters",
                            "body": "The comics have plenty of issues in 2025, but this comic is 20 years old near the peak of Marvel's edge lord phase imo.",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "Victor_Von_Doom65",
                            "body": "“These days” sir, this comic is two decades old.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Major-Safe-9736",
                                    "body": "Apologies. I'm a stuck in my ways 90s reader.\nI still pick up the odd collection, but my days of following monthlies are long gone.\nI am showing my age a lot. I just don't recognise the books anymore.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Girl-UnSure",
            "body": "What porn actress was “traced” for that one particular frame?",
            "score": 13,
            "replies": [
                {
                    "author": "Agraxor",
                    "body": "Looks like Fuukadoll",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "iheartdev247",
            "body": "So edgy",
            "score": 5,
            "replies": []
        },
        {
            "author": "Patient-Reality-8965",
            "body": ".....\n\n.........\n\n..............\n\nSusan. 😐",
            "score": 3,
            "replies": []
        },
        {
            "author": "BigBeeff_21",
            "body": "That's kinda gross",
            "score": 7,
            "replies": []
        },
        {
            "author": "DJfunkyPuddle",
            "body": "Also, schoolgirl wearing a skirt with her legs wide, ugh.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Blainedecent",
            "body": "How did Emma Frost get Sue Storm's powers?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Chemistry11",
            "body": "Yeah… I wasn’t interpreting any of that here.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bloo_overbeck",
            "body": "They weren’t even oogling her or anything. Completely unprovoked. Wtf",
            "score": 2,
            "replies": []
        },
        {
            "author": "SuperArppis",
            "body": "I'm all for sexyness in comics, but please leave underaged people out of it.",
            "score": 6,
            "replies": [
                {
                    "author": "TopRule8217",
                    "body": "***Please...***",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Cardinal_and_Plum",
                    "body": "As long as we can acknowledge underage people aren't sexless. I hated when I was a teenager seeing the vast majority of teenage characters act like a sanitized version of a real teenager. They curse, they have sex, they might drink or do drugs, and not every single one of them that does those things is an outsider or burn out. I agree they shouldn't be sexualized, but let's not pretend they're something they aren't or these kinds of stories won't connect with them. Runaways was such a breath of fresh air when I started reading it in high school, because to me they felt like actual kids. They definitely never played up the sexual stuff much but it was also obvious it was there (even moreso in the show) and a part of their lives. Their language sounded real to me too.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "SuperArppis",
                            "body": "Yeah sure. \n\nI don't mean it like that. But there are certain lines not to be crossed.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Cardinal_and_Plum",
                                    "body": "Wasn't sure how you meant it, but I know there are people out there that never want to see or hear anything about the fact that underage people have sex and would prefer it never ever be a topic for any story, which I have always viewed as a flawed take. If you just mean strict sexualization for the sake of it (like what's happening in the above image), then I agree.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ryp69",
            "body": "What is the mark on the chalkboard? :/",
            "score": 1,
            "replies": [
                {
                    "author": "AporiaParadox",
                    "body": "A spitball.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "esar24",
            "body": "I'm surprise this isn't ultimate",
            "score": 1,
            "replies": []
        },
        {
            "author": "blackbutterfree",
            "body": "How is this a fetish? She's threatening them with humiliation in front of their peers if they fuck with her. An adult clearly knows she cannot and would not do that, but a teenager? She just put the fear of God into them and ensured that her classroom will be quiet for the semester.",
            "score": 0,
            "replies": [
                {
                    "author": "Cardinal_and_Plum",
                    "body": "That doesn't make it permissible. Telling some kid he better shut up or you'll slit his throat would accomplish the same thing, but obviously that wouldn't be okay. I don't see how this is much different.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "blackbutterfree",
                            "body": "I'm not saying it's permissible, I'm saying it's not a sexual thing like OP is trying to claim.",
                            "score": -4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Razzazz123",
            "body": "Tbf this is a brilliant threat for teenagers",
            "score": -25,
            "replies": [
                {
                    "author": "AporiaParadox",
                    "body": "Maybe if you want the FBI knocking at your door.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "Tuffsmurf",
                    "body": "As an actual teacher this is highly inappropriate and would result in discipline of some nature.",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "Razzazz123",
                    "body": "Just to clarify it still doesn't warrant this behaviour",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "nerdwerds",
            "body": "I read that as she’s lying. She’s scaring the students into obeying, not threatening them with something she can actually do.",
            "score": -4,
            "replies": [
                {
                    "author": "AporiaParadox",
                    "body": "That's still illegal.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "nerdwerds",
                            "body": "Okay, so is fighting crime.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "IStanForRhys",
                                    "body": "Not comparable. She's not serious, but it's still a really creepy threat. Why would she think of threatening to strip a bunch of minors naked in front of each other as a form of punishment? There are a million other things she could threaten them to behave with.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "nerdwerds",
                                            "body": "What is even the context of this issue? I’m not a FF fan so I don’t get why she’d even be in this role as a teacher.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "IStanForRhys",
                                                    "body": "I haven't read this myself, but based on what I could gather from the comments above, the FF went broke (reused plot, I liked it better when they made a movie to get their money back lmao), so they had to get 'regular person' jobs.   \n  \nBut yeah this scene is really off-putting to me. Luckily it's not in the main title.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}