{
    "title": "[TVA #4.] \"No matter what she's done no one deserves this\" I love my girl but Wanda absolutely deserved this.",
    "author": "ZsforZedd",
    "subreddit": "Marvel",
    "rank": 14,
    "score": 83,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/gallery/1je8cu9",
    "id": "1je8cu9",
    "selftext": "",
    "comments": [
        {
            "author": "SorcererSupremPizza",
            "body": "She killed a lot of people, enslaved a whole town to her bidding, and tried to kill a child",
            "score": 79,
            "replies": [
                {
                    "author": "thatonefatefan",
                    "body": "I remember when people argued no matter how bad what she did in wandavision was, she shouldn't be sent to the raft because the treatment there is inhumane so she was justified in escaping\n\nMeanwhile- Thaddeus thunderGOAT Ross",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Night_Inspector",
                            "body": "Also, if she was “possessed by the Darkhold” as some people claim, she’d still need to be imprisoned or killed to prevent it from bringing back Cthon.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nightwing_of_Asgard",
                    "body": "It's not the same Wanda from the mcu, as confirmed by the writers",
                    "score": 7,
                    "replies": [
                        {
                            "author": "thatonefatefan",
                            "body": "Sure, but she clearly did the same things up to her \"death\" in MOM based even on these pages alone",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "justhereforthem3mes1",
                    "body": "She's adopted",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RubiconPizzaDelivery",
                    "body": "Can't wait to see the part where Wolverine gladly tries to cut Wiccan's head off.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JamesPlayzReviews3",
                    "body": "Two of those were under the control of the Darkhold and the third one is because she couldn't control her powers while going through grief so that one ain't her fault.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Friendly_Duty_3540",
            "body": "Why do they keep justifying this. Wanda is tragic but she absolutely did go down a villain route. She took a town hostage, murdered a million sorcerers, and went into another dimension taking a body hostage and killing others in it. She deserves to go into a mental institution under heavy guard and watch\n\nNo it’s not the same Wanda but this absolutely is a reference to mcu Wanda",
            "score": 41,
            "replies": []
        },
        {
            "author": "Quirky_Ad_5420",
            "body": "The punishment fit the crime Gwen don’t question it",
            "score": 15,
            "replies": []
        },
        {
            "author": "baiacool",
            "body": "What comic is this? Is that Wanda from the MCU? I'm so confused.",
            "score": 2,
            "replies": [
                {
                    "author": "Hobbies-memes",
                    "body": "It’s an mcu tie in comic but also not canon to the mcu. Because no other character deserves a mini over this shit.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "baiacool",
                            "body": "so basically they want the backstory of the MCU without directly affecting the MCU, got it.\n\nis it worth the read? it piqued my curiosity",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Hobbies-memes",
                                    "body": "No",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nightwing_of_Asgard",
            "body": "This is not the same Wanda from the MCU",
            "score": 3,
            "replies": [
                {
                    "author": "Enough_Forever319",
                    "body": "How?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Nightwing_of_Asgard",
                            "body": "The writers confirmed it, it's a different Wanda from the multiverse",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "mdavis360",
                                    "body": "While true-the exact same events as the MCU occurred for her.  So it’s basically exactly the same as the MCU up until the end of MoM.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Powerofx1",
                                            "body": "I think feige will be ultimately the one choosier that. Not being canon might change in some point.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wonderful_Silver",
            "body": "Ugh",
            "score": 1,
            "replies": []
        },
        {
            "author": "sokuzekuu",
            "body": "How does Gwen know about fridging? Does she read DC?",
            "score": 1,
            "replies": [
                {
                    "author": "mdm168",
                    "body": "Icy what you did there",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ant-Man2099",
            "body": "But they all treat punisher like he’s a monster",
            "score": -2,
            "replies": []
        }
    ]
}