{
    "title": "Hot Take: Thor Looks Better with Shorter Hair",
    "author": "Lil_Critter_2001_",
    "subreddit": "Marvel",
    "rank": 6,
    "score": 69,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 26,
    "url": "https://i.redd.it/t8fqr7oj1jpe1.jpeg",
    "id": "1jeiaf8",
    "selftext": "I know this might get some people angry and not happy with me, but honestly, I think Thor looks way better with shorter hair than longer hair. \n\nLong hair Thor is cool and all, but short hair just suits him more in my opinion. I think with shorter hair, Thor looks more mature, put together, clean, stronger, sharper, and less reckless than in the earlier movies. I feel like the longer hair on him looks kind of off (like it doesn’t fit the shape of his face and head). I also think that the short hair is more practical for someone in battle.\n\nI know in the original Norse mythology Thor has long hair and that how he is depicted in the comics, but I think the shorter hair on him looks better and I think Marvel should have kept the look moving forward. \n",
    "comments": [
        {
            "author": "stonerpunk77",
            "body": "Actually it just sounds like you like how Chris Hemsworth looks with that hairstyle not the character themselves",
            "score": 61,
            "replies": [
                {
                    "author": "Lakiel03",
                    "body": "he also looks better in comics.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "thedean246",
                    "body": "This was my exact thought after reading the title. lol.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ttvfortnitesweat",
            "body": "You mean Chris Hemsworth looks better with short hair",
            "score": 25,
            "replies": []
        },
        {
            "author": "GRL00",
            "body": "I think Thor as a character has to have long hair, it’s his iconic look along with his helmet, Chris Hemsworth could pull off any haircut for Thor. \n\nThor = Long Hair / \nChris = Any Hair",
            "score": 10,
            "replies": []
        },
        {
            "author": "zef-toxin",
            "body": "I don’t think this is a hot take. I like Thor with short hair too.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Zmrdizhor",
            "body": "Looks cool, but not like Thor tho. Just Chris Hemsworth.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ACodAmongstMen",
            "body": "I really prefer a more modern Thor, like as good as he is with his asgardian speech, I prefer it when he has an American accent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Environmental_Day928",
            "body": "Yes. And Captain America looked better with a beard. The two of them should have stood in battle with Iron Man as a trio of three bearded Badasses who are each a different kind of manly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoNotGoSilently",
            "body": "If you look up his Unworthy Thor design from the comics it’s my favorite look for the character.",
            "score": 3,
            "replies": []
        },
        {
            "author": "xolotlceleste",
            "body": "honestly I agree!! i think the short hair really fits mcu’s thor specifically",
            "score": 2,
            "replies": []
        },
        {
            "author": "JaxZeus",
            "body": "Yea Chris in this movie was hot af",
            "score": 1,
            "replies": []
        },
        {
            "author": "IsraeliChick",
            "body": "Thor in Thor 1 will always be unbeatable, even if it wasn’t the right haircut for Chris, just the way he looked and acted felt like the best for the character at that point in time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sku11bruh",
            "body": "I disagree and I’m not mad, I respect your opinion",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unlucky_Arrival4175",
            "body": "Things change",
            "score": 1,
            "replies": []
        },
        {
            "author": "weaverider",
            "body": "Sorry, I need the long hair. He feels like Thor with long hair. Loki can have shorter hair, but not Thor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PokeVitinho",
            "body": "I cant even respect men with long hair...",
            "score": 1,
            "replies": []
        },
        {
            "author": "N7_Pathfind3R",
            "body": "No. You just like Chris Hemsworth with short hair.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DisasterBeMyMaster",
            "body": "That take is ice fucking cold.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SamuraiUX",
            "body": "Minor correction: Chris Hemsworth looks better with shorter hair.  I don't know if it's very Thor-y of him, or if Thor looks better with shorter hair, but it's more complimentary to him as portrayed by the actor, yes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BackgroundAsk1623",
            "body": "Literally me and every single friend of mine agree with you, his hair was so much cooler looking when it was shorter, and I also preferred when he only had one eye. Short haired one eye stormbreaker thor would be the coolest thing marvel could ever do with thor",
            "score": 1,
            "replies": []
        },
        {
            "author": "DrDreidel82",
            "body": "It’s Chris Hemsworth he’d look good with Marge Simspon’s hair",
            "score": 1,
            "replies": []
        },
        {
            "author": "Burner_Cuz",
            "body": "Weird that’s what my wife said…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prettywitchboy",
            "body": "I feel the same about Aquaman lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "TwoGimpyFeet69",
            "body": "But only when St' An Nlee  cuts it",
            "score": 1,
            "replies": [
                {
                    "author": "LaBamba338",
                    "body": "Did you have a stroke typing Stan Lee or is there a joke that went my head (nothing goes over my head, my reflexes are too quick)",
                    "score": -1,
                    "replies": []
                }
            ]
        }
    ]
}