{
    "title": "Ephey becomes the ambassador of Team Spirit",
    "author": "noproblemCZ",
    "subreddit": "DotA2",
    "rank": 0,
    "score": 648,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 131,
    "url": "https://i.redd.it/639wuwdvhgpe1.png",
    "id": "1je5xmf",
    "selftext": "",
    "comments": [
        {
            "author": "g13n4",
            "body": "When you want Mira back but didn't specify which one",
            "score": 673,
            "replies": [
                {
                    "author": "armandocalvinisius",
                    "body": "This Mira also pos 4!!",
                    "score": 151,
                    "replies": [
                        {
                            "author": "jerryfrz",
                            "body": "Imagine if rue has visa problem for a tournament then Ephey gets subbed in lol",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "dotesdoto",
                                    "body": "Imagine if mira has visa problems for a tournament then rubick gets subbed in lol",
                                    "score": -3,
                                    "replies": []
                                },
                                {
                                    "author": "CALM_Oxygen",
                                    "body": "Imagine if Ephey has visa problem for a tournament then mira gets subbed in lol",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Morgn_Ladimore",
            "body": "I remember when they were selling voice packs, and Ephey's voice lines sold like fucking crack. She made a good buck from that.\n\nSo yeah, smart decision to have her allied to your brand.",
            "score": 104,
            "replies": [
                {
                    "author": "Jacmert",
                    "body": "Heheheh, sorry!",
                    "score": 35,
                    "replies": [
                        {
                            "author": "cob33f",
                            "body": "Uh oh, that may have been a mistake!",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jesuschristk8",
                    "body": "Player/talent voicelines are EASILY my favourite mtx in dota personally\n\nI don't have any Ephey lines, but my favs are:\n\nSheepo: \"Who do you think you are I AM\"\n\nNattea: \"ohhh I'm gonna make a name for myself here\"\n\nSVG: \"What the hell are we doing here?\"",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Zack_of_Steel",
                            "body": "I love the ones that I know I hate to hear as an opponent. One I have never heard anyone but me use is the MLP, \"HAHAHAHAHA, we don't care! We don't care!\" \n\nAnd then of course the couple Slacks ones \"GOD GAMER ALERT\" and \"YEEEEEEEHAW THAT'S A DOTA PLAY RIGHT THERE\"",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Present-Excuse-5180",
                    "body": "Out of all the female casters she's definitely top 2 but the fake voice she puts on doesn't do it for me absolutely gorgeous lady though",
                    "score": -81,
                    "replies": [
                        {
                            "author": "GraDoN",
                            "body": "yikes...",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "Present-Excuse-5180",
                                    "body": "I knew it'll get down voted but the inauthenticity is a deal breaker :)",
                                    "score": -42,
                                    "replies": [
                                        {
                                            "author": "HyalinSilkie",
                                            "body": "Let me give you a hint: it wasn't about the inauthenticity...",
                                            "score": 26,
                                            "replies": []
                                        },
                                        {
                                            "author": "GraDoN",
                                            "body": "Damn, you lack self awareness too...",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "author": "Present-Excuse-5180",
                                                    "body": "So no logical points except just insults ? Got it :)",
                                                    "score": -19,
                                                    "replies": [
                                                        {
                                                            "author": "GraDoN",
                                                            "body": "Not an insult, just an observation :)",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "author": "Present-Excuse-5180",
                                                                    "body": "I made an observation too :) might be unpopular but doesn't make it untrue",
                                                                    "score": -5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "l3ninsw3ak3sts0ldier",
                                                                            "body": "The reason it's untrue is because she doesn't fake her voice, she actually sounds like that all the time",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HyalinSilkie",
                                                                                    "body": "Also, the downvotes aren't because of his complaints about Ephey either. lol",
                                                                                    "score": 5,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Zack_of_Steel",
                                                                            "body": "Since you're so obviously socially stunted and you don't understand the 4 people laughing at your level of cringe and need it spelled out for you:\n\nWhen you comment on someone's appearance like that, especially after saying something insulting, it's immeasurably cringe. And then to follow it up with...all those other comments...lol. Like the \"dealbreaker\" comment insinuates that you would somehow have a shot with her and that you're above her and would turn her down. The subtext might make you feel superior, but it just makes you look like a clown.\n\n\n:)",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Present-Excuse-5180",
                                                                                    "body": "Yikes.. why don't you tell us what you really think",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Zack_of_Steel",
                                                                                            "body": "\"guRbA HurBA DurrRR\"- Clown",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "gandolphus_pfiffikus",
                            "body": "it's been 4 years now and some dense fellas still believe she fakes her voice just cause it's rather high-pitched... can't make that shit up",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "wutfacer",
                                    "body": "The lilypichu effect",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Present-Excuse-5180",
                                    "body": "Sure buddy :) listen to her when she speaks Arabic the affectation is gone it only appears during English \nIt's not her voice if the affectation disappears once the language changes which is in essence putting on an accent or voice :) I can't be the only one who sees it man\nShe speaks like that at home at her dinner with family and childhood friends like that ?",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "Super-Implement9444",
                                            "body": "Maybe that's just the way she speaks English? There is such a thing as accents lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "peternickelpoopeater",
                            "body": "treading so lightly that you could walk on water lol",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Present-Excuse-5180",
                                    "body": "Clearly not xd",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "girls_im_a_WO2",
            "body": "mira joins team spirit: :-)  \nmira joins team spirit: :-(",
            "score": 222,
            "replies": []
        },
        {
            "author": "Fun_Plankton_7793",
            "body": "They replaced mira with mira.",
            "score": 22,
            "replies": []
        },
        {
            "author": "srirachatoilet",
            "body": "First they kick yatoro and got this other dude named raddan and now another mira?\n\nEven Torontotokyo got removed and might add another dude named Quebecuador.",
            "score": 16,
            "replies": [
                {
                    "author": "gandolphus_pfiffikus",
                    "body": "Quebecuador is fire, don't underestimate him",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "MainCharacter007",
            "body": "So can a team ambassador also be on a tournament analyst desk they are participating in?",
            "score": 112,
            "replies": [
                {
                    "author": "aufkeinsten",
                    "body": "it's a little bit like BSJ and Team Liquid, no?",
                    "score": 162,
                    "replies": [
                        {
                            "author": "Tartalacame",
                            "body": "Depends what does the role of \"Ambassador\" means. \n\nBSJ is a streamer/content creator for the Liquid Org. While he can't trash talk the org, he can say that the Dota2 team played a poor match and 'here is why'. If anything, that may boost his legitimacy as a streamer.\n\nIf the role of Ambassador is similar to a content creator, I don't think there's any problem.  \nIf the role of Ambassador is to specifically talk how the brand and the team is good, kind of like an endorsement, then yeah, it causes problems as the opinion expressed will be directly biaised.",
                            "score": 91,
                            "replies": [
                                {
                                    "author": "Ciri__witcher",
                                    "body": "Idk, Notail been hired for tournaments (ESL Berlin) and he is literal owner of OG.",
                                    "score": 55,
                                    "replies": [
                                        {
                                            "author": "HeyUniverse22",
                                            "body": "You can’t fire owner if you dont like what hes saying can you?",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "KainLust",
                                                    "body": "You mean firing n0tail because he's biased towards OG?? lmao",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "HeyUniverse22",
                                                            "body": "Obviously not. Argument was: if person is biased towards an org, because org is paying them, then should that person be on a panel? And if you’re hiring someone to hype up your org then obviously when they start criticizing that org you will fire them. It does not work for notail, because as an owner you can do all you want with your business",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "TheBlackSSS",
                                                                    "body": "If someone payed by an org can be biased, how is the one who directly owns the org's money not biased?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "HeyUniverse22",
                                                                            "body": "Jesus christ whats so complicated about “owner can do anything he wants” statement?   \nI have no idea what he says or where he is invited, nor do i care. There was an argument about org members being on a panel, someone brought up notail example, i said that those same rules do not apply to him, regardless of what he does or say, because he makes the rules for his org and personnel",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TheBlackSSS",
                                                                                    "body": "\nSomeone getting paid is biased because he gets money\n\nThe org's money is literally the owner's money, not only that, but he has the biggest stake out of everyone since, you know, he owns the thing\n\n\nDunno what you think the example was about, but \"getting fired\" isn't the only thing that makes someone biased",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "HeyUniverse22",
                                                                                            "body": "Thank you for explaining how ownership works. I am, however, not going to explain differences between CAN DO (something) and WILL DO (something), but i hope you can figure it out at some point",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "TheBlackSSS",
                                                                                                    "body": "Just because he can, doesn't mean he will\n\nDoesn't take much to figure out that an owner won't, basically ever, talk bad about his own org, dunno why this is so hard to understand for you\n\n\n\n\nBeside all this, a panel is just simple analysis (opinions) to entertain the spectator, nobody gives a turd about how biased someone is, everyone is biased anyway, who more who less, it's not like anything they say has any consequence",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Tartalacame",
                                            "body": "Has he analyzed OG matches? I don't remember so.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Atramhasis",
                                                    "body": "I definitely remember him doing so and while he didn't completely trash talk them after a loss he was honest with his analysis and said like \"I hope my boys pick it up in the next one.\" Sometimes there isn't really any sugarcoating it, and even the team themselves know they played poorly so the owner or someone else associated with the team saying that as an analyst is just saying what the players are thinking in the break room.",
                                                    "score": 15,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Lame4Fame",
                                    "body": "> If the role of Ambassador is to specifically talk how the brand and the team is good, kind of like an endorsement, then yeah, it causes problems as the opinion expressed will be directly biaised.\n\nI think it's fine, as long as they are being transparent about it. You could also have friends, former teammates or even coaches on panel commenting on a match, if anything some amount of inside knowledge should make it more interesting to viewers.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Tartalacame",
                                            "body": ">ou could also have friends, former teammates or even coaches on panel commenting on a match\n\nThe problem wouldn't be that a someone with friendship ties to a player be on the panels. The problem would be if someone paid by an org would be on a panel commenting about the choices of said org. Could they talk freely? Would you be able to call out your boss' mistakes out in the open? especially if that could cost you your job?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Lame4Fame",
                                                    "body": "Don't see how that's so different than the other examples. Either way there's a conflict of interest, but as long as it's known, so what? Especially since there are usually other voices to balance it out on coverage.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Jacmert",
                                                            "body": "Yes. Being transparent is good, and the DotA scene (and other esports scenes) have a lot of ppl with \"biases\" or potential conflicts of interest on the broadcast but as long as it's disclosed, everyone has a good time and the discussions are richer for it, imo.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Tartalacame",
                                                            "body": ">Either way there's a conflict of interest, but as long as it's known, so what?\n\nI don't agree with that statement at all.  \nThere are \"level\" of conflict of interests and in some case I think it's bad for the scene to allow it to happen. One can not want that a teacher can grade their own children, while it may bother much less if the teacher is friend of the parents of the child.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Lame4Fame",
                                                                    "body": "It's fair to disagree, but I think your analogy highlights why I think this is not a big issue: A teacher's grading has important consequences for the child. Their self-esteem or future course or career choices and opportunities etc. A pundit's opinion or evaluation of a Dota 2 game, play or team don't really matter in any practical way, they are just entertainment for the viewers. As long as the viewers know that they are associated with a certain team, I'd trust them enough to take an overly positive opinion with a grain of salt - people scream \"biased caster\" plenty as is, even without direct association of talent. And if some new viewer came away from a broadcast with a slightly higher opinion of TS as a result of listening to Ephey's commentary (assuming she would hold back criticism because of this association), then what's the harm, really?\n\nSeems certainly outweighed to me by the possibility of easier access to internal information. I'd rather have a coach tell me about what a player or their training environment is like in person on a panel, at the cost of them pulling a punch or two criticizing. Especially since I a) don't think the latter is even a given, panelists already tend to hold back, precisely because they don't know what's going on behind the scenes - e.g. if a bad play is a player or team decision. And b) since panels and casts are rarely ever solo, so you'll have other voices who will be glad to point out mistakes not mentioned by the biased person in question.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Tartalacame",
                                                                            "body": "It certainly is a much lesser issue than grading their own child, but I feel that if what an analyst would refrain from saying things on a panel because it goes against the policy of their employer, we should not have said analyst on that exact panel because we don't get to have their full analysis.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "itspaddyd",
                            "body": "Or Micah Richards for Man City lol",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Jacmert",
                                    "body": "Big Meeks??",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "itspaddyd",
                                            "body": "bursting on to the scene",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "aufkeinsten",
                                    "body": "love this guy :D",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MemeLordZeta",
                    "body": "What could an analyst possibly do to give the team an advantage lmao if anything it’s bad because she might be able to give better insight into spirits drafting to other teams. But yeah as others have said this is probably just the same thing bsj and liquid have going on",
                    "score": 14,
                    "replies": [
                        {
                            "author": "redbushrobby",
                            "body": "Specifically English speaking analyst. They provide access to a market for branding that is otherwise somewhat hard to break into.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Livid63",
                    "body": "why wouldnt they be? Who cares bias in this context",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "fr3nzy821",
                    "body": "I think they'll just replace her whenever Team Spirit is playing to avoid bias.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "wahabicp",
                    "body": "They do invite very biased analysts to the desk. I am sure that isn’t a problem for them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "nonruminant_ungulate",
                    "body": "ppd was a TI analyst while he was CEO of EG (on paper at least).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OutlawJoseyWales",
                    "body": "the tournaments are sponsored by gambling bro theres no big j journalism happening in dota",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zack_of_Steel",
                    "body": "People doing mental gymnastics to find a problem with anything these days, lmao. \n\nWhat do you even think an analyst does that it would somehow be a conflict of interest? They're all paid to give their opinions and many of them have ties to other teams...like when they constantly have pro players on panel or GUNNAR CASTING (usually after being booted from the tournament ((no shade, love you Gunman))). \n\nFear and EG\n\nppd and EG/Alliance\n\nBSJ and Liquid\n\nWinter and all of SEA lol\n\netc. etc.\n\nA conflict of interest implies that they would somehow affect/harm the competitive integrity. Please tell me how any of the analysts affect the teams and their play.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "spectreaqu",
            "body": "What does this mean?",
            "score": 48,
            "replies": [
                {
                    "author": "TheGalator",
                    "body": "The gets paid so The next time jenkins talks trash about team spirit in a panel she beats him up",
                    "score": 127,
                    "replies": [
                        {
                            "author": "TheZett",
                            "body": "My money is on Jenkins. He will pull out some super niche technique to somehow win in a single strike.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "pow3rhous3",
                                    "body": "probably would cliff her for 15 minutes straight",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "fapthepolice",
                            "body": "Hot take here but I think Jenkins might be stronger",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "WasabiofIP",
                                    "body": "Yeah I mean between the mewing and the yapping his jaw alone probably has enough muscle density to bite her head off",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mih5du",
                    "body": "Apparently they’ll be co-streaming and maybe making content together",
                    "score": 50,
                    "replies": []
                },
                {
                    "author": "irimiash",
                    "body": "they'll make some ads with her",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "mkipp95",
            "body": "Fitting since both team spirit and ephey had their breakthrough at the animajor a few years ago",
            "score": 11,
            "replies": []
        },
        {
            "author": "Jovorin",
            "body": "We have Mira at home.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Scones2",
            "body": "What does an ambassador do?",
            "score": 20,
            "replies": [
                {
                    "author": "MainCharacter007",
                    "body": "Ephey is the closest to a goth girl twitch streamer that they can get.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "itstimetogoinsane",
                            "body": "Ephey is on the opposite side of the goth girl spectrum",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "Balalenzon",
                                    "body": "Her favorite band is Tool, that's gotta count for a few goth points at least",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Embarrassed_Post_866",
                                            "body": "tool is not a goth band lmfao",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "Kotobeast",
                                                    "body": "I'm nerd, i hear band and im clueless tbf",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "pimathbrainiac",
                                                            "body": "They're among the two most famous progressive metal bands and progressive metal is among the nerdiest of metal genres.",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "toman33",
                                                            "body": "Tool is basically a math project.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "drschreber",
                                            "body": "Really, Tool? That's just a plain rock band...",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "RavelJests",
                                                    "body": "I think calling Tool a \"plain rock band\" is pushing it a little :D",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "gian2099",
                                                            "body": "So just plain band? \nI literally don't know the band",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "Zack_of_Steel",
                                                                    "body": "Bold of you to comment directly out of your ass, then.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "gian2099",
                                                                            "body": "Can also be just band who knows what his coment mean hahaha",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "deljaroo",
                    "body": "basically advertising",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "mvrander",
                    "body": "Spoils you with foil wrapped chocolates",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tyvmpicks",
            "body": "Team spirit is smart",
            "score": 37,
            "replies": [
                {
                    "author": "vaette",
                    "body": "Idk, paying for something you were getting anyway seems a bit dumb ;)\n\nNah, seems good, best of luck to everyone involved.",
                    "score": -23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Maleficent-Ruin-8065",
            "body": "Mira out\nMira in",
            "score": 7,
            "replies": []
        },
        {
            "author": "fr3nzy821",
            "body": "Got a little heart attack when I saw \"Mira\"",
            "score": 12,
            "replies": []
        },
        {
            "author": "HotDog2026",
            "body": "Congrats",
            "score": 5,
            "replies": []
        },
        {
            "author": "heephap",
            "body": "Why a picture of Larl",
            "score": 3,
            "replies": [
                {
                    "author": "AMetaphor",
                    "body": "I believe it's a video of Larl making the announcement/welcoming her",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "oxpecke",
            "body": "Ephey pog, Team spirit pog. Together pog.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Houeclipse",
            "body": "Close enough, welcome back Mira",
            "score": 2,
            "replies": []
        },
        {
            "author": "vianivan",
            "body": "That's pog",
            "score": 2,
            "replies": []
        },
        {
            "author": "theironman46",
            "body": "Absolute cinema",
            "score": 1,
            "replies": []
        },
        {
            "author": "Possible-Bee8352",
            "body": "Will language barrier be a problem? Ts content usually Russian and a rough Russian like no censor whatsoever so if they make content I wonder if English going to be TS problem content wise",
            "score": 1,
            "replies": [
                {
                    "author": "malibucasts",
                    "body": "I think Spirit certainly has the resources to work across any language barriers. A partnership like this is a step in addressing that I’d say.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "WasabiofIP",
                    "body": "They have a translator for all of their long form content already, and as the other comment said this partnership is probably working towards exactly that, bridging the language gap.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Awkward_External_731",
            "body": "they replaced one mira with an another.",
            "score": 1,
            "replies": []
        },
        {
            "author": "clairaudientsin2020",
            "body": "love this for her",
            "score": 1,
            "replies": []
        },
        {
            "author": "Phnix21",
            "body": "I was like \"Who is Mira?\", saw the dude's photo and thought this is a new Dota player joining TS 🤣.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wyqted",
            "body": "She can sub for Rue sometimes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Legitimate-Insect958",
            "body": "uuh",
            "score": 1,
            "replies": []
        },
        {
            "author": "CueVix",
            "body": "Wow, thats actually cool. Donno why, but cool.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aninnocentcoconut",
            "body": "Ephey speaks russian?",
            "score": 1,
            "replies": []
        },
        {
            "author": "PaixPaix",
            "body": "Thanks for setting up talents meetings Qojqva_",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoobaGaming",
            "body": "Arabs love Russian money",
            "score": -15,
            "replies": []
        },
        {
            "author": "Geaux_LSU_1",
            "body": "Interesting message to send to Jewish team spirit fans",
            "score": -71,
            "replies": [
                {
                    "author": "Torakkk",
                    "body": "What message lol?",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Im_Smitty",
                    "body": "Least obvious IDF bot on reddit",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Roreo_",
                            "body": "There is a conversation to be had.\n\n\nIsrael take land = bad.\n\n\nRussia take land = indifferent.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RoughRoundEdges",
                    "body": "The fuck are you on about?\n\nEdit: I'm pretty sure I know, and if you're remotely self-aware you won't say your ignorant thoughts out loud.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Atroxiae",
                            "body": "she is very vocal against israeli warcrrimes and this fk thinks every jew support israel war crimes i assume?\n\nEdit : I DONT SUPPORT ISRAEL either but not every jew SUPPORTS THEM EITHER , Learn to differentiate",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "RoughRoundEdges",
                                    "body": "Yeah that's what I figured. Dare I say, quite an antisemitic thought process.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "baievaN",
            "body": "the question is does any one of them bang her",
            "score": -21,
            "replies": [
                {
                    "author": "JustAposter4567",
                    "body": "I can't imagine being this deprived of contact with women.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Nyanta322",
                    "body": "That'd be Qojqva.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "RoughRoundEdges",
                    "body": "Clearly this isn't really a question anybody needs to ask about you.\n\nOr one that you need to ask anybody else. Just because she's attractive doesn't mean you need to be a sexist creep about it.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}