{
    "title": "You’re invading Taiwan, aren’t you Squidward?",
    "author": "A_Pathetic_Squirrel",
    "subreddit": "NonCredibleDefense",
    "rank": 14,
    "score": 5569,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 332,
    "url": "https://www.reddit.com/gallery/1jdd051",
    "id": "1jdd051",
    "selftext": "Why the hell else would you mfs (🇨🇳) build these damn mulberry harbor ass looking things ",
    "comments": [
        {
            "author": "COLSandersEnjoyer",
            "body": "Wow it's not like they've been broadcasting that intention forever",
            "score": 2016,
            "replies": [
                {
                    "author": "BonyDarkness",
                    "body": "It’s a strategy as old as time itself.  \nState your intentions openly and clearly and show everybody around all the fancy preparations you are making.  \nIf anybody takes you serious gaslight them. Continue for a while and build up strength.  \nContinue the gaslighting.  \nAttack.",
                    "score": 1330,
                    "replies": [
                        {
                            "author": "COLSandersEnjoyer",
                            "body": "Invasion or no, we're gonna make sure we sink the Renhais all the same",
                            "score": 297,
                            "replies": [
                                {
                                    "author": "WuhanWTF",
                                    "body": "No. Save me one, it’ll look amazing on my patio.",
                                    "score": 58,
                                    "replies": []
                                },
                                {
                                    "author": "Candy_Bomber",
                                    "body": "Unless they grease the right palms first.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "superblobby",
                            "body": "I remember during the Russian buildup in early 2022. The Russian bot line was “Putin really worked up the west and he didn’t even have to leave his own borders!” Then a month later Russia attacked. ",
                            "score": 328,
                            "replies": [
                                {
                                    "author": "BonyDarkness",
                                    "body": "Wasn’t it the “common consensus” in the media as well?  \nI think I remember reading headlines along the lines of “Biden warns Ukraine about imminent invasion, Russia says it’s just training.”  \nWe’re all falling for the same thing again and again.  \nIt’s just going to be another “exercise” and to get the right “training conditions” the whole country is in top alarm modus - just a simulation. (If you’re smart you do this a couple of times. Make the other one cry wolf a couple of times..)",
                                    "score": 188,
                                    "replies": [
                                        {
                                            "author": "SerLaron",
                                            "body": "> Wasn’t it the “common consensus” in the media as well?\n\nDidn't some experts say, that it would be stupid to invade without proper preparation and procedures? Turns out it was, but when has that ever stopped somebody?",
                                            "score": 148,
                                            "replies": [
                                                {
                                                    "author": "Reality-Straight",
                                                    "body": "that was cause it was absolutely idiotic from a  rational standpoint. but Putin is no rational actor so the west got blindsided. \n\nIts the big weakness with \"Realpolitik\". It assumes every nation is a somewhat rational actor.",
                                                    "score": 119,
                                                    "replies": [
                                                        {
                                                            "author": "BonyDarkness",
                                                            "body": "Historically speaking: if a leader (or any other lunatic) writes stuff down, like in a book or essays or papers or whatever and this is clearly detailing what they think and want and how they want to achieve this… I’m going to read this shit and take it word by word.\n\nMustache-man did it and everybody was “surprised” when he did what he wrote down.\n\nPutin wrote a lot of shit about getting back the old Russian empire and how he feels like the reincarnation of Peter the great or something.\n\nI’m not looking for a rational, he gives it himself. He is the top dog who is going to rid the world of this boring “rules-based-order” creating a new russki mir-“pole” in the new “multipolar world”.\nHe wants to go down in the history books as a conquerer and the guy who revived the empire",
                                                            "score": 39,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "superblobby",
                                                            "body": "OSINT saw it coming from miles away.",
                                                            "score": 63,
                                                            "replies": [
                                                                {
                                                                    "author": "WasabiofIP",
                                                                    "body": "Lmao keep in mind OSINT is literally just a bunch of people on Twitter, it's not an organization that draws a conclusion and stands by it. There were probably thousands of people who were right (and were wrong the other 1000 times they doomered out about something else big totally about to happen) and thousands who were wrong (because they are the \"nothing ever happens\" crowd). It's like saying \"Twitter saw it coming\" or \"4chan saw it coming\" it's completely meaningless.",
                                                                    "score": 41,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Jerkzilla000",
                                                                            "body": "No, he's talking about John OSINT. He was there and he saw them, a mile away, with his very good eyesight.",
                                                                            "score": 8,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "argonian_mate",
                                                            "body": "It also assumes that no one in the world but superpowers has any agency. Realpolitik is a silly, silly thing that failed to work continuously for over 60 years but suits still cling to it like shit to a sole.",
                                                            "score": 17,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "SnooBananas37",
                                                            "body": "Eh. Putin is rational, the problem is that he believed his own hype, laundered through his own subordinates.\n\nPutin surrounds himself with yes men and people who are loyal to him above all else. He built a system where his subordinates want to compete with each other for his favor, rather than taking the risk of attempting to usurp him.  As a result everyone in Russian military and intelligence was telling him that Russia was strong, Ukraine was weak, that the Ukrainian people either wanted to be Russian or were indifferent, and no country would support Ukraine, because that's exactly what he wanted to believe\n He had trained or replaced anyone who might offer a dissenting opinion.\n\nThe belief was that Russia could deliver a crushing blow that forced Ukraine to surrender, and it would all happen so fast that the West wouldn't have time to react. All of the right wingers that had been compromised by Russian propaganda would say the reason why Ukraine fell so fast was because Ukrainians either want to be Russian or dislike their own country and are unwilling to support, why should we crucify ourselves with sanctions when Ukrainians don't even care?\n\nWestern intel knew that this was Russia's assessment of what the outcome would be, and our intel believed it was accurate, which is why Zelensky was offered a ride rather than ammunition.  It's why prior to the war a significant amount of training was in guerilla and insurgency tactics... if Russia ever invaded, Ukrainian resistance would mostly be during an occupation, because their army would quickly collapse.\n\nPutin believing this, was perfectly rational starting the war, expecting a short war with few consequences and much to gain.  If Putin in 2022 could look in to the future and see where things are today (donkeys, golf carts, North Korean troops and shells, tens of thousands of vehicles lost and hundreds of thousands of casualties) he'd probably shit himself and call off the invasion.",
                                                            "score": 10,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "midnightrambulador",
                                                            "body": "Putin is a rational actor, he just doesn't have any Russian \"national interest\" in mind, only the short-term survival of his own regime.",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "BonyDarkness",
                                                                    "body": "Not that I’ll ever have the opportunity to know but what the fuck was going on in the Kremlin behind closed doors if this war was needed to ensure the (short term) survival of his regime?  \n\nFrom the outside look I have it’s more like this is destabilizing his rule and not really helping much in strengthening the grip honestly.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "midnightrambulador",
                                                                            "body": "I'm no expert on Russian politics either but there are a few things you could say the war has brought him. All remaining opposition is broken and delegitimised, western journalists have been kicked out, and the wartime atmosphere makes it easier to paint any dissent as \"sympathising with The Enemy.\"\n\nNot saying any of this was smart or net beneficial even from Putin's narrowly personal PoV – being a rational actor doesn't necessarily mean you make good decisions – but this does seem to be the common thread to his actions. Attempt to destabilise or overthrow neighbouring democracies that might give the Russian population ideas, and more importantly stoke constant conflict with an external enemy.\n\nI just want to push back against the assumptions that a) Putin believes his own propaganda bullshit or b) being a leader of Country X means you're necessarily operating with the national, strategic interests of Country X in mind. Both of which show up quite often even in serious commentary.",
                                                                            "score": 11,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BonyDarkness",
                                                                                    "body": "I think - at least right now - that he mostly did it out of narcissism. I’ve said it in different comments, there is talk about the Russian empire, spheres of influence and so on. A lot of it even from the man himself.  \nThey have somehow managed to find out how to leverage the internet/social media against western democracies creating an opportunity for him to - at least partially - get closer to his goals.  \nHe (and the CCP) has played us. We trade and think this will “democratize” them but in reality they just build up strength, stole all technology they could trying to catch up as fast as possible to challenge us. And in the meantime they are putting wrenches between allies for good measure and fun. \n\nMost of this doesn’t make sense to me. The war and open conflict with the west didn’t benefit anyone in Russia. Not the general population nor the elites or inner circle. They got sanctioned and can’t dine in London anymore (what a bummer but you know what I mean). This is bad for business in general.  \n\nSo who wants this really? Some hardliner maybe but how do they have leverage over Putin if he doesn’t want it?  \n\n(So much about your point b lol)  \n\nIn terms of social cohesion surely the war has its benefits. But there are also long term social consequences and demographic ones as well and I highly doubt they are worth it in this sense. Yes you have patriots but fewer and a lot of missed opportunities.  \n\nAbout a) yes I agree in principle but we also need to look out for flaws in the system that could impact his decisions. It’s a dictatorship and they have a corruption problem, that’s kinda well known. How accurate will be any report really and what will be reported to him in the end? Nobody wants to say the depot is empty and scavenged or the fuel has been sold, ~~75%~~ ~~83%~~ ~~96%~~ 110% readiness reported! The troops did extra training this month!  \nThat’s some sort of “propaganda” on its own and I think it’s fair to say this will also be influenced by the propaganda he/they feed the general public.",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Tapkomet",
                                                    "body": "One Ukrainian war analyst admitted that he only really came to believe the invasion would happen like a week or two before it actually kicked off, when the russians started bringing in blood supplies. Before then he was observing the preparations, but thinking \"surely this is a bluff because it's so fucking stupid. This will be a disaster for them.\"\n\nAnd it was indeed a disaster for most of the attacking forces, though of course the ones going from Crimea saw a lot of success until well after they took Kherson.",
                                                    "score": 25,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "BonyDarkness",
                                                    "body": "That’s why the only experts I trust are my 394k Defense Experts™ here in this sub (and for politics the other NCD)",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "NaturalBornHater",
                                                            "body": "What’s the other sub?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "BonyDarkness",
                                                                    "body": "r/noncrediblediplomacy",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "superblobby",
                                            "body": "The Secretary of State Blinken even spoke at the UN stating everything that would happen. He said “Russia is gonna do this, this, this, and then the invasion is gonna happen” and it played out exactly like that\n\n[don’t look in the comments for the sake of your sanity](https://youtu.be/476xeLfd4yE?si=5X-O9iZuveFA75uy)",
                                            "score": 44,
                                            "replies": [
                                                {
                                                    "author": "dugmartsch",
                                                    "body": "Brain rot comments. \"US did this in Iraq\" WTF. No they didn't do this, he's saying invading Ukraine is bad. \n\nI mean obviously it's russian bots but like, how did it work on people?",
                                                    "score": 28,
                                                    "replies": [
                                                        {
                                                            "author": "BonyDarkness",
                                                            "body": "This is the explanation I came up for myself. I haven’t looked much into the science of it but I think [kitchen-psychology](https://en.m.wikipedia.org/wiki/Folk_psychology) (we call it that in German and I love that expression) is the best kind of psychology.  \n\nI start with the premise that any lie becomes a truth if you repeat it often enough.  \n\nWe have the algorithm that’s basically telling us what we want to see.  It’s known - you can test it and it’s scary - that this is even true for comment section.  \nIf I look at a post and read the comments and I look at the same post and comments on my sister’s account they are different.  \n\nPeople are watching videos and pictures. These media - usually - is tailored to induce specific feelings. We can see it with interviews nowadays. No substance but only soundbites for later use in social media. Stuff is strategically cut or omitted or implied.  \nThe user go to the comment section reading “what others are thinking about that”. Maybe the first few times they are like, _”hell nah, wtf is this opinion”?_ but after they read the same shit over and over they start questioning their own thoughts about a matter.  \n\nAs said, that’s just my attempt of making sense of this. Maybe there are people around who know about this and can correct me cause I’m just an idiot on the internet.",
                                                            "score": 18,
                                                            "replies": [
                                                                {
                                                                    "author": "McSkrjabin",
                                                                    "body": "I mean your post demonstrates you have critical thinking skills so maybe consider yourself to be on the other end of the \"idiot on the internet\" spectrum. :)",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ITaggie",
                                            "body": ">  Wasn’t it the “common consensus” in the media as well?\n\nIn American and Ukrainian media, yes. A lot of European countries were in denial up until it already happened though.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "lenzflare",
                                            "body": "But also, Biden was warning people Russia would attack. The US admin was warning Ukraine, they just couldn't believe it. France came to the opposite conclusion.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "BonyDarkness",
                                                    "body": "Europe was (apparently) of the believe the remaining energy deals were still juicy enough. Making the shift and all the public debate around gas/renewables surely didn’t help reassuring the Russians Europe will be endless money forever.  \n\nUS probably had people within. We know their opsec now and it’s costing them lives now. Surely wasn’t any better before the full scale invasion.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Selfweaver",
                                    "body": "Yep. I remember being certain that it was a nothing burger when the US went out and said they had evidence he wanted to invade.\n\nIraq did so much damage to US credibility.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Grandmastermuffin666",
                                    "body": "Yeah I constantly saw stuff like. \"They do this every few years it's meaningless.\"",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ein_grosser_Nerd",
                            "body": "History really is full of moments where somehow everyone is shocked that the guy/country that has been veey explicitly detailing exactly what they are going to do for decades, actually did it",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Hinterwaeldler-83",
                                    "body": "In movies people complain how unrealistic such a thing would be, but in real life *surprised Pikachu*",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "wastingvaluelesstime",
                            "body": "The other things which should be obvious is they would rather paralyze the potential supports of Taiwan using subversion. Sun Tzu and winning before fighting, and all that.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "TARANTULA_TIDDIES",
                            "body": "I don't think anyone really even thinks they AREN'T going to have a go at (and likely succeed unless  a Luigi eats an orange) taking Taiwan. Even prior to trump, the us hasn't exactly shown 5that they will forcefully stop annexations by force. And Ukraine is a lot easier to supply than Taiwan is/would be.\n\nI just really wish people wouldn't be dicks but it looks like we are going the opposite direction full steam ahead. Can't help but feel like this must've been like what living in the 1930s must've felt like except that our next great depression hasn't quite kicked in yet",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "BonyDarkness",
                                    "body": "Actually invading Taiwan would be a nightmare.   \nAnd yes, supplying them would be way harder than Ukraine.  \n\nSo you mean they are going to blockade and say give”give or else”? Makes sense. But what will the 23million Taiwanese say about that.  \nI can’t see Ukraine rolling over just because the US stops supplying weapons. They’re going to do this on their own if they must (at least that’s my feeling so far, could be wrong) and I can’t see Taiwan just giving the Chinese what they want just because of a blockade and US backing down. Both are essentially an existential crisis for each nation. That’s a make or break moment and break means potential eradication from the history books.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FLARESGAMING",
                            "body": "make them confident your going to attack, so confident they become complacent.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Hinterwaeldler-83",
                            "body": "How is „we are prepared to take Taiwan by force“ gaslighting?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BonyDarkness",
                                    "body": "_“This are totally not landing ships! This are barges for.. uhm… fishing!”_",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hinterwaeldler-83",
                                            "body": "I was alluding to the part where Xi said „we are prepared to use force“, like, literally.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "BonyDarkness",
                                                    "body": "Gotcha.  \nThat’s no gaslighting, that’s the “state your intentions openly and clearly”-part.  \n\nThe gaslighting comes into play if anybody tries to do something about it.  \n\nIt’s about making you question your own reality.  \nOn the one hand you have a statement and on the other hand you have clear actions that are denied as being such. Doesn’t work in everyone but it’s enough to be a problem for any democracy.  \n(Every country has a party or groups who are repeating Russian/ccp propaganda unfiltered excusing everything and accusing their own government of wrongdoing or inciting the other)",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "J0E_Blow",
                            "body": "Hey! This sounds like something a political party I know is doing!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "briancbrn",
                            "body": "The power of gaslighting fucking terrifies me",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Mantaraylurks",
                            "body": "That’s how trump took power",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Minute_Helicopter_97",
                    "body": "Hey, there’s a difference between forever and 77 years.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "just_anotherReddit",
                            "body": "77 years is older than me so it could very well be forever.",
                            "score": 36,
                            "replies": []
                        },
                        {
                            "author": "COLSandersEnjoyer",
                            "body": "I agree. But I meant it in the same way we say \"forever\", as in \"I will love you forever\" and it ends up being anything from a few minutes, an hour, a week, a month, seven years, fifty years, a millenia.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "grifxdonut",
                            "body": "Acrually china's initial takeover of Taiwan was in the 1600s",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Initial_Barracuda_93",
                    "body": "Nah you’re wrong bro. Clearly these are for humanitarian aid. \n\nThe “invasion-ramp” is obviously an earthquake-support shelter designed to rescue Taiwanese ppl and the new jet is for efficient delivery of fluorescent tube lightbulbs, hence long the shape of their internal payload bay\n\nsmh a lack of critical thinking in this sub",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "___DEADPOOL______",
                    "body": "China: Taiwan is and has always been part of China and will be reunited with the mainland. \n\n\nThe West: I wonder what they mean by that? ",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Selfweaver",
                    "body": "There is the \"I fully intend to do X ... someday\" and I fully intend to do X in 18 months.\n\nChina may have moved from the first towards the latter.\n\nPersonally I don't care much - it is obviously objectively bad, but we have all accepted that what China did to the Muslim population (ie genocide) was completely fine, so can we really say anything this time?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Anen-o-me",
                    "body": "They're not trying to gaslight. China has been all about using the threat of military invasion to pressure Taiwan to willingly and voluntarily surrender their sovereignty. \n\nThese vessels don't even look particularly credible, they're there to place additional pressure because the assumptions of landing sites Taiwan built its defense on are now moot.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Joezev98",
            "body": ">Why the hell else would you mfs (🇨🇳) build these damn mulberry harbor ass looking things\n\nClearly they are preparing to switch sides against Russia and donate these for the retaking of Crimea!",
            "score": 1987,
            "replies": [
                {
                    "author": "Kindly_Title_8567",
                    "body": "Peak non credibility",
                    "score": 685,
                    "replies": [
                        {
                            "author": "donsimoni",
                            "body": "Oh, we can take it higher. Kim fell from grace by touching one of Winnie Pooh's tea cups. PLA joins the fight on the Ukrainian side.",
                            "score": 193,
                            "replies": [
                                {
                                    "author": "ScipioAtTheGate",
                                    "body": "[Or their gearing up for the second battle of attu, so the Russians can retake the Aleutians ](https://youtu.be/swrdI1QZZA0?t=30)",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Jam-Boi-yt",
                            "body": "2026 Mar 17: In today's news the UAF managed a sea born operation to retake Crimea in the Black sea. They used new Chinese makeshift Mulberry harbors to supply their troops. Which the Russians believed to be regular cargo ships. The overall shock of the operation has surprised many military analysts around the world. Except for one extremely happy man on reddit who predicted these events exactly one year ago. \n\nIn other news Trump has declared that his new American Empire will use force to protect its trading rights with Canada, including against Canada itself. \n\nMore news at 11.",
                            "score": 99,
                            "replies": [
                                {
                                    "author": "Kindly_Title_8567",
                                    "body": "Oh shit i read 2026 and immediately assumed that's like 4 years in the future, not next year 😳",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "TreezusSaves",
                                            "body": "We're in the 63rd month of 2020.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "jixdel",
                                                    "body": "\"Welcome to the 3rd year of the 3 day special military operation\"",
                                                    "score": 15,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "NBSPNBSP",
                                                    "body": "261st week of the two-week lockdown.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Comprehensive-Map383",
                            "body": "Would be peak comedy",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Background_Drawing",
                    "body": "\"look russia, it's not your fault, but i just dont want to be  in the same faction as America\"",
                    "score": 91,
                    "replies": [
                        {
                            "author": "I_Automate",
                            "body": "*Auto balancing teams in 3.....2.....1....*",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "Kamikaze_Urmel",
                                    "body": "No, North Korea, *you* stay *exactly* where you are. Nobody likes winning team joiners.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "unfunnysexface",
                                            "body": "Depends on how good their pasta is",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Background_Drawing",
                                            "body": "NK switching sides to potato? Now that's interesting",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "I_Automate",
                                            "body": "Let's be real here. The only reason they still exist is because nobody wants to deal with the refugee crisis and they have nothing of value worth actually fighting them over",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "2eDgY4redd1t",
                    "body": "Russia would actually be a better target for China, not crimea, but Manchuria and/or Siberia, and these barges would be even more suited to that than they are to Taiwan.\n Firstly because taking back Manchuria and Siberia would be far more useful the the Chinese (I say taking ‘back’ because taking a leaf out of Putin’s book, those territories are historically Chinese.  Well, mongol anyway, and the mongols owned China, and that’s a better claim than Russia has ever had over Ukraine)\n\nSecondly because the barges are incredibly vulnerable to attack. In Taiwan they will be under so much missile and arty fire it will block the sun, whereas they can make an insta-port anywhere on russias coast and the Russians won’t be able to do a damned thing about it. The Chinese could spend weeks landing half a million dudes and equipment, and the Russians simply cannot contest it meaningfully. Unlike Taiwan.\n\nThe next 3.5 years will hold the answer. I really hope they use them in Russia, if only because Russia deserves it.",
                    "score": 64,
                    "replies": [
                        {
                            "author": "I_Automate",
                            "body": "The Bear and the Dragon 2: Electric Boogaloo.\n\nTom Clancy is smiling down from the afterlife right now",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "2eDgY4redd1t",
                                    "body": "Never read it.  Other than red October and red storm rising I never felt like Clancy was worth reading.  Those two were great, the rest was just retreads and paranoia in equal measures.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "I_Automate",
                                            "body": "Massive gold and oil strike in Siberia.\n\nUSA and Russia begin new era of cooperation to exploit them. \n\nMassive Chinese invasion into Russia to try to claim the resources, which is stopped by soviet era stockpiles of heavy equipment, backed up by American air power and intelligence gathering.\n\nRed Storm Rising, but China is the aggressor, invading Russia",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "2eDgY4redd1t",
                                                    "body": "So a paranoid retread that also lacks believability?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "I_Automate",
                                                            "body": "I mean, it's part of a longer running series that lends some in universe credibility to the cooperation. After Russia gets its shit pushed in in red storm rising, the new government is a lot more open to the west because....what choice do they have. And China becomes the isolated outsider in turn.\n\nBut yes. Basically, it's yellow panic as a book.\n\nThough.....given recent events. Maybe not as far out to lunch as I'd really like.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "PurpD420",
                                                    "body": "Omg that sounds like a fantastic read, I found my new book!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PatientClue1118",
                            "body": "On other news, Japan must take Sakhalin and Kuril island's",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "2eDgY4redd1t",
                                    "body": "These are all excellent ways to punish Russia for invading Ukraine. Supply Ukraine with what is needed to drive the Russians out, then set peace terms that include loss of Kaliningrad, loss of the kuriles and Sakhalin, the demilitarization or all Russian ports on the Black Sea, demilitarization of a 200km buffer zone inside the Russian border in Belarus and Ukraine (effectively prevents another surprize invasion), plus reparations etc etc.  then when Russia refuses, Ukraine just keeps striking Russian oil and military targets inside Russia until the fuckers surrender on even worse terms.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "Jackbuddy78",
                                            "body": "Loss of Kaliningrad would do more to destabilize Europe than Russia at this point. \n\n\nIt's not a a strip of land with 50k people, 1 million people live there and it's almost all ethnic Russians. ",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "2eDgY4redd1t",
                                                    "body": "Yeah, and you kick them out and drop them back in Russia.  Taking away Kaliningrad is punishment for Russia, it’s not about some dumb idea of liberating the Russians living in their stolen enclave. Herd them to the Belarusian border and let potato head shivvy them on to Russia.\n\nBefore I hear whining about how unfair that is to the people being displaced, they should have been better people and then they wouldn’t be considered a massive risk to the peace and happiness of their nighbours.\n\nFuck em.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "WorldArcher1245",
                                                            "body": "And what if those Russians resist?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "2eDgY4redd1t",
                                                                    "body": "They still leave.  The ones that survive.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "WorldArcher1245",
                                                                            "body": "And how many people do you think are going to die? Especially in the West with brutal urban combat a shit way to fight?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "2eDgY4redd1t",
                                                                                    "body": "Considering the Russians are an invasive species, I don’t much give a damn.   They won’t stand a chance against whichever European state gets the territory, so it really doesn’t matter to me if Russians decide to throw their lives away instead of accepting well deserved banishment.\n\nThat’s what you get when you are the willing vanguard of a brutal campaign of imperialism.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "WorldArcher1245",
                                                                                            "body": "Yeah, well, you may not care, but when Kaliningrad becomes a warzone that might be even worse than Gaza and when Western soldiers get a taste of their own Stalingrad where it'd be foolish to think not a decent number will die, people will care and think, perhaps, this isn't the way.\n\nAnd it's not even considering the boost in support right wing parties will receive when Kaliningrad becomes Stalingrad. \n\nI get this sub is Non-credible, but this is just a no-brainer.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SoylentRox",
                            "body": "Imagine how effective torpedoes with nuclear warheads or cruise missiles would be.  Just a few shots would take out the invasion fleet.  That's the logical move for Taiwan to build - rush cram spicy rocks into missiles they already have.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "2eDgY4redd1t",
                                    "body": "Nukes won’t save them. The only thing that can save them is support from other nations and sanctions. Thats an unfortunate fact.\n\nHonestly, I think Taiwan is fucked simply because nobody can afford to sanction China. Their manufacturing is just too important for meaningful trade wars, even the half assed BS the USA is pulling is destroying the American economy weeks in.  For Taiwan to survive requires too much sacrifice from other nations.  It sucks but that’s my prediction.  I hope the Taiwanese make a stand that Chinese mothers whisper to their children hushed  tones for a thousand years, but I can’t see them winning",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "SoylentRox",
                                            "body": "Why wouldn't it?  They can threaten Shenzhen.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "2eDgY4redd1t",
                                                    "body": "Because they aren’t going to have enough nukes.  China is very spread out with hundreds of major cities and economic and military targets. They are huge and dispersed.  Taiwan’s would need hundreds of nukes before they would be able to inflict enough damage to deter China.   China isn’t like Russia where a single nuke on each of three cities ends the country",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "SoylentRox",
                                                            "body": "They wouldn't be deterred by losing Shenzhen and Beijing and the entire population of Taiwan?",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "2eDgY4redd1t",
                                                                    "body": "It’s not existential for them.  Plus, remember MAD?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SoylentRox",
                                                                            "body": "I mean if losing 20+ million of your better people isn't a deterrent what is.  Just because China would continue to exist doesn't mean the us would trade with them ever again or allow anyone else to send ships to China.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "2eDgY4redd1t",
                                                                                    "body": "Your argument is relying on Americans to do the right thing?\n\nNow that’s genuinely non credible.",
                                                                                    "score": 8,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Fyrefanboy",
                                                                                    "body": "China is famous for backing down after loosing a few dozen of millions of people, as we all know",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Meem-Thief",
                                            "body": "taking out the three gorges dam, especially if it's near full or overflowing (as has happened multiple times) would cripple the chinese economy and cause millions of casualties, though it's a last resort because it WOULD be equivalent to nuking China",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "2eDgY4redd1t",
                                                    "body": "Do you have any idea how hard it is to break a dam?\n\nIt is beyond taiwans capability to do so.\n\nLike it’s hard to do it with demolitions experts and tons of explosive placed at pre Isley the right locations inside the structure and sequenced perfectly.  From a missile that might carry a 500lb warhead, can’t be made accurate enough and doesn’t penetrate far enough it’s effectively impossible.  Tactical nukes would not do it, though you could take out the transmission lines, you probably couldn’t breach the dam.  A big nuke landing in the right place would breach the dam, but Taiwan is decades away from. Multi megaton nukes even if they started a couple years ago.  It’s not so much the bomb, it’s a\nMissile sophisticated enough to get it there still functional. Ballistic missiles the size of a school bus are not something you whip up overnight. Neither are the guidance systems, the smooth and gentle acceleration required of the engines, the cushioning to prevent the payload from rattling into uselessness.\n\nIt’s too non credible even for here.\n\nYes, the USA could do it if they could get that massive penetrator bomb, or rather a dozen of them, into the right part of the dam, but how are you getting there to drop it? The Chinese have an air force, Taiwan, for these purposes might as well not have an Air Force at all.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "PersnickityPenguin",
                                                            "body": "It has been done before.\n\n\nAlso, the 3 gorges dam has serious structural flaws that are showing.  It is actually at risk of collapse now.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "2eDgY4redd1t",
                                                                    "body": "Not since the development of modern air defense it hasn’t.  What you posit requires that the entire Chinese air force and all their air defense leaves the area.\n\nIt’s simply non credible.\n\nAlso, the three gorges dam isn’t made of cracked porcelain. It’s a massive earthwork.  The absolute platonic ideal for absorbing explosive energy unharmed.  Its structural defects are not making a difference.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PersnickityPenguin",
                                            "body": "No, I am pretty sure that nuking China's navy into atoms would end the war, and pretty quickly at that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "2eDgY4redd1t",
                                                    "body": "Right. That’s why nations use nukes routinely.  Thats why Russia has used them instead of losing the Ukraine war.  That’s why Israel used them on Gaza.\n\nNukes fix everything!\n\nThey’re just big booms. Not miracles in a casing.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SoylentRox",
                            "body": "I mean the Russians have a way to contest it meaningfully.  A single fully loaded SS-18 with 10 750 kiloton warheads spread across the beachhead and the invasion ships.\n\nThis is why it's the ultimate defensive weapon. Invasions require a concentration of forces.  That concentration of ships during the Normandy invasion was essentially a linear target, easy prey for a single ICBM with the MIRVa set to spread across the beach.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "2eDgY4redd1t",
                                    "body": "Nah, these barges mean you can have a hundred ports across a whole coastline, and if you drop a nuke on each one you just destroyed your own nation.  Thats precisely why these allow an invasion even if a country with nukes.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "SoylentRox",
                                            "body": "Then kill everyone in China.  That's what Russia can do.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "I_Automate",
                                                    "body": "People forget that China has nukes, too.\n\nNobody wins a nuclear war. That's why it hasn't happened yet and hopefully never will.\n\nEven the most ruinous conventional war isn't a drop in a bucket compared to nuking your own country to stop an invasion",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "2eDgY4redd1t",
                                                    "body": "No they can’t.  Aside from the fact that most of their nukes won’t even fire, China has extremely effective nukes to fire in retaliation for a nuclear strike on China. That’s the whole point of MAD, it keeps nuclear nations safe from invasion, but the main foundation of the doctrine is it ensures any nuclear exchange between nuclear powers is always lose lose.\n\nRussia would have to either give up the territory, fight an win conventionally, or be fully annihilated.\n\nAlways remember Russia is uniquely vulnerable to nuclear attack. You need three nukes to destroy Russia as a nation, as far as the Russians are concerned. They don’t care about anywhere but the ethnic Russian cities, and they never have.",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Pinesse",
                            "body": "They just silently annexed the other half bear island and secretly building on it. It's literally overwatching one of the two bridges that connects to outer manuchuria from the rest of Siberia. Warning of Taiwan invasion isn't very art of war-y so this 100% confirms this.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "J0E_Blow",
                            "body": "Why would they take Eastern Russia? There's hardly anything there and they have a decreasing population as it is... They want strategic resources not space.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "2eDgY4redd1t",
                                    "body": "It’s jam packed with valuable resources, global warming makes much of it increasingly arable, it’s ‘historically part of China’ and it damages Russia.\n\nThe last part is very nearly enough. The Chinese hate Russia. They always have.  The limited alliance they have is purely because they can get cheap petroleum from Russia.  Or they could just take the land the oil is under. They would consider this just to screw Russia over, even without the immense resource wealth\n\nRussia destroyed their future by squandering all their military resources in Ukraine.  They are now utterly defenseless against any modern army, and the Chinese are licking their chops with how helpless Russia is.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "nutdo1",
                                            "body": "Exactly this. Right now, a significant part of China’s energy resources are imported through the Malacca Strait. In a war with the US, the US will likely blockade the strait which will cut off China’s energy supply.  The other ocean routes are blocked by the US and their allies aka the “island chain strategy”. \n\nChina is developing overland contingencies to counter this threat (i.e. providing Russia with military supplies in exchange for natural gas and building pipelines/developing relations with Central Asia).\n\nLastly, to elaborate on the above comment, it would also screw Russia as their only warm water port and home of their Pacific Fleet is located in Vladivostok (a former part of China before it was taken during the “Century of Humiliation”). This would take away their ability to project power in the Pacific while at the same time gives China access to the Sea of Japan as another avenue to break through the US’s “island chains”. Not to mention it seems that Xi’s foreign policy is undoing the Century of Humiliation so they would likely press this claim when the opportunity arises. They’ve done it before during 1969.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Vankraken",
                    "body": "China gets Outer Manchuria back and Ukraine gets Crimea. Good deal.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Chimichanga2004",
                    "body": "I mean didn’t China recently occupy some island in Siberia?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Jackbuddy78",
                            "body": "No that would be quite a big deal",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "user975A3G",
                    "body": "At this point, with the current events\n\nI wouldn't be surprised",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jenetyk",
            "body": "Boys saw Russia fumble an invasion across open farmland, looked at fortified Taiwan across a freaking ocean; and decided they better get their shit together.",
            "score": 219,
            "replies": [
                {
                    "author": "Amogus-Connoiseur",
                    "body": "Nah just go and do it. \n3 day operation\nIn and out.\nNo biggie\nNo balls if I dare so.",
                    "score": 76,
                    "replies": [
                        {
                            "author": "therealbman",
                            "body": "I’d really appreciate if they sent their landing force in floating IFVs. Crossing open ocean in one of those would be a hoot.",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hotfezz81",
                    "body": "I mean, Russia was looking at Ukrainians, who realised how badly things could go and were desperately uparming and training their forces.\n\nChina is looking at Taiwan, a country whose population no longer thinks its at risk,is wasting billions of dollars on irrelevant and will-be-immediately-destroyed white elephants like fighters and frigates, has dropped it's defense spending to a level comparative to an unthreatened European state's, can't fill it's units, etc. Etc. Etc.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AutoModerator",
                                    "body": "This post is automatically removed since you do not meet the minimum karma or age threshold. You must have at least 100 combined karma and your account must be at least 4 months old to post here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NonCredibleDefense) if you have any questions or concerns.*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Rick_Flare_Up",
            "body": "I wish them a very unsuccessful invasion.",
            "score": 737,
            "replies": [
                {
                    "author": "Fearful-Cow",
                    "body": "3 days, in and out, quick adventure, what could go wrong?",
                    "score": 320,
                    "replies": [
                        {
                            "author": "Rick_Flare_Up",
                            "body": "Hopefully everything.",
                            "score": 121,
                            "replies": []
                        },
                        {
                            "author": "Tom-Nook-98",
                            "body": "Hey, I've seen this one! It's a classic",
                            "score": 48,
                            "replies": []
                        },
                        {
                            "author": "OuchYouPokedMyHeart",
                            "body": "Best case is the whole CCP collapses",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "RedneckNerf",
                                    "body": "With the kind of investment that an actual invasion would entail, that is certainly a possibility.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "breezyxkillerx",
                                    "body": "\"China then collapsed into 300 warlord states, 30 billion dead, civilians eaten alive.\"",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CostaCostaSol",
                            "body": "China has a population of 1.4 billion, while South Korea has 51 million—a ratio of 27:1. By comparison, the Russia-Ukraine ratio is 3.8:1. China also spends three times as much on its military as Russia. And unlike Russia, they probably don’t have as many alcoholized officers stealing equipment from T-72 stockpiles. Don’t get me wrong—I sincerely hope they fail miserably.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GripAficionado",
                    "body": "On a completely unrelated note, how many seadrones you figure would be needed to blow up that thing?",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Rick_Flare_Up",
                            "body": "Well, if you take the stupid and vulnerable bridge out it kind of defeats its entire purpose. I’m going to say 1 well placed drone.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "GrafZeppelin127",
                                    "body": "That thing looks like a Taiwanese artillerist’s wet dream. Huge, valuable target that’s completely static? Lord.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Rick_Flare_Up",
                                            "body": "Really giving off meat grinder vibes this thing is lol.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Intelligent_Slip_849",
                    "body": "It would be an amphibious invasion into urban warfare, there's no way it'd be anything but an utter bloodbath",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Rick_Flare_Up",
                            "body": "That’s the reason to ideally avoid it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FBWSRD",
                    "body": "I can’t imagine how they would succeed. A hundred miles of water, onto a mountainous country with a shit load of people. Oh and don’t destroy the microchip factories, that’s mostly what you want.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "IVgormino",
                            "body": "As if those factories aren’t rigged to blow the moment any of those fancy landing ships start acting suspect",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Frap_Gadz",
                            "body": "If I was Taiwanese and it looked like they would fall I'd scupper the fabs. Only need some explosives in each clean room, enough to take out or highly damage the critical tools, and the place would be basically worthless, everything in there would need to be replaced, which China can't do for a lot of that equipment.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Rick_Flare_Up",
                            "body": "It was a terrible plan from the beginning. Maybe they should have just tried harder to build relations with them and the West instead of playing their own stupid power trip game they play. Which is ironic coming from an American right now, it wasn’t ironic a few months ago.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LordBrandon",
                    "body": "An opposed amphibious landing in the age of the transparent battlefield. Nothing a little volunteerist zeal can't overcome.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Hyperious3",
                    "body": "it will be, Even if the US sits it out, Taiwan has enough shit in reserve to make a D-Day assault basically impossible without resorting to nuking the beaches.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Rick_Flare_Up",
                            "body": "The PLA would take heavy casualties for sure.\n\nIt’s hard to tell if we would get involved or not. The current administration is playing their own game while playing Russia’s game. It’s stupid.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Is12345aweakpassword",
            "body": "~~USA - Over my dead body. Democracy must prevail!~~\n\nHave they said thank you?",
            "score": 852,
            "replies": [
                {
                    "author": "COMPUTER1313",
                    "body": "The smart move for Xi would be to feed Mr. Orange’s ego and personal wealth to get Mr. Orange to recognize Taiwan as a rightful part of the PRC. Thus being able to take Taiwan **with** US support.",
                    "score": 257,
                    "replies": [
                        {
                            "author": "Is12345aweakpassword",
                            "body": "Indeed. He’s already proven to be extremely pliable to Russias interests and state media talking points",
                            "score": 141,
                            "replies": [
                                {
                                    "author": "LB__60",
                                    "body": "He’s pliable to whoever pays him. I’m ashamed to live in the US",
                                    "score": 91,
                                    "replies": [
                                        {
                                            "author": "Dx_Suss",
                                            "body": "Didn't you people make at least 2 or 3 ammendments to the constitution cover this situation?",
                                            "score": 52,
                                            "replies": [
                                                {
                                                    "author": "Slut4Tea",
                                                    "body": "Trump is using a little known loophole in the Constitution called the \"who is going to stop me.\"",
                                                    "score": 37,
                                                    "replies": [
                                                        {
                                                            "author": "Dx_Suss",
                                                            "body": "Right, I never read past the First Amendment, so I'll assume there's nothing covering this eventuality either.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "NonCredibleDefense-ModTeam",
                                                                            "body": "**Your comment was removed for violating Rule 5: No Politics.**\n\nWe don't care if you're Republican, Protestant, Democrat, Hindu, Baathist, Pastafarian, or some other hot mess. Leave it at the door.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "LB__60",
                                                    "body": "Idk dawg. My family wasn’t able to vote until the 60’s and even now the gerrymandering in the area where I live basically makes my votes not count. Most Americans don’t have a say in anything that isn’t local politics, if even that. We have always been ruled by corporations.",
                                                    "score": 51,
                                                    "replies": [
                                                        {
                                                            "author": "Dx_Suss",
                                                            "body": "Right right, I'm sure James Madison couldn't have anticipated all that.\n\nOh well, gg as they say",
                                                            "score": 21,
                                                            "replies": [
                                                                {
                                                                    "author": "LB__60",
                                                                    "body": "I mean he signed a document that said I was 3/5 of a person lol. We’re definitely cooked tho",
                                                                    "score": 30,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Dx_Suss",
                                                                            "body": "My feeling is he signed more than just that, and some of it is still on the books.\n\nGood luck with everything, I hope it works out.",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LB__60",
                                                                                    "body": "Preciate it. Worst case, I can still leave the country and keep my veterans’ payments. Good luck wherever you are",
                                                                                    "score": 14,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "treegor",
                                                                    "body": "I mean Madison created a system that prioritized the interest of wealthy landowners. Now we have a system that prioritizes the wants of Wealthy Capital Owners.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "CharlesBronsonsHair",
                                                    "body": "we built a whole gun culture around keeping tyrants out of government. Turns out its all about getting the right kinds of tyrants into government.",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "LB__60",
                                                            "body": "That’s exactly why it exists actually",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "CharlesBronsonsHair",
                                                                    "body": "Im shocked to hear fascists were acting in bad faith",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "afoxian",
                                                    "body": "Laws are only worth anything if you enforce them.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SirNedKingOfGila",
                                            "body": "He's not being paid. It's **PURE** vanity. He'd do anything for somebody to complement him.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SyrusDrake",
                            "body": "One year ago, I would have considered US support for China ridiculous, *especially* under Trump. \n\nAnd now I'm at a point where Trump could announce an alliance with Iran and North Korea to invade New Zealand and I'd just be like \"Yea, sure, checks out\".",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "COMPUTER1313",
                                    "body": "> alliance with Iran\n\nMossad: “Time to pay a little visit to the White House.”",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Youutternincompoop",
                            "body": ">recognize Taiwan as a rightful part of the PRC\n\nthis is literally just the standard US diplomatic position for over 40 years lol.\n\n(to be clear I mean as in Taiwan being part of China)",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Exile688",
                            "body": "China threatening Canada with tariffs at the same time as the US is doing wonders for the US/Canada trade war in the favor of the US. So, ego is in the process of being inflated right now and it doesn't even matter if China gets the credit because it won't be a \"quick and easy\" trade war with all of Europe vs the US. If China can prolong it then there will be enough economic chaos for their invasion to occur with less sanctions than it would have 3 years ago.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "J0E_Blow",
                            "body": "The Taiwanese till wouldn't play ball.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "piponwa",
                            "body": "Didn't Trump create a scandal during his first administration by taking the congratulations call from Taiwan before China?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "NuclearWinter_101",
                            "body": "No lol. I think trumps hatred for communists goes beyond his ego.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "COMPUTER1313",
                                    "body": "“Psst, want some easy Macau casino licenses with lots of regulation exemptions? We’ll even throw in a 50% construction cost discount!”\n\nhttps://en.wikipedia.org/wiki/Gambling_in_Macau\n\n> Macau overtook the Las Vegas Strip in gambling revenues in 2007.[1] Since then, Macau has become known worldwide as the \"gambling capital of the world\",[2][3] grossing the highest amount of gambling/gaming revenue and greatly dwarfing all the other gambling centers/cities.[2][3][4]",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "super__hoser",
                    "body": "No and they weren't even wearing a suit!\n\n\nCan you believe it???",
                    "score": 82,
                    "replies": [
                        {
                            "author": "Dazvsemir",
                            "body": "I will get costume like yours after the war, ok?",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lord_of_pigs9001",
                    "body": "Those soldiers better be wearing suits.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "GripAficionado",
                            "body": "The worst ones usually are.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SirNedKingOfGila",
                    "body": "Exactly. If the Chinese hurry up quickly enough they can get it for free.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "J0E_Blow",
                    "body": "Honestly? Probably.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "barl31",
                    "body": "Taiwan actually provides the US with something.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "just_a_bit_gay_",
            "body": "[welcome back Roman naval siege engines](https://en.m.wikipedia.org/wiki/Sambuca_(siege_engine))",
            "score": 200,
            "replies": [
                {
                    "author": "Squidking1000",
                    "body": "When you read the wiki lots of \"unsuccessful\" thrown around in their performance review LOL.",
                    "score": 50,
                    "replies": [
                        {
                            "author": "WunderPuma",
                            "body": "Yet the Romans still got Syracuse, curious. Clearly, sufficient cannon fodder can overcome how badly these things work. Good thing China doesn't have sufi- oh uh.",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "24silver",
                                    "body": "Ridgway and the boys turning in their graves watching china winning using human wave tactics in big 20XX years",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tajake",
                    "body": "\"and was first used unsuccessfully,\"\n\n\nThe Romans were also noncredible?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Rocco89",
                            "body": "The Romans suffered one of their worst defeats at the hands of Arminius \"the son of Rome\" a guy they had literally kidnapped as a child together with his brother Flavus, from a Germanic chieftain of the Cherusci, a tribe that was actually allied with Rome. \n\nInstead of growing up bashing skulls in the woods, Arminius and his brother got the full VIP Roman education military training, political schooling, the whole deal. And Arminius thrived! He climbed the ranks, won battles and was on track for a glorious political career in the Empire. But for reasons unknown (midlife crisis? cultural identity issues?), he decided to nope out of Rome and return to his people. \n\nEven though his family was no longer in power among the Cherusci, he somehow managed to unite them, forge an alliance with other Germanic tribes that typically hated each other and then just for good measure completely kicked the Romans off the right side of the Rhine while wiping out at least 3 legions.\n\nIf that isn’t peak noncredible Rome, I don’t know what is.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "heckinseal",
            "body": "Xi has looked good in recent events by literally doing nothing. Compared to idiocy in Russia and US he comes off as a genius. This doesn't mean he is any smarter though. An invasion of Taiwan would be stupid, and xi may just be dumb enough to do it. I predict it will be Aug 1 2027 for the 100th anniversary of the founding of the PLO. This is a dumb reason to invade, but wars have been started for dumber reasons. It will be a mess, china won't be fully prepared, they will not have ramped up their nco corps in time, but I bet they will still do it.",
            "score": 380,
            "replies": [
                {
                    "author": "ProperTeaIsTheft117",
                    "body": ">wars have been started for dumber reasons\n\nKid called War of Jenkins' Ear",
                    "score": 134,
                    "replies": [
                        {
                            "author": "OREOSTUFFER",
                            "body": "Kid named Football War\n\nKid named War of the Bucket",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "LeMe-Two",
                                    "body": "Kid named War of the cow (Poland)",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "Spiritual_Ask4877",
                                            "body": "Kid named Ice Cream War",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HeavyCruiserSalem",
                    "body": "PLO? Like Palestina Liberation Organization? I think u mean PLA",
                    "score": 47,
                    "replies": [
                        {
                            "author": "khornebrzrkr",
                            "body": "Unless?",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "heckinseal",
                            "body": "Lol yeah.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "posidon99999",
                            "body": "Splitters!",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "IamJames77",
                            "body": "pot-limit omaha",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "COMPUTER1313",
                    "body": "Xi could wait until after Mr. Orange has purged the US military leadership to replace them with loyalists and the SECDEF gets his way with a 40% budget cut to the DoD. That wouls be the perfect time to make a move.",
                    "score": 82,
                    "replies": [
                        {
                            "author": "Roboticide",
                            "body": "It was their own Sun Tzu who said never interrupt your enemy when they're making a mistake.\n\nGiving them a reason to not cut the budget before it's actually in place seems like a pretty big interruption.\n\nBut honestly given how the US is treating Ukraine, I have no real confidence the US would back Taiwan in the event of an invasion even if the budget got boosted.",
                            "score": 61,
                            "replies": [
                                {
                                    "author": "GripAficionado",
                                    "body": "Just in time for the Europeans to start rearming themselves, not to mention South Korea and Japan who is doing the same.",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "confirmedshill123",
                                    "body": "I've been saying since the Ukraine war started there's a 0 percent chance we support Taiwan. \n\n\nIt's far easier to load up a train in Berlin and ship it to Kyiv. It's FAR harder to get that same equipment across an ocean to an island less than 50 miles off the coast of the aggressor.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Youutternincompoop",
                                    "body": "should go back and tell that to the Argentina Junta lol, the Falklands war happened just before the British navy was set to be heavily scaled back in size.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SyrusDrake",
                            "body": "Wait until all HMMWVs have been replaced by Tesla Cybertrucks and watch them get stuck in the sand during amphibious landings.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "Squidking1000",
                                    "body": "Or burn when salt water immerses the batteries.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "goodbehaviorsam",
                            "body": "Not really, Xi is on a clock; the clock being the optimal time for an invasion of Taiwan being 2025 to 2030.  Iran's mostly contained at this point and Putin wants/needs a breather from Ukraine, so Xi cant even rely on a multi-pronged international response to stretch out America's military power due to the haphazard way Trump is doing things.  The earlier he starts a conflict in Trump's term the better it will go for him because China still has excess men and he has purged the CCP and the Chinese military of dissidents towards his eternal rule, and the US hasnt fully pivoted to Asia nor has their 6th gen fighter, has not fully completed and operational island chain of new airbases and most importantly dont have the necessary huge stockpile of the long range missiles for air to air combat.  The longer Xi waits the worse the war will go for him especially if he waits out Trump's term because then a re-armed European intervention into the Pacific is back on the table and the odds by then would have gotten worse.\n\nPutin sold Xi up the river because at the end of the day Russia and China are only allies of convenience.  The US is pulling out of Europe which unfortunately lets Putin exert more influence into Europe and testing the limits of the EU and an America-less NATO as the US pivots from Europe to Asia because Trump seems to believe that Europe is not going to offer much help if any in a Pacific conflict so he is not going to honor a lot of European commitments, and Europe will mostly likely half-ass its commitments to the US say, like in Asia.\n\nTL;DR:  Xi's best chance at taking Taiwan is like right now before the West re-arms further and the US further entrenches its island chains around China.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "TheArmoredKitten",
                            "body": "Blindly hacking at the DoD budget is the single most un-American fucking thing you can do. It's blatant insanity.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GripAficionado",
                    "body": "> I predict it will be Aug 1 2027\n\nIf anything it would be in April that year so that it could be announced on the 100th anniversary that China has been \"reunified\".",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Firecracker048",
                    "body": "It would be great to watch J6s and J20s in action to see they really are still a generation or two behind and have tons of flaws that were never discovered before",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Fauxyuwu",
                    "body": "I hope skorea, japan and europe mic will have ramped up by then and that most western nations will support to repel china",
                    "score": 12,
                    "replies": [
                        {
                            "author": "GripAficionado",
                            "body": "It's going to be up to the countries in the region with navies and whatever countries who has developed good sea-drones by then. So... Ukraine might have an interesting task in helping out in the future.\n\nThe biggest threat to Taiwan will be a naval blockade, so submarines and sea-drones will be critical.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hebdomad7",
                    "body": "RemindMe! 866 days ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Chernould",
                    "body": "If it’s anything current USAF leadership has been consistently stating that a war with China could happen as early as 2027 based on their predictions, at least that’s what my higher leadership keeps saying.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "YorhaUnit8S",
            "body": "Credible question, how do they expect to use it? That thing looks like it would take a lot of time to set up and be an easy target.",
            "score": 228,
            "replies": [
                {
                    "author": "Yothatsharry",
                    "body": "Probably for after the initial attack/invasion",
                    "score": 218,
                    "replies": []
                },
                {
                    "author": "SamtheCossack",
                    "body": "Not really a first wave sort of thing. Looks more like a contingency if they don't get control of the harbors early on, and have to land follow up waves on the beach.",
                    "score": 186,
                    "replies": [
                        {
                            "author": "YakovAttackov",
                            "body": "Trenches in Ukraine, nationalists in Germany, and Gallipoli offensive plans for Taiwan. \n\nWW1 Bros, we're so back.",
                            "score": 70,
                            "replies": [
                                {
                                    "author": "MooningCat",
                                    "body": "A colleague of mine is the great-niece of Manfred von Richthofen, should I ask her to pass the secret knowledge?",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "killer_by_design",
                            "body": "It definitely could be a first wave thing. \n\nSpecial forces in ahead of the invasion forces first. Targeting key installations and identifying key defences. Then you send in the jets, hitting ID'd key defences and infrastructure. Harass identified defences with SF and Jets. \n\nThen specialised forces are deployed, Paras and Marines. Air and sea assault. The ship then lands once a beachhead is established and there forms your initial invasion force. \n\nSetting this thing up is a <1hr job when the beach has been secured by your specialised forces. \n\nYou then use that as a base of operations to then go out and invade the rest of the country. \n\nAir supremacy in an invasion is an equally important thing to naval power projection and supply. Everything after that is just building on the opportunity created by your navy and air force. \n\nNavy power = Air Power > Land forces.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Z3B0",
                                    "body": "First wave needs to secure the beaches, so if that thing needs them secured and 1 hour to setup, it's not an assault landing ship, therefore not a first wave ship. Might be second close behind.",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "killer_by_design",
                                            "body": "Sorry you're misunderstanding. The first wave lands and secures the beach. \n\nThat's specialised forces like marines who will have amphibious assault capabilities such as hover craft, landing craft, etc. Paras would parachute in and secure from depth, ahead of the beach, rather than _at_ the beach. \n\n>it's not an assault landing ship,\n\nCorrect, it's to deliver the invasion force who will capture the Island. Not the beach front. That's still \"the first wave\" of an invasion it's just not the very first step. It's still a day one activity.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "SamtheCossack",
                                                    "body": "That is by definition the second wave though...",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "killer_by_design",
                                                            "body": "This is semantics though. \n\nThe amphibious force isn't large enough to invade the islands, and you can't land your brigades without this thing. \n\nThey go hand in hand. \n\nIf it helps you to think of it as the second wave then fine but it's all the same thing. They go hand in hand. \n\nIf you want to be really pedantic the first wave was cyber warfare starting 20 years ago.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "SamtheCossack",
                                                                    "body": "That isn't pedantic, lol. That is how operations are sequenced. \n\nYou don't take over a county all in one step, and this isn't an asset that is used until many other conditions are already fulfilled, making it not a first wave option. \n\nI mean if step 1 of your plan is \"Take Taiwan\" then, yes, it is involved in the first step. But we generally expect military planning to have more nuance than that.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "killer_by_design",
                                                                            "body": "This is peak pedantic. \n\nStep one of capturing an island is to land a sufficient force. \n\nHow do you do that? Well, you follow the steps I outlined. \n\nThe fact it is not _the very first thing landing_ is exactly the pedantry I'm talking about. \n\nSeriously mate, give your head a wobble.",
                                                                            "score": -3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SamtheCossack",
                                                                                    "body": "Pedantry is not worth doing in half measures! \n\n(... but first wave does mean the first things landing, lol. That is why it is called the first wave)",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SamtheCossack",
                                    "body": "I am pretty sure the PRC would have been dumb enough to use that as the main plan 20 years ago. I am pretty sure they have learned better by now. \n\nHere is the problem with that sort of plan. It relies on multiple things going right in a row. Which is just not how war works. If you are relying on something like this to get your heavy equipment onto a beach, and you mess up any of the previous steps, you are fucked. If your SEAD is anything less than perfect, you are fucked. If the Marines fell to establish a perimeter, you are fucked, if the Japanese intervene, you are fucked, if your intel fucks up an the enemy is using more capable jamming capabilities than you thought, you are probably fucked. \n\nIt is easy to draw up complex sequenced plans on a white board. What sucks is when the Beachhead Commander doesn't have radio contact with half his subordinate elements, the ones he does have a screaming at him to land the heavy armor before they are overrun, and he doesn't know if the enemy artillery still has precision fire capability. If he commits two or three of these and they get obliterated, he is going to lose the beachhead. If he doesn't commit them and the enemy counterattacks before heavy armor lands, he loses the beachhead... History is not going to be fair. If he makes the right call, he will be a hero, if he makes the wrong call, he is will be removed from command (And almost certainly disappeared). \n\nThe TLDR is that this asset isn't reliable for the first wave. IF you pull it off, it makes things go easy, but using it requires getting a deep draft vessel close to the shoreline, and it is huge and valuable target. Realistically, this thing is going to be unloading an armored brigade or more. That is just a catastrophic amount of eggs to put in one basket. \n\nMy actual bet is that this isn't really for deployment in an invasion of Taiwan at all. It is probably primarily for operations in Africa and South-East Asia. Its roll in an invasion would be weeks after the initial assault, to reposition Armored Brigades along the coastline.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "ecolometrics",
                                            "body": "I'd think that before they invade, they need to practice it first. This might just be the basic preparations. There are multiple ways of doing this, and there are downsides with all of them. If they were smart, they'd find an island somewhere and do a red/blue team a hundred times.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "MooseyGooses",
                                                    "body": "You can practice the same scenario 1000 times and it can still easily go to shit in ways they couldn’t possibly plan for",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "killer_by_design",
                                            "body": "The only thing that makes me think this is for Taiwan is that allegedly the bridge span was designed for Taiwan's corals that surrounds them. \n\nThat's all I've got to go by. \n\nI get what you're saying but if you have a large enough amphibious assault force then this isn't really the initial assault asset but still functionally is.\n\nWhat I mean is that you aren't reliant on it for securing the beachhead but can still count on it for the later parts of the operation.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DarkScarb",
                                            "body": "Not that I disagree, but I’m sure Japan is only a defence force for its own borders. Not sure if they’d actually come to another countries aid like that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SamtheCossack",
                                                    "body": "Which is exactly why them intervening is the sort of thing you should have a contingency for. \n\nJapan doesn't WANT to get involved, but that doesn't necessarily mean they won't. Especially if they get a chance to absolutely fuck over the Chinese short of overtly declaring war.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "NovelExpert4218",
                                    "body": "I mean... not really.  Any credible invasion of Taiwan is going to take several weeks to potentially several months and not be a lightning speed type thing.  That type of thing was the thinking behind the Russian SMO and we all know how great that went.  Chinese military theory like [systems destruction](https://old.reddit.com/r/LessCredibleDefence/comments/umy3lz/will_the_chinese_navy_in_the_future_operate_on_a/i85j8ju/?context=3) heavily revolves around the concept of creating friction.  Not at all new concept for the PLA, goes back to Maos \"on protracted war\" (which is basically Clausewitz \"at home\" or broken down to be carried out by a then largely illiterate populate), however its been very much modernized and brought into the 21st century to the point where its not too different from the DODs doctrine of operational warfare.\n\nAssuming the Chinese follow their own doctrine, not only will the Taiwanese military be drastically eroded before a landing is actually attempted, but so will likely the civillian population.  [Systems destruction actually sees military and civil infrastructure as interlinked](https://www.rand.org/pubs/research_reports/RR1708.html) and therefore legitimate game.  With Taiwan thats really bad, because not only do they import 70% of their food and literally 100% of their energy (pretty much all of which is stored in unhardened facilities and extremely vulnerable to Chinese attacks) but their power plants, water treatment, sanitation facilities, and pretty much every other civil service you can think of can likely easily be destroyed overnight as well, same with the majority of Taiwans fibreoptic cables, basically just cutting it off from the internet.  Taipei is one of the most developed cities in the world, and also one of the most densely populated, can you at all imagine the psychological terror that would set in when this first world population suddenly not only has all its creature comforts taken away, but becomes emaciated from lack of food or water, and has to contend with literal shit filled streets.  The Taiwanese woln't really have internet at this point either, so will not know what is going on outside.  The Chinese will be bombarding them with propaganda, which if things get bad enough, a lot of the population might give into.\n\n[Pretty good writeup by a IC analyst that used to be on reddit who made a comparison between this and Mauripol](https://rentry.co/tw-human-material-state)",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sakezaf123",
                            "body": "Still it looks like something that a single missile or larger drone getting through would just completely invalidate.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "SamtheCossack",
                                    "body": "Probably is. This isn't the sort of thing you use when shells are still flying. This is what you use to land heavy armor after you already have the area secured. \n\nOr, more practically, this is what you use to land an Armored Brigade in Ethiopia or Borneo, or some other part of the world where you can't, or don't want to, use the ports. \n\nIts use in an invasion of Taiwan would probably come weeks or months after the initial landing, moving forces to where they would be most useful around the island. This is NOT the sort of asset you use while enemy artillery is still a thing that exists, and has range on the beach.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Natefire78923",
                                    "body": "still have to have enough missiles and drones left after fighting their initial waves along with senors to feed your effectors in a location to do the targeting.  That's also not accounting for PLA countermeasures, which I'd assume prime assets like invasion bridges will be well protected by anti air and jamming assets.  ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MrIDoK",
                            "body": "Even if they manage to capture the harbors they may have been damaged enough to need the artificial harbor to bring in enough supplies. I could bet that any plan for the defense of Taiwan includes sabotaging the port infrastructure to hinder the attacker as much as possible.\n\nBut besides Taiwan it may be very useful in other theaters in asia or africa, it's the kind of thing that you want to have experience with if you intend to project power abroad. The US have been showing for the last century how much importance there is in logistics if you want to be able to influence other places militarily.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 27,
                    "replies": [
                        {
                            "author": "Eclipsed830",
                            "body": "> The runner-up political party in Taiwan got 38% of the democratic vote in 2020, and wants reunification with mainland China but quibbles on the exact details with the PRC.\n\nNo, they don't.\n\nThere is no major party in Taiwan that supports unification, especially with the PRC.\n\nThe only party currently supporting unification here is the New Party, and they haven't won an election on the national level since like 2004.\n\nhttps://en.wikipedia.org/wiki/New_Party_(Taiwan)\n\n----\n>If I were the Chinese I'd bang the war drum as loud as I could, scare people into voting for reunification on good terms, consolidate power, and then slowly water the terms down later.\n\nAs a Taiwanese person, I assure you this would never work. Our ancestors lived under a single party authoritarian dictatorship, we won't ever do that again.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "Independent-Mix-5796",
                                    "body": "Is the desire for freedom by a willingness and ability to fight, though? Last I checked, Taiwan’s military is ill-equipped for any prolonged resistance against the PLA. I could be wrong though.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Eclipsed830",
                                            "body": "We can never outgun the PLA... That doesn't mean Taiwan won't fight.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Independent-Mix-5796",
                                                    "body": "Hence why I asked about both willingness and ability. I’ll be blunt, there’s been multiple reports done over the past decade indicating that the majority of Taiwanese men, especially those under 30, are actually unwilling to serve and fight.\n\nYou have a better grasp on this than me, is this actually the prevalent attitude,  or is it more nuanced and that they’ll still defend Taiwan if push comes to shove?",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "Eclipsed830",
                                                            "body": "Can you cite those sources?\n\n\nI don't know anyone that feels like that here. Nobody wants to go to war, but nobody wants to become part of China.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "Independent-Mix-5796",
                                                                    "body": "Never mind, my sources are out of date. The polls in particular that was in my mind was this one from 2022: https://www.businesstoday.com.tw/article/category/183027/post/202202080002/\nThat poll seems to have been called into question by other analysts and more recent polls indicate a stronger support to fight were China to invade. My bad!",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "AG4W",
                                                            "body": "Those polls are the fucking dumbest thing to ever exist.\nNot a sane person in a functioning society will respond seriously, but once bullets start flying the will to fight jumps up over night barring incompetent leadership every single time.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Independent-Mix-5796",
                                                                    "body": "Except that Taiwan has mandatory conscription, therefore everyone in Taiwan more or less has a sense of the quality of their military and leadership. Therefore, I think the polls might not nail an exact representation but can still give a glimpse of what’s out there.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AG4W",
                                                                            "body": "So have many other countries, especially in Europe, and those polls rollercoaster up and down every other week.",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Independent-Mix-5796",
                                                                                    "body": "I did some more digging into the poll that I had in my head and found that it is both questionable and outdated (quite a bit of change in the past three years—see other comment). \n\nGood points and good callout!",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "strayduplo",
                            "body": "This tracks with my thoughts as well -- I don't think either the younger Mainland Chinese or the younger Taiwanese really have the appetite for war. China's Tier One cities are very modern and developed, so perhaps to the Taiwanese, it's not such a bad thing to be Chinese now, as long as they still allow some semblance of autonomy and allowing them to retain their unique Taiwanese culture. There's precedent, like how Traditional Chinese characters are still used in Hong Kong... it wouldn't be such a stretch to continue that policy in Taiwan. (I mean, at least until they decide those unique qualities are politically inconvenient, and therefore must be purged.) North and South Korea are right next door to look towards; in comparison, Taiwan reuniting with the Mainland seems much less daunting.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Eclipsed830",
                                    "body": ">t's not such a bad thing to be Chinese now, as long as they still allow some semblance of autonomy and allowing them to retain their unique Taiwanese culture. There's precedent, like how Traditional Chinese characters are still used in Hong Kong... it wouldn't be such a stretch to continue that policy in Taiwan.\n\nImagine thinking like this... hahahahaha wtf",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "strayduplo",
                                            "body": "TBF I'm not an expert on Chinese/Taiwanese geopolitics, but I'm Chinese diaspora, so most of my thoughts are from a soft power lens. There's always been plenty of cross cultural collaboration and trade despite political status, so it's not like China and Taiwan have been entirely divorced from each other since 1945.\n\nI was chatting up classmate at my HS reunion who turned out to be an analyst with the Navy, specifically in China-Taiwan relations. He was of the opinion that China's takeover of Taiwan will not be military, but rather economic and political. It tracks with my experience as well-- my brother is a tech CEO in China, with factories in Taiwan. China has too much to lose to try aggressive military action, because it would just entrench independent sentiment among the populace.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Eclipsed830",
                                                    "body": "We were never married. Taiwan and China are two completely different countries and at no point has Taiwan been part of the PRC. We are distant cousins... The same way you are disconnected from China as diaspora.\n\n\nThere will never be an economic or political takeover of Taiwan. Losing our freedom and democracy is a red line that cannot be crossed. China has been using it's political and economical influences over Taiwan for decades, and we have only gone further apart ",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "BreathPuzzleheaded80",
                                                            "body": "What year did Taiwan stop being China?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Eclipsed830",
                                                                    "body": "Taiwan stopped being part of China some 15,000 years ago when the ice bridge melted and the Taiwan Strait was formed. ",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BreathPuzzleheaded80",
                                                                            "body": "Hainan island isn't part of China according to your logic.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Eclipsed830",
                                                                                    "body": "It is part of the PRC.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "BreathPuzzleheaded80",
                                                                                            "body": "Hainan stopped being part of China some 15,000 years ago when the ice bridge melted and the Hainan Strait was formed. ",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Eclipsed830",
                                                                                                    "body": "Cool?",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NovelExpert4218",
                    "body": ">Credible question, how do they expect to use it? That thing looks like it would take a lot of time to set up and be an easy target.\n\n[To quote Rick Joe](https://www.reddit.com/r/WarshipPorn/comments/1jay5zq/comment/mhpsm4u/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n>Prior to these barges, the vision for this \"artificial harbour\" phase of an amphibious assault involved the PLA [using](https://i.imgur.com/Gem5gC2.jpeg) their [equivalent](https://i.imgur.com/dXIDzzx.jpeg) of something like JLOTS, which of course as we've seen in Gaza (as well as surmisable through common sense), has a few weaknesses in choppy water. These new barges are likely to offer significant greater stability, as well as likely greater width of transport lanes from the sea to shore, while retaining the ability to be modular and adjust to the total distance they want the unloading ship to be from the shore (draft considerations).\n\n>But the prerequisites for these barges to be used in a Taiwan contingency, will likely be not much different to when they had their prior JLOTS-esque equivalent pier; they still exist to form an artificial pier to unload non-amphibious capable AFVs, trucks, logistics, artillery from sea to shore...\n\n>... which is preceded by amphibious capable AFVs and helicopters conducting a genuine amphibious assault and attaining an initial beachhead and pushing inwards while supported by persistent aerial sensor overwatch and fire support and organic naval air defense...\n\n>... which is preceded by days to weeks of extensive preparatory fires from air and sea launched missiles and munitions and cross strait long range rocket artillery and SRBMs in conjunction with extensive EW, ISR, ELINT/SIGINT to suppress and destroy remaining ground forces, C4I, AShM bases and TELs, artillery units and ammo dumps in conjunction with an air and naval blockade...\n\n>... which is itself preceded by an overall air-naval-missile (and non-kinetic EW+cyber) systems destruction campaign across the strait by the PLA to seize air superiority and sea control over and around Taiwan itself, involving the destruction of ROCAF aircraft and ROCN vessels either in the air or at sea (respectively) or more comprehensively at their bases and ports, while also carrying out suppression of ROC military IAMDS, and targeting high level C4I nodes and political and service level command/control as well...\n\n>... which finally would be preceded by likely weeks and months of gradually escalating cross strait political rhetoric where efforts to find offramps to military action would be extensively done by all parties involved, but ultimately end in failure.\n\nTLDR: if these things are showing up on Taiwanese beaches, the conflict has already basically been decided.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "rompafrolic",
                    "body": "It's the sort of thing you deploy when you're not certain if existing harbours will be functional during and after the invasion. Mulberries during and after D-day were used because the Channel ports were all blocked by scuttled warships and freighters, so only shallow draft ships could get in and out. Naval invasions live and die depending on the ability to resupply the troops you've just landed.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "LordBrandon",
                    "body": "You can see it here being used to it's full potential. Internet propaganda.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "wampenrettich",
                    "body": "https://m.youtube.com/watch?v=Klkpk_hO4FQ\n\nThis video explains everything.\n\nGreat channel.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Natefire78923",
                    "body": "Probably sets up fairly quickly.  Let's say they build twenty.  Suddenly now the number of places heavy supplies can potentiallybe taken in by an invader increases dramatically.\n\n\nAlso why would China be sending the invasion forces in immediately when Taiwanese defenses are intact?  Shouldn't it be expected they cross the straits after a prolonged air campaign and naval blockade?   These bridges survivability goes way up if they only get pulled out out once local air and naval superiority , if not complete supremacy, is achieved.   I wouldn't expect China to send in infantry in large numbers until Taiwan is a wasteland with no fuel or ammo left.   ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "retailhusk",
                    "body": "China wants to operate under full air supremacy in Taiwan. This is the kind of thing you deploy after you've degraded the enemy's ability to fight. I think any invasion of Taiwan is going to start with missiles, lots and lots of missiles. Aimed at every hanger, runway, helicopter pad, SAM site and anything else that has anything remotely to do with the Taiwanese airforce. China sees a rising isolationist US who might take a more back seat approach to Taiwan. A few years ago us getting involved was a given. But now we have an isolationist administration who thinks our allies are ripping us off, and face a much stronger china. \n\nI think China takes the W invading Taiwan. A bloody and hard fought W but I think by 2030 Taiwan will be occupied by the People's Republic",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HeavyCruiserSalem",
            "body": "China's final warning",
            "score": 47,
            "replies": [
                {
                    "author": "99999999999BlackHole",
                    "body": "They ran out of ink for the red lines",
                    "score": 38,
                    "replies": [
                        {
                            "author": "hebdomad7",
                            "body": "Lines? They are rolling on a red carpet... ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FrisianTanker",
            "body": "I wonder how many missiles Taiwan has pointed straight at the Three Gorges Dam",
            "score": 94,
            "replies": [
                {
                    "author": "Roboticide",
                    "body": "Hundreds right?  600+ miles through heavy air defense, and that thing is massive.  Not like a couple missiles will take it out, it'd need to be dozens.",
                    "score": 50,
                    "replies": [
                        {
                            "author": "EnricoLUccellatore",
                            "body": "you only need a hairline crack to cause a catastrophic failure, and bunker buster ammunition is incredibly strong",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "Roboticide",
                                    "body": "Aren't bunker buster munitions more like dropped bombs though?  I didn't think there were super-sonic cruise missile bunker busters, but I could be wrong.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "EnricoLUccellatore",
                                            "body": "I believe so but my source might be a schizopost in this very subreddit",
                                            "score": 28,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ytzfLZ",
                                    "body": "No, the Three Gorges Dam is a gravity dam, and a small breach will have little effect on it because it is already collapsed.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "J0E_Blow",
                            "body": "What's stopping them from just firing a 100\\~ missiles straight up into the upper atmosphere to avoid AA and then having them enter a vertical terminal phase at mach-fuck to damage the damn dam?",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Roboticide",
                                    "body": "Probably the calculus of \"if they take a high ballistic trajectory, every radar on the continent will see them coming, versus if they fly low they might actually avoid radar.\"\n\n\nIDK, maybe they'll try both.",
                                    "score": 18,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "doobyscoo42",
                    "body": "I think if China invaded Taiwan, many Chinese would react with \"ok, great. anyways, about my mortgage...\" If Taiwan retaliated by attching the Three Gorges Dam, many Chinese would react with \"ok, you want to be funni, let's be funni.\"",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "reddebian",
                    "body": "Hopefully enough",
                    "score": 41,
                    "replies": []
                }
            ]
        },
        {
            "author": "Uranium_Heatbeam",
            "body": "Big brain Xinnie the Pooh.\nYour youth populace can't complain about 996 culture when they've been conscripted.",
            "score": 84,
            "replies": [
                {
                    "author": "floridachess",
                    "body": "or the other big brain move, is that all these men that will never have a wife due to the one child policy got to be put to use somewhere.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "Cardborg",
                            "body": "How many family names do you think will be snuffed out on Taiwanese beaches after their only son gets conscripted?\n\n\nOr so you think they'll have combat semen-extraction teams?",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "Count_de_Mits",
                                    "body": "They're called apothecaries and it's called extracting the Holly Emperors gene seed you filthy heretic",
                                    "score": 23,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "COLSandersEnjoyer",
                            "body": "Kid named rapidly aging population and rapidly shrinking pool of fighting age males",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "Omegaxelota",
                                    "body": "Honestly I wouldn't count on China running out of people to feed into the meatgrinder when it comes down to it.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "COLSandersEnjoyer",
                                            "body": "Of course not. But will China view that trend in the same way? They understand the costs of a Taiwan invasion in terms of bodies, but will they throw the dice prematurely if they think they have to act sooner?",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LordBrandon",
                    "body": "If you were going to lie flat anyway you might as well do it on a beach neat Taipei surrounded by stacks and stacks of your closest comrades.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ecumnomicinflation",
            "body": "OG USA: go ahead, pull my finger.\n\ndownload trump USA: go ahead, put it in my ass.",
            "score": 115,
            "replies": []
        },
        {
            "author": "NovelExpert4218",
            "body": "I mean, the new mulberries are 100% for Taiwan, but new 6th gen (or J-36, whatever you really want to call it), is likely not.  Like their carriers and the H20 bomber program, its more to increase projection and become a direct competitor to the US, with their military being able to carry out all the same missions.  It would definitely be useful in an invasion (if the PLA winds up fighting the US/JSDF anyway, ROC just complete overkill) but don't think its a game changing final piece of the puzzle or anything.  Probably woln't see this thing in any actual numbers until around a decade,",
            "score": 21,
            "replies": []
        },
        {
            "author": "Enron__Musk",
            "body": "Too credible lmfao",
            "score": 17,
            "replies": []
        },
        {
            "author": "Timart7",
            "body": "It's nothing, I'm all in",
            "score": 14,
            "replies": []
        },
        {
            "author": "SilkyZ",
            "body": "It's been an open secret that West Taiwan wants to become Best Taiwan by absorbing it. The question is when, which boils down to between Soon™ and Later®.\n\nWith the Family Trumpster in office, and seeing the response Ukraine has been getting, I'm leaning on the Soon™ option. Most of Europe doesn't care too much for the defense of Taiwan as it's been mostly an American affair, and the current administration is likely to take a blind eye to the endeavor. I say it will be at the end of this election cycle.",
            "score": 40,
            "replies": []
        },
        {
            "author": "Calm_Relation7993",
            "body": "They built that in a noncredible amount of time. Would have taken the US 7 years.",
            "score": 9,
            "replies": [
                {
                    "author": "Omegaxelota",
                    "body": "US shipbuilding is a kek tbh, the USN needs to start cooperating with Japan and SK to ramp up production otherwise they wont have a chance in hell of competing with PLAN shipbuilding.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Space_Gemini_24",
            "body": "What's with the Mulberry Silent Hill megalophobia-inducing AI-looking image???\n\nChat, is this real?\n\n(real question tho')",
            "score": 16,
            "replies": [
                {
                    "author": "SouthernCareer",
                    "body": "It is, and China plans to use this same as Mulberry Harbor was used.\n\n[https://www.newsweek.com/video-china-special-barge-taiwan-invasion-beach-landing-2044261](https://www.newsweek.com/video-china-special-barge-taiwan-invasion-beach-landing-2044261)",
                    "score": 11,
                    "replies": [
                        {
                            "author": "LordBrandon",
                            "body": "What? Those are just completely normal car ferries for when you want to bring you very heavy cars to the beach.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "A7V-",
            "body": "If I was a guided bomb, I'd be drooling.",
            "score": 8,
            "replies": []
        },
        {
            "author": "theLV2",
            "body": "These bargebridge things look ominous in the fog...",
            "score": 5,
            "replies": []
        },
        {
            "author": "DutchFarmers",
            "body": "How would Taiwan fare in this invasion scenario. Seems like they would get steamrolled even if they can mount a defense",
            "score": 4,
            "replies": [
                {
                    "author": "Omegaxelota",
                    "body": "There was a CSIS wargame about this released in 2023 and it basicly entirely comes down to whether or not US forces commit to a defence of Taiwan. If Taiwan is left hanging out to dry then it falls in about 70 days with around 70,000 PLA casualties and 23,100 killed. They sink about 17 amphib ships and a similar amount of escorts and take out 240 combat aircraft.\n\nHonestly there's simply not much Taiwan can do when its enemy is capable of striking into Taiwan with MLRS fired from the mainland. Without US support the PLA quickly attains air superiority and lets loose the PLARF which comftourably smashes Taiwan with ballistic and cruise missiles, MLRS, basicly nearly evreything it has in its arsenal aswell as a strategic bombing campaign led by the PLAAF. Three weeks into the conflict the Taiwanese military runs out of shells so really the outcome is without a doubt a total PLA victory.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Joazzz1",
                            "body": "Seventy fucking thousand casualties, over twenty fucking thousand dead, and a good deal of those probably on the bottom of the sea and never to be recovered - all because some smallballs limpdick shitface closet-cocksucker tyrant wants a piece of land and and its funny electronics\n\nAnother flawless victory for the meat wave dictatorships I guess???",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SgtChip",
                    "body": "I feel like the results will rely heavily on the PLA making it to the beach. The PLA can absolutely throw more men at the problem than the Taiwanese army, but that wouldn't be worth much if the landing crafts get hit with anti ship missiles before they can get their troops to shore. The PLAAF will need to lock down the airspace to protect their landing ships from air attack, and likewise the PLAN needs to keep it safe from attack submarines or surface warships",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "pole_fan",
                    "body": "I honestly doubt that anybody could tell with a high amount of certainty after russias 3 day special operation. The last time the PLA fought a proper war was like 50 years ago and all they did was to occupy like 3 cities near their border. This would be the biggest naval invasion since Normandy by a navy that is mostly occupied with bullying indonesian fishermen in the south chinese sea. They could probably starve the island to death, the question is just if they are willing to take taiwan on a pyrrhic victory.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Arthur-Bousquet",
            "body": "I’m going to Taiwan one semester next school year for studies, wish me luck everybody lmao",
            "score": 5,
            "replies": []
        },
        {
            "author": "Trigger_Fox",
            "body": "With the pushover oranges burning down america this is a pretty good time to invade.",
            "score": 8,
            "replies": []
        },
        {
            "author": "AKJ90",
            "body": "2027 baby",
            "score": 3,
            "replies": []
        },
        {
            "author": "GB36",
            "body": "That Temu Mulberry looks ominous as fuck, ngl. If I were Taiwanese I would want some funni up my sleeve.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ThePickleConnoisseur",
            "body": "Look!  A massive and stationary target!",
            "score": 4,
            "replies": []
        },
        {
            "author": "BigCHF",
            "body": "Chat, what will happen first:  the A-10 gets its first floating bridge/boat kill or the F-35 gets its first Three Gorges Dam kill?",
            "score": 3,
            "replies": []
        },
        {
            "author": "ArachnomancerCarice",
            "body": "These damn mixed breeds are getting out of hand. Pairing up a boat with a mining earth-mover is just ridiculous. Look at those tiny legs! Poor thing won't be able to run like all the others.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Wolfman038",
            "body": "my bet is 2026 to align with the anniversary of the PLA",
            "score": 3,
            "replies": []
        },
        {
            "author": "SomeGuyNamedPaul",
            "body": "It's all a psych-out, they're going to take over the Amur River and everything south of that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "my_name_is_nobody__",
            "body": "The worst part is Donald will watch it happen. Maybe Japan and Korea step up but I doubt it",
            "score": 2,
            "replies": []
        },
        {
            "author": "Les_Bien_Pain",
            "body": "They're preparing in anticipation of the balkanization of the United States in the 2030s.\n\nSuddenly a lot of free real estate and stuff.",
            "score": 2,
            "replies": []
        },
        {
            "author": "niTro_sMurph",
            "body": "That is a sexy plane though. God I love diamond shaped planes",
            "score": 2,
            "replies": [
                {
                    "author": "LordBrandon",
                    "body": "Really? I think it's the least attractive stealth aircraft, and that's saying quite a lot.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "niTro_sMurph",
                            "body": "It would look better with a more clean diamond shape. Either shorten the wings so it's a clean line from the nose the the point where the angle changes to go to the butt or shorten the nose. Basically a straight line from nose to wingtip would look better probably",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "afk2448",
            "body": "Long bridge good idea only when good AA",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "This post is automatically removed since you do not meet the minimum karma or age threshold. You must have at least 100 combined karma and your account must be at least 4 months old to post here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NonCredibleDefense) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Edgelordgo",
            "body": "Gorgeous. I love these pics as well as these ships.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NuclearWinter_101",
            "body": "What the hell is even that",
            "score": 1,
            "replies": []
        },
        {
            "author": "pentox70",
            "body": "Do you think they'll load thousands into landing vehicles and claim it's for military maneuvers?",
            "score": 1,
            "replies": []
        },
        {
            "author": "adjective-noun-one",
            "body": "I can't wait for the \"peacetime\" president to roll over and abandon Taiwan too 😊",
            "score": 1,
            "replies": []
        },
        {
            "author": "sr603",
            "body": "Lmfao I was thinking the same thing when I saw the pictures \"oh thats like a mulberry\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "barukatang",
            "body": "They can't even make an original air force emblem",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent_Slip_849",
            "body": "- Sees title \n\n- Of course I get this news from Reddit\n\n- Nevermind, nothings happening",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheMeepster73",
            "body": "That is a very big unarmed, and unarmored target. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Few_Storm_550",
            "body": "what in the doohickey",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperPacocaAlado",
            "body": "China will be the first country to lose an aircraft carrier to artillery fire.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zerosen_Oni",
            "body": "I know we are no longer supposed to joke about bombing that one thing….",
            "score": 1,
            "replies": []
        },
        {
            "author": "LumpyTeacher6463",
            "body": "It's time to license produce the TLK-1000 autonomous torpedo. 5000 kilogram warhead. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrWaffleBeater",
            "body": "China really just remade the Drakken",
            "score": 1,
            "replies": []
        },
        {
            "author": "L1ntahl0",
            "body": "Funny thing given I intend to enlist in the Marine Corp soon…\n\nI got the opportunity to do the funniest fucking thing If I actually do, that is…",
            "score": 1,
            "replies": [
                {
                    "author": "Dexter942",
                    "body": "You'll be on the side of the PLA at this rate",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rafale1981",
            "body": "Don’t worry. Big D is going to cut a deal with them. Maybe a piece of the action on the microchips and a crate of plum liquor and he’s gonna play peace president",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "This post is automatically removed since you do not meet the minimum karma or age threshold. You must have at least 100 combined karma and your account must be at least 4 months old to post here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NonCredibleDefense) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unlikely-Writer-2280",
            "body": "Those Barges look VERY non-bulletproof.",
            "score": 1,
            "replies": []
        },
        {
            "author": "punkojosh",
            "body": "With Nvidia and semiconductors down, at this point they can just roll up under the guise of protecting the world's chip industry.\n\n\nScary thing is, I trust China with the World's semiconductors more than the US in 2025.",
            "score": 0,
            "replies": []
        }
    ]
}