{
    "title": "Nuke delivery french style",
    "author": "ww1enjoyer",
    "subreddit": "NonCredibleDefense",
    "rank": 17,
    "score": 786,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 41,
    "url": "https://i.redd.it/366fkpr0i9pe1.png",
    "id": "1jde964",
    "selftext": "",
    "comments": [
        {
            "author": "Noir_Lotus",
            "body": "Hey, that's not non credible, that's historical !!",
            "score": 225,
            "replies": [
                {
                    "author": "Corvid187",
                    "body": "Nothing is less credible than actual history",
                    "score": 130,
                    "replies": [
                        {
                            "author": "Noir_Lotus",
                            "body": "Looks back at french military history : cavalry charge against ships, a teenage girl leading armies ...\n\nAh crap, you are right !!",
                            "score": 86,
                            "replies": [
                                {
                                    "author": "Substantial-Tone-576",
                                    "body": "They used cavalry against war ships?",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "VladimirBarakriss",
                                            "body": "The ships were stuck in ice, but yes",
                                            "score": 56,
                                            "replies": [
                                                {
                                                    "author": "Substantial-Tone-576",
                                                    "body": "Oh still funny",
                                                    "score": 19,
                                                    "replies": [
                                                        {
                                                            "author": "printzonic",
                                                            "body": "The French cavalry won by the way and captured a significant chunk of the Dutch Navy. Though no fighting took place as the Dutch sailors effectively surrendered immediately.",
                                                            "score": 37,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Spart_2078",
                                                            "body": "Wait until you hear of a certain Monsieur de Chambure who decided to break through the siege of Danzig to ask the Russian to stop firing their cannons at night because it woke him up in his sleep before going back to the city. And then did it again when the Russians didn’t listened.",
                                                            "score": 30,
                                                            "replies": [
                                                                {
                                                                    "author": "COMPUTER1313",
                                                                    "body": "Or earlier in the war when they bluffed some Austrians who were guarding an important bridge. The French knew the bridge was rigged with explosives to prevent capture.\n\nThey pretended a peace treaty was already signed and did a ceremonial parade march towards the bridge, and convinced the Austrians to let them across.",
                                                                    "score": 17,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "RussiaIsBestGreen",
                                                                    "body": "Oh my god I hate when my sleep gets interrupted by people making noise.",
                                                                    "score": 10,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Intelligent_Slip_849",
                                                                    "body": "Source/link?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Spart_2078",
                                                                            "body": "It s in the biography of Laurent Augustin Pelletier de Chambure",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bigfatkakapo",
                                            "body": "It has happened a couple of times in history, which is the weirdest part.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "qwertyalguien",
            "body": "Sounds like some trashy American movie from the early 2000's\n\nSome dudebro took his dad's shitty car for a ride across the desert with his bros to reach a party his out of his league crush invited him. But the party is in 2 days! And along the way his compromise to get (ilegal ) fireworks accidentally gets involved in a secret french nuclear project and must carry a bomb. \n\nIm the third act he barely makes it through, but the nuke proves a success at the party and by accident humiliated chad, giving him the girl. And the hardass berating French operative creates a situation he and rhe girl will be alone for many hours as a bro reward. \n\nCredits roll. Dance act.",
            "score": 112,
            "replies": [
                {
                    "author": "Substantial-Tone-576",
                    "body": "Dude where’s my nuke?",
                    "score": 38,
                    "replies": [
                        {
                            "author": "leap12345",
                            "body": "hold on let me put on my thickest French accent \n“you will find it parked outside the rich white Americans mansion next to passed out rich boy and the local homeless man”",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Bwint",
                                    "body": "\" 'oo weel fahnd eet parked outsad ze reech wat Americun's mansion next to passed out reech boi and ze local 'omeless man\"",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "theawesomedanish",
            "body": "That's from 'A Very Secret Service' right?",
            "score": 67,
            "replies": [
                {
                    "author": "Noir_Lotus",
                    "body": "Inspired by real facts, most of all !",
                    "score": 30,
                    "replies": [
                        {
                            "author": "theawesomedanish",
                            "body": "Well it's a very enjoyable series, I'm actually in the process of rewatching it.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "LuNiK7505",
                                    "body": "Il aime les femmes, beaucoup",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "Phenixxy",
                                            "body": "Et...?",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "pastey83",
                                            "body": "This scene gave me a deep dread. I \"speak\" french, and it was the first time I'd heard a non-French speaker speak. I never realised that I might have an accent in french!",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nordic_banker",
                    "body": "Double tamponnée",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "super__hoser",
            "body": "2CV: more French than a good pinot noir or being angry at the Germans. ",
            "score": 31,
            "replies": []
        },
        {
            "author": "F1lth7_C4su4L",
            "body": "Wankil really messed up with geoguesser.",
            "score": 28,
            "replies": []
        },
        {
            "author": "Rei-ken",
            "body": "You deliver nuclear fire through methodical doctrine and advanced weapon.\n\nWe deliver nuclear fire through Flantier and Jon-Luc in a 2 CV.\n\nWe are not the same.",
            "score": 29,
            "replies": [
                {
                    "author": "COMPUTER1313",
                    "body": "Ukraine in 2026: “We deliver nuclear warning shots through one-way drones.”\n\n*Paranoid Russian air defense indiscriminately slings missiles at everything that flies, including Aeroflot jets and Russian military aircraft.* \n\n*Ukrainian cropduster plane turned drone with an onboard nuke still makes it through…*",
                    "score": 9,
                    "replies": [
                        {
                            "author": "zekromNLR",
                            "body": "Even if it does not, the nuke was armed 10 km after the border and is on a fail-deadly firing switch, and the flight altitude is already at the optimal burst height",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "COMPUTER1313",
                                    "body": "Troll mode: Have the nuke drones fly in a circle over Moscow and tell Putin his military needs to immediately withdraw back to the internationally recognized border, and he has until the drone's fuel tank runs empty.\n\nOr he can try to shoot one of them down, which they will all predictably detonate.\n\nSorta like this scene from PATLABOR 2, where shooting down a jamming air blimp results in it crash landing and releasing gas over the city: https://www.youtube.com/watch?v=oGxeiDFVRkY",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Spart_2078",
                    "body": "The masters of disguise! Nobody would be dumb enough to transport a nuclear weapon in a 2CV. So when you show a massive nuke on the roof of your car, they ll think it s fake. \n\nSBU if you re looking for someone to do the funni, my contacts are open.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "COMPUTER1313",
                            "body": "The other option would be to drive a delivery van (with a nuke in it) into Moscow and park it there.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Blorko87b",
                                    "body": "And on the way downtown Barry's builder van then encounters an older Mercedes E-Class with a CB radio antenna towing a trailer with rubble and an upturned bathtub, a half-heartedly souped-up Golf III (‘Kein Schwanz ist so hart wie das Leben’) with a seemingly defective bass roll, a caravan with yellow licence plates, a slightly rear-heavy Piaggo Ape belonging to a Milanese distillery for bitters, ...",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "nYghtHawkGamer",
                                    "body": "\"The other option would be to drive a delivery van (with a nuke in it) \"\n\nJust disguise it as a captured washing machine and mail it \"home\" from Belarus.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FrenchLeBaguette6",
            "body": "Stylé, Wankil studio sur un subreddit d'amerloc",
            "score": 18,
            "replies": []
        },
        {
            "author": "ww1enjoyer",
            "body": "Original post: https://www.reddit.com/r/Frenchhistorymemes/s/tKp6F1I4G4",
            "score": 15,
            "replies": []
        },
        {
            "author": "Nimitz-",
            "body": "Wankil appearing on here was not on my 2025 bingo.",
            "score": 6,
            "replies": []
        },
        {
            "author": "AWildAndWoolyWastrel",
            "body": "2CV can [go anywhere](https://2cvgarage.nl/en/2cv-4x4-rws/).",
            "score": 3,
            "replies": []
        },
        {
            "author": "d_bfighter",
            "body": "Is the background in the picture above from BF1?",
            "score": 2,
            "replies": [
                {
                    "author": "degeneral57",
                    "body": "I think it’s Zeebrugge",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ww1enjoyer",
                    "body": "Idk, ask the author, i added a link in a comment to the original",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}