{
    "title": "I had to clean adult human poop at work today, I work in a hardware store",
    "author": "Spazz_1995",
    "subreddit": "mildlyinfuriating",
    "rank": 8,
    "score": 310,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 81,
    "url": "https://i.redd.it/ncugqhbszpie1.jpeg",
    "id": "1insbxe",
    "selftext": "",
    "comments": [
        {
            "author": "PixelCube_",
            "body": "I’ve had to clean shit out of a fitting room at TJMaxx. Probably not legal of my manager to make me do that",
            "score": 109,
            "replies": [
                {
                    "author": "XandersCat",
                    "body": "I did clean poo when I worked at a gas station because thwt was part of my job but I successfully made my managers clean up blood on two occasions.\n\nI told them, \"Look I'll do it, pay me $100 extra and get me a hazmat suit and I'll clean it.\". And I wasn't bluffing, I would have done that.\n\nBut instead they always just cleaned it up themselves.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "IndecisiveAHole1",
                            "body": "It's the managers responsibility and that doesn't include asking the first employee they see. That means them getting on the phone and finding the employee with the proper training. I would have called OSHA.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Empty_life_00",
                    "body": "its not",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PixelCube_",
                            "body": "Damn, then what about the black mold my teenage coworker had to clean up everywhere?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Empty_life_00",
                                    "body": "that too bro.. companies have cleaning crews/ janitors for a reason",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PixelCube_",
                                            "body": "I worked there for over two years and I’m honestly not sure if I ever saw them! They would only come in after store hours, and even then I’ve seen paper towels lie on the floor for days and days.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Empty_life_00",
                                                    "body": "thats wild and the manager should be doing the shit/ mold cleaning if the cleaners arent onsite..",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PixelCube_",
                                                            "body": "Lmao, I haven’t mentioned the gas leaks etc, yet",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Empty_life_00",
                                                                    "body": "god damn, your place of work is an OSHA reps wet dream.. infractions everywhere🤣",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PixelCube_",
                                                                            "body": "Yeeaaaaa tbh I should’ve called the fire marshall. The backroom was constantly breaking safety rules. And aaaallll TJMaxx/HomeGoods/Marshalls are like that :) (same company)",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Empty_life_00",
                                                                    "body": "reporting work hazards/ potential infractions to osha can be anonymous just sayin.. or at very least let corporate know the situation.. if it was my workplace i would.. just sayin🫡",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "shaobues__",
                                    "body": "did you speak up in that situation at all?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PixelCube_",
                                            "body": "Yes, and nothing happened because management never did anything",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "shaobues__",
                                                    "body": "I really hate being reminded of how shitty most people are.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "InsideOutRat",
            "body": "Who made you clean it? Are you the manager?",
            "score": 42,
            "replies": [
                {
                    "author": "Spazz_1995",
                    "body": "I'm the only worker who can't smell",
                    "score": 42,
                    "replies": [
                        {
                            "author": "WitlessParasite",
                            "body": "Doesn’t matter. If you’re not the manager then it’s not your responsibility. Like, not even a little. Tough shit if you can smell it, I’m not doing it.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "Baguelt389",
                                    "body": "Pun intended?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "WitlessParasite",
                                            "body": "lol, didn’t even realize what I did. Sure, why not",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "HolyGrailOF",
                                    "body": "I would do it for manager or co workers If I like them. Ill do the hard jobs to move up socailly.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "WitlessParasite",
                                            "body": "Fair point. If my manager is cool I would consider it. Gonna have to sweeten the deal a bit tho. “I like you, you’re cool. But if I clean this up, can I take off an hour or two early?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Angeltt",
                            "body": "Any form of fluid or solid body/tissue/excrement from a human is considered a bio-hazard.  You shouldnt have had to clean that up!",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "FlatPineappleSociety",
                            "body": "But you can still be affected by fecal transmissible diseases and biohazardous waste. \n\nThis should have been handled by a business that specializes in that sort of thing. You can not be expected to handle this and have a right to refuse.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "AccordingCard2977",
                            "body": "Doesn't matter. I remember the first time I was made to do it (I'm a cleaner at a hospital but by policy not allowed to clean shit or piss or spit or blood unless in corridor, but again I won't be doing it.) I felt bad for the older lady who simply had diarrhea so I did it but I felt a severe lack of self respect for myself then and there for a good week.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "_DancesWithKnives",
                            "body": "Oh no Dewey! You've gone smell blind!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LostWanderlust",
            "body": "This is awful. really sorry for you",
            "score": 21,
            "replies": []
        },
        {
            "author": "Dcybokjr",
            "body": "It's insane how much adult human poop you have to deal with in retail. I used to work in a grocery store and they had to ban an old lady because she would poop in the aisle and then kick it under the shelves. She wore a long skirt and would just stop in the middle of an aisle and let loose.",
            "score": 1,
            "replies": [
                {
                    "author": "Katiefucius",
                    "body": "Decades ago, I worked as a valet at a casino for about 6 months -- there was an elderly dude who would pull up in his silver Grand Am (yeah I remember it) and when one of us would plop down in the driver's seat to park it, we'd get a butt full of piss.\n\n\nThen someone (with dry pants) had to go into the casino find him and tell him he had to leave because he was walking around the casino with pee pants, and whoever was lucky enough to get the butt full of pee had to try to make it home to change without getting pee on the seat of our own car, not to mention the shuttle to the employee parking lot.\n\n\nThere was no reprieve, either, because casinos don't ban people for incontinence.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "itsmecarlybee",
                    "body": "lol what is it about grocery stores! I worked at one in my teens and we constantly had code brown",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheBeardyDragon",
            "body": "All these people saying about biohazard and all that, i once got a facefull of shit and piss whilst unblocking a drain, i was working in McD's at the time and when i say a facefull i mean it hit mean square in the face and soaked me head to toe, i ended up with turd and toilet paper everywhere, i had no issues from that at all which even i was surprised about! It was one of the funnier moments whilst i worked there lol",
            "score": 1,
            "replies": [
                {
                    "author": "TheBeardyDragon",
                    "body": "Another incident was some one shit thelselves in the public toilets and remived their underwear and just put it in the toilet along with half a roll of toilet paper, i was the lucky one that had to clean that up too, shit was everywhere! Haha",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Away_Schedule2969",
                    "body": "I hope you went back to working the drive-thru window like nothing happened with a name tag labelled 'McFeekle’",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheBeardyDragon",
                            "body": "Haha that would have been funny, the store i was at wasnt a drive through, i washed most off in the sinks with the hose thing they have was then given a fresh uniform that was too small for me, changed into that and went home lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mr_StoneStar",
                    "body": "You definitely have  coprophilia",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaffeineChaotic",
            "body": "Are you the janitor? If you aren't the janitor, do not clean up literal shit off the floor unless you offer to. OSHA will have your back if your boss fires you for not cleaning up biohazard.",
            "score": 13,
            "replies": [
                {
                    "author": "winkysteiner",
                    "body": "Osha will prob be gone soon",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Old_Man_Withers",
            "body": "Looks like someone had a 2 inch grip on an 8 inch log.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Aggravating_King1473",
            "body": "That Tod Packer is disgusting",
            "score": 4,
            "replies": [
                {
                    "author": "kama9117",
                    "body": "nice",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Upset_Dragonfruit575",
            "body": "I've quit jobs for less, just saying... Once had a customer shit in a urinal, and my manager tried to get me to clean it out. I straight up told them \"Oh hell no, and if you want to make a big deal out of this I'll walk the fuck out right now... You make the big bucks, you do it.. I don't get hazard pay so you're shit out of luck, pun intended...\"",
            "score": 6,
            "replies": []
        },
        {
            "author": "ButIfYouThink",
            "body": "How??? How did someone do this?",
            "score": 3,
            "replies": [
                {
                    "author": "Spazz_1995",
                    "body": "Sneaky drop out the bottom of his shorts I reckon, had no idea until another lady asked if we had a dog in or something",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Temporary_Tune5430",
                            "body": "If you have security cameras on that area, should be pretty easy to ID the person. Print out their picture and post it on the door marked “BANNED!”",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "192217",
                                    "body": "It's likely an elderly person who is incontinent.  Probably didn't even realize it happened.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mild_Shock",
            "body": "I stepped in human poop on a parking lot recently. Some people.....",
            "score": 5,
            "replies": []
        },
        {
            "author": "Perndog8439",
            "body": "I had to clean up a colostomy bag that burst in a bathroom at Kroger.  1st job did not know better and should have never been made to clean it up.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Shadowhawk0000",
            "body": "Don't you hate it when people aren't house trained? What the hell is wrong with people????",
            "score": 3,
            "replies": []
        },
        {
            "author": "Unsure_Fry",
            "body": "https://preview.redd.it/5una4u4x9qie1.png?width=1924&format=png&auto=webp&s=ad7461684b5dc170f98170ef0d119d7788aee4a5\n\nThe footage is a bit grainy but I found this guy at my hardware store pooping. 22 years later and I still haven't caught him.",
            "score": 1,
            "replies": [
                {
                    "author": "IndecisiveAHole1",
                    "body": "Classic.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Island_Maximum",
                    "body": "As gross as someone doing this is, this was a hilarious scene.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "maxru85",
            "body": "this looks soft",
            "score": 3,
            "replies": []
        },
        {
            "author": "rinkurasake",
            "body": "I wish reddit would split the nsfw option between porn and other shit. I did not want to see other shit rn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "danfish_77",
            "body": "Carpet in a hardware store seems like a bad choice",
            "score": 5,
            "replies": []
        },
        {
            "author": "Baguelt389",
            "body": "Ah humanity",
            "score": 1,
            "replies": []
        },
        {
            "author": "NastyStreetRat",
            "body": "I imagine you're the owner, because I don't clean that. let the owner come to clean it or hire someone to do it, but if you are the one who serves the customer, then you are not the one who cleans the store",
            "score": 3,
            "replies": []
        },
        {
            "author": "edemberly41",
            "body": "This is just plain gross. Sorry it happened.",
            "score": 3,
            "replies": []
        },
        {
            "author": "StarWars_Viking",
            "body": "If you weren't trained to do so, report the business. It's the only way they'll learn.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kallistama",
            "body": "Why is it so bright colored, it looks like leftover meat 😅",
            "score": 1,
            "replies": [
                {
                    "author": "Adventurous_Froyo007",
                    "body": "Lot of hardware stores get stray cats in winter, looked like regular cat poop to me.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kallistama",
                            "body": "Yeah, exactly! That's what I thought too as well. It's too weird colored to be a human shit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Worried-Slide1350",
            "body": "A carpeted hardware store floor? That's not smart",
            "score": 1,
            "replies": []
        },
        {
            "author": "WinterX2",
            "body": "I'm an accountant and I've had to do that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mbrc-137",
            "body": "More like shartware store, amirite?",
            "score": 1,
            "replies": [
                {
                    "author": "Traditional_Neck_154",
                    "body": "Take my upvote and get the fuck out\n\nhttps://preview.redd.it/ul4evwnygqie1.png?width=236&format=png&auto=webp&s=8bd7edf60e1307cc6ca492a2b71a6dc933b30701",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnguSGibson1995",
            "body": "You guys should call hazmat companies for that. *someone who get’s paid to clean up poop*",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Bold_as_Love-",
            "body": "It cuts more when it’s adult.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DiligentTear6993",
            "body": "Shit happens",
            "score": 1,
            "replies": []
        },
        {
            "author": "Peen_Round_4371",
            "body": "Yeah unless you're maintenance or management, that's not your job. That's a biohazard and osha would love to have a conversation with you. I wish I knew that back when I was 19 and had to scrub shit off the women's room floor in a burger king bathroom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "3imoman",
            "body": "Look man... I SAID I was sorry!!  We are you posting my personal bussiness on the internet....???  \n\nWHO IS FULL OF SHIT NOW!!!???",
            "score": 1,
            "replies": []
        },
        {
            "author": "comeasyouareD7",
            "body": "That's a shit job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "marz_shadow",
            "body": "Idk why I opened the picture after reading the title",
            "score": 1,
            "replies": []
        },
        {
            "author": "voyeur6",
            "body": "Thanks for sharing",
            "score": 1,
            "replies": []
        },
        {
            "author": "WrasslinJunkie",
            "body": "Nope, not in my job description....simple",
            "score": 1,
            "replies": []
        },
        {
            "author": "_pm_ur_tit_pics_pls_",
            "body": "I had to clean frozen shit smears out of a freezer/bunker when I worked retail.\n\nPeople should not be allowed outside",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aintyodad",
            "body": "One of my adult life’s goals is to never leave my shit or piss anywhere but the toilet, so far all good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bucebeak",
            "body": "Poor hard done by OP. Shit happens and you get to deal with it. That is called life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ButHoly",
            "body": "This is why people work in dead-end low paying jobs forever. You talk about \"not being able to smell\" so I can pick up the human shit like it's a magic power. In reality, you were the only one dumb enough to do it.\n\nAlso, you just lost the respect of management and your coworkers cause you'll all be seen as lowclass shit handlers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AccordingCard2977",
            "body": "Fair play I guess I wouldn't have done it. Not my job to clean someone's shit. Even if it is...the pay don't reflect it then it doesn't belong to my tasks",
            "score": 1,
            "replies": []
        },
        {
            "author": "HelmetedWindowLicker",
            "body": "Was Johnny Knoxville there?",
            "score": 1,
            "replies": []
        }
    ]
}