{
    "title": "2nd round light buy: pointless rant",
    "author": "flusfu",
    "subreddit": "VALORANT",
    "rank": 13,
    "score": 549,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 127,
    "url": "https://www.reddit.com/r/VALORANT/comments/1jdpl7e/2nd_round_light_buy_pointless_rant/",
    "id": "1jdpl7e",
    "selftext": "OMG stop buying pistol + light shield after you win 1st round!!!\n\nYou are increasing the risk of losing against eco and another round. YOU ARE NOT PRO. Dont use a strategy you once saw in champions... You have a good fucking chance of losing the round because you didnt buy with your team. And for what??\n\nYour team is still going to go bonus 3rd round even if you dont throw the 2nd round...\n\nEnd note: Im not talking about a coordinated calculated risk, where everyone goes light buy 2nd because for example u desperately need to win the 3rd one as well.",
    "comments": [
        {
            "author": "FrequentBill7090",
            "body": "Thank you. I’ve had multiple losses of 2nd round just because people refuse to buy",
            "score": 352,
            "replies": [
                {
                    "author": "clem82",
                    "body": "My least favorite is the guy who full buys runs it straight down and feeds them a free vandal...",
                    "score": 95,
                    "replies": [
                        {
                            "author": "blzrdwzrd",
                            "body": "The league of legends special… but in Val. Classic",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Brilliant_Heart_7902",
                            "body": "Unfortunately this is me",
                            "score": -7,
                            "replies": []
                        },
                        {
                            "author": "Ok-Ring1158",
                            "body": "That's me... haha",
                            "score": -15,
                            "replies": []
                        },
                        {
                            "author": "Federal_Bottle_2503",
                            "body": "I only buy vandal on 2nd round if we absolutely clapped the team 1st round. If I get a 3k+ in first round, I’m 100% buying a vandal/phantom.",
                            "score": -8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AetherLionn",
            "body": "I really enjoy heavy shield outlaw round 2. The chances an enemy buys full armor is slim, and if they did then they don't have a decent weapon and I can usually win that exchange. Plus the outlaw isn't bad post round 2, so it's not a waste just for a second round win imo.",
            "score": 120,
            "replies": [
                {
                    "author": "Lucas74BR",
                    "body": "Same. Every once in a while I find a psycho that buys full armor in a round 2 eco lol",
                    "score": 42,
                    "replies": [
                        {
                            "author": "AetherLionn",
                            "body": "Just to almost 2 tap you with a lucky classic heads hot after being hit 140",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "Oviheart",
                            "body": "Chambers do that a lot, bullets for the headhunter and a heavy shield",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "IcyReplacement2707",
                                    "body": "Yeah, again, guilty as charged xD",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "IcyReplacement2707",
                            "body": "Guilty as charged, I don’t trust my aim enough so I like the extra protection",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CinnamonStew34s_eh",
                    "body": "I do the same but with sage, so in the case the enemy jett buys full shield and dinks me even after I give 140 dmg, I can heal and repeek even in their fullbuy/(they cooked in 2nd round)",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ControlAmbitious5749",
                    "body": "I never do that because they usually 5 man rush one of the other sites and I have to retake with an outlaw...",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "philbro550",
                    "body": "Regen shields outlaw maybe, heavy shields outlaw I can never afford, and is too risky",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Cosmic_Hashira",
                    "body": "only one buying heavy shield in round 2 eco is a bum ass chamber main with his trusty pocket guardian thinking he can one tap (i am the chamber main)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bronkanon",
                    "body": "if its defense, id rather regen shield. i should be able to reliably take the first shot and take cover without dying so i can regen it after",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Forsaken_Salt_7039",
            "body": "I’m new to the game so this is honestly helpful to see. I usually wait to see what my teammates are buying and follow suit",
            "score": 107,
            "replies": [
                {
                    "author": "t_arends",
                    "body": "You’re doing it exactly right then. General rule of thumb is you all want to save at the same time so you can buy at the same time.",
                    "score": 81,
                    "replies": [
                        {
                            "author": "Disastrous_Yellow_46",
                            "body": "unless you happen to be able to afford buys both times. as long as you can all buy with your teammates next round after they save, spend whatever you want this round.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Unique_Name_2",
                    "body": "Good call. In ranked, it can be better to be collectively wrong with your entire team, than correct on your own.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "ImagineDragonsFan6",
                            "body": "This has been my issue. Randoms in bronze buy to 0 every damn round even when you beg for a save it feels like 😂",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "CrispyFriedJesus",
                            "body": "Which is how I begrudgingly end up on a light buy after winning pistol",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "angrypolishman",
                    "body": "Yep, should do so.\n\nIf 4 teammates dont buy 2nd round, thats troll\n\nIf you decide to buy in spite of that, also kinda trolling your economy",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kairelle",
            "body": "For some reason, I’m back in lobbies where people don’t buy after winning pistol and ALWAYS LOSE",
            "score": 51,
            "replies": []
        },
        {
            "author": "lenolalatte",
            "body": "I’ve given up on trying to tell people in my games. I really don’t understand why. Maybe people get lucky and win a round not buying anything after winning pistol and they think that means they don’t need to buy anymore…",
            "score": 11,
            "replies": []
        },
        {
            "author": "BidetEnjoyr",
            "body": "2nd round outlaw no matter what. GG",
            "score": 11,
            "replies": []
        },
        {
            "author": "tazai123",
            "body": "People see the FPX buy and think it applies to pub matches",
            "score": 28,
            "replies": [
                {
                    "author": "philbro550",
                    "body": "Tbh ghost still farms on anti ecos, 3-4 people buying is still fine esp on senti/smokes on t side",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheGoofyWave",
            "body": "when playing in fives, me and my friends always have 2 people ghost + full shield and 3 rifles, really good because if the rifle player dies the pistol payer just grabs their gun",
            "score": 7,
            "replies": []
        },
        {
            "author": "Legendary_Xerxes",
            "body": "A coordinated buy is good. 3 or 4 upgrades, and a pistol or two. That way, dropped weapons can be recovered. \nI'm not a fan of full buys as most people still don't think of disposing weapons so that enemies on a save can't get them.\nThere's still a risk still, no matter what you do. Thriftys happen for a reason. Full buys might reduce the risk of losing, but better weapons falling into enemy hands increase it",
            "score": 29,
            "replies": [
                {
                    "author": "flusfu",
                    "body": "If a spectre falls into enemy hands, it is much worse if he fights your teammates with ghosts only. Thats why you either all force or all go light buy. Dropped weapons might get recovered, but they also might not, especially on defensive.\nOn the other hand, there isnt much enemy can do woth spectre if he faces 4 more enemies with spectres or bulldogs",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Zaplo194",
                            "body": "In higher Elo this is rarely a problem. You should not go alone with a Gun against an eco.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "philbro550",
                            "body": "Yes but having 4/5 people with guns means if anyone dies you lose a rifle, esp in high elo where people cheese strats for a pick like 5 man walk ups or shorties",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PlantainEfficient504",
                    "body": "It is still objectively better to buy second round.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "International_Bat972",
                            "body": "if you have zero faith in your team it is better to buy second round, correct. but if you are a decent rank and have some support in your teammates, then you (if you're playing support and therefore are unlikely to take gunfights), can definitely save r2 and upgrade on bonus.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "ShipEffective3793",
                                    "body": "What game is bro talking about “if u play support and are unlikely to take fights” u mean if u are a pussy and just camp the entire round lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "International_Bat972",
                                            "body": "i mean you statistically are less likely than your duelists to take fights if you are on support (assuming your team is playing the game properly, which it sounds like yours are not..). what is difficult to understand?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "ShipEffective3793",
                                                    "body": "I think you’re playing the game wrong bud, never have only your duelist take fights, ofc setting him up with flashes or smth is good but always go and fight with him afterwards, u always wanna be able to trade anybody and especially on 2nd round or enemies eco rounds u wanna stop them from retrieving guns",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Stovvadz",
            "body": "I've been going absolutely INSANE since I started playing again.\n\nI took basically a year+ break of playing the game actually serious, so coming back my rank was decayed to absolute hell and I was sitting in high bronze/low silver games and my teammates WOULD NEVER BUY AFTER A PISTOL WIN!\n\nI started even psyching myself out where I'd ask them like \"Hey guys, I haven't played in a while has something changed with the economy that makes it so it's not worth buying after a pistol win??\" and I'd usually either get a light response or just nothing at all so I'd just go with it. \n\nNow that I've ranked up a bit finally teams are buying after pistol wins again and I feel like I was in some bad nightmare.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Ruby-Crystal",
            "body": "Honestly, for me, it depends on what agent I'm playing like if I'm playing some I'll stay with a ghost and either regin or light armor with full abilities since not only to the shock darks provide some decent dmg but I can also provide plenty of Intel for my teammates to play off of but if I'm playing like a gecko or a Deadlock then I'm going to just use whatever abilities I had left from pistol and get the best weapon I can whith as much armor as I can (usually a regen and a spector/stinger since it is still a decent gun)",
            "score": 4,
            "replies": []
        },
        {
            "author": "FemtoG",
            "body": "i agree just go straight for bulldog u scrubs",
            "score": 2,
            "replies": []
        },
        {
            "author": "D1sbade",
            "body": "This shit pisses me off sm. So many times like 3 of my teammates go ghost and shield after we win first round and the enemy team has a BETTER buy like some of them buy sheriffs and marshalls and we just lose. Like this isnt vct just buy a bulldog and call it a day",
            "score": 2,
            "replies": []
        },
        {
            "author": "CanvassedBeauty",
            "body": "I mean I personally like when 1 person saves and 4 people by. Guarantees you Atleast 1 gun round 3 to make some damage fucking their economy while still insuring you win round 2 with 4 full buys. (If your all comming and agreeing about it, plus if 1 player is significantly playing better than the rest the person who saves should give them the rifle for round 3 bonus). But I agree when more than 1 person does it it's pointless and stupid and a throw.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mako_girlypop",
            "body": "Having a lurker go with a ghost is way better than them going with something like a bulldog",
            "score": 3,
            "replies": [
                {
                    "author": "intusel3",
                    "body": "Lurking is not good if you have an economic advantage especially in ranked/unrated. If you can afford better weapons buy them together and go as 5. That gives you by far the best chances of winning the round and eventually the game.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Gushanska_Boza",
                            "body": "Human drone is the way to go. You run a 4-1, have your team take some map control off barrier and then freeze, then the lurker just walks through the opposite side. If it's free, you call your team back, if you die, you've found the enemy's stack and your team still gets a free site.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "intusel3",
                                    "body": "I’m not saying this is bad at all but I’m pretty sure going as 5 with better weapons has still by far the better chance of winning in ranked. I think it’s a great plan b for second half if going as five didn’t work for some reason (passive duelists for example) though.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Gushanska_Boza",
                                            "body": "Let's say rushing into a stack with gun advantage is a loss 1 in 10 times. 5 man running it down has around 50/50 chance of going into a stack (other than 3 map sites or people pushing mid, etc.). So statistically, you're losing 1 in 20 antiecos when you 5stack. If you run a 4-1, you are significantly less likely to go into the stack, so you'll be converting more antiecos on average. Of course, this is all assuming you have teammates willing to listen, but I've found relative success in that department as long as I'm comming clearly pre round.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "intusel3",
                                                    "body": "Communication and coordination depends on the server I guess. I regularly have full mute people on my team or the ones that simply prefer to communicate in a variety of languages that I don’t speak unfortunately.\nAnd I would assume that even on NA servers, where there ist almost no language barrier, ignoring calls is a regular issue in every elo. Personally I feel that a simpel Call works more often than a slightly more complex one.\n\nHowever I would argue that if you have better weapons running as 5 into a stack with worse weapons/pistols is surprisingly often better than avoiding the stack, planting and playing postplant in something around or in between 4v4 or 5v5 scenarios. Because pushing as 5 you at least somewhat have a decent chance that your team fights together. Therefore you go into the stack and fight a 5v3 with better guns, which should highly favor your team. If you get into a 5v5 postplant something far worse and more common than bad communication comes into play. People chasing eco frags, (over-)pushing enemy spawn, taking unfavorable duels against worse weapons and dying 1 by 1. Consequently i honestly prefer fighting the stack together with better weapons than watching my teammates willingly and actively hand over their lives as well as guns postplant and thereby lose the round. The more enemies you got to fight before postplant together the better because it leaves less possibilities of people throwing by dying in the hunt for eco frags.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Gushanska_Boza",
                                                            "body": "1. I'm EU, only play on London servers, most people speak or at least understand English. \n\n2. It's not a complex call. Legit just \"Alright, go take A main and pause, I'll walk through B.\" and then either \"They're stacked B, hit A!\" or \"B's free, rotate.\"\n\n3. Overheating in postplant is fine, as long as you do it as a team, it's honestly on you if your team's dying pushing shit and you're not with them.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "intusel3",
                                                                    "body": "1) Good for you I guess.\n\n2) I didn’t say it’s super complex or that people are never able to do it, I just said it’s more complex than pushing as 5 and easier equals better chance of working in this case. I actually communicate and call a lot because you win a lot more games by doing so and you can frequently prevent your teammates from tilting or going at each other’s throats. And in normal gunrounds I would agree that playing with lurks or fakes for example makes a lot of sense because you increase the chance of winning the round however against an eco the simplest strat (push as 5) gives you the best chance to win the round and has the highest probability of people following it. That’s all I’m saying.\n\n3) Common we both know that people don’t chase eco frags as team. They don’t push together postplant they go one by one through different chokepoints and don’t do it strategically at all, they just want the easy kills. 1 or 2 are mostly already gone chasing while the person with spike is planting and the others are clearing the rest of site. And from what I can tell chasing eco frags is an issue in every elo. Kinda makes sense because from iron to radiant there are a lot of people with inflated egos that define themselves way to much over the amount of kills they made in video game for some reason.\nBut even if we assume you overheat as a team it’s still not a good decision because you go into chokepoints against worse guns for no reason while you actually can just set up for preferable duels that suit your (better) weapons. And btw on certain agents it’s just bad to not play postplant as playing postplant is their biggest or only strength on attack.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "69Gunslinger69",
            "body": "I play initiator so I have to full buy my abilities on the second round and every round following, I always just go ghost for the second round, save a bit of money so I can always full buy. There’s not really another way to do lmfao",
            "score": 3,
            "replies": [
                {
                    "author": "deepfriedicecubes",
                    "body": "I also play initiator. After winning pistol I also buy full abilities and have enough for a Bulldog/Guardian + half shield or a Stinger/full shield so I don’t get your argument. I go into bonus round 3 with the same weapon and full abilities. At round 4 I can finally upgrade to a Vandal/Phantom with full shield and abilities. That basically the default logic of buying when winning pistol ever since the game has been released.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Ruby-Crystal",
                    "body": "Honestly, this, although I think it depends a little on what initiator you're playing, like i think a sova needs his abilities as often as possible, but someone like a sky can get away without full buying abilities every round in favor of a stronger gun (although this is just my opinion and might not reflect in your games)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "69Gunslinger69",
                            "body": "It does indeed depend, like if I’m playing Kay/o i usually have some left over flashes or something, but with fade, I swear I could full buy halfway through some of the rounds. I SPRINT through her abilities, and same with sova like you said.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Shjvv",
                    "body": "No, gun first, utils later. Full buy then use the left over for utils. \n\nYoure on anti eco, they should already lost the round by default. You don’t need to make them lost harder, you need to keep yourself alive by having good armour and good gun.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Unique_Name_2",
                    "body": "What abilities are yoy buying that cost like 3,000? Lol. Should be able to bulldog/regen/full util with most. Or heavy shield / spectre / util.\n\n\nIf youre in the back, and the only one with a ghost, it can be ok i guess. Just recycle guns. Still sucks to lose r2 in a clutch because your last alive has a pistol :/",
                    "score": 3,
                    "replies": [
                        {
                            "author": "69Gunslinger69",
                            "body": "If I’m last alive, I probably don’t have a pistol anymore. As an initiator, I’m constantly in front pushing sites with duelists using my abilities. \nI’m either one of the first ones dead or alive for the win. \n\nBeing that I’m usually first to die, I don’t really plan on getting kills in the first few rounds so I just save the money for a vandal in the third, I always tell my duelists to go light/ vandal in R2 so I just pick that up if they die. If they don’t die and we have a successful push into site, I pick up an enemies weapon. This plan has kind of just worked out pretty well for me so far",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "D4RK1773R4019",
                    "body": "I also play initiator and after winning a pistol round i can buy my util back, light or regen shield and a bulldog/spectre/marshall.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "69Gunslinger69",
                            "body": "I’m awful with the Marshall, and the spectre and bulldog are meh so I kind of just save the money for r3. Like I’m not the one going for kills, that’s not really my job if I have a good duelist. One single extra save round sets me up for the entire rest of the half. If it’s obvious my duelist sucks than I usually buy spectre or stinger in the second half.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "flusfu",
                                    "body": "The point is you are not supposed to full buy r3. You are supposed to go bonus (in most situations)",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "SkuLLFlankerr",
                                            "body": "This.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "D4RK1773R4019",
                                    "body": "I understand not going with a Marshall since it's a fairly difficult weapon and getting kills isn't your main priority but I were to enter the site so I can support my duelist I'd feel safer doing it with a better weapon than a pistol.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ChypRiotE",
                                    "body": "If you win r1, you want to win r2 and play r3 as bonus. In most cases you should not be full buying r3, so there's no reason to save for it",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SkuLLFlankerr",
                    "body": "I'm sova main I buy spectre full shield with drone+1 dart easily if we win 2nd round, even with fade I buy full shield spectre + utils",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Potential-Prompt-126",
            "body": "To be honest I think it's fine as long as your team has 3 buy ups. Less than that is kinda trolling, but 3 guns +2 pistols makes a pretty good anti-eco and makes for a strong bonus",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheWillOfFiree",
            "body": "I love heavy plus a submachinegun on most maps. \nThen go somewhere where the range works in your favor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JFKsghost2",
            "body": "Outlaw is the way and if you don't die for rounds 2 and 3, your basically rich all game if you win half of the rounds",
            "score": 1,
            "replies": []
        },
        {
            "author": "RealCiggy",
            "body": "If I pick up a sheriff first round I'm buying sheriff heavy armour and full util",
            "score": 1,
            "replies": []
        },
        {
            "author": "Upbeat-Junket-5252",
            "body": "My teammates either don't buy or force buy help",
            "score": 1,
            "replies": []
        },
        {
            "author": "aitacarmoney",
            "body": "if you can get at least two more to buy with you, buy up. if everyone else is saving, save up. the worst feeling is being first death and giving them a vandal or judge",
            "score": 1,
            "replies": []
        },
        {
            "author": "adi27393",
            "body": "My team: 2-3 people buying light shield with sheriff/ghost saved from Pistol round.\nEnemy team: Stinger and light armor.\n\nPlay aggressive with a pistol and die early...blame teammates for not supporting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "One_Inspection_4113",
            "body": "I agree same here in my game as well",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thundr4x",
            "body": "Buy stinger and full armor",
            "score": 1,
            "replies": []
        },
        {
            "author": "pauloyasu",
            "body": "the whole point of having someone buying just a pistol on second round is to allow someone to make the risk play without giving the other team a gun, but most people who buy pistols second round just try to rush the site and die without accomplishing anything besides giving a free ult orb. So, best strategy in ranked is just to buy second round and play it safe.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Affectionate-Pay558",
            "body": "If I win the first round i always buy a outlaw or judge with light shield (gun changes according to how my teammates are playing if that are playing good I hold and angles otherwise I buy and outlaw. If I lost the first round i always save .",
            "score": 1,
            "replies": []
        },
        {
            "author": "Harsh131101",
            "body": "It's fine to buy in second round as long as you're not that guy who buys vandal/phantom with a half shield.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EfficientNose9229",
            "body": "I have faced multiple 2nd and 3rd round losses because someone decided to buy a vandal with no shield or utility and just gift the opponents a gun",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elitefuture",
            "body": "I thought pros bought after winning the first round. Am I wrong???\n\nTbh, I buy even after losing. I usually end up winning since people don't buy for some reason... even if they buy, I end up with a few kills and hurt their eco more than mine. I love the stinger, so I'd just buy the stinger the 3rd round and eventually get a real gun later",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top_Kaleidoscope4362",
            "body": "I also know some crazy guy who lose pistol round but buy an outlaw and started decimating enemy's bulldog+Regen shield. Full shield is a must for me after that lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MisterHotTake311",
            "body": "Is buying a sheriff both the first and second round ok if I'm good at it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Venduhl",
            "body": "And you don't see what's wrong with your point?",
            "score": 1,
            "replies": []
        },
        {
            "author": "fantastic--duck",
            "body": "Specially people in high plat and diamond. Seems like these people think of themselves as some aim gods or something. \n\nI have lost so many games as 2/3 players of my teams would choose to go with the ghost they saved from first round and regen shields.",
            "score": 1,
            "replies": []
        },
        {
            "author": "itzyyunna",
            "body": "im in silver rn, came from bronze and people almost never buy second round its so fucking annoying",
            "score": 1,
            "replies": []
        },
        {
            "author": "PuzzleheadedNight196",
            "body": "I been full buying on second round for win, but sometimes my random teammate is saving.\n\nTriggering me soo hard that literally cost us 1 round to lose, i was like bro...u wanna win or not?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sushi-Mampfer",
            "body": "If you play in a 3 or 5 stack it’s not that bad for someone to keep a sherif or ghost and pick up a gun on attacking, especially if you still have a sheriff left over you can use that one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ro4q",
            "body": "If im lurking on viper i dont want to give them a gun by dying, everyone whonisnt planning to lurk should buy tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting_Web_9936",
            "body": "Tell that to my iron teammates. They will kill you on the spot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElectricSheep182",
            "body": "Yeah honestly I really don't get not buying after a pistol round that's been won, hell even if we all died but got a plant im probably still gonna buy",
            "score": 1,
            "replies": []
        },
        {
            "author": "GlitchOnAir",
            "body": "I dont mind the right person, like i have 40% HS with ghost I usually play ghost 2nd round so i can buy a vandal third round and have a better chance of winning against buy round, if i play with my friend then he usually plays ghost and buys me a vandal second round. Also sometimes your risk does not pay off i just hate when i see someone’s aim and play style and thinking to my self like you should not even try a light buy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Both_Ad_1615",
            "body": "Sure thanks, buying vandal :D",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soft-Replacement362",
            "body": "I didnt even realize thats what people would be doing. Hell im in swiftplay and i still get teammates who buy pistols second round despite you still getting more than enough money to full buy third round. Dumbest shit ever",
            "score": 1,
            "replies": []
        },
        {
            "author": "XxSunslayerz",
            "body": "Pros don’t even buy all pistol light shields if they win eco",
            "score": 1,
            "replies": []
        },
        {
            "author": "falsefingolfin",
            "body": "Why is the 2nd round strategy so different in valorant, everybody in CS knows you buy 2nd round. What is different about valorant that makes people not buy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist_Spend_775",
            "body": "I'm just an actual demon with a ghost so I buy fulls and full util, I'm usually good for at least two, plus I can catch them off guard b lurking or playing aggressive, without worrying about giving them a gun. I also only do this if the rest of my team is forcing, only one person should play like this at a time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FreshDepth2912",
            "body": "I'm still relatively new to the game, is it actually better to buy something after winning pistol? Isnt it kinda risky because if i buy something and die with it, im broke, no?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bradur-iwnl-",
            "body": "Im a cs player and still dont understand the economy of valo but his just didnt enter my head. So it seems its just stupidity, gotcha. I always tell them to buy second round and not eco for whatever reason and they all go \"But bonus round\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "SomeMobile",
            "body": "Heavy shield spectre babyyy",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThatKindaSourGuy",
            "body": "My friend always did this and I realize we always lose 2nd round. Like I seriously cannot remember a time when we did. If the rest of my teammates do it I'm probably just gonna end up forcing from now on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dzsukeng",
            "body": "That's my secret. I full buy every round.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Necessary_Mixture_41",
            "body": "I buy regen shield and full util 2nd round cope💀",
            "score": 1,
            "replies": []
        },
        {
            "author": "TimeSalvager",
            "body": "Just to spite you, I'm not going to buy in _any_ rounds now. I'm calling it the _famine_ strat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dopeitsdrea",
            "body": "i had a debate about this yesterday in comp. i’m like why are we not buying and bc they wanna full buy 3rd ??? but we just won 1st and basically giving up 2nd round for full buy 3rd? i don’t get it 😩",
            "score": 1,
            "replies": []
        },
        {
            "author": "53881",
            "body": "I’ve also won a ton of third rounds not buying second, getting a loner pistol from someone and then upgrading to a vandal round3 where everyone can still buy in a worst-case scenario that you lose round 3.\n\nI just don’t get eco’d. Ever",
            "score": 1,
            "replies": []
        },
        {
            "author": "Durpface66",
            "body": "in my elo people trade. I typically go ghost (or sheriff) + regen round 2 to pick up guns dropped by my teammates in case they die to save econ. If we win i will always buy rifle round 3 to increase chance of winning 3 rounds in a row. you don't need five rifles round 3 to win, just 1 or 2 is enough to turn it around. Not buying with your team isn't really an issue if you are capable of trading off your teammates contact.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hollow-minded",
            "body": "Literally happens in all ranks, even when you think people should know better…",
            "score": 1,
            "replies": []
        },
        {
            "author": "ljukomir",
            "body": "based on the matchup and how I feel sometimes I get like a sherrif or if I had an amazing 1st round a bulldog,If they trashed us in the first go with ghosts and no shield and get full buy in third",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key-Difficulty7965",
            "body": "I always buy ares and generate shield in second round.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iliketrainsNYOOOOOM",
            "body": "I coordinate with my duo, I’ll go Odin + light/regen depending on econ, and they’ll go classic heavy. It works about 85% of the time",
            "score": -1,
            "replies": []
        },
        {
            "author": "notyouravgcat",
            "body": "I got my one though…",
            "score": -11,
            "replies": [
                {
                    "author": "IJustAteMyDawg",
                    "body": "That's not helpful unless you win",
                    "score": 5,
                    "replies": [
                        {
                            "author": "notyouravgcat",
                            "body": "it was a joke",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "R3KTMYRAMPAGE",
            "body": "Vandal + Light Shield is the way to go",
            "score": -5,
            "replies": []
        },
        {
            "author": "Ping-and-Pong",
            "body": "I've honestly given up caring and sometimes even will full armour ghost myself if I'm feeling it. When it grinds my gears though is when they buy a vandal on the other teams bonus - then lose it - and then have the gal to request round 4 and complain no one is buying with them.\n\nYou'd think current high plats (ex-ascendants) would know this by now...",
            "score": 0,
            "replies": []
        },
        {
            "author": "Livid-Community7748",
            "body": "The problem is the eco team buys too and then you lose, have to save and -2 rounds already",
            "score": 0,
            "replies": []
        },
        {
            "author": "doubledownducks",
            "body": "I’m nasty with the sheriff so that’s all I need to get 2 kills in 2nd round",
            "score": -1,
            "replies": []
        },
        {
            "author": "SnooSprouts9046",
            "body": "Not that deep",
            "score": -1,
            "replies": []
        },
        {
            "author": "prcsIna",
            "body": "No thank you I’m going the the pistol and light shield :)",
            "score": -13,
            "replies": [
                {
                    "author": "letsputletters",
                    "body": "Which is probably why you were iron 3 a month ago...",
                    "score": 7,
                    "replies": [
                        {
                            "author": "prcsIna",
                            "body": " Yeah still iron 3 but it’s a dnan game so I’m playing how I want to :)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "babyatemygator",
            "body": "I always go Odin or Op and end up losing.",
            "score": -2,
            "replies": [
                {
                    "author": "CodyAlexC",
                    "body": "Good /j",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RemoteWhile5881",
                    "body": "You can’t even afford an Operator round 2 unless you Ace.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TripleShines",
            "body": "Funny enough if you don't buy and lose round 2 there's a good chance the enemy won't buy round 3 and you'll have gun advantage lol.",
            "score": -6,
            "replies": [
                {
                    "author": "flusfu",
                    "body": "Yeah, but that will be their bonus. So you just gave them a round and let them save money with decent chance of winning",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}