{
    "title": "Whose gun should it be when this happens?",
    "author": "shtoopidd",
    "subreddit": "VALORANT",
    "rank": 6,
    "score": 192,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 94,
    "url": "https://www.reddit.com/r/VALORANT/comments/1je11ba/whose_gun_should_it_be_when_this_happens/",
    "id": "1je11ba",
    "selftext": "Pistol round won. Everyone buys the regular old spectre, or even bulldog. Stinger, outlaw. But that one cocky phoenix wants to go big and buys a vandal. That’s fine.\n\nObviously there’s also a higher chance he dies, since he’s the duelist entrying and he sacrificed his flashes and wall so he’s just dry peeking.\n\nI pick it up, and we win the round. But the next round, he goes “give me back my gun” and gets mad when he doesn’t get it back.\n\nOr even worse, when we LOSE pistol round and he forced a naked vandal. \n\nShould we give it back to the person or keep it?",
    "comments": [
        {
            "author": "normandy24",
            "body": "Hell the way this game is anymore, I'd say just give it back so the dude doesn't end up throwing cause he's a little kid or a smurf.",
            "score": 356,
            "replies": [
                {
                    "author": "shtoopidd",
                    "body": "Lmao true",
                    "score": 54,
                    "replies": []
                },
                {
                    "author": "LFrostyD",
                    "body": "So true, so sad that its truuuuue.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "charizard_72",
                    "body": "Fuck that \n\nStop feeding into poor sportsmanship. If he is that fragile he’ll find another reason to throw anyway. Stop catering to players like this. Mute, report if he throws or flips out. \n\nHe died. Not his gun. He’s not entitled to it. The fact that he “got mad” is an instant no from me and I would have given it back if he had nicely asked and left room for a no. And i could personally care less if he’s going to “throw” now for being upset. Go ahead! Giving it back is just showing him it works to cry and demand vs showing him people could give a fuck less if he wants to be childish or toxic. I think it’s a horrible mental to be in if you’re submitting to assholes and trolls “for fear of them throwing” in situations where they are in the wrong. \n\nIt’s crazy to me how many of you care more about a slightly increased probability of winning by doing whatever toxic people demand vs having any kind of standards for someone’s behavior in game.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "XxSunslayerz",
                            "body": "Realistically doing this isn’t going to fix their behavior.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "charizard_72",
                                    "body": "Likely not. But it’s also not going to feed into toxicity. \n\nIt’s more about the fact that he got mad and demanded it than asked. I’m opposed to rewarding toxic assholes in this game. Dude can request or ask nicely and see if anyone can help him out. If you’re going to be an asshole I’m not giving it to you and you can learn how to speak to people and have some basic manners.\n\nIMO it makes this game even more toxic to allow people to speak to their teammates like that in round 2 and have zero consequences. At the end of the day he died. The gun wasn’t “his” so the least he can do is ask nicely and have some basic manners.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Bloodstream12",
                            "body": "I understand your point, I think if you reframe the situation has hey a round where everyone bought and someone has extra money and this last person doesn’t have enough would you think someone should buy for them regardless how they ask or even if they don’t ask. Then apply the same answer to yourself, then apply it to this. It’s virtually no different tbh\nI think most people standards are to win and get out of the elo that has people like that",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Excellent-Truth-5594",
                            "body": "tbh its situational, but not giving it back can also be considered bad sportsmanship, you're a team after all",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "normandy24",
                            "body": "It ain't that serious bro Jesus lol",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Low-Negotiation-1041",
                    "body": "I mean if hes doing his role any dying from it, give it back imo",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CodyAlexC",
                    "body": "Real",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DemandImmediate6471",
            "body": "Give it back unless you want to play the next round 4 v 5. You will have more money than him if you didn’t die, if you’re not playing duelist, you’ll have a chance to pick it up next round if he dies again. Gives him a stronger chance of getting a kill on his next entry as he’ll be able to afford an extra flash etc. Your money is your teams money. Same applies if you have a full load out and can afford a vandal and somebody asks for one who can’t afford one. If you’re selfish in this game, you will lose. It’s a team game.",
            "score": 172,
            "replies": [
                {
                    "author": "thebebee",
                    "body": "“your money is your teams money” is big. keeping the vandal 3rd round just means buying your team a gun 4/5th round. while risking the 3rd round win",
                    "score": 67,
                    "replies": []
                }
            ]
        },
        {
            "author": "thebebee",
            "body": "idk why you wouldn’t give it back. he’s going to entry again with it. if you keep it you have to bait him. if phoenix has it he can maybe get 1 before dying.",
            "score": 173,
            "replies": [
                {
                    "author": "AnimeDeamon",
                    "body": "I always give it back, just like you'd give back an Op if you managed to pick it up. Plus, I'd rather the duelist have the vandal on the bonus round - I can easily rebuy my preferred gun (stinger) or get a pistol off of someone who survived both rounds.\n\nIt also shows trust and normally makes people friendlier and keeps moral high.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "DemandImmediate6471",
                    "body": "Only sensible answer on this thread so far",
                    "score": 33,
                    "replies": [
                        {
                            "author": "thpkht524",
                            "body": "Half the ppl in here just doesn’t give a fuck abt the game or some shit.  \n  \nThere’s literally 0 reason to not give it back.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "DemandImmediate6471",
                                    "body": "Literally. These are the people that will have 7k spare on round 12, won’t drop, and expect a drop in the second half haha.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Willkillshill",
                                            "body": "You aren’t understanding the effects of this situation. If someone is force buying a gun and doesn’t get full armor , they are more at risk to dying on that 2nd round. So you win your pistol round but now someone is risking your team losing because they don’t full armor. \n\nMeanwhile everyone else who full armor more likely contributed more to win the round. So if everyone had the same mindset of let’s just buy the best gun and not go full armor , you risk losing essentially a free 2nd round. Not only that , the other team now picks up those guns and their other eco is good for the rest of the half. \n\nIt’s highly selfish to buy the big gun 2nd round and you may see pros do it because they have a thought out strategy. In a random pug, it’s merely selfish to do so and then to expect to get it back if you die. It’s the same thing as requesting for a gun then you die , and next round everyone can buy except for the person who bought you the gun and you immediately buy for yourself instead of them. Selfish mentality is rampant.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "DemandImmediate6471",
                                                    "body": "Buddy, it’s a game. I will still wake up the same and go to work tomorrow (God willing) whether I lose round 2 on valorant or not.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Disastrous_Yellow_46",
                                    "body": "if i have a teammate being a dickhead i'd rather take the -RR than give them another thought. why should i spare the time handing op back to the racist jett calling me slurs? I'm tossing the damn thing off the map",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "anonymousgreyhat",
                    "body": "This is what I do when I play with my duelist duo in my lobby.\n\nBut I've seen my friends in much lower elo where they give back the vandal to a duelist just to see them lurk bait the entire team or just go wandering around the map than actually playing for the team.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Sushi-Mampfer",
                    "body": "This is the best play theoretically, you can do the same thing as in your bonus and pick it up later. But the next round he has no right to ask for it.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "thebebee",
                            "body": "why wouldn’t he? he bought it with his money. the person picking it up, lived. they have more money and they bought lighter the previous round. the two options are give the gun back or screw the teams economy.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Sushi-Mampfer",
                                    "body": "Ofc he can ask, but they have the same money(force 2. round, safe 3. round), if the phoenix bought a shield in the 3. round and can’t buy then it‘s fine, but that‘s just trolling from his side.\nMaybe I‘m just biased from only playing 5/3 stacks tho",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "thebebee",
                                            "body": "they would not have the same money, phoenix spent more and died. the person who lived, bought lighter and by living has *some* weapon already.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Sushi-Mampfer",
                                                    "body": "Are we talking about the same round? I mean round 4, when everyone should be able to do a full buy. The Vandal is from round 2 where everyone forced(0money), in the second round they played bonus(saved for a full buy) and now everyone can do a full buy. Everyone that survived has a vandal/phantom, because the opponent had their full buy and now a player that died asks for a gun. If he isn’t broke(he can’t be without throwing) he can buy himself. It‘s not his vandal, it‘s just a vandal that was dropped multiple times and picked back up. If he really wants it he can have it so he doesn’t start to throw, but he doesn’t have the right to claim it as his anymore.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "thebebee",
                                                            "body": "op is talking about 3rd round. refuses to give the gun he picked up to his teammate. now comes 4th round after losing 3rd. op has 7k because he full saved 3rd and teammate has 4k. if anyone dies 4th round op now has to buy them because he has so much extra money. assuming he’s a good teammate he will buy them.\n\nnow, to avoid this scenario from happening, he could’ve just given the gun back. and everyone’s money would be the same. this would allow the teammate to have his gun for 3rd round. most likely causing the enemies eco damage or even the whole round.\n\nso, the two scenarios are. a scuffed 3rd and 4th round. or a winnable but disposable 3rd round and a normal 4th round.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LFrostyD",
                    "body": "Or he swings as dumb as always and you have a gun wide open on main. Then the gun is lost cuz all they gotta do is hold it. I get what you're saying and honestly no matter what that is the answer. Only reason it is, is the dude would obviously throw after not getting the gun lmao.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "thebebee",
                            "body": "“as dumb as always” it’s 3rd round, after winning 2 rounds. why would you cripple your duelist by taking their gun, when you have money to spare.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Lunaeri",
                                    "body": "yea you’re absolutely right. if you come out with a vandal bonus round you’re already pretty ahead, because statistically bonus round is meant to be a loss for your team anyways if you won pistol and force round. \n\nat that point give the vandal to phoenix to go and do phoenix things and you guys just try and trade/do econ damage with your eco guns",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aaela_Reddit",
            "body": "Best case scenario is just giving it back to him, think abt overall economy, it just makes sense.",
            "score": 20,
            "replies": []
        },
        {
            "author": "boyardeebandit",
            "body": "Depends on if you think you're effectiveness with the gun will outweigh the negative potential of tilting your teammate. \n\n\nIf you have a plan and think you might be able to pop off with it then fuck that guy, but otherwise it might be best to play ball to keep the vibes up.",
            "score": 13,
            "replies": []
        },
        {
            "author": "TubbsAlmighty",
            "body": "in low elo, finders keepers, unless it's a highly situational gun (op, odin) where there's one or two dedicated players in the team.\n\nin high elo i think there's enough strat play to warrant giving up a gun in light buy rounds (vandal on sentinels to force trades/long range picks without actually entrying) but then again, I don't think pissy teammates demanding their vandal back is a problem up there",
            "score": 22,
            "replies": [
                {
                    "author": "DesyatskiAleks",
                    "body": "Strat play? Strat as in playing economy properly? There is a right and wrong answer, the situation does not change because someone is in low mmr",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MonkeyDKev",
                    "body": "I agree, but also if they demand their gun back vs asking for it back will decide my choice. I don’t give two shits for the rr if they’re gonna be like that.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "thebebee",
                            "body": "why play comp if you don’t want the win?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Disastrous_Yellow_46",
                                    "body": "they want the win. they just don't want it enough to put up with whining idiots.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "thebebee",
                                            "body": "the “whining idiot” is giving the correct call but the guy replying’s ego is too big to reason",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "anonymousgreyhat",
                    "body": "This. This is the most sensible answer.",
                    "score": -11,
                    "replies": []
                }
            ]
        },
        {
            "author": "xdarkshadowlordx",
            "body": "i mean if hes entrying for you then just let him have it, you can trade him when he dies and then pick his gun up",
            "score": 9,
            "replies": []
        },
        {
            "author": "Flex_Wildes",
            "body": "I'd say depends on the side, give the rifle to the duelist, if he takes the first Engagement he has a better Chance at winning than with just a Sheriff. \n\nOn Defense? Keep it, u found u use it. Nobody knows for sure where the enemies are going, so just keep and maybe they push u and u get some frags.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Hitman47_x",
            "body": "Unrated, keep it. Competitive, give it to a duelist if he is making entry.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Anishx",
            "body": "It's common sense by now. Buy guns more that utility. Phoenix already gets 1 flash, that's why he takes vandal. He gets one more flash for 2 kills. If that one flash can get him 1 kill, he's literally just 1 away from the 2nd. \n\nHe enters the site. His wall might help, but he just sections for a few seconds, apart from that what he did WAS THE RIGHT THING.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TeaTimeKoshii",
            "body": "If you’re confident you give it back to that guy. My eco > your rifle you dookie butt ass mfer. Just politely give it back to placate a potentially emotionally unstable teammate and continue to carry.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Durbdichsnsf",
            "body": "As soon as my teammate asks for it back, I will immediately drop it to him and say \"oh yeah yeah ofc bro\". Some val players have INSANELY shit mentals and one vandal isnt worth it for him to say \"ok fuck u im throwing\". \n\nIf all you care about is winning RR, giving it back is the only reasonable option. Not to mention hes literally entrying w it.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Panzer_leo",
            "body": "If you win, you give it back, cuz it's bonus anyway. It's much better for a duelist to have a vandal than anyone else. If you lose pistol and win the bonus, give it back anyway cuz, you'd want to buy up as a team anyway.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Santiav90",
            "body": "If he is the entry maybe it would be beneficial for you to give it back, but I would ask for something else in return like a stinger. That way you are not with a classic and he either dies on the entry and you can pick up the gun or he does a good entry and the vandal was worth it.\n\nI also think it's a good idea to buy a vandal on round two, as long as you can buy small shield and are not sacrificing utility",
            "score": 2,
            "replies": []
        },
        {
            "author": "EatingCtrlV",
            "body": "If your entry duelist asks for his gun back you either give it back or be prepared to entry yourself next round.\n\nAlso people are so fragile in this game I'd rather just give the gun back to keep morale high.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gushanska_Boza",
            "body": "Unless it's your duo, always give the gun back. It's better for team morale and shows that you trust them.",
            "score": 5,
            "replies": []
        },
        {
            "author": "LFrostyD",
            "body": "I instinctively give it back knowing how many petty players exist. But in a perfect world they'd have the common sense to say \"hey that guy is better with my gun, let me save him some money this round\". I usually get my gun given back and argue to let them keep it for a great round. It's the fact that the person who clutches it should get it. But again, petty, cry baby players will throw.",
            "score": 3,
            "replies": []
        },
        {
            "author": "xd-Sushi_Master",
            "body": "Give it to him.\n \n1. He's entrying, he needs it the most of anyone on the team.\n \n2. He'll likely get pissy and kill the team's mental if you don't give it back, which will outweigh the short-term advantage of you not having to buy a gun that round.\n \n3. Even if he doesn't start a fight in voice chat, you're teaching him that the best way to keep his gun for the next round is to just go in last and let someone else die on the entry. Whether you intend it or not, whether he gets audibly mad or not, you are sending the message that he needs to bait you and the rest of the team to keep his gun and maintain his economy. This is the worst thing a duelist can be doing, and you want to avoid that by any means available to you.",
            "score": 3,
            "replies": []
        },
        {
            "author": "vivson_",
            "body": "me, personally, u would never ask for my gun back. im  always glad the gun stays in my team, not goes to the enemy, ion need to have it lol. if i spend money in a stupid way like that and die then its my fault and i dont deserve to get it back next round, unless sb wants to buy me",
            "score": 2,
            "replies": []
        },
        {
            "author": "penguin_gun",
            "body": "If I'm also an entry duelist I tell him to get bent otherwise I give him the gun",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mobile_Editor5739",
            "body": "This is good. I think if you die with any gun then it's up for grabs. If you're team lost someone on the opposite team would have it, why should you be damanded to give it back? That sound - I give it back because grown children still act like children and I'm in it to win it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Babushka9",
            "body": "It's a team game, do what's optimal for the team.\n\nIf it benefits your team that the duelist gets a gun, give him that gun and ask for him to drop something else (stinger, sheriff etc)\n\nIf you think that you'll benefit more (maybe you kept onto a sheriff or maybe you trust yourself more than that teammate, keep it.\n\nIf you suspect that the teammate will start ranting and throwing because of not getting his gun back, it's your choice to have an ego and argue or to play for the win and drop the gun along with your ego.",
            "score": 1,
            "replies": []
        },
        {
            "author": "avarageusername",
            "body": "I'm just giving it back.\n\n a) valorant players are immature as hell, there's a really good chance you not giving the gun back is all it takes for him to crash out and throw the entire game \n\nb) if he's entrying for the team makes sense he has the better gun, if he dies someone else can pick it up again. \n\nLogically it doesn't really make sense to demand your gun back, you gambled with your own credits and died, why should someone who bought a spectre or something and picked up your vandal now give up their gun and fuck up their own economy of play a pistol? But if you want to win in valorant you have to be unselfish and make decisions based on what gets you the highest chance to win the round, not what benefits you personally.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Andinjoss",
            "body": "Right way is someone from the team drops him remaining sheriff/ghost from the first round (if there is so) or buy for him his request that shkuld be sherif/stinger/bulldog at max.\n\nAll of this differs depending on how much kills (credit reward) each player got thru those 2 rounds.\n\nBut to not overcomplicate things, make sure every round every one of your teammates has a weapon that can make an impact/make your chance of winning the round higher.\nIt's much betrer even if you drop him that vandal and buy urself a spectre to dodge conflict in team vc leading to trow/troll.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JustKaleidoscope1279",
            "body": "In low elo do whatever you want it doesn't really matter.\n\nIn high elo, definitely should be prioritizing duelists with the weapon bc they are more likely to get kills, and even if they die, you can just repeat and pick up their gun again. Honestly should even be the case if it wasn't their gun originally, regardless of who ends with it or who has money you should always be funneling the best guns to duelists unless someone else is popping off maybe theres an argument for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Akaigenesis",
            "body": "The best way to keep a good winrate is to mantain good team morale. Just give the gun back, it is not worth the headache. Sometimes people would rather be right than to have fun and win...",
            "score": 1,
            "replies": []
        },
        {
            "author": "philbro550",
            "body": "Plat or below keep, asc higher give it back, diamond is ambiguous",
            "score": 1,
            "replies": []
        },
        {
            "author": "faerox420",
            "body": "I mean first of all, if you die and I pick up the gun the gun is now mine. But this is a team game and if I have the money to rebuy a gun I would give it over since the point is to win\n\nOn another note. It's important for the team to communicate. And a full buy on second round is a valid strategy. People on valorant, much like in life, are self centered and have a problem communicating and working together. If you see your teammates are saving, don't be a dickhead and waste your money. That's stupid. Wasting money on a specter rnd 2 might not even be the best idea either. There's loads of strategies, but you need to be doing it with your team in mind not just yourself \n\nWin or lose rnd 1, if you all do the same thing 2, and you all do a bonus round (don't buy just use leftovers from last round/guns you picked up) 3rd then usually you're always gonna be in a good spot, and if you've been losing you're gonna have a good chance for a take back. If you all do the same thing. \n\nIf you win the first round, you have the money advantage. Now you can all chose to save and buy small that is 100% valid. Win or lose, bonus round 3rd and youre in the money. \n\nBut you can also all chose to buy high tier guns and some util n armour. Now you're at a gun advantage and will likely win round 2 if you're coordinated. Then rnd 3 you do a bonus round with those guns and have a good money advantage and either be 3-0 in a very good spot. Some of you with vandals you kept from rnd 2. Or you'll be 2-1 with a good money advantage. This is a very good strategy, but only if everyone full buys",
            "score": 1,
            "replies": []
        },
        {
            "author": "cdubular77",
            "body": "This has happened to me many times. I love to buy the vandal on round 2 after winning pistol if I have enough money for it, especially because half the time people just get a pistol bc they think they are God's, so many times the vandal has secured the round.\n\nBut if i die and someone picks it up, they don't have to give it back. I do how ever, expect that if they keep it, at least buy me a sheriff. Alot of times people give it back without me asking which is really nice, but they technically shouldn't have to",
            "score": 1,
            "replies": []
        },
        {
            "author": "C-lex1",
            "body": "Depends..\nIf he has a plan like he did last round where someone can also pick his weapon then sure why not.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ModernManuh_",
            "body": "you can throw harder than him",
            "score": 1,
            "replies": []
        },
        {
            "author": "MillyFillyBaby",
            "body": "I give the gun back 99% of the time",
            "score": 1,
            "replies": []
        },
        {
            "author": "PhysicalGunMan",
            "body": "I'm very strong with Stinger and Bucky as is so I don't mind dropping my gun to him, generally I'd rather just win by having everyone on agents and guns they're better with. It's why I play devil's advocate when it comes to agent select; if you all want to run 4 duelists, that's all you! Just please don't complain about not having the initiating util or defensive pieces if you're locking duelist after seeing what everyone else is playing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "999brii",
            "body": "tbh i always give my duelist there gun back if they died, obviously they will die entrying so after they do i pick the gun up and use it for the remaining round and just give it back the next since i didn’t buy it. Most of the time they don’t ask for it back though but i give it back anyway since the 3rd round is a 2nd bonus round and i just buy sheriff and shields on clove🤷‍♀️",
            "score": 1,
            "replies": []
        },
        {
            "author": "seilapodeser",
            "body": "I'm only on gold, but over here people usually don't even ask for it back.\n\nI'd say the unwritten rule is that he has no right over it unless you decide it's best for the team",
            "score": 1,
            "replies": []
        },
        {
            "author": "CorvusCorax11",
            "body": "Well since he wont have money...yea. Its good sportmanship. He risked it and it payed off. Usually that ends with enemy team getting free vandal.\nNo matter what, comms and good sportsmanship goes a long way.\nBeing selfish with \"u died, its mine\" is a childish stupid approach and u actually end up looking bad rather then he who asked it back.\nEspecially when OP is in question, my jett died without kills, dropped OP, i picked it up gave it to her next round...kid solo killed 4 eith it. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unique_Name_2",
            "body": "I give it back and sheriff. I can control my positioning, recycle the vandal, and still get work done with a sheriff.\n\n\nOnly time i dont if im significantly outperforming the entire team, then ill hold it, tell them im entry and to recycle it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnazzyCat14",
            "body": "why is this a question",
            "score": 1,
            "replies": [
                {
                    "author": "shtoopidd",
                    "body": "Idk",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DjinnsPalace",
            "body": "tactically, if your are not a duelist then giving it back would be logical.\n\non a human level, pheonix is pretty whiny about it. if he didnt ask nicely id force him to ask nicely or id keep it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hawkery",
            "body": "Wait, wait, wait... A duelist that entries?! Bro found a unicorn!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spookie86",
            "body": "So, I will pretty much always buy someone if I have the credit for it. I will also toss them back their op (even though I love to snipe), but with this guy, I would 100% tell him to fluff off. I would give him the gun normally, but the \"give me my gun\" with, I have no doubt, attitude would get a fast no.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DazzlingAd1442",
            "body": "I wouldn’t cater to he’s needs or give a crap about what he is saying however in a comp game, if I had enough to then full buy I would then give him the vandal if not I’m buying full shields and util",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jack-o-Lightning",
            "body": "Any guns picked up from the previous round are yours and really you should keep it. The only gun I think that you should pick up and give back to a player is the op in the case that they are Jett or someone else that can utilize the op better than you can",
            "score": 1,
            "replies": []
        },
        {
            "author": "CodyAlexC",
            "body": "Your gun cause if he’s buying like that then he understands the meaning of the next round which is bonus. If you convert your bonus then you could give “his gun” back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elitefuture",
            "body": "When I buy a vandal round 2 and I die then a teammate picks it up, they keep it.\n\nI greeded, so they keep my greed. I'm good with budget guns anyways, I just wanted a good range advantage round 2.\n\nBut if they're making a stink about it, I'd give it back to keep morale high.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Diufoem",
            "body": "The real answer is throw the gun off the map",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impressive-Ad1741",
            "body": "If he didnt die both time no kills and cry give it back",
            "score": 1,
            "replies": []
        },
        {
            "author": "CinnamonStew34s_eh",
            "body": "unless it's a op(I give to the duelist or the chamber), otherwise any other gun I find is mine(except a vandal, I'm a bodyshot guy with 15% hs so that goes to any guy with more frags than me :/), keep the phantom and judge",
            "score": 1,
            "replies": []
        },
        {
            "author": "HugeHomeForBoomers",
            "body": "1 thing I learnt my past 10 games. The 2nd coming of Little whining pheonix main are upon are! Please them or die trying to fight against them. \n\nBut seriously, why is there so many phoenix kids out? Have some massive toxic streamer like taric or jollz picked up phoenix?",
            "score": 1,
            "replies": [
                {
                    "author": "DemandImmediate6471",
                    "body": "Phoenix is still less popular than Raze, Jett, Reyna lol.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Interesting_Web_9936",
            "body": "Don't give it back. You need to make a statement, asking for a gun like that is the most bullshit thing. That player does not deserve a good gun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "igotwingss",
            "body": "this is diamond but i had this happen on sunset long time ago(it feels like long ago). the duelist was a reyna but we were defending, so he pushed for eco frags but ended up dying. i had to clutch our buy round 1v3 because of their mistakes, especially reyna’s. in the end i got the vandal and this guy bugged me for the whole game while bottom fragging, and trying to say that diamond is a pisslo(lowkey i agree im ass). but he was peak asc 1 LOL. we won the game but to stop costing my games i decided to just give the gun “back” the next time it happens(never happened again).",
            "score": 1,
            "replies": []
        },
        {
            "author": "krsna_1102",
            "body": "Just keep it...u die the gun dies with u...simple",
            "score": 0,
            "replies": []
        },
        {
            "author": "Hi_im_nsk",
            "body": "Keep it, giving back only applies to operators",
            "score": 0,
            "replies": []
        },
        {
            "author": "Fledramon410",
            "body": "Give it back. This is what always happen in plat and below. They dont buy after winning pistol round but when i buy and win the round for them with the gun and die, they refused to give back the weapon. It’s so selfish. I sacrifice my creds to win the round and get 3000 creds next round. I deserve my weapon back. People like you are the reason why people dont buy after win pistol round anymore. \n\nThe higher you climb you’ll see its normal to buy vandal second round and return back the gun to the buyer on the next round or at least buy another gun for them.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Molay_MCC",
            "body": "If he isn’t toxic about it then yeah ur supposed to give the gun to ur duelist",
            "score": 0,
            "replies": []
        },
        {
            "author": "SKuLLIsTooNoob",
            "body": "Keep it . They died with it so it's not like they would've gotten it back anyway.",
            "score": -6,
            "replies": []
        },
        {
            "author": "shurpness",
            "body": "If someone buys a vandal, I'm keeping it if I pick it up unless they're performing well.",
            "score": -4,
            "replies": []
        }
    ]
}