{
    "title": "🎶Grandpa's got a gun🎶🎸",
    "author": "Slight-Garlic534",
    "subreddit": "BoomersBeingFools",
    "rank": 14,
    "score": 278,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 173,
    "url": "https://v.redd.it/ldgn360c99pe1",
    "id": "1je2e6l",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Remember to report submissions that violate the rules! Harassment and encouraging violence are not allowed.\n\nEnjoying the subreddit? Consider joining our discord server: https://discord.gg/v8z8jNwJs6\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BoomersBeingFools) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "human_trainingwheels",
            "body": "Fucking boomer, that should cost him his carry permit if he has one",
            "score": 383,
            "replies": [
                {
                    "author": "BigJayPee",
                    "body": "It should be jail time. I'm all for 2A rights for self-defense and stuff, but this fool pulled it out because he was losing the fight he started.",
                    "score": 312,
                    "replies": [
                        {
                            "author": "A-Clockwork-Blue",
                            "body": "It is. It's called Brandishing a Weapon and can often be paired with multiple other charges which can absolutely lead to jail time.\n\nI live in Texas. A lot of fuckin idiots here own guns without any formally training or license.\n\nA guy not too long ago whipped out his gun after a road rage incident and caught jail time.\n\nYou absolutely cannot just pull that shit out and threaten people.",
                            "score": 103,
                            "replies": [
                                {
                                    "author": "poorbred",
                                    "body": "Here in Alabama brandishing is even suggesting you're going to use it in a situation where it's not warranted.\n\n>The mere carrying of a pistol, holstered or otherwise secured on or about one's person, without brandishing the weapon, in a public place, in and of itself, is not a violation of this section. For purposes of this subsection, \"brandishing\" shall mean the waving, flourishing, displaying, or holding of an item in a manner that is threatening or would appear threatening to a reasonable person, with or without explicit verbal threat, or in a wanton or reckless manner.\n\n>Ala. Code § 13A-11-7\n\nFlourishing and/or displaying I was told can be along the lines of pulling your jacket open to reveal it.  Like the classic move in westerns when they tuck their duster behind them in preparation to draw.  If you're in an altercation and you intentionally reveal the weapon and it's a significant escalation, it can be argued a reasonable person would consider that a nonverbal threat of \"I'm armed and prepared to use it.\" (As explained to me, but that was years ago.)\n\nI got a conceal carry, but only to make it easier to get to the range and back.  I keep my pistol locked in a case when transporting it, but I figure better safe than sorry in case it breaks or whatnot and I have to get the gun home outside of it.\n\nJokes on me though. 6 months after I did, Alabama struck down that law and now any yahoo can conceal carry without a license or training.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "hjablowme919",
                                    "body": "He was assaulted from behind. If this was any number of red states, they all have Stand Your Ground laws.",
                                    "score": -97,
                                    "replies": [
                                        {
                                            "author": "LacidOnex",
                                            "body": "After assaulting the rider from behind lmfao. Not even remotely correct.",
                                            "score": 60,
                                            "replies": [
                                                {
                                                    "author": "HorneyHarpy82",
                                                    "body": "Dude, the profile",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "hjablowme919",
                                                    "body": "Never touched him. Just grabbed his bike.",
                                                    "score": -3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "New-Sky-9867",
                                            "body": "Nope. He started it. You can't escalate with a firearm because you started a physical confrontation - concealed carry rule 1. Learn the law.",
                                            "score": 47,
                                            "replies": [
                                                {
                                                    "author": "hjablowme919",
                                                    "body": "No. He did not start it. He walked away and was assaulted from behind. Shaking the guys bike is not assaulting the rider. Rider, being the pussy that he is, waited until the guys back is turned to shove him.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "New-Sky-9867",
                                                            "body": "I want to live in your reality, but I'm not off my meds",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "A-Clockwork-Blue",
                                            "body": "Stand Your Ground still requires a justifiable reason to have to need one. \n\nGoing up and committing Battery and destruction of property *in the middle of the road* isn't going to fly. In fact, that's exactly what happened to the guy who got arrested here in Texas. Pulled a gun during road rage and ended up in jail.\n\nLiterally Google \"man pulls gun in road rage in Texas.\" There's like 20 articles (because Texans are fuckin dumb) and every single one is the same. A guy whips out a gun during road rage and gets charged.",
                                            "score": 27,
                                            "replies": [
                                                {
                                                    "author": "Living_Struggle_8022",
                                                    "body": "![gif](giphy|dXFKDUolyLLi8gq6Cl|downsized)\n\nTexas has some dumbasses",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "hjablowme919",
                                                    "body": "I’d say being attacked from behind, pushed to the ground where the person who assaulted you can now kick and stomp the shit out of you is a good reason. The rider didn’t shove and walk away. He stayed there until the old guy pulled his gun. Who knows what damage he would have done if the old man didn’t pull the weapon. Which is exactly the situation stand your ground laws were created for.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Farkon",
                                            "body": "Yea, after that boomer assulted him he should of standed his ground.",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "author": "hjablowme919",
                                                    "body": "Never touched him. Just grabbed his bike.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Easy-Bathroom2120",
                                            "body": "He assisted someone else. You can't just assault someone and claim self defense when there's retaliation.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "hjablowme919",
                                                    "body": "As soon as the old guy turns and walks away, it’s over. Biker starts a whole new incident by pursuing and shoving the guy to the ground from behind, like a pussy would.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "MagnusStormraven",
                                                            "body": "> \"As soon as the old guy turns and walks away, it's over.\"\n\nIf you start a fight with someone and then *turn your back on that person*, you don't get to act surprised or offended if the person you initiated the encounter by assaulting - and yes, shaking someone's bike around while they're on it IS a form of assault - goes \"I didn't hear no bell\" and rings yours a few more times when your back is turned.\n\nThe only pussy in this case are the wrinkly little troglodyte who pulled a gun once it was clear he was losing the fight HE started in the first place. If that biker was serious about harming the fucker, instead of simply putting him in check for his actions, the geezer would've never gotten his gun clear of the holster; a helmet is a great improvised bludgeon.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BecauseScience",
                                            "body": "You get that gold medal for those mental gymnastics?",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "hjablowme919",
                                                    "body": "“Boomers bad!” Rider is a pussy. Hits the guy from behind as he’s walking away.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LikelyBannedLS1",
                                            "body": "Stand Your Ground doesn't count when you exit your vehicle and create a fight where there wasn't one. Try again.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "hjablowme919",
                                                    "body": "That’s not what happened here. Stop lookin at this through the lens of “old people all suck”. Old guy was an asshole for getting out of his truck for sure. But he never hit the rider, he just grabbed his bike and shook it and walked away with his back turned. Once he turns and walks away, and because he never touched the rider, it’s over. Once the rider gets off his bike and physically assaults the old guy, now we have a stand your ground case.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "joshtheadmin",
                            "body": "Any self defense class will teach you to be passive and quick to flee while carrying a gun.",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "cottonfist",
                                    "body": "Unfortunelty I doubt this guy took any classes, and if he did he clearly didn't learn much",
                                    "score": 30,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "dmnckv",
                            "body": "Dude wanted an excuse to use his gun. Provoked a reaction by STARTING the conflict just so he can pull it in “self defense”. What a scumbag",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "Old_Artist3624",
                            "body": "Boomers gone boom.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "SpicyBanditSauce",
                            "body": "This is exactly why I hate 2A supporters. \n\nThey see shit like this and still want guns. \n\nThis man probably claimed all his life to be a \"responsible gun owner\".\n\nHe has probably been to the range hundreds of times over his life on this earth. He has probably taken tests to show he is competent with them to get a permit...\n\nAnd yet this *ALWAYS* happens and none of you get the fact that it won't ever fucking stop.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Fartknocker9000turbo",
                            "body": "[http://www.leg.state.fl.us/Statutes/index.cfm?App\\_mode=Display\\_Statute&URL=0700-0799/0790/Sections/0790.10.html](http://www.leg.state.fl.us/Statutes/index.cfm?App_mode=Display_Statute&URL=0700-0799/0790/Sections/0790.10.html)",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "revrobuk1957",
                            "body": "Does the 2nd amendment cover carrying a firearm for self defence? I thought it was just in case they needed to form a “well regulated militia”…",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "BigJayPee",
                                    "body": "That falls under \"and stuff\" from my previous comment.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Poonpatch",
                                            "body": "Where does the 2nd amendment specify \"and stuff\"?  \nThe \"well regulated militia\" question is a valid one.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "hjablowme919",
                            "body": "He didn’t start the fight, legally. He never touched the rider, just grabbed his bike. Rider escalated by pushing the guy from behind.",
                            "score": -46,
                            "replies": [
                                {
                                    "author": "Slight-Garlic534",
                                    "body": "You touch me or my shit, I'm gonna handle you myself.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "hjablowme919",
                                            "body": "Then expect retaliation. Also, don’t be a pussy like the guy on the bike and push someone from behind as they are walking away.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "si_wolfbane",
                                    "body": "Rider has a right to protect his property.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "hjablowme919",
                                            "body": "Not once the old man turns and walks away.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "si_wolfbane",
                                                    "body": "Good point.  Might depend on if it's a stand-your-ground state or not (I am not a lawyer).\n\nRegardless,  I still think the old man should get jail for brandishing a firearm.  He went straight for that gun after getting a little shove.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Easy-Bathroom2120",
                                    "body": "If biker touched his car, he'd have gotten shot.\n\nBut boomer can try to knock biker off his bike and it's just ok?\n\nInsane logic. You're not allowed to just touch other people's stuff, especially with intent to intimidate.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "hjablowme919",
                                            "body": "You can’t legally shoot someone for touching your car.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Easy-Bathroom2120",
                                                    "body": "You also can't legally try to knock someone off their bike. And you can't legally pull out your firearm to threaten someone.\n\nYet here we are. This guy thinks rules don't apply to him and its bc he's never held accountable.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Lunavixen15",
                                    "body": "Yes he did. He had no right to be interfering with the rider's bike, it's what caused the argument. The boomer fool was looking for an excuse to brandish his gun.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "hjablowme919",
                                            "body": "He never touched the rider.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Acceptable-Suit-1834",
                                    "body": "Please tell me you're not serious...",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "hjablowme919",
                                            "body": "He never touched the rider.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Acceptable-Suit-1834",
                                                    "body": "He did though, in the beginning. But regardless, are you suggesting that if someone is actively destroying your property, you're supposed to just let them do it?",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LikelyBannedLS1",
                                    "body": "You're severely misinformed about how gun laws work.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "hjablowme919",
                                            "body": "Nope",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hrtpplhrtppl",
                    "body": "If the dude on the bike was carrying it would have cost him his life. With all the guns in America, why do people assume that they are the only ones armed with one..?\n\n![gif](giphy|xT9KVhLU76MRgVg3Qc)",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Noble_Hieronymous",
                    "body": "His permit? This man has had long enough to learn how to be a human.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Gullible_Method_3780",
                    "body": "Execution. These ego trips need to end. ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Viperbunny",
                    "body": "He should be in prison. You don't brandish a gun. That was intent.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "hjablowme919",
                    "body": "Probably lives in a state where you don’t need one.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "BAEB4BAY",
                    "body": "Should get all his guns taken and barred from owning.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Kerensky97",
                    "body": "Sounds about right. Physically starts an altercation. Then pulls a gun for \"self defense.\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ego_tripped",
            "body": "And there it is...right there.\n\nIt's not about defending oneself in the US, it's permission to be a dick when under any other *normal* circumstance you'll be a chicken...or just a normal human being.",
            "score": 190,
            "replies": [
                {
                    "author": "GrandPriapus",
                    "body": "I have two uncles whose wet dream would be being able to whip out their guns to threaten someone.",
                    "score": 42,
                    "replies": []
                },
                {
                    "author": "hjablowme919",
                    "body": "The guy who pulled the gun was shoved to the ground from behind and maybe even kicked or punched as we can’t see what happened. \nStand Your Ground laws allow him to pull his weapon.",
                    "score": -72,
                    "replies": [
                        {
                            "author": "DifficultAd3885",
                            "body": "If you initiate the confrontation you lose your ability to claim self defense. You can’t punch someone in the face and then you pull your gun when they fight back.",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "ZealousidealCrow8492",
                                    "body": "Tray von Martin would like to differ... but hes dead so he cant",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "jimbo91375",
                                            "body": "Well, Travon was black, so the laws don't apply the same way. /s",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "radjinwolf",
                                            "body": "Getting downvoted for speaking the truth. Pure Reddit moment.\n\nDon’t think people are rubbing their brain cells together to understand what you’re saying: George Zimmerman was the one who started the confrontation with Trayvon, and when Trayvon tried to defend himself, Zimmerman took out his gun and shot him. \n\nZimmerman was the aggressor, yet he got to claim “stand your ground” because Trayvon fought back. Fought back against a grown ass man who was accosting him in his own neighborhood at night.\n\nThis is America.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "hjablowme919",
                                    "body": "That’s absolutely incorrect. Plus, the rider who pushes the old guy from behind, like a pussy would, is the first one to make physical contact with the other.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "USSSLostTexter",
                            "body": "a scenario he, himself, created by getting out of his car to mess with the biker.  Biker was baited in to reacting and defending himself.   \n\nI'm sure man with the gun has already told several of his friends and family about how he 'taught a guy a lesson' and 'watched the guy run away like a baby' when he pulled out his gun on him.   It was this dude's wet dream to do that and probably not the first time he did.   This is the type of person should not own a gun or at least not be able to carry (concealed or open).",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "hjablowme919",
                                    "body": "Doesn’t matter. He doesn’t make physical contact with the other person.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AardQuenIgni",
                            "body": "You don't get to instigate by attacking the biker and then call yourself the victim and kill someone for it. \n\nAnyone who's actually attended any CCW class would know that Stand Your Ground wouldn't apply here.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "hjablowme919",
                                    "body": "He shook the guys bike and walked away.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "AardQuenIgni",
                                            "body": "Thats a very childish way to see it, and I think you know that.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "twister428",
                            "body": "Not when he started the confrontation in the first place, as it looks like is the case. He's out of his car doing whatever he was doing to the bike/biker, and then the guy retaliates. You don't get to road rage and attack people, then claim self-defense when they fight back. The biker was in the wrong for the shove, but that doesn't make the driver of the car right for starting it in the first place, assuming he did.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "hjablowme919",
                                    "body": "Once the old guy walks way, it’s over. He never physically assaulted anyone.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "twister428",
                                            "body": "I'm pretty sure what he did to the bike would technically be classified as assault. Regardless, you don't get to get out of your car in traffic because you're road raging, put yourself in danger, and then claim self-defense.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "FriendlyITGuy",
                            "body": "But what did the biker do to deserve boomer jumping out of his car to try and rip his license plate off? We don't see enough of the story.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Hike_and_Go891",
                                    "body": "Additionally, depending on state, Boomer getting out of his car can carry a ticket (and points) all on its own.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "hjablowme919",
                                    "body": "I don’t know. Video doesn’t show that.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "FriendlyITGuy",
                                            "body": ".... That was my point.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "the_propagandapanda",
                                    "body": "The license plate was hidden you can see when he first grabs it. It was flipped up into the wheel well. Probably got into some road rage with the biker and saw the plate and he went to “fix” it.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SigmaPlateau_Way7188",
                            "body": "Found the coward",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "hjablowme919",
                                    "body": "You must be looking in the mirror.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Curt28781",
                            "body": "[ Removed by Reddit ]",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "hjablowme919",
                                    "body": "No. Stand your ground does not work like that.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Curt28781",
                                            "body": "Are you trying to say non-lethal force is not equal to lethal force?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Tricky-Major806",
                            "body": "Did you see how the confrontation started…",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "hjablowme919",
                                    "body": "I saw the video in the post. He’s pulling on the guys bike. Once he turns and walks away, it’s done. Guy gets off his bike and, like a pussy, attacks from behind.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Tricky-Major806",
                                            "body": "Ok, you good with me slapping you in the face and walking away? I’m walking away the confrontation is over!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "meow13x13",
                            "body": "He fucking started it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "hjablowme919",
                                    "body": "No. Walking away ended it.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Viperbunny",
                            "body": "After he attacked the guy on the bike. He started a fight. Then he tried to escalate that with a gun. There is absolutely no self defense claim. The biker was defending himself.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "hjablowme919",
                                    "body": "He never touched the guy on the bike.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Viperbunny",
                                            "body": "He grabbed the back of that man's bike. That is battery. Given it was in traffic, what he did may be a few different crimes. But please, advocate for the asshole who started a fight and then brandished a gun in public!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "hjablowme919",
                                                    "body": "I grab the bumper of you car I’m not touching you. It’s not battery. Battery is physical contact with another person, not something they are sitting on.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Viperbunny",
                                                            "body": "A car is not the same a bike with a person on it.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jacknimrod10",
            "body": "What the fuck is wrong with America? There is no way that old guy would have done that if he wasn’t carrying a gun. How can he claim it was for self defence?",
            "score": 124,
            "replies": [
                {
                    "author": "Olly0206",
                    "body": "Depending on where he lives, that absolutely is self-defense. It's bullshit, but the law allows for the initial aggressor to disengage, and then if the initial victim pursues, the initial aggressor can claim self-defense. It's how Kyle Rittenhouse got off.\n\nThe boomer is clearly the guilty party here by any moral standard, and there is a chance a jury could agree, but since he walked away, that \"ended\" the confrontation. The biker then started a new confrontation where the boomer can pull a gun and \"defend\" himself.\n\nIt's a bullshit loophole in the law that some states have. Many states, I believe.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "jacknimrod10",
                            "body": "I stand by my original question",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "Olly0206",
                                    "body": "I agree wholeheartedly. It's the point that might resonate with a jury to find him guilty, but a good lawyer can spin it.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Fartknocker9000turbo",
                                            "body": "Now, if the motorcycle guy had a gun too, they would argue, he could have just shot the aggressor and claimed he feared for his life when he initially approached in his road rage.  This is why everyone needs to carry a gun! Partially/s",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "jacknimrod10",
                                                    "body": "The old ‘only way to stop a bad guy with a gun, is a good guy with one’ defence eh, much favoured of your batshit dictator. Seems like a perfect way to get innocent bystanders killed to me. That old guy was raging. Surprised he didn’t shoot his own cock off",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "hogsucker",
                            "body": "I read elsewhere this took place in Florida, the home of George Zimmerman.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "BAEB4BAY",
                            "body": "It’s not, he will still be charged for brandishing a fire arm along with a few other charges. This isn’t a case of what you’re describing. He would be found guilty of the whole situation because of where it’s happening, the fact he is the initial aggressor, he brandished a firearm and threatening with a deadly weapon. \nIt would not be self defense. Self defense must meet the burden of reasonable belief one’s life is in danger. Getting pushed because you instigated a situation then just walked away after damaging property is not disengaging. You can’t claim self defense if you start the altercation. Especially if you’re armed like that.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Olly0206",
                                    "body": "That's why I said it depends on the state. Every state has different laws.\n\nKyle Rittenhouse brandished his weapon first and instigated a conflict, but he turned his back and walked away, allowing him, by law, a way out of the confrontation. This removed him as the aggressor and turned him into the defender/victim per the law, and the jury agreed.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "BAEB4BAY",
                                            "body": "Yeah there was little to no evidence he actually threatened or menaced anyone with it first. Someone actually brandished against him first and only responded after being chased and cornered and attacked. The sequence of events that have outlined his case exonerated him.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Olly0206",
                                                    "body": "He showed up with his gun first. He 100% brandished a weapon first. There is footage and pictures of it. It is outlined in the case as well. But because he \"walked away\" it legally ended that conflict and made him no longer the agressor in that moment.\n\nI'm summarizing, of course. It's still a bit more complex than that. There are lawyer breakdowns on YouTube that actually analyze the laws that were referenced and used in the case.\n\nI'm not saying Rittenhouse is legally guilty. I think from a moral perspective that he 100% is guilty, but the law doesn't always align with personal morals.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ChadWestPaints",
                                            "body": ">Kyle Rittenhouse brandished his weapon first and instigated a conflict\n\nHe also didn't do that. So that helped.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Olly0206",
                                                    "body": "He 100% did. There is footage of it. He even admitted he showed up with a gun. He said it was for protection. He said it was to defend his \"friend's\" dealership at said friend's request, even though that \"friend\" said they never asked him to.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ChadWestPaints",
                                                            "body": ">He 100% did. There is footage of it. \n\nOh. \n\nCool. \n\nLink and timestamp it, then, if youre not lying. \n\nBest of luck.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Olly0206",
                                                                    "body": "https://www.youtube.com/watch?v=k9PRqHYTiaE&ab_channel=Law%26CrimeNetwork\n\n0:24-0:28 second mark is a clip from a bystanders phone before any shootings acknowledging Rittenhouse and another as \"medic's who are packing\" to which Rittenhouse replies \"yes.\" He is walking around with **brandished** firearm first.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ChadWestPaints",
                                                                            "body": "Right so the issue here is that you dont understand the difference between brandishing and open carrying. Rittenhouse was open carrying. Not brandishing. Open carrying is not instigating or provocation.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Olly0206",
                                                                                    "body": "Witness testimony said he did. \n\nThere is an argument for open carry absolutely being considered brandishing and threatening. No cop is going to just let you open carry if they have to interact with you. They consider you simply having a weapon on you as a threat and will disarm you. If cops can treat you as a threat simply because you have a gun on you, then so can the public.\n\nNot to mention, there was no reason to bring a weapon to a peaceful protest. The fights and riots didn't start until after Rittenhouse and co stirred shit up, according to some witnesses.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "LastWhoTurion",
                                                                                            "body": "So just your feels that he was brandishing. Not legally. Brandishing is using your firearm in a manner that would suggest that unless someone changes their behavior, you will shoot them.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Olly0206",
                                                                                                    "body": "I linked a video with several clips of him brandishing his gun. I dunno what else you want from me.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "LastWhoTurion",
                                                                                                            "body": "He was carrying it yes. Brandishing would be pointing it at someone, making verbal threats while holding the gun, stuff like that.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "ChadWestPaints",
                                                                                            "body": "Ah. So we moved from \"theres video\" to \"witness said so.\" \n\nAlright. Link the testimony",
                                                                                            "score": -1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Olly0206",
                                                                                                    "body": "Not moved. It exists in both. I've already stated as much. I've already linked video. You can keep pushing the goalposts, but it isn't helping you any.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "ChadWestPaints",
                                                                                                            "body": "But you didnt provide video of brandishing. You provided video of open carrying. Huge difference. No goalposts have been moved *by me.* You claimed A so I asked for evidence of A. You provided evidence of B and tried to pass it off as A.",
                                                                                                            "score": 0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Super_Reading2048",
                    "body": "How do you know it was in America?",
                    "score": -11,
                    "replies": [
                        {
                            "author": "jacknimrod10",
                            "body": "Seriously? You think the American lady in the car was in France or somewhere and an American motorcycle coincidently pulled up in front of her only to get in a fight with some old guy, openly carrying a gun, who has been following him halfway across the world? Cos that would be wild.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "sylvnal",
                            "body": "The situation itself and the obesity. And the oversized vehicles. The ARCO. Driving on the right side of the road. The stoplights.\n\nNeed I go on?",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Detox64",
                            "body": "Is this some kind of joke?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Slight-Garlic534",
                            "body": "![gif](giphy|oUS6u2rbjg4JD4Z9Lp)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "project__matt",
            "body": "Way too many bitch made people quick to pull a gun in this country.",
            "score": 26,
            "replies": []
        },
        {
            "author": "CookieBear676",
            "body": "Small man syndrome with a gun added in.",
            "score": 26,
            "replies": []
        },
        {
            "author": "derek4reals1",
            "body": "Your average Maga gun owner.\n\nhttps://i.redd.it/lu5qii2lqfpe1.gif",
            "score": 62,
            "replies": []
        },
        {
            "author": "Astronomer_Even",
            "body": "Always assume someone belligerent is carrying, if you’re in the USA. This is the dystopian paradise conservatives wanted. Everyone carrying and every encounter with another human is potentially fatal.",
            "score": 19,
            "replies": [
                {
                    "author": "hjablowme919",
                    "body": "Yup. Whenever I am outside of NY, I just assume everyone owns a gun and I avoid all confrontation:",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "jacknimrod10",
                    "body": "I’ve always wanted to spend a few months doing a big road trip across the US but there’s no way I would do it without a weapon. Out of interest, is that even possible?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ku_78",
                            "body": "I have done several and not once did I ever think, I need a gun.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "NeurodiversityNinja",
                            "body": "Ha. I've never felt the need to carry a gun, ever, and I'm a medium built woman who was single half my life. Now if I were going on the Appalachian Trail, or super remote places where they recommend one (or for bears), only after training.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Slight-Garlic534",
                                    "body": "Nice that you live somewhere you can do that....",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "hifumiyo1",
            "body": "I’m going to go manhandle your bike for no good reason, and when I get rightfully upset about it, out comes a firearm. Create the problem, and when confronted about the problem you created, escalate dramatically with potential deadly force. 🙄",
            "score": 9,
            "replies": [
                {
                    "author": "NeurodiversityNinja",
                    "body": "He was trying to steal the bikers license plate so he couldn't ride anymore, I assume. \n\nIt would be Bonus Boomering if the old man did it bc he needed \"evidence\" or to remember his plate number (rather than take a picture).",
                    "score": 11,
                    "replies": [
                        {
                            "author": "BigJayPee",
                            "body": "To a boomer, ripping off a license plate is easier than taking a picture with a cell phone.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "the_propagandapanda",
                            "body": "If you look right at the beginning the plate looks like it was flipped to be unreadable or hidden. A lot of bikers that drive fast or aggressive will put magnets and/or a hinge so they can flip their plate onto the bottom of their wheel well. Biker probably pissed the old guy off with his driving and the old guy went to “fix” his plate as a response. \n\nThis is a cheap example. There are better ones but it’s the first I could find. \n\nhttps://a.co/d/4wgISLi",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "patcatpatcat",
            "body": "I blame Trump",
            "score": 30,
            "replies": [
                {
                    "author": "Drivefaster4u",
                    "body": "As we all should!",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "AcadianViking",
                    "body": "This has been an issue for far longer than the fascist orange man-child\n\nTrayvon Martin was shot in 2012 after defending himself against harassment by George Zimmerman, who got off on BS self-defense claims.  \n\nThis is a deeply rooted cultural flaw of this country. One of many.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dritarashtra",
            "body": "Menacingly Armed Grandpa Alert",
            "score": 7,
            "replies": []
        },
        {
            "author": "42ElectricSundaes",
            "body": "Typical boomer. Starts a fight then plays the victim. Every. Time.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Efficient-Release500",
            "body": "Hopefully he tests out how well the barrel fits in his fucking mouth fucking coward bitch",
            "score": 7,
            "replies": []
        },
        {
            "author": "Geotryx",
            "body": "This is why gun laws make no sense. They’re not carrying a gun to protect themselves from grave bodily harm. They are the grave bodily harm.",
            "score": 6,
            "replies": []
        },
        {
            "author": "S0ylentBob",
            "body": "Typical Trump voter behavior.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Fartknocker9000turbo",
            "body": "Straight to jail.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mariner1990",
            "body": "It would have been interesting to see what started this incident.  Regardless old man, sell the gun before you do something you can’t undo.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AusCan531",
            "body": "I'm glad I live in a civilised country.",
            "score": 7,
            "replies": []
        },
        {
            "author": "powerroots99",
            "body": "This is too much. Older gentleman is a bit sick likely",
            "score": 4,
            "replies": [
                {
                    "author": "AcadianViking",
                    "body": "Bog standard MAGA republican. \n\nGun toting lunatics just looking for an excuse to \"stand their ground\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lordfril",
            "body": "I never understood the anger ppl get toward motorcycle riders?",
            "score": 4,
            "replies": []
        },
        {
            "author": "darklogic85",
            "body": "It's a bad idea to start a fight with someone wearing biker gear. They're basically wearing armor, and the gloves have kevlar or metal in the knuckles and are similar to brass knuckles. You won't be able to hurt them with the helmet on and if they decide to hit you, they can do a lot of damage with those gloves.",
            "score": 4,
            "replies": []
        },
        {
            "author": "TruckGray",
            "body": "Another a hole “tuff guy” who is only tuff becaus he has a gun. His day wouldve gone better if he didnt have one and just minded his own business.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sliderisk",
            "body": "That's why you just lay them out and ask questions later.  Dude deserves a pavement nap for walking up and assaulting someone while they are legally driving a vehicle.  Confronting him with words back at his car is a good way to let him find his gun and escalate.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Indoor_Carrot",
            "body": "Why are so many gun owners so desperate to shoot people?\nWhy are they all so unhinged?\nNo wonder they're quiet on school shootings. They're obsessively violent.",
            "score": 3,
            "replies": []
        },
        {
            "author": "casualAlarmist",
            "body": "Boomer doesn't seem \"well regulated.\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fun_Stock7078",
            "body": "Oh to live in a country where a simple disagreement can end in a shooting. Good old USA….🤦‍♂️",
            "score": 3,
            "replies": []
        },
        {
            "author": "RealityIsRipping",
            "body": "This is why the biker should also have a gun. That boomer wouldn’t be alive to make this mistake again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "wetbirds4",
            "body": "M’urrica",
            "score": 2,
            "replies": []
        },
        {
            "author": "Curt28781",
            "body": "Start shit then start crying and pull a gun.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ShefGS",
            "body": "These people think they can do whatever they want just because they carry around an emotional support weapon",
            "score": 2,
            "replies": []
        },
        {
            "author": "tlrider1",
            "body": "Anyone who is the aggressor or escalates a situation because they're carrying and know they have the additional protection of their gun, needs to lose their ccw.  Regardless of what the biker did.\n\nIf you start picking fights, while carrying, you have no business carrying.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ericfromthewell",
            "body": "pretty sure that’s jail time? not an expert here pls don’t be mean",
            "score": 2,
            "replies": []
        },
        {
            "author": "nono66",
            "body": "I got money on him claiming he's \"good guy with a gun.\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "navigationallyaided",
            "body": "Take away his guns, he should ride the bus.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheeWoodsman",
            "body": "OP, I haven't heard that song in forever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PipeComfortable2585",
            "body": "Big man",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dependent_Guess_873",
            "body": "This is why americans cannot be trusted with guns",
            "score": 1,
            "replies": []
        },
        {
            "author": "TipMedium2055",
            "body": "This old fuck (and others like him) do this shit on purpose just so they can pull a gun on someone and \"exercise their rights.\"\n\nGet fucked old timer. Karma always gets their man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mrspygmypiggy",
            "body": "America’s wild like wtf was all that?",
            "score": 1,
            "replies": []
        }
    ]
}