{
    "title": "Boomer makes fake promises to fools.",
    "author": "Scared_Performer_750",
    "subreddit": "BoomersBeingFools",
    "rank": 4,
    "score": 2593,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 130,
    "url": "https://i.redd.it/523gg83zdgpe1.jpeg",
    "id": "1je5fxp",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Remember to report submissions that violate the rules! Harassment and encouraging violence are not allowed.\n\nEnjoying the subreddit? Consider joining our discord server: https://discord.gg/v8z8jNwJs6\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BoomersBeingFools) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "danbearpig2020",
            "body": "![gif](giphy|PqVt4Oh0gfhfTnW01p|downsized)",
            "score": 185,
            "replies": [
                {
                    "author": "BigConstruction4247",
                    "body": "Such an underutilized insult.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "UsualSuspect95",
                            "body": "Bozo, schmuck, klutz, they're all good insults! If you're gonna insult people, borrow from Yiddish!",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "Daflehrer1",
                                    "body": "Came here to say this. So many good descriptive terms from Yiddish!",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "DeeSnarl",
                                    "body": "And I was literally just thinking about how much I like mensch as an accolade.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "ProfessionalGuess251",
                                    "body": "I tend to use Spanish terms, like pendejo",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "UsualSuspect95",
                                            "body": "A German favorite of mine is Arschgeige.  Which literally means \"ass fiddle\".",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Pizza_Saucy",
                                    "body": "Shmohawk, thank you Curb Your Enthusiasm.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Several_Razzmatazz51",
                                    "body": "schlemiel is one of my favorites",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AutoModerator",
                                            "body": "Hello, your comment was removed because your account is under 2 days old. Please wait for 48 hours and try again.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BoomersBeingFools) if you have any questions or concerns.*",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "an_agreeing_dothraki",
                            "body": "the only problem is that the old clown brought joy",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "runjcrun1",
                            "body": "Jabroni is also a great one",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "UsualSuspect95",
                                    "body": "You mean like getting out of that Jabroni outfit?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pianoflames",
                            "body": "_She told him to \"beat it, bozo!\"_",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Human-Bluebird-1385",
                            "body": "makes it more fresh to dispatch when the timing is right",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Branchomania",
            "body": "Damn I'm glad he won and none of that bad stuff happened, could you imagine",
            "score": 219,
            "replies": [
                {
                    "author": "tato_salad",
                    "body": "same.. SO good that the witch Kamala dit' win and make everyone use pronouns.. imagine how that would have been?   So glad the counry is currently getting raided for the sake of the rich, at least pronouns and protections for trans aren't happening, and that FIANLLY the white MIddle aged Man can stop being discriminated against!\n\n/SARCASM",
                    "score": 58,
                    "replies": []
                },
                {
                    "author": "Easy-Bathroom2120",
                    "body": "I keep seeing people online talking about how cheap eggs are now.\n\n... Eggs are $11 for me. They're going bad on the shelves bc no one can afford them.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "FROG123076",
                            "body": "My son tried to tell me that egg prices are down. I asked him when he last bought eggs was, cause I was at the store two days ago and they have gone up. I told him his podcasters are lying to him and to get his head out of his ass. (He's 25)",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Easy-Bathroom2120",
                                    "body": "Send him out to go buy some eggs. Tell him how much he should expect to pay, assuming prices have gone down.\n\nTell him you'll have omelettes every day.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SketchSketchy",
                            "body": "That’s the worst thing I’ve seen in my life. Display case 80% empty, only one brand of eggs, all of them tagged with 50% off tags because today is their expiration date. They sat there alone at $12.99 until they expired.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "gr33n_lobst3r",
                                    "body": "You can eat eggs well after the stamped expiration date. They can stay good for two to three months past. When I lived alone I did it all the time. If you're not sure if an egg has gone bad, put it in a bowl of water. Bad eggs float.\n\nAsk the manager if they will sell you the eggs at a reduced rate if the date is coming up and they have a shit ton. They normally clear inventory before the actual date comes, so it's a win win to sell at all. Just make sure they know you only want to buy a reasonable amount at the reduced rate. They'll do it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SketchSketchy",
                                            "body": "I know that. It doesn’t change what a bummer the sight of that was. Eggs going in the trash during a time of shortage because the price was too high. That’s not supposed to happen. That’s a sign of multiple things being very wrong.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "gr33n_lobst3r",
                                                    "body": "Oh I completely fucking agree, don't get me wrong about that. Just wanted to provide a frugal tip in these times of shittiness",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DemonoftheWater",
                            "body": "They’re like $5-$8 where I live but all the stores have put purchase limits on them to keep stock up.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "WittyPresentation786",
                            "body": "No joke, I went to order eggs on Sunday and they were $17.99 a dozen. No organic, free range. Normal large eggs🤷🏼‍♀️",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Easy-Bathroom2120",
                                    "body": "Imagine making a scrambled egg on your own stove and that alone is over $1 per egg.\n\nWhere I work, we are taking eggs off the shelves bc they just go bad. No one's buying them.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Particular_Title42",
                            "body": "I am very grateful to be able to have chickens and give eggs to some of my neighbors.   \nThe last time I paid attention to egg prices where I was shopping, you could buy one dozen extra large eggs for $6.04. Additional cartons would be $10.88 each.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Branchomania",
                            "body": "If you say it enough it’ll come true",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Kaida33",
                    "body": "Did you forget/s ?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ArnieismyDMname",
                            "body": "If the sarcasm was any thicker, you could use it for syrup.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "ravoguy",
                                    "body": "Canada is no longer sending syrup, sorry eh",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TieFighterHero",
            "body": "https://preview.redd.it/8j5we0lnggpe1.jpeg?width=1162&format=pjpg&auto=webp&s=7e800214e839a254fce7e2e411b04a361a83c753",
            "score": 77,
            "replies": [
                {
                    "author": "Outlandishness_Know",
                    "body": "Someone on CNBC said “He’s even underperformed himself”.\n\nSomeone else said when he admits something n he’s really just admitting to what he’s done or going to do and I’m starting to see it now",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Aeronor",
                    "body": "A picture's worth a thousand words, and this one even speaks their language.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Mathilliterate_asian",
                            "body": "Nah their language is hate and bigotry.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dirtashblonde",
            "body": "Everyone that voted for trump can literally fuck off!!!",
            "score": 100,
            "replies": [
                {
                    "author": "Creepy-Team6442",
                    "body": "And die.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "dixiech1ck",
                            "body": "Oh they will. The 96 tornadoes that went through the Midwest was just a start and the measles outbreak was just a start. I'm waiting on the locusts next but not before Tornado Outbreak Part Deux comes in next week.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "No_Philosopher_1870",
                                    "body": "With another couple of years of drought, Dust Bowl II looks like a good bet.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Common_Highlight9448",
                                    "body": "And the hand will be out looking for fed cash on every frigging one",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "dixiech1ck",
                                            "body": "Except that's socialism and we all know how they feel about THAT 🙄",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Common_Highlight9448",
                                                    "body": "You forgot about hurricane season starting soon !!",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "specialopps",
                                    "body": "That’s a pretty nauseating forecast. And this is just March. Outbreaks like over the weekend go until May.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Drivefaster4u",
                            "body": "No no exile them to north korea or russia",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "S1DC",
            "body": "They literally just say anything they want and back it up with nothing. And then when it doesn't happen they blame anyone but themselves. Fucking idiots.",
            "score": 37,
            "replies": [
                {
                    "author": "BigJayPee",
                    "body": "If they dont blame anyone else, they are just like, \"Oh, yeah, um, i think this was our plan.... sure we planned this, it builds character.\"",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Responsible_Dig_585",
            "body": "\"It's what he said, but what he MEANT was 'Recessions are an important part of a healthy economy, and being temporarily jobless builds character. Also, laughing Kamala couldn't cause a recession this nice.' obviously\"",
            "score": 22,
            "replies": []
        },
        {
            "author": "Snarkasm71",
            "body": "The problem with anything and everything Trump says is when he’s talking about untold wealth, he’s talking about the people who are already very wealthy. I don’t know why people think he’s talking about the majority of us, he isn’t.\n\nTrump, his kids, the people in his circles, have no idea what it’s like to live as someone making anywhere from $12-$50 an hour. Do you think Donald Trump has ever set foot in a 1500 square-foot ranch home, priced TVs, or gone to the grocery store and looked at the price per ounce on laundry detergent to figure out which jug is the better deal? He has no concept of any of that. So why people thought Donald Trump could relate to them will forever boggle my mind.\n\nSo he’s right, for his very rich friends and the people he considers worthy, they will ultimately see more wealth. The rest of us are fucked.",
            "score": 16,
            "replies": []
        },
        {
            "author": "BojukaBob",
            "body": "We live in a post truth era. People don't want the truth, they want a pleasing lie.",
            "score": 15,
            "replies": []
        },
        {
            "author": "cheeseandrum",
            "body": "Right. Got layed off in Nov. sent ~350 applications since with  3 denials and 0 human responses lol",
            "score": 10,
            "replies": []
        },
        {
            "author": "Background-Mud-777",
            "body": "If companies can’t create false adverts to use on the public, why can candidates?",
            "score": 10,
            "replies": [
                {
                    "author": "Le-Charles",
                    "body": "🤔",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SilentRhubarb1515",
            "body": "Is that big check in the room with us right now?",
            "score": 6,
            "replies": []
        },
        {
            "author": "tauntauntom",
            "body": "Potato Trump had his wires crossed as always.",
            "score": 6,
            "replies": []
        },
        {
            "author": "InvestmentSorry6393",
            "body": "![gif](giphy|11OQRFijlncwq4)\n\nVote for me and all your dreams will come true",
            "score": 5,
            "replies": []
        },
        {
            "author": "CoopGhost",
            "body": "He forgot to say “it’s Opposite Day!”",
            "score": 4,
            "replies": []
        },
        {
            "author": "originalmosh",
            "body": "*\"Prices will come down on day one!\"* BuT i HaVe OnLy BiN iN OfFiCe 80 dAyS...",
            "score": 4,
            "replies": []
        },
        {
            "author": "Aeronor",
            "body": "Make America Great (Depression) Again",
            "score": 3,
            "replies": [
                {
                    "author": "jesse1time",
                    "body": "🔥",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BishlovesSquish",
            "body": "The fact that anyone believes him is why America can’t have and doesn’t deserve nice things.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Hot-Scarcity-567",
            "body": "Aged like milk.",
            "score": 3,
            "replies": [
                {
                    "author": "jesse1time",
                    "body": "Like a fine unpasteurized vintage",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "stockstatus",
            "body": "![gif](giphy|QhjR3MG9ZFfjB6BtIZ)",
            "score": 3,
            "replies": []
        },
        {
            "author": "GallonofJug",
            "body": "Just die already",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nir117vash",
            "body": "![gif](giphy|vbPFS043TO9TNPDqhz)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Puzzleheaded-Rip-824",
            "body": "The projection on every level is crazy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Logical_Parameters",
            "body": "45 years later, we keep waiting for the diarrhea falling from the sky to turn to gold, or at least rain.\n\nAmerica can't quit Rethuglican Trickle Down Economics.  All they have to do is tell the same lies every 2 to 4 years and they snag millions -- hook, line, and sinker.  Sad.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Puzzleheaded-Skin367",
            "body": "So Americans saw how shitty his first presidency was, they gave him another. Enjoy the turmoil as I build my damn bunker",
            "score": 2,
            "replies": []
        },
        {
            "author": "bebejeebies",
            "body": "We gotta stop cropping out the datestamps.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Exploreradzman",
            "body": "NO VICTORY FOR THE LGBTQ. ESPECIALLY THA TRANS! IF KAMALA WON YOUR DAUGHTER WOULD GO TO SCHOOL AND COME BACK A MAN!",
            "score": 4,
            "replies": [
                {
                    "author": "ChickinSammich",
                    "body": "I sent my kid to school last week and they came back a boy on Monday, a girl on Tuesday, a boy on Wednesday, nonbinary on Thursday, and a girl again on Friday.  I can't get off Mr. Biden's Wild Ride!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DaClarkeKnight",
                    "body": "You really think it’s schools and the presidents that make kids trans? Kids don’t listen to their teachers. They don’t give a damn who the president is. They don’t listen to their parents. They listen to their friends and their phones.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Exploreradzman",
                            "body": "Look it was a circlejerks moment.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Suikoden_Tir",
                    "body": "We can not fully defend schools and you think they are doing bottom surgery..... I am assuming your dropped out of the 4th grade.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Exploreradzman",
                            "body": "No sense of humor. Wow. But it is real that there are boomers who believe this?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Suikoden_Tir",
                                    "body": "Yes, people really believe this and it is not just boomers.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Old_Artist3624",
            "body": "Still waiting tbf he didn’t which there’s days you have to wait. Didn’t say they are consecutive. And he probably the first day some random mt Rushmore honorary bobblehead day and his last day in office….",
            "score": 1,
            "replies": []
        },
        {
            "author": "tato_salad",
            "body": "economists say many such cases not happening.",
            "score": 1,
            "replies": []
        },
        {
            "author": "summizzles",
            "body": "Everything he says against others is an admission. He is literally creating an intentional economic collapse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BananaBitme",
            "body": "“Brightest economic future the world has ever seen” — we’ve lost 4 trillion since November",
            "score": 1,
            "replies": []
        },
        {
            "author": "UmpireMental7070",
            "body": "Tell people what they want to hear and when it’s proven to be bullshit over and over again just don’t acknowledge it. It’s worked for religion for thousands of years!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Richard_Espanol",
            "body": "Every accusation is an admission",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kaleban",
            "body": "No you all don't get it.\n\nHe never said what date those 3 days start from.\n\n![gif](giphy|n4jVkK2pqgLpCOLPzl)",
            "score": 1,
            "replies": [
                {
                    "author": "DrCares",
                    "body": "I always assumed it was after his heart attack",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PipeComfortable2585",
            "body": "How’s that working out for everybody",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Agency-6985",
            "body": "That sure as hell didn't age well at all!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raise_Hail",
            "body": "Literally sounds like a kid running for class president 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot_Opportunity5664",
            "body": "BS",
            "score": 1,
            "replies": []
        },
        {
            "author": "vanzir",
            "body": "I don't know if this is just getting reposted across every sub, or just repeatedly to this sub, but honestly, I am over it.  Boomers aren't the only fools anymore.  66% of this country either voted for, or didn't care enough to vote against what Trump is doing right now.  We are all complicit in this fucking tragedy.\n\nI mean fuck, boomers aren't even the largest voting demographic anymore.  I believe that honor belongs to Millennials these days.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DistinctGrand519",
            "body": "Well, it is not just boomers who believed his BS, was it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy-Document4574",
            "body": "Just like everything else he'll say he was being sarcastic",
            "score": 1,
            "replies": []
        },
        {
            "author": "details_matter",
            "body": "This technique is called Accusation in a Mirror, kids. Very cool and very honest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "seeclick8",
            "body": "He cannot speak about himself or his policies without using hyperbole.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hyperlinux",
            "body": "I think he got it reversed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stinkycableguy",
            "body": "Ahahahahahahaha! 👌🏼",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Significance_1550",
            "body": "I’m saving this one",
            "score": 1,
            "replies": []
        },
        {
            "author": "Expert_Scarcity4139",
            "body": "That didn’t age well now did it",
            "score": 1,
            "replies": []
        },
        {
            "author": "FKim312",
            "body": "No one that voted for him believed in that.  Deep inside, they wanted an isolated America and to get rid of the brown and rainbow people. The economy was just an excuse they gave because it would look bad on them to say, “Hey, I’m a white supremacist”.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BusterOfCherry",
            "body": "He was looking in the mirror and had it reversed.\n\n![gif](giphy|3o85xnoIXebk3xYx4Q)",
            "score": 1,
            "replies": []
        },
        {
            "author": "FatalSpiderbite",
            "body": "And most Trumpers still believe this is true and they are happy with what is currently going on. You can't convince them otherwise. It's more than a cult at this point. It's a religion now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Caffiend6",
            "body": "This didn't age well",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spanky-McSpank",
            "body": "Still waiting for my paycheck to get bigger and my job to get better",
            "score": 1,
            "replies": []
        },
        {
            "author": "coffeebeanwitch",
            "body": "They eat it with a spoon and ask for more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rwarimaursus",
            "body": "#***SO ARE GREAT AGAIN YET!?!***",
            "score": 1,
            "replies": []
        },
        {
            "author": "jesse1time",
            "body": "r/agedmilk",
            "score": 1,
            "replies": []
        },
        {
            "author": "Natural_Indication95",
            "body": "Welll he loves uneducated people",
            "score": 1,
            "replies": []
        },
        {
            "author": "ELECTRICMACHINE13",
            "body": "All the old people still alive for the next election are not going to learn a damn thing and will do it again. It's going to keep happening",
            "score": 1,
            "replies": []
        },
        {
            "author": "Psychological-East83",
            "body": "Will be one of the greatest examples of projection by a salesman selling off the lives of American citizens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Major-Check-1953",
            "body": "So that was a fucking lie.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cold-Sun3302",
            "body": "He sounds like a desperate criminal. We were so close to seeing him face justice. Now, it'll never happen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Human-Bluebird-1385",
            "body": "More than fake promises. It's pure projection.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FreakshowMode",
            "body": "I would ask 'how's that working out for America' but that's a little crass. The world doesn't have a beef with Americans. Broadly they're great people. We just hate the orange asshole you voted in. Please, please, please vote the little tyrant out again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChickinSammich",
            "body": "So that was a fucking lie.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fukyourkarma",
            "body": "It's always admittance and projection with this clown.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zombiedrd",
            "body": "That is a lot of \\[deleted\\]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alternative-Dream-61",
            "body": "He was being sarcastic, give him a break.",
            "score": 1,
            "replies": []
        },
        {
            "author": "6Wotnow9",
            "body": "I can think of another 3 day promise that went to shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valuable-Ad-3147",
            "body": "And just the opposite happened go figure",
            "score": 1,
            "replies": []
        },
        {
            "author": "SomethingAbtU",
            "body": "a staggering amount of gullible fools fell for these empty, whimsical promises",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nunov_DAbov",
            "body": "This was absolutely true except he misspelled win and lose.  Or maybe he just got the two confused.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mangosawce9k",
            "body": "It’s like he gaslights himself into a massive hypocrite reverse uno card.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sohcordohc",
            "body": "Well people believed it so he wins both ways..and it’s not any different than what he said about Harris",
            "score": 1,
            "replies": []
        },
        {
            "author": "deberryzzz",
            "body": "Fingers crossed you lose not sorry! 😆",
            "score": 1,
            "replies": []
        },
        {
            "author": "Random-sargasm_3232",
            "body": "Where have I heard \" three days\" before.\n\nIt sounds so familiar...",
            "score": 1,
            "replies": []
        },
        {
            "author": "twosheds12",
            "body": "Maybe you should have voted instead of being a whiny crybaby months later.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Ambitious-Sink5968",
            "body": "Trump is my pookie😘",
            "score": -2,
            "replies": []
        }
    ]
}