{
    "title": "Just Stop Oil and climate protest",
    "author": "signoftheserpent",
    "subreddit": "Marxism",
    "rank": 440,
    "score": 60,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 91,
    "url": "https://www.reddit.com/r/Marxism/comments/1ea4mnc/just_stop_oil_and_climate_protest/",
    "id": "1ea4mnc",
    "selftext": "Recently in the UK a group of climate protesters from Just Stop Oil (which has sister groups in other countries iirc, is also linked to Extinction Rebellion) were sentenced to 5 years in jail apiece. THis was in response to their plans to block the m25 (the major motorway that surrounds London). Blocking roads has been one of their major tactics, ostensibly to push the government to act on fossil fuels.\n\nPublic support according to at least some polls is not in their favour, especially blocking motorways. They also block roads more generally, regarldess of who needs to get by or what other road users are doing. I say this because there is evidence of them blocking a young woman trying, she claims, to take her kid to hospital (presumably non emergency). There are good reasons why blocking roads is a bad idea, so the issue is whether the climate crisis is a stuiable justification.\n\nMore broadly their actions are extremely divisive and do not, as I say, appear to be winning people over. I think that is a huge problem for them because if the public are against them then the state has absolutely no reason to concede. People will be more likely to vote for a government that wants to punish them as a result. Their actions alone, IMHO, will not achieve their goals, and certainly do not address the fact that one country alone cannot solve climate change.\n\nSo how do marxists analyse this situation? It seems to me that the working class needs to be united on this and that climate change needs to be part of the broader class based resistance to capitalism, as that is the main driver of pollution. Tactics that divide our class will be counter productive. A new mass workers party could achieve this I believe. Thanks",
    "comments": [
        {
            "author": "FireSplaas",
            "body": "There’s a saying but i’m not sure where it’s from : climate activism without socialism is just gardening.\n\nThis aside I think these protest movements should focus on disrupting governments rather than random civilians, this would help gain more support feom the people",
            "score": 71,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "They should certainly pick their targets better. But given the state of class consciosness I'm not sure even disrupting government would be seen more positively. Many people seem to view the protesters as just idle malcontents - as protesters are always charged. So the only solution is to fold the climate struggle into a broader political class based movement with a wider program of demands, including better wages etc.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Ultimarr",
                            "body": "The other solution is to keep protesting! If I posted on 1960s Reddit about how civil rights wasn’t that popular in America and that the civil rights movement should stand back and stand by until we get to socialism, I would be seen as a villain today. Just stop oil is working — for proof, consider the other environmentalist orgs you know willing to break the law. Are there any…? Green peace fucked up the Nazca lines I guess, but that seems different. \n\nFWIW they burn up private jets and stuff too, it’s just that those articles go nowhere and the punishments are way way worse",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Belisarius9818",
                                    "body": "Being able to actually watch police beat up black people in the streets for demanding their own rights strikes a way different tone to watching just stop oil get dragged out of the streets for blocking every one’s way.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HikmetLeGuin",
                                            "body": "Fwiw, climate protest is for everyone's rights and survival. Especially poor people of colour, especially in \"developing\" countries. The silence and apathy toward climate change will lead not only to ecocide, but also a form of genocide as entire cultures and nations are wiped out by the environmental crisis. People in \"wealthier\" countries are less effected, so they can afford to ignore it longer, despite the fact that their countries are more complicit.\n\nProtest is disruptive by nature (at least if you're doing it right). We're on a Marxist subreddit, and Marxist revolution would be way more disruptive than simply blocking a street. We have to accept the implications of fighting back against the system: if we're overly worried about inconveniencing people and just allowing things to function as they normally do, we will never overthrow capitalism.\n\nThat said, are these the most effective actions? I don't know enough about their decision-making process to really judge. I would like them to build more solidarity with unions, socialist groups, etc. If they can do that, they can expand and create more momentum for greater change.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Maleficent_Fudge3124",
                            "body": "Do you think that would happen fast enough to make the changes they want?\n\nThe leftist political struggle has been “working” (mostly unsuccessfully) for centuries. \n\nClimate change doesn’t have centuries.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "FireSplaas",
                            "body": "I agree with you here, the best outcome would be a revolutionary socialist government that considers climate action as one of its goals, like we have here in China. Not sure how applicable this would be to the west though",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Vegetablecanofbeans",
                                    "body": "Hey kinda off topic but do you live in China?\nIf you do I’ve been kinda curious on how the average citizen feels about how socialism works in the country, I wonder if you could answer 🙏",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "FireSplaas",
                                            "body": "Yes, I’m chinese.\n\nMost people support it : we have the highest government support rate in the world. That’s because there’s been massive change in standards of living since 1949. Much of the previous generation could barely feed themselves, and today we have 100 % literacy, everyone can get three meals a day, no homelessness, best infrastructure etc.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "antberg",
                                                    "body": "That's utter bullshit.\n\nThere is no 100% literacy, everyone getting three meals a day, no homelessness, best infrastructure, etc.\n\nYou're a bot.\n\nNot even keep going with the \"highest government support rate\".",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "kidhideous2",
                                                            "body": "I've lived in China for almost 15 years and there are some really poor people here, but the changes for the better that I have seen since I arrived are amazing.\nOf course I am a foreigner with a nice job and it's just anecdotal from living in a few different places, and I know that it's very unequal, but it is amazing just the differences I have seen",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Exactly. These protests lack any kind of popular backing to be successful. They are not tactical or part of a larger strategy to win reform. \n\nWe’re seeing something similar with Palestine protestors here in the US. This group called Within Our Lifetime who have been very good at mobilizing large rallies and protests decided to protest Jamaal Bowman on the eve of his election against a conservative Democrat. \n\nYou’re pitting the Palestine cause against the rest of the working class. Instead of attacking progressive politicians, you should be out knocking on doors for them and bringing the Palestine issue into the fold of the larger program.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Acrobatic_Lobster838",
                                    "body": ">You’re pitting the Palestine cause against the rest of the working class. Instead of attacking progressive politicians, you should be out knocking on doors for them and bringing the Palestine issue into the fold of the larger program.\n\nDo you apply the same to any other issues, or is it just palestine.\n\nWere my trans friends wrong for actively protesting the (now current) Labour government? Should they have gone out to campaign for them?\n\nLikewise with Palestine and the Democrats. Biden is actively supporting a genocide.\n\nThat should be protested.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "It applies to all issues. The issue isn't protesting, but are we doing it strategically and effectively. What is actually going to help us build power and bring about actual change?\n\nI'm not too familiar with your trans friends' situation or Labour policies on that issue (apart from off hand Keir Starmer remarks) so I can't say. But probably yeah I think they should have campaigned for Labour or other non-Tory parties. But they should also protest the Labour government. We can do both. It depends on what the situation demands. \n\nIn this case, Jamaal Bowman, who has been an outspoken supporter of Palestine and critic of Israel, was up against a conservative politician funded openly by the Israeli lobby to weaken the Palestinian voices in Congress. Instead of mobilizing their support behind Bowman and trying to help him win the election, they spent months criticizing him and protesting him for either not saying the correct enough thing or endorsing Joe Biden (who we need to win if Bowman and other Palestinian allies have any influence in the government). So they actively working with the right wing and against the Palestinian cause!\n\nNot only that, Bowman is a Black, progressive working class guy who was a teacher and has stood up for working class issues. All the progressives and working class folks, especially brown and Black folks, supported him and needed him to win because he advances their cause. Gathering people to protest this guy is sending the message that we don't care about anyone else's problems, only this issue. We don't care if people lose healthcare or education or can't afford housing we are going to burn it all down unless you agree with us on Palestine. That is petit bourgeoise radicalism. It's standing apart from the working class and shouting slogans at them.\n\nThe fact is, Palestine is not a priority for most Americans. The government reflects that. Continuing to protest the leaders without actually doing the work of mass organizing to shift public opinion and bring people into the movement (and bring this issue into the larger movement) does absolutely nothing. \n\nI think these protestors should have been campaigning for Bowman for months to ensure he had a good chance in this race. The election would have also served as a good platform to have one-on-one conversations with people about Palestine and tie it in with other progressive working class issues. \n\nWhen the election is done, Bowman is in power, then yeah, go occupy his office and confront him on these shortcomings. He might actually listen vs the guy who is specifically installed to shut the door on you. \n\n[Crisis of Petty-Bourgeois Radicalism, by Gus Hall (marxists.org)](https://www.marxists.org/archive/hall/1970/crisis-petty-bourgeois-radicalism.htm)",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "signoftheserpent",
                                    "body": "WRT palestinian protest I worry that in Britain we are seeing a divide grow across the working class where muslim voters are turning against Labour politicians and supporting independents because of Labour's dreadful stance on Gaza. This has led to  some dreadful candidates standing, not least of all the odious bigot Galloway (who lost, thankfully).\n\nGaza is a vital issue that people are right to be angry about, but again it is important not to let that divide our class.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Acrobatic_Lobster838",
                                            "body": ">Gaza is a vital issue that people are right to be angry about, but again it is important not to let that divide our class.\n\nLabour does not represent our class. Campaigning against Labour for supporting the genocide of Palestinians and their atrocious stance on trans issues is not working against working class interests.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "nicholasshaqson",
                                            "body": "Astoundingly bad take honestly. Read that Gaza bit again to yourself, and ask yourself whether or not you come off as a social-chauvinist.\n\nLabourism is not functionally a working-class movement. It is useless to try and pull labourism back to working-class representation because it is so thoroughly bourgeois in its orientation.\n\nThink on what the composition of the working class looks like today, and then think of the violence Labour will do to them, and the purpose it serves. And in between that, read - thoroughly read - on the Labour Party's history and especially its ideological trajectory.\n\nI'm tired of seeing British leftists (ones who are usually cis and white) go on about this romantic soliloquy about labourism supposedly losing its way even as commits to violence on our class on an international basis while not properly understanding what labourism is, does and has done. It does nothing for the lives of the black and brown people it ruins abroad, and manipulates at home (while deporting the rest), and the LGBTQ+ people it throws under the bus.\n\nIf you're going to demand a new workers party, at least abandon the idea that labourism is salvageable, and refrain from this chauvinism please.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "vitoincognitox2x",
                            "body": "The best solution would be to use the current system to build capital and then invest that capital into superior solutions.\n\nBut this would require actual work and coordination, so that rules a lot of participants out.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TiagGuedes",
                    "body": "I believe the original quote is \"ecology without class struggle is gardening\", or in the original portuguese \"ecologia sem luta de classes é jardinagem\", from brazilian activist Chico Mendes",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Maleficent_Fudge3124",
                    "body": "A lot of these groups have tried disrupting governments or working in the system to change things and have no luck. \n\nThey’re trying to prevent the “boiling of the frog” with common people. \n\nBut also climate activists who do acts like this have the whole weight of wealthy elite owned propaganda machines and the state skewing opinions against them.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Available_Remove452",
            "body": "You've answered your question. By class action. The problem is class consciousness is so far back, the working class don't realise they are a class, they are asleep. Capitalism declared victory once the wall came down and the working class has not recovered.",
            "score": 15,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "Broadly I agree. However the condition of the working class hasn't remained thus. It has moved somewhat, particularly in the last couple of years. Now that may go backwards again, or have already done so. But the recent strike wave has shown there is still hunger for struggle in our class.\n\nThe problem with these climate groups is their very actions jeopardise that while they, IME, wholly reject class politics. I don't think they are bad people, just misguided. They view class politics as an anachronism. The sort of people who say you need a bit of capitalism and a bit of socialism, but fall for bourgieouse propaganda about revolutions (ie that they are an inevitable consequence of capitalism's inability to resolve internal crises).\n\nBlocking roads is inevitably going to harm working people the most, and you need them on board.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "According_Site_397",
            "body": "Only Roger Hallam got five years, the rest got four.\n\n  \nJust Stop Oil is deliberately trying to be the radical flank.  Everyone hated the Suffragettes too, but eventually they won.  When Extinction Rebellion first appeared it was seen as radical, now compared to Just Stop Oil it's like the friendly face of climate activism.  All the various groups act as part of a wider movement which moves the Overton window closer to where it needs to be.  Successful social change movements are generally the ones that employ all the tactics all the time.  Martin Luther King would have been a lot less successful without Malcom X.  Etc.\n\n  \nJust Stop Oil and Insulate Britain have always let emergency vehicles past when they block roads.  The myth that they don't is a lie continually repeated by capitalist media.\n\n  \nTraffic jams happen on the M25 all the time for various reasons.  People are late for things or miss them entirely every day due to London traffic.  It's just traffic, it's an inconvenience.  We're talking about ecosystem collapse, mass death and the potential extinction of humanity.\n\n  \nThere is a new thing called the Humanity Project.  Roger Hallam was involved, may or may not continue to be involved from prison.  It's still in it's early stages so too soon to make a call on it's success, but it's an attempt to bridge the radical flank to something resembling a democratic confederalism model and build a dual power situation.  JSO is also part of the Umbrella group and A22 network.  They do not need their actions alone to achieve their goals because they are not alone.\n\n  \nIdeally we would unite the working class and create a revolution.  And maybe we will, but we don't have time to wait and find out.  We need to shut down the fossil fuel industry as soon as possible.\n\n  \nWhile this trial was going on a Labour government won a general election in the UK with a manifesto commitment to cease all new licencing for fossil fuel extraction projects, which was JSO's core demand.  So they have just achieved their main goal.\n\n  \n[https://humanityproject.uk](https://humanityproject.uk)\n\n  \n[https://www.theguardian.com/environment/article/2024/jul/12/contempt-gagging-un-intervention-uk-wildest-climate-trial-just-stop-oil](https://www.theguardian.com/environment/article/2024/jul/12/contempt-gagging-un-intervention-uk-wildest-climate-trial-just-stop-oil)\n\n  \n[https://realmedia.press/law-what-is-it-good-for/](https://realmedia.press/law-what-is-it-good-for/)",
            "score": 13,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "I understand the comments, but the fact remains that, if polls are to be believed, JSO aren't winning people over. Is there a point when their tactics will succeed? I'm not sure that is going to happen.\n\nPeople like to invoke the comparison with the suffragette movement. I get it, it may even prove to be valid when history looks back on this period. But I'm not entierly perusaded it's an effective comparison. We live in a vastly different world and this cause is similarly different. Nowadays there is a proliferation of social media tech so people can post clips of JSO blocking a young mum taking her kid (as I outlined) to hospital. Is that fair? Is it bad faith? Is it even accurate. I don't know. From what i've heard JSO say it did happen. Their response was to say that the severity of climate change is even greater. I think that's a dangerous argument to put to people; you're effectively telling them their problems don't matter. That isn't going to win people over. JSO has to win people over. \n\nRoger Hallam is informed by his reading of theory on matters of protest. I can't speak to that theory, i've never read it. But I don't think it's working. As I said, putting the lives of minority BAME and migrant background activists at risk is a dangerous thing to do that I don't think he considered. It was put to him in an interview I listened to (Politics Theory Other podcast, irrc), he had no answer. He is a very driven and motivated person, but I think it has blinded him.\n\nThis is why we need clear headed class consciousness in this.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Ultimarr",
                    "body": "Thanks for sharing your expertise! \n\nAny advice for an American looking to support this new initiative from afar, as a SWE/computer guy/writer? Practically speaking I should be out there spraying orange paint on stuff, but ideally I could ease myself into that. Nbd if you don’t know, I’ll do research later\n\nEDIT: clearly they’re focused on UK volunteers but their site does say “…and beyond”, so I threw em an email anyway. Check it out, esp if you’re in the UK! https://actionnetwork.org/forms/get-involved-154?source=direct_link&",
                    "score": 3,
                    "replies": [
                        {
                            "author": "According_Site_397",
                            "body": "There might well be remote stuff you can do, especially as an IT guy.  But I'm sure there's stuff going on in whatever part of America you're in, and there's probably plenty folk here more in the loop with that stuff than me.  But if you haven't already you could find your local XR group and ask them what else is going on.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "anarcofrenteobrerist",
            "body": "The goal of disrupting traffic is precisely to get attention. All publicity is good, including bad publicity, at least thats the idea. It gets people talking about climate change. There's a fundamental ideological disagreement between non-marxist ecologists and marxists and it really shows tactic-wise. They somehow want to get rid of capitalism but they're always vague about how that would happen or what system would follow after. They recognise capitalism is the issue but they mostly work under its frame, drawing attention to climate change, educating people about it, but never in my time working in those circles I heard a competent plan on system change. Ecologist activism is the reason I got drawn to marxism and marxism ironically drew me away from ecologist activism.\n\nI don't think the issue is the tactic itself because its a logical next step from ecologist ideology and non violent direct action groups are very competent at their niche. Its just that the ideologic core of how they fight is wrong. Thats why I refrain from criticising their actions, even though there's some valid critiques, because the main issue is their ideas.",
            "score": 16,
            "replies": [
                {
                    "author": "Big-Teach-5594",
                    "body": "The places people complain about the disrupting are places that are known for being annoying like that anyway, like blocking the m25, that happens on a regular basis anyway, causing more traffic in London, there’s already a shit load of traffic and hold ups in London. But this kind of pedantic point aside, groups like xr and other climate activist groups have tried every other form of protest and lobbying, and this  type of protest they’ve engaged in lately seems to be the most successful in getting attention, every time people have protested in the more acceptable traditional way it didn’t even make the news.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Ultimarr",
                    "body": "I mean, yeah, I’d be a little frustrated if Just Stop Oil took a break to meet and democratically decide on which version of socialism to endorse exactly. Can’t you say the same about literally anyone doing literally any sort of activism? Even a parent and child? What’s the point in raising a child if I could be fighting for systemic change instead? Why teach ethics when I could be agitating for worker ownership?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "anarcofrenteobrerist",
                            "body": "You don't have to pause everything to form a political line. Most competent political parties or social movements combine theory and praxis just fine.\n\nA good organisation doesn't just define themselves with what they aren't. \"Anticapitalist\" is not a good enough label. Its necessary to define yourself about who you are. Which, to be fair, is complicated with such a heterogeneous movement. But I saw this a lot on an individual level also. People considering themselves anticapitalist but not going further than that or having very underdeveloped ideas.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MisterConway",
                    "body": ">it gets people talking about climate change\n\nWhere? Under any posts online, everyone absolutely trashes the protestors. And because of those popular opinions under the post, people just get exposed to that which is protestors = stupid, bad, and hypocrites. Not \"Climate change bad\". The news doesn't discuss the climate when this happens. Nobody does. \"Any publicity is good publicity\" is catchy but absolutely not correct. \n\nActivism towards better targets (not random civilians) DOES sometimes lead towards educational conversations behind the protests. Think of the farmers and their manure spraying of government buildings in Europe. \n\nI'm not saying they should go back to standing in a designated square and hold signs chanting into the wind. There are better alternatives to pissing off the people you want support from.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TravelingFud",
                    "body": "Bad publicity does not help people fight for yor cause or turn more people to your favor. This is shooting themselves in the foot.\n\nYou want a revolution with no popular support?",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "signoftheserpent",
                    "body": "But the problem is that not all publicity is good. The polls show that people are against them. This isn't groing to translate into support for the cause. If people don't like the tactics then it stands to reason they will not support the cause and so the government is off the hook.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "lord_of_abstractions",
            "body": "blocking roads as a tactic aside, the actual demands pf these groups are usually extremely minimal and extinction rebellion has staged actions where the explicit goal was to get arrested without protest. these are liberals in programme and strategy: demands that do not disturb capitalism and methods that repy on the bourgeois state to act through „shifting the discourse“. Marxists should fight against repression, as such protests are often a precedence for harsher measures against all legitimate protests. However it would be a grave error to call for such actions or supporting them.",
            "score": 4,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "What do marxists think of ER's tactic of arrest? They lost a lot of support from experienced activist groups because of this, the argument being that it would put people from minority groups at great risk",
                    "score": 1,
                    "replies": [
                        {
                            "author": "lord_of_abstractions",
                            "body": "it lacks a critique of the police as a repressive organ of the state, essentially seeing them just as „people doing their job“.\n\nI remember an action of them where they even turned themselves in voluntarily iirc.\n\nIn essence the limitation is that of the tactic of „civil disobedience“ more broadly which can be legitimate when accompanied by a good programme and other methods/tactics. Groups like XR however exalt it beyond a reasonable defense, divorcing it from class struggle (as outlined in my original comment and your post).",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "signoftheserpent",
                                    "body": "They view the police as benign agents of the state. Just doing their job. That's what makes it so dangerous for minority activists. Netpol had to walk away from XR because of this. I hope they have learned.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sharpiemancer",
            "body": "So they are a splinter of XR and largely share their politics from what I can tell. No class analysis, no understanding of the role of the state etc etc. albeit they seem of a more adventurist bent. I am sure they are well meaning but yeah, some of their stunts have definitely had a detrimental effect on the movement and haven't progressed a thing from what I can tell.\n\nThat said their trail sets a worrying precedent and for that at least they deserve our solidarity, it's only by proving ourselves trustworthy and steadfast allies that we can demonstrate the need for unity and solidarity.",
            "score": 2,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "I agree about the sentence. The reasons for the harshness are given in the sentencing remarks. It's largely due to the effects of their protest. For example, some children with special needs coudln't get to their school, one was out of their meds, and a delivery of food coudln't get to a hospital.\n\nNow I'm not offering that as a justification, merely to report the facts. However there are good reasons why blocking roads is an offence. So the question becomes can they justify it to the court since that is the legal defence the crime requires to avoid punishment. The jury didn't find they were justified. \n\nPersonally I think the whole endeavour is a hiding to nowhere. Even if they were acquitted it still looks bad for the reasons I've outlined. I wish they had chosen better tactics. These are inherently divisive methods and don't appear to be making any difference with the government either. Of course they were going to get arrested, that appears to be part of their MO. But martyring themselves seems ineffectual to me. \n\nA working class party can get round this by building support across the class amongst workers to addres a variety of concersn that all share a common cause, capitalism.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sharpiemancer",
                            "body": "Blocking roads can be a legitimate tactic and has been utilised by Communists and other progressives effectively in the past. It's distasteful because historical examples and Marxism shows that their politics don't lead anywhere so yeah people suffered for nothing. If\n\nA working class party would not be able to get around this, a worker's party is not a magic wand where these things will not be necessary, it would be engaging with the broader working class movements and seeking support and consensus in order to take actions like these. Just Stop Oil is a small group of predominantly middle class liberals who recognise the scale of the crisis and are franticly doing something anything to push change but they do so with under the delusion that the actions of a brave few can change society rather than engaging in class based struggle and building an alternative to the bourgeois parties and fighting to defend that.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "newStatusquo",
            "body": "Tbh I think the negativity aimed at the group mostly affects the group and not the cause and the negativity or anger around some of the protest gets people talking. My politically uninvolved parents where talking about climate change as a result of their actions and are much more invested although they tend to still not like just stop oil it did  achieve its goal of raising awareness in some sense.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bugscuttle999",
            "body": "The US did a great job at squashing Green Protest in the '90s and '00s.\n\nELF, etc are rotting in jail, and their movement stopped. The UK desperately wants to be like the US.\n\nWe should all work just a little harder at organizing working folks for revolution, because THIS is what happens when movements are marked for destruction.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Granya_Kalash",
            "body": "Any successful campaign requires a diversification of tactics. I'm not gonna police someone else's actions because what their critics are trying isn't working that well either. I understand the point of a protest is to cause inconvenience but why not block the roads outside of refineries or storage facilities. That being said I really feel like blocking my neighbors from conducting their business is saying \"I'm Granya Kalash and this is blocking the road,welcome to Jackass\" I don't have a problem with creating inconveniences but I do have slight issues with target choice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "peanutist",
            "body": "they knew the paintings had glass over them and only threw the soup specifically because it wouldn't cause permanent damage but knew it would make headlines. That other time they threw intentionally bio-degradable material on the Stonehenge stones (literally just cornstarch) to make similar headlines, knowing it would wash off with some water. people say they should be doing stuff to the actual oil companies' properties, but they do actually do that yet they get no news coverage. They protest at the offices of oil companies and their insurers too, but you don't hear about that. Apparently we've ALL forgotten that one of their first major protests was them blocking the road to stop oil trucks coming out of some facility in the UK.\n\ntheir stated goal is to get as much people talking about climate change as possible (even if it tarnishes their own reputation, so long as they don't cause actual harm). they know everyone already knows about climate change and already has an opinion on it which won't be swayed one way or the other by seeing some protest. so, they found that the only productive form of protest at this point is to get people to think about it constantly. most people know, but they just don't treat it like a pressing or major issue since it's so far off. they want as many headlines mentioning climate change as possible so that it stays at the front of everyone's minds, keeping them likely to actually act on it and make it a primary issue at the ballot box. this is how most successful forms of protest have historically worked, and the psychology behind it is sound.\n\nalso, they've been heavily smeared by right wing media that they're funded by oil tycoons, but that's not true. they have a major donor from a woman who inherited money from her parents' oil business, but she herself has stated she feels guilty over it and wants to channel her resources towards a productive cause.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Big-Teach-5594",
            "body": "It’s important to remember that they went to prison for planning to block a motorway, not actually doing it, this in itself is an issue, five years in prison for planning something is unacceptable and I’m surprised there’s isnt protests breaking out all over the uk about a legal decision that sets a frightening precedent, interestingly the judge that sentenced them previously sent a rapist down for a year, were as planning to block a motorway in this judges eyes is a worst crime, this whole situation is ridiculous and alarming, if the police knew about the planned protest , why didn’t they just turn up and prevent them from doing it….?",
            "score": 1,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "we agree on the harsness of the sentence. \n\nhowever, that it was a conspiracy doesn't alter the fact. If I planned to kill somsone, that is still serious, even if I am intercepted before I can complete it.\n\nI don't think any society can ignore that.\n\nThat doesn't justify the nature of policing in a capitalist state.\n\nTBH I'm not surprised about the UK. It is an exceptionally conservative and reactionary country though hopefully that is down to the age of the population",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Occasion-Boring",
            "body": "This is the group that refused to let a mother through who was trying to get her child to the hospital, no? \n\nI struggle to see how that has anything to do with community or dismantling capitalism. If they had a spine, they would form a ring around refineries or suppliers of oil. But they won’t because they know that’s trespassing. \n\nI don’t respect them.",
            "score": 1,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "Correct. They don't deny that happened as well. Hard to see that as productive. At the very least they coudl have temporarily step out the way, let her pass, and then carry on. But they chose not to.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fun-Cricket-5187",
            "body": "We analyze these protests as a symptom in the lack of a Marxist movement. The political atmosphere has been stunned and traumatized since the death and mutilation of Marxism in the 20th century. I love comedy and listen to many comedian podcasts, their sentiment sounds right wing to a non-Marxist, but beneath their rhetoric lies the suppressed motivations of a Marxist politics but nobody is there to tell them, the only ones are libertarians who are equally enslaved. \n\nThe climate change crisis is a capitalist crisis, this goes for most social upsets currently. What must be the politics of true sexual liberation? Socialism. What must be the politics of a truly emancipated peoples of Israel and Palestine? Socialism. Marxists ought not forget about freedom, emancipation and universalism. My politics are the C word(s), Capitalism and Critique. Capitalism and Critique. \n\nLiberal enlightenment took 400 years to overcome the oppressive aristocracy, lest not forget our revolutionary forefathers.",
            "score": 1,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "Indeed. Has it even succesfully overcome that oppression? The culture wars of today serve capitalist hegemony, if not aristocracy (in Britain the two appear connected), would suggest otherwise. There isn't much liberation when the world's most successful 'liberal' author spreads transphobia and fascism (the latter unwittingly because she's absolutely gone round the bend)?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "The biggest problem here is that the people most likely to care about climate change (at least in the US) are middle and upper class, the working class lists it very low on their list of political concerns. So rolling climate change into a broader working class agenda is a political non starter. For all his faults Biden did about the most he could give his coalition on climate, and got absolutely no credit from the working class for it. They just don’t care.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Donovan_Volk",
            "body": "Hi, I know these people. My personal feeling was that these tactics were becoming less effective over time. However, if you follow the recent history of Just Stop Oil and XR (similar organisations with the same people behind them) you will see that the overall strategy is extremely effective.\n\nIn its first week, the Labour government announced no new Oil and Gas licenses in the North Sea, which was one of JSO's demands. Prior to organisations like these it was unheard of that an environmental organisation actually affected policy at this scale.\n\nDon't cry over the jail sentences, Hallam in particular has been vocal about the need to attract lengthy jail sentences in a kind of martyrdom doctrine, so its not exactly foisted upon them.\n\nIn my experience of these groups they have little in common with prior radical left organisations or working class socialism. They seek rapid policy change within the bourgeois system, and are up front about that. They are also explicitly non revolutionary in their goals. They are more in the vein of former reform movements like suffragettes and the civil rights, important within the framework of the current system, rather than a radical challenge to it.\n\nWorking class environmentalism exists in spades throughout the world, as well as the more reformist green trade unionism. Before anyone condemns JSO, let's remember that strikes are also disruptive, and many of the same arguments deployed against these tactics are also deployed against striking workers.",
            "score": 1,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "Roger Hallam's doctrine hasn't been proven effective and jeopardises minority activists.  \nI don't think it necessarily follows that because Labour has done positive things it's because of the protesters. You would have to prove that.\n\nthe argument isn't that disruptive action should never be used, but that the disruption doesn't impede the propadanda produced. You have to win people over, but the only people JSO are impacting are those people. Now they are blocking airports stopping people from going on holiday. If you're a working class family who can afford barely a holiday a year are you going to look at their actions and be sympathetic? No, you are going to think these protesters are privileged and disruptive and you will, understanadbly, feel aggrieved.\n\n  \nThat doesn't imply that air travel is good for the environment. Currently it isn't. But a few kids blocking an airport terminal? It just hurts the people they need to win over",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Donovan_Volk",
                            "body": "I remember when the 'but minority activists can't get arrested' line came out from the bourgeois press. It was entirely spurious, there was a definite mechanism for making sure that only those who were prepared to get arrested would be. We should be very suspicious when nominally progressive ideas are deployed in ways that suppress organisational capacity or stir up a sense of false grievance between members of a political group. Certainly any revolutionary movement that still takes the utterances of the bourgeois press at face value is doomed to fail.  \n\nIn former times ages when a campaign group had an aim, and after a series of disruptive actions the government policy changes, we attribute the policy change to the campaign. So if you'd like to apply the same burden of proof to the relation between the suffragettes and the women's vote, as just one example, then be my guest. I myself am happy to state I think that the campaign led directly to change of government policy, that would not have happened without it. It's just a common sense interpretation of events, I don't feel the need to provide proof. \n\nSo, on whether their actions should win people over, I think your confusing this for revolutionary action, which does need the support of the people. XR/JSO, like civil rights movements is more a way to change policy even when there is a majority against you. They needed to persuade government rather than the average worker. \n\nShould they be popular revolutionary? Well, that's another question. The point is they're not, and have never claimed to be. \n\nDespite a few unpopular actions from environmentalists, support for renewables and other measures is at record high levels. So, I think they were strategically correct in thinking that they needed attention more than sympathy. \n\nSo just to underline my point here, they pushed forward their aims despite losing popularity. Socialist organisation and popular revolution is based on entirely different principles.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "signoftheserpent",
                                    "body": "It wasn't spurious. It was a genuine concern. Netpol, who monitors police activities wrt protests and activism, walked away from XR because of this. Not sure what systems XR had in place, but the only safe one was for such people not to protest, which is fine advice but rather proves the point.\n\nI'm still not seeing any direct causal link between these actions and Labour policy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Donovan_Volk",
                                            "body": "\"The only safe thing to do is not to protest.\" I think you have inadvertently stumbled on the essential truth of the matter.\n\nWell to spell it out. And I really don't think I should have to:\n\n1. JSO has a stated aim of no new oil and gas licenses\n\n2. They engage in a highly visible campaign to publicize their demand\n\n3. Their actions escalate to highly expensive infrastructure disruption\n\n4. A new government is elected which implements their demands in its first week.\n\n5. JSO announces their demand has been met.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "signoftheserpent",
                                                    "body": "It doesn't follow that because the new government implemented those policies it had anything to do with their demands per se. It might be, I just don't believe so. \n\nI don't believe their campaign, certainly visible, succesfully publicises their demands. I 'm not sure those affected come away aware of their specific demands.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Donovan_Volk",
                                                            "body": "Okay. I think the temporal correlation is enough to justify the causal link. A motivated investigator could if they wished gather evidence from Labour party meetings or publicity, anecdotal comment from party activists and so forth, so as to confirm or deny such a causal link.\n\nAs I previously stated, I don't believe the general public were the primary target of the publicity. Rather, it was a direct action design to place an economic cost on the government for ignoring the demand.  \n\nI say this because I have first hand awareness of the sort of strategic thinking that goes into direct action.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Fine_Anteater3345",
                                    "body": "JSO definitely are not compatible to the civil rights movement. \n\nMLK’d struggling for legislative reformation and the Civil Rights movement was about the emancipation of African Americans and other marginalised ethic minorities to have greater equality (socially and economically) and dignity amongst society. To reduce systematic oppression, segregation and discrimination based on unconscious biases and tensions.\n\nJSO are a bunch of affluent, privileged middle to upper class white bourgeois activists wanting to stop greedy private, profit making corporations and governments from continuing on with the further exploration of fossil fuels to stop climate change. JSO aren’t systematically oppressed nor are they a marginalised community because of race and ethnicity. They’re white posh and white.\n\nSo your comparison between the disruptive activism of JSO and the Civil Rights movement is moronic, ridiculous and irrelevant. You’re wrong. Piss poor argument. Completely redundant and stupid.  There’s no similarities. Climate Change is a worldwide planetary issue that affects everyone in society whilst the Civil Rights movement specifically only affected / related with Americans and black African Americans in particularly. ",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HikmetLeGuin",
            "body": "I think we need mass organizations with a socialist worldview serving as the foundation for the struggle. \n\nThere are often justifications for disruptive actions, even if they are \"unpopular.\" But at the same time, they need to have goals of organizing people and building solidarity; the disruption isn't enough in and of itself.\n\nI don't know enough about this group to really comment in-depth, though. I don't like the police and legal repression against them. I think at least they're standing up and bringing attention to an ecocidal crisis that will cause massive death and destruction, particularly in poorer countries. If someone doesn't do something, the poor will suffer and die on an unprecedented scale while those in the wealthier nations will be able to mostly ignore it for a little while longer.\n\nSo I offer tentative praise for this group, with the hope that they will evolve into a more explicitly socialist organization that has deeper ties to labour, anti-imperialism, and other movements.",
            "score": 1,
            "replies": []
        },
        {
            "author": "happysadhappy567",
            "body": "when emily davidson jumped in front of a horse during a race in 1913, there would have been:\nan angry horse owner/trainer\nsomeone who had a bet on the horse to win the race\npeople who are squeamish \nthe horse that ran into her\nthese people probably weren’t big fans of women’s rights movements after this, but since then laws have been changed and she has gone down a hero. if someone can’t wait in traffic for a cause that is equally as important to all of us, then get fucked",
            "score": 1,
            "replies": []
        }
    ]
}