{
    "title": "Businesses Under Socialism",
    "author": "signoftheserpent",
    "subreddit": "Marxism",
    "rank": 170,
    "score": 42,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 32,
    "url": "https://www.reddit.com/r/Marxism/comments/1hvnan5/businesses_under_socialism/",
    "id": "1hvnan5",
    "selftext": "(I tried posting this on Marxism 101 but it didn't get through for some reason).\n\nFor the record: I'm a socialist. I hate and want rid of capitalism. I'm just not an expert on theory. I find it a bit difficult.\n\nIn Britain the other day the news mentioned that business leaders were going to raise prices following government tax rises. Obviously profits come first to these people. So my question: how woukd businesses operate post revolution. How would a governing revolutionary party deal with this? Would it institute price controls? Take over every business? Force them all to become worker coops? \n\nYou can imagine the outcry from not just the capitalists, but most of society moaing about freedom. We see that now with almost everything, post covid \"muh freedoms\", people have sadly been raised and primed to think that way under capitalism.\n\nTHanks",
    "comments": [
        {
            "author": "SvitlanaLeo",
            "body": "Lenin emphasized that socialism is a system of civilized cooperators, and Marx pointed out (Capital, Volume 3, Chapter 23) that workers' cooperative factories are places where the manager's labor is not exploitative. Of course, it is impossible to build a system of civilized cooperators by allowing the petty bourgeoisie to successfully compete with workers' cooperatives.\n\nMany people fall into the trap of \"supporting small businesses\", thinking - oh, this is leftist, because small business is not big business. Ask people on the streets of large cities if they know what a cooperative is. Not everyone will answer.\n\nHowever, the petty bourgeoisie competes with workers' cooperatives and thereby destroys social property. Therefore, Western \"social democratic\" and \"social liberal\" parties lead society away from socialism, and not towards socialism, ruining workers' cooperatives and strengthening their competitors - the petty bourgeoisie.\n\nOf course, if we are talking about a country like Russia in 1921, then in such conditions the Bolsheviks introduced the NEP for obvious reasons: Russia was not a country of developed capitalism, Russia was a country in which a huge number of elements of feudalism remained, involved in imperialist exploitation. Therefore, in those conditions, the temporary legalization of small private manufacturing entrepreneurship was reasonable.\n\nHowever, now developed countries are at the stage of developed capitalism, and this does not apply to them.",
            "score": 34,
            "replies": [
                {
                    "author": "Silly_Mustache",
                    "body": "I think since Marx's times a few things have shifted regarding the petty bourgeoisie. \n\nTheir interests materialistically are indeed against the working class, and supporting them will definitely not bring forth any socialist thought, however given how easier it is to become a \"businessman\" or open up a shop (due to funding from state/other sources), it feels as if there are two categories of petty bourgeoisie. I've met a lot of small shop owners (primarily in non-urban environments, but also in urban environments), that seem more interested in controlling their own labor (after many bad experiences in big businesses) rather than ascending the ranks of capitalism. Especially given that in Greek law there is a concept of a legal entity called \"personal business\" that is impossible to scale (due to high tax the more income you have, but lower tax on low incomes), a lot of people that choose to open up a business choose personal business, not only because of the low tax on low income, but because exactly they're not looking to scale up, only make a decent living. Maybe this is a behavior mostly observed in Greece - I'm not sure about other countries.\n\nWhile I do not think that their material interests align with the working class, I believe this category of petty bourgeoisie might be easier to convince to subscribe to socialist thought, and should not be instantly disregarded as \"wannabe capitalist\" that still hasn't ascended the ranks.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bolshivik90",
            "body": "For the biggest businesses: expropriation without compensation and bring them under democratic workers' control as part of a wider nationalised planned economy.\n\nFor the smaller businesses my theory is rusty, but I have heard some propose  immediately post-revolution (I.e. Before the state has withered away) that small businesses will be offered far better business loans compared to what they get under capitalism because the banks would also be nationalised under democratic workers' control. Therefore they will be able to afford to give cheap credit to small businesses without worrying about profits.\n\nThe problem with workers' cooperatives is that historically they are attempted islands of socialism operating in a sea of capitalism. I.e., they still have to make a profit and submit to capitalist market relations. The point however is the abolition of capitalism altogether.",
            "score": 14,
            "replies": [
                {
                    "author": "SvitlanaLeo",
                    "body": "\"The problem with workers' cooperatives is that historically they are attempted islands of socialism operating in a sea of capitalism.\"\n\nThe same problem with a planned economy in one particular country. If this country is forced to enter the international market, if it is forced, for example, to buy grain from farm-owners of capitalist countries, then despite the destruction them here, it simultaneously strengthens them there. Meanwhile, the farm-owners of capitalist countries consistently demonstrate themselves as the most reactionary part of the bourgeoisie, supporting the most aggressive anti-communist line.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Bolshivik90",
                            "body": "Indeed, which is why \"socialism in one country\" doesn't work.\n\nSocialism needs two things for it to survive and lead to an eventual communist society: workers' democracy, and internationalism.\n\nOf course socialism will start in one country at first. But that's no bad thing. If history is anything to go by, revolutions tend to spread. They tend to spark revolutionary waves in one country after another: 1848, the end of WW1, the end of WW2, the Arab Spring.\n\nIf a socialist revolution took place in any one of the western countries, it'll spread like wildfire to the rest of them.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "OfTheAtom",
                                    "body": "Isn't it kinda odd or immoral that they wouldn't be socialist in every sector that involves the rest of the world?  One would still be benefiting from exploitation of the innocent, relying on it even from anywhere they dont embargo. A sort of \"we do evil in the short term\" is kinda unique to this project isnt it? ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "signoftheserpent",
                    "body": "It's the smaller business I'm really asking about. \n\nDo profits still exist during socialism and before we enter communism? \n\nHow do we stop bosses throwing their weight around, you know they will. They will threaten to sack people saying they can't afford their wages because...socialism",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Bolshivik90",
                            "body": "Ideally profits will be abolished when capitalism is abolished.\n\nYou're right that bosses will throw their weight around. But a socialist government will be a government working in the interests of the working class. The bosses will have zero political power, in that sense. (Under liberal democracy it is the opposite: a bourgeois government working in the interests of the bosses and capitalists, and we workers have no political power). \n\nSo, if they threaten to sack workers or say \"we can't afford higher wages\" then the workers' state will answer \"If you can't afford to pay better wages (BTW, they can, they just don't want to) then you have no right to run a business\" and said government will allow and instruct the workers of that business to take it over themselves.\n\nExpropriation is the watch word.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "makhnovite",
                            "body": "Think of the transition progressing from a starting point in which the big bourgeoisie are expropriated along with the major productive forces, while petty commodity production is slowly phased out and subjected to the controls of the workers state, up until the point that capitalist relations have disappeared entirely and there's no longer any need for markets of any size.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Techno_Femme",
            "body": "Slight disagreement on the wording of your question: it's a common mistake for beginners to think socialism and the transition period are the same thing. This isn't the case for Marx and Engels. Socialism is the first stage of communism where a few elements of capitalism might remain in the way people are socialized but communism has been established. There probably wouldnt be many businesses left at all by that point and they would just disappear as a generation that remembers capitalism is replaced by one raised under communism. The combining of socialism with the transition period by later theorists (mainly Kautsky and Stalin) is a different subject, though.\n\nThe specifics of the transition period depend heavily on how a revolution comes about. Personally, I believe the Russian Revolution got stuck in this transition period and then slumped into capitalism because of a need to develop productive forces. Similar problems happened to other revolutions although some were just capitalist developmentalism from the beginning. So it's hard to take lessons from these revolutions when they happened in such different places than the US. \n\nGenerally, during the transition period, while a ruling party is still overseeing a capitalist system, the goal should be to do things that are terrible for the economy but good for people. An example of this might be canceling all mortgages. This would crash the housing market. But it would also help a lot of people keep their homes or finally own a home. This would also probably win over a lot of those small business owners for a time. \n\nIn the US, you'd also want to nationalize large healthcare providers and create a single-payer health insurance system. This seems like a moderate demand on the surface but in reality, the bloated administrative costs of these industries make up a large portion of new job growth in the US. By nationalizing it, you can stop this administrative bloat, redirecting those people to more productive jobs of their choosing. The greater labor supply in the productive jobs will allow you to lower weekly hours of work in these industries, with the ultimate goal to minimize the work week as much as possible (I think the lowest we can get it would probably be around 4 hours a week, although jobs like doctors and nurses would probably still work 12 hour shifts but just work less of them). \n\nYou'd also want to localize food production both because the chaos of a revolution would destabilize many supply chains and because our supply chains have significant ecological waste. You'd likely see people on their own expropriating walmarts or giant monoculture farms and turning them into more diverse food gardens. Cuba's Special Period is, in some ways, a glimpse of what this process can look like. The state would help in these efforts and create national farms alongside these collective farms with the primary goal of localized food production. This destroys cash crops and agriculture as a commodity but it's good for people. Small farmers wouldnt be expropriated directly but they'd find it harder to compete, likely turning to small specialty crops, providing some luxury goods to people. \n\nThe state would give these small businesses a financial incentive to transform into cooperatives, of course. And they can also sell to the state for a fair price. The cooperatives in turn will begin transforming into free associations of producers as money is of less and less use, needs are cheaper to meet, and people have more and more free time. Eventually, under the early stages of communism, the few surviving small businesses will only have a distant ancestral resemblence to their current form and will be smaller free associations of producers.",
            "score": 7,
            "replies": [
                {
                    "author": "signoftheserpent",
                    "body": "I'm just not sure how you get rid of the petit bourgois/small business. In our capitalist society they are used for a great deal of propaganda. You don't dare enact any progressive polciy because it harms mom/pop stores and the propaganda of the hard working little guy. So what happens to him?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AndDontCallMeShelley",
                    "body": "I think the question of agriculture is extremely interesting, as every example of AES has been in a country with peasant agriculture, often in places where most crops were cash crops. In the US agriculture is pretty much entirely industrialized and agriculture workers proletarianized, and while there are cash crops (such as feed corn and ethanol corn) food crops are also produced in abundance.\n\nI think this would lead to less localization of agriculture than we've seen in the past, and much less disruption as the production of food is already collectivized.\n\nOf course we would be in uncharted territory, so we'll see how well our plans survive contact with reality.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Techno_Femme",
                            "body": "agriculture would absolutely be less localized than Russia pre-industrialization but more localized than it currently is. This wouldnt be a return to pre-industrial agriculture, it would just be an industrialized moving away from large monoculture crops which are generally ecologically devastating.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "AndDontCallMeShelley",
                                    "body": "For sure, and I imagine a lot of land will be given over to rewilding once overproduction and ethanol are no longer in the mix. That would also be a big help to the ecosystem",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Techno_Femme",
                                            "body": "I agree. I imagine indigenous tribes would end up playing a big role in this in the US because indigenous land management practices are good ecological practices. In this way \"landback\" would be more of a practical than an ideological thing.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CornfieldJoe",
            "body": "This question depends really lol. \n\n1.) The Country and culture in question will handle these questions differently. \n\n2.) The state of development of the economy will matter too. For example, in western nations today, you could easily argue that many businesses are so large and so concentrated that they constitute social institutions (Amazon, Mcdonalds, Walmart - all are accessible and used by just about every person with a fair degree of regularity - it would not be difficult to transform these into public utilities at tremendous cost savings). However, JR's junk yard outside of town that sees a few hundred bucks of revenue every month is of little to no concern and never will be. Should society advance sufficiently, JR will no longer have any reason to charge for access to his junk yard. \n\n3.) Price controls are a tricky question because their results are often unpredictable and usually have to be matched by intensive capital investment (for example rent controls on apartments alongside a wide-scale building of housing). \n\n4.) As far as worker coops - there are some real world examples of this in Venezuela and Bolivia in particular where regular businesses that feared the socialist governments there chose to close up shop and leave, and the government then enabled the workers there to continue to operate the business as a workers' cooperatives. \n\nI still think Lenin's proposition that the most exploited workers will turn over first, and so we will mostly see revolutions outside of the imperial core. There revolutions will typically nationalize key extractive industries while building out social programs.",
            "score": 14,
            "replies": [
                {
                    "author": "lezbthrowaway",
                    "body": "> I still think Lenin's proposition that the most exploited workers will turn over first, and so we will mostly see revolutions outside of the imperial core. There revolutions will typically nationalize key extractive industries while building out social programs.\n\n\nThe current revolutionary outlook, looks very dangerous for the first world. The imperial core --- deprived of means of production and inputs for its economies --- will collapse  under third world revolutions. Leading to a cascade of revolutions in the first world sometime later.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "DvSzil",
            "body": "With defenders like these Marx and his theories don't need enemies; these people do a fine enough job in distorting it into a pointless mess. I'm happy that at least user Techno_Femme was here to set some things straight.\n\nThe short answer is that value will be abolished, and production planned by the revolutionary working class with the intent of satisfying people's needs. A business, or even a cooperative enterprise are antithetical things to a society of socialised production, though the latter can play a role in the transition.",
            "score": 5,
            "replies": []
        },
        {
            "author": "makhnovite",
            "body": "There's no such thing as 'business' under socialism as thats a capitalist economic form based on private property and market exchange.\n\nAll the productive forces would ultimately be taken over by force, yes, that's what Marx is saying in the manifesto with the line 'the expropriators are expropriated'. They would not be transformed into workers co-ops in general as co-ops are still independent enterprises which compete in the market. The productive forces would be placed under the authority of the working class with production and distribution being subject to centralised planning according to the demands of the revolution and the needs of the populace. \n\nYes capitalists will complain which is why revolutions are violent affairs. Its not just about the ideology of 'freedom' (although naturally thats how they tend to express themselves), its about their entire existence as a class coming to a decisive end, being forced to work and consume on equal terms with everyone else while their old power, wealth and privilege is unaplogetically stripped from them.\n\nThe ruling ideology is the ideology of the ruling class, so to effectively fight political concepts like freedom (in reality the freedom to exploit or be exploited) the working class must establish itself as the ruling class in society, that is the dictatorship of the proletariat.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MountainChen",
            "body": "Luckily, we have enough historical data at this point to look at some examples of how AES (read: Marxist-Leninist) countries deal with these things.\n\n1) Market mechanisms have been adopted (to various extents) by all AES countries since the 1980s, so the idea of just nationalizing *all* private businesses while hypothetically possible, seems unlikely, as it doesn't fit with the trend of the times/global norms in mode of production. We live under the hegemony of global capitalism, so trying to institute total nationalization without bucking the global hegemony or at least implementing a new Soviet Bloc to compete with it would almost certainly end in economic collapse. The obvious solution would be to just become completely self-sufficient, but what we've seen up to this point is that that's simply not possible if you want your society to continue developing in terms of technology, productivity, quality of life, etc. \n\n\n2) Converting all businesses into co-ops and such without nationalization is essentially the goal of Syndicalism. The closest, more broadly socialist (not necessarily Marxist-Leninist) implementation of this kind of thinking that I'm aware of would be Chile or Yugoslavia, and in both cases it ended in tragedy due to the global hegemony of imperialism. If that hegemony is defeated then it could be a potential avenue, but a Marxist-Leninist critique of it would be that it could—without a centralized leadership power to maintain stability—end up reproducing capitalist class antagonisms since each group/syndicate/union in the production chain could exert uneven influence, eventually reproducing class conflict and leading to rupture.\n\n\n3) Price caps and market interventions, alongside strategic or partial nationalization of key industries and the empowerment of labor under the centralized leadership of the Party/State is the prevailing method of AES governments in China, Vietnam, and Laos, with generally positive (albeit imperfect) outcomes. Afaik Cuba has been moving more in that direction as well (their historical tendency is more co-op oriented), and I've heard the DPRK has also implemented some reforms of that type as well (their historical tendency is more akin to total nationalization), but I'm not as familiar with those two beyond some basic knowledge of their trade relations.\n\n\nThe ultimate goal from a Marxist-Leninist perspective is to develop towards Communism, but it also comes with the caveat that the primary contradiction today is US imperialist hegemony, so the prevailing logic tends to be \"if it works then it works\" as they develop up to the point where the US will no longer be an existential and ever-present threat to their existence. After that? Who knows? hopefully, fully automated space Communism.\n\n\nI mention Marxism-Leninism specifically here because different flavors of \"Socialist\" will have very different answers to this question, and each flavor will insist that all of the others are wrong, lol",
            "score": 1,
            "replies": []
        }
    ]
}