{
    "title": "Not to legitimize this but the nationalist language in this feels like a red flag",
    "author": "Crafty_Money_8136",
    "subreddit": "Marxism",
    "rank": 99,
    "score": 73,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 90,
    "url": "https://www.reddit.com/gallery/1i8cuzn",
    "id": "1icoz8p",
    "selftext": "",
    "comments": [
        {
            "author": "alecro06",
            "body": "this is just typical liberal behaviour, they don't know how to do anything other than voting so when something they don't like happens they resort to dumb shit like this or the reddit blackout (lmao). they obviously won't achieve anything but it's fine because they don't want to actually change things, they only want to feel like they've done their part so they can feel smug about themselves",
            "score": 106,
            "replies": [
                {
                    "author": "____joew____",
                    "body": "No offense intended, but I think a lot of liberals (which I am not) would say the same thing about socialists. Not like Marxists are rallying in the streets or really doing anything other than what you're talking about.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "alecro06",
                            "body": "Marxists believe that there's a way to change things that doesn't involve voting or virtue signaling. I don't i think i need to explain why we aren't just randomly starting revolutions",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "fubuvsfitch",
                                    "body": "> I don't i think i need to explain why we aren't just randomly starting revolutions\n\nNo, but we should be laying the groundwork. How do you turn a revolution from \"random\" and \"hopium\"? Reaching the kinds of people who may attend these demonstrations, for one. Could be very beneficial.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "____joew____",
                                    "body": "I agree that liberals largely seem to think the only thing to do is voting despite their posturing. My point is just that, especially given the last election, the only thing Marxists seem to think you can do is not vote.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "catbusmartius",
                                            "body": "All the Marxists I know spent the last year literally 'rallying in the streets' along with other work supporting BDS, labor organizing etc. while the liberals were just online crying \"please don't criticize muh blue team in the electorino\"",
                                            "score": 33,
                                            "replies": []
                                        },
                                        {
                                            "author": "alecro06",
                                            "body": "Yeah, obviously not voting is just as useless as voting. However, I've never seen marxists say that not voting is the only thing you can do. In fact, you always see people that say \"organize!\" when asked about what we should do",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "CommunistRingworld",
                                                    "body": "I think not voting for dems is useful. Cratering hol0caust harris will have historical consequences hard to determine now, despite the liberal-right doing everything possible to pretend it wasn't partially because of gaza, and 100% because the liberal-right are right-wing.\n\nBut obviously building a revolutionary party is how those historic consequences become real. A space to the left of the liberal-right is open in the minds of the masses.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": -6,
                                                            "replies": [
                                                                {
                                                                    "author": "CommunistRingworld",
                                                                    "body": "I'm Palestinian. Hol0caust harris sent us here, not the people who refused to vote yes on her demanding a mandate for more genocide. Which, considering she did propaganda to package this as a \"woke genocide\", that mandate was LITERALLY THE GREATER EVIL in this election.\n\nAnd the chicken little crying wolf over fscism is extremely dangerous liberal-right bullshit which is actually strengthening the REAL fscists. Which is not trump. He's just a taste of real reaction in america. Who by the way, biden used to be buddies with and likely never stopped: the kkk are actual fscist militias and there are people like them everywhere but they have not seized power yet despite the hyperbole.\n\nhttps://youtu.be/vazUVS72gUo?si=HJ2WlZnGxlaI-wOo",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Crafty_Money_8136",
                                                                            "body": "All this. People saying trump is an ‘actual fucking fascist’ for targeting Americans while ignoring that Kamala and Biden actively killed 100,000s of Palestinians during their term, are showing their WS beliefs. Why are the lives of white Americans more important than Palestinian lives? \n\nRight now we have US tech corporations funding a genocide in DRC and enslaving children for precious minerals. Why doesn’t this ‘great American protest’ focus on targeting tech companies? Certain lives are being prioritized here while others are sacrificed, and it’s the result of settler colonialism. People are just digging the hole deeper by saying Kamala wasn’t a fascist.",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "JohnRodriguezWrites",
                                            "body": "Wild to say this when Marxists were busy protesting for Palestine while liberals went out of their way to ignore the movement even after they were told that they would lose if they didn't stop bombing children.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "____joew____",
                                                    "body": "well I guess just for the sake of argument, why do Marxists get the credit for those protests? I'm sure many Marxists did get involved, but so did Muslims without a socialist affiliation and certainly liberals and other groups, like Jewish anti-Zionists, who are not necessarily socialist.\n\n\"Liberals\" seems to mean just the Democratic establishment, here, but by virtue of the fact most people on the left end of the spectrum in the US are moderate liberals, wouldn't most protests be disproportionately represented by them?\n\nIt's not clear to me based on what I've seen Harris lost the election because of protest nonvoters. This might cause some anger but given the fact there has been a ceasefire, prior to Trump getting in office, and because Kamala *did* say she wanted a ceasefire, and because Trump has already talked about \"clearing out Gaza\", one could actually easily argue nonvoters harmed Gazans more than they would've otherwise.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "JohnRodriguezWrites",
                                                            "body": ">It's not clear to me based on what I've seen Harris lost the election because of protest nonvoters\n\nWhen you lose as badly as Kamala did there is no one single reason, but there are multiple swing states in which Muslim voters and young voters abandoned the coalition that got Biden elected in 2020, which was undoubtedly (and this is supported by polling) affected by Kamala being complicit in the genocide in Gaza.\n\n>\\-one could actually easily argue nonvoters harmed Gazans more than they would've otherwise.\n\nHow do you figure? Non-voters didn't vote for her bc they wanted to punish her for committing genocide and force the Democratic Party into agreeing to a ceasefire before Trump took office. It seems like they were successful at both. Considering both candidates were blatant liars I'm not sure if what they said had much impact.\n\n>\"Liberals\" seems to mean just the Democratic establishment, here, but by virtue of the fact most people on the left end of the spectrum in the US are moderate liberals, wouldn't most protests be disproportionately represented by them?\n\nIn my anecdotal experience this was not the case. I have no data to support this so grain of salt. There are lot of non-Marxists in the movement bc the number of Marxists in America is relatively small, but there were a many different Marxist orgs represented in (and even organizing) the protests and demonstrations.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "____joew____",
                                                                    "body": "> When you lose as badly as Kamala did there is no one single reason, but there are multiple swing states in which Muslim voters and young voters abandoned the coalition that got Biden elected in 2020, which was undoubtedly (and this is supported by polling) affected by Kamala being complicit in the genocide in Gaza.\n\nI want to point out, first of all, she lost the electoral college, but lost the popular vote by one of the thinnest margins in 200 years. In that time, there have only been 7 elections closer than the most recent one. She received the third most votes for any candidate, ever. So she did not lose as badly as the right would have you believe (not that you believe that, necessarily).\n\nI also want to point out that I am not defending Harris's policies or morality or any of her decision making in the campaign or as a politician.\n\nDo you have a link to stats or something that it was people not voting as a Gaza protest that led to her defeat in swing states?\n\n> How do you figure? Non-voters didn't vote for her bc they wanted to punish her for committing genocide and force the Democratic Party into agreeing to a ceasefire before Trump took office. It seems like they were successful at both.\n\nI guess I figured they wanted to help Gazans. I'm not really sure how they \"forced\" the Democratic Party to \"agree to a ceasefire\", because a) the Democrats were not the ones holding out, b) the Biden admin's efforts towards a ceasefire, even just the current one, started more than six months ago, and c) Trump already made it clear that he wanted a ceasefire. In fact, he wanted it prior to the 20th. So either: the ruling party couldn't motivate a ceasefire, in which case it didn't matter who won, or they could, in which case both the republicans and democrats were working on doing so.\n\nWhen the choice is between someone who is evil and someone who is comic book level evil I would pick the former. \"Punishing\" a candidate is childish to the point it feels like a psy-op on the part of the Republicans. It's not in a vacuum. If punishing the Democrat means electing a Republican, who is not only far worse for Gazans but everybody on earth, it's simply impossible to make that argument.\n\nI'll accept people who say that they felt, morally, that they could not vote for someone who was not vocally against the genocide (as I said, Harris did call for a ceasefire). But I do not accept that it has or will lead to better outcomes for anyone involved, or that it was a calculated maneuver on the part of Marxists or anyone else.\n\n\"They succeeded\" in the sense it was always going to happen. The Democrats do not and did not suddenly care about what the far-left had to say.\n\n>  Considering both candidates were blatant liars I'm not sure if what they said had much impact. \n\nThis is just to deflect from the fact non-voters explicitly helped elect an outright authoritarian to the presidency. They might both be liars but in such varying degrees as to be a worthless comparison.\n\n> In my anecdotal experience this was not the case. I have no data to support this so grain of salt. There are lot of non-Marxists in the movement bc the number of Marxists in America is relatively small, but there were a many different Marxist orgs represented in (and even organizing) the protests and demonstrations.\n\nAll of this could be true and none of it contradicts the part you're quoting.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JohnRodriguezWrites",
                                                                            "body": "1) To clarify: I didn't speak to many moderate liberals at these rallies, mostly leftists and young people who are getting into political organizing for the first time.\n\n2) As a card carrying communist I don't vote as an individual. The party I'm a member of decides who we're voting for by consensus. They've earned that bc of the mutual aid work in my community. **Even** **if** I believed Democrats were the lesser evil I still wouldn't vote for them on principle. \n\n3) The cold hard truth is that Democrats were holding out. Biden could have ended the genocidal campaign on Gaza with a single phone call. Whether he was getting played by Netanyahu or simply refused to risk that AIPAC money drying up before the election, he sat on it for months while thousands of people died. If Kamala won who knows when they would have announced a ceasefire (if at all), but we know that Trump winning forced them to speed up the process so he couldn't take full credit for it.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OfTheAtom",
                    "body": "This misunderstands i think a critical difference because liberals believe two human beings are searching for truth and can help eachother through their particular perspectives to figure out. That means voting is almost always an option because conversation is fruitful with almost everyone. The exceptions would be people who have closed themselves off from this possibility. For them, that's when violence is needed. \n\n\nLiberals are more likely to actually argue basically. Get up and have debates. Now, the intellectual work is basically garbage these days to have these talks but look at the origins of the Republican party. Lincoln vs douglas debates and talks across the country on the difficulties they were having with slavery. The conversation was changing, and the elections showed that. \n\n\nThen of course you had those that wanted to pull away from the conversation. And the rest is history but it shows liberals are willing to use violence when necessary. But they also believe in truth. \n\n\nMarxists are more likely to run into an argument and just sum it up to \"well you're brainwashed. We will squash you in the revolution\" and thats it it seems. ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gertsky63",
            "body": "Notice also said that the actions are mainly actions that individuals will take as consumers. That's okay as far as it goes but note to the absence of mass collective action by labor in the statement (unless I've missed it).\n\nMarxism in Russia grew in struggle against populism and only came to the head of the masses by supplanting the populists. And those populists had a track record of heroic if misguided actions.",
            "score": 47,
            "replies": []
        },
        {
            "author": "Gertsky63",
            "body": "There are many things to object to in this statement.\n\nThe American people are absolutely not united. No nation is, let alone the population as a whole of large nations. \n\nNations, states: they are divided by class. This is such a fundamental point that anything speaking of uniting the people of a large imperialist power as a whole cannot be described as being on the left or progressive.\n\nAnd then it says explicitly: this is not a matter of left or right. By deliberately rejecting the idea of siding with socialism against capitalism, this statement places itself firmly on the ground of populism. Its words about the working class and opposing the rich are therefore fundamentally empty, and the statement has telegraphed that in advance.\n\nWe are in dangerous enough territory as it is without leftists making these sorts of concessions – if they were left in the first place. But non-leftists  using fiery radical language and talking about the working class is always a dangerous sign.",
            "score": 41,
            "replies": []
        },
        {
            "author": "CoagulaCascadia",
            "body": "Classic petty-bourgeois stuff. Telling the working class to boycott cheap goods will not win them over when they are just struggling to put food on the table. These sorts of boycotts are a fetter on class consciousness, as they falsely inform people that a possible solution lies in the hands of the ruling capitalists class, if only you can force their hands to do good or moral things with their money. It is overly simplistic, its basis is in a lack of faith in the working class.\n\nThe logic is this, that since corporations are driven by profit to do bad things, the opposite MUST be true, they can be driven by a fall in profit or a loss of profits to simply do the right thing. This is false, and is based in liberal reformism, that there is a way or ways to let the better thinkers, or those with the hands on the levers of control, to simply create a better world based on some higher set of morals that do not exist for the ruling class. They disregard that only though the class struggle, the active participation of the masses in creating THEIR OWN destiny, will there be a new set of proletarian morals born out of this process. This can only happen through the process of revolution and the seeds of which do not lay in the hands of Nestle, Meta or Coca Cola but in the working class themselves!\n\nEdit: My first \"Red flag\" was the fact that the document is being yelled at me.",
            "score": 16,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 3,
                    "replies": [
                        {
                            "author": "CoagulaCascadia",
                            "body": "If you are a Marxist, and think that the working class needs an independent class perspective, this document should make you feel weary. For the reasons I stated above. \n\nThese same reasons can be extended to the political sphere(workers or labour parties like the NDP or Labour Party in Britain)or even the sphere of trade unions who claim to fight in the interests of the working class but attach themselves to the capitalist system. They profess that they are able to wave their magic wand and deliver concessions from the bosses WITHOUT the direct participation of the masses of workers. \n\nThis has the same, fetter on class consciousness, as boycotts or placing faith in bourgeois government institutions. It offers a shortcut to the workers problems, an easy way out, \"the union bureaucracy will solve your problems at the boardroom table so your family has food on its table!\". This tells workers that they don't need to struggle, they don't need to participate at all!\n\nThere is a very real economic basis of this reformism thought, like the boycott ideas of this document, but these are reaching their limits in the current crisis and workers are waking up from their slumber and realizing that their trade union leadership is not up to the task of actually solving even their most basic needs.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Crafty_Money_8136",
                    "body": "The part about boycotting food companies with the objective being just to reduce food prices, I think encapsulates what you’re saying. The objective is not stated as returning power over food production and distribution to the population, it’s just to force companies to make food cheaper. I tuned out when they started talking about American farmers. A lot of those ‘farmers’ are big agricultural corporations who have production contracts with those listed food companies. Those who aren’t, are settler farmers who recreate the same ecologically destructive practices in a less efficient way (even more so for organic, regenerative, local type farming). \n\nAs someone who’s really interested in reforming our food system, it screams ignorance. Farmers having to buy new seed is only for patented, genetically modified crops. Even if you’re not under the constraints of a patented crop, it’s still often preferable to buy new seed instead of seed saving to ensure genetic diversity and disease control, plus many plants don’t go to seed until the second year so it’s just not feasible to save seed unless that’s the main objective of your setup.\n\nAll that to say, there’s an ignorance pervading this whole document which makes it clear this is a petty bourgeois initiative from someone who’s dissatisfied they can’t live the way they did before 2020. It doesn’t aim for an effective class conflict because they don’t even acknowledge the existence of separate classes within the ‘American People’",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "It might be Well intentioned, but these sorts of broad calls to action rarely work and often decry a lack of knowledge or experience on the part of the poster, which might be your discomfort. \n\n\"Let's all do a thing guys!\" Doesn't hardly ever work. \nThe internet is not a very great place to organize. \nIt worked a little bit in 2020, but even then, most of those protests were being organized by either organizations or teams of individuals doing the groundwork, and then they gained traction online. \n\nThe internet is filled people right now who are hoping to encourage some kind of group movement, but I personally believe most on the ground action is going to take people either joining some kind of organization, or syndicalizing people at their workplaces and among their friend groups, and then either doing their own direct action, or acting opportunistically when actions are being taken place near them.",
            "score": 15,
            "replies": [
                {
                    "author": "None",
                    "body": "Like the internet can help an action gain traction, but there must be groundwork first for anything real to happen, and a lot of people are I think maybe terrified of going outside.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Crafty_Money_8136",
                            "body": "Thank you for this, and an action can’t start from a place of idealism and patronizing the people they’re trying to recruit as you’ve said. That’s definitely a big part of why I dislike this so much.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sure-burn",
            "body": "This is the kind of passive resistance than anyone can do without putting a target on their back.  It’s a toe in the water for collective action for people who have not developed a sense of class consciousness. \n\nMost Americans use the term “left” to refer to liberals and Democrats and “right” to refer to conservatives and Republicans.  The language here is an attempt to overcome the political rhetoric that divides the working class and remind us that our material interests are aligned with other workers.",
            "score": 7,
            "replies": [
                {
                    "author": "Crafty_Money_8136",
                    "body": "To me it seems like a conservative effort to turn back time to pre- 2020 conditions without addressing the root of classism. What u said about left vs right meaning democrat vs republican is pertinent, I think more and more people have been seeing the parties as essentially for the same purpose. I don’t like the false claims of unity or the objectives here though.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sure-burn",
                            "body": "As an American, I can tell you that the Democratic Party invests billions in confusing these issues.  Democrats spend most of their resources and energies crushing opposition from the left covertly so they can hold themselves up as the only viable alternative to fascism, and a major part of that is co-opting and defanging any successful activist movements.  You can’t really understand the culture wars in America without understanding that.  \n\nBoth Democrats and Republicans are beholden to corporate interests.  They (meaning both Democrats and the private interests that control them) are happy to co-opt social justice movements like Black Lives Matter that threaten material change and turn them into superficial Diversity, Equity, and Inclusion initiatives which are impotent to effect real change, and often exacerbate cultural divides because they aren’t allowed to threaten the interests of capital by educating on class consciousness. Of course, movements like DEI are being cast aside rapidly now that the fascists are in charge again.  \n\nI’m sorry if I’m saying things that sound basic or obvious. I am no expert in Marxism, but I know a lot about Americans who are clueless about their material interests and think that they are on the same side as billionaires.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Crafty_Money_8136",
                                    "body": "What you said here is pretty spot on imo, the only thing I would argue with is that the Democratic Party is also basically fascist. I also think most Americans are pretty aware of their immediate material interest, may have a false idea of class mobility but they do know that their interests lie in the continuance of American imperialism because that’s how most of our economy of goods is produced. Your points about Black liberation movements being reformed into DEI and democrats existing to co- opt and crush the left are spot on.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sure-burn",
                                            "body": "I don’t care to argue about whether the Democrats are also fascist. I will say that they don’t believe themselves to be. I think virtually all Democrats and most of the self-professed leftists in the US believe there is a difference between being pro-capitalism and pro-fascism. Personally, Democrats also feel much less scary to me than the raging fascists that control the Republican Party.  But they carry water for the same capital interests, so… yeah.  \n\nAs to whether Americans are aware of their material interests, yes and no.  I think most Americans (myself included) lack a deep understanding of how US imperialism benefits them materially.  We live in a place where the cost of goods and services is so divorced from the labor that produces them that it is quite common for people to have more automobiles than teeth in their head.  Dental services are so expensive (and not covered under regular medical insurance, which is also expensive) that it can literally cost less to buy a car than get your teeth fixed.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Popular-Squirrel-914",
            "body": "I agree in principle with your point about the nationalist language, however nationalism if it is for the purpose of national liberation I.e Palestine, Ireland and Cuba can be a good unifier for a Marxist movement if said movement remains oriented toward the goal of socialism and is controlled by the workers. I think it is important to take this into consideration when criticising nationalism. I do however have my issues with this, yes it’s good to see some effort at collective action but the actions they are taking unfortunately will not be effective. Boycotts can and do get results however they need much more popular support. For example in Ireland at the turn of the 20th century entire villages and towns would refuse to supply even basic necessities to police, army or British government officials when they stayed there and anyone who did was ostracised. This is the level of solidarity that is needed in order to gain any collective bargaining power from it. At the minute it feels like this lacks any kind of class consciousness and fails to take in to consideration the power that fascists currently hold. Voting with your dollars is unfortunately not a viable strategy when going up against a flourishing totalitarian regime. However, this combined with a general strike, militant boycotts and civil disobedience may be enough to actually start to hurt their pockets. It would absolutely need to be more centralised and organised to have any sort of long term or even short term effect.",
            "score": 8,
            "replies": [
                {
                    "author": "Crafty_Money_8136",
                    "body": "The difference imo is that Palestine, Ireland, and Cuba are all largely nations of people who are themselves previously or currently colonized. They’re mainly either the cultural and ethnic descendants of the Indigenous people or people who were enslaved on that land. Nationalism in the US means rallying the settler population. There is a big difference in the class interests of the settler colonial population vs the Indigenous population of any country and revolution in the countries you listed has necessarily involved ousting or reclaiming power from the settler population.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Popular-Squirrel-914",
                            "body": "I essentially agree with what you are saying and I do understand the difference. However, I think it may be possible to shift the focus of such a movement into a more class struggle focused direction if you get me? So whilst the language used in this fits the criteria of settler nationalism they could in theory be nudged toward class via some mass line work. If we meet the people where they are and create a dialogue it is possible to shift from decentralised, vague American patriotism to a more organised revolutionary effort. Of course there would also have to be a significant effort to make the language and movement more inclusive of the indigenous population.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Crafty_Money_8136",
                                    "body": "I agree, although I don’t think it’s just about being inclusive, I think it’s necessary to strictly stay on a trajectory toward the liberation of the colonized groups within the US and the third world being imperialized by the US. without that, you’re moving toward settler communism. Imo there’s no reason why settler populations of the US shouldn’t be involved in class struggle alongside colonized populations, but the material priority shouldn’t be their continued provision at the expense of the ‘global south’. I actually think that priority should be criticized as much as possible",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Popular-Squirrel-914",
                                            "body": "I completely agree to be honest! I think you’ve articulated it excellently! I definitely agree that there is no point in class struggle if it does not allow for the liberation of colonised peoples! The last think we need is a repeat of the material conditions that have led to such a sharp decline into fascism in the first place",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CoagulaCascadia",
                            "body": "You are applying a very concrete and rigid definition to nationalism. At one point the national interests of an oppressed people can be seen as progressive and at another point they can be seen as regressive or fascistic. \n\nTake Serbian nationalism as an example.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Crafty_Money_8136",
                                    "body": "In a country like the United States where basic goods and necessary labor in sectors like food, housing, energy, etc are largely provided through neocolonial and imperial relationships with other countries and with specific populations within this country, the national interest of citizens is to continue this relationship and that interest will not change until the economic relationship changes",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Arabismo",
            "body": ">It is not left vs right\n\nThis is where I stopped reading, any protest movement that can't accurately wrestle with reality is doomed to failure \n\nPretending the right and it's class character simply doesn't exist guarantees two outcomes; either your org will surrender to the right or it will be taken over by the right thru infiltration\n\nRadlibs are ideologically wedded to the idea that they can somehow \"TRICK\" the American populace into embracing progressivism, like a hypnotist who dangles Keynesianism and snaps his fingers, they continuously underestimate the class cohesion and character of multiple American demographics",
            "score": 3,
            "replies": [
                {
                    "author": "Crafty_Money_8136",
                    "body": "Thats one of the most annoying parts about this for me, thanks for hitting the nail on the head. The idealism here and trying to convince people that reality is something it’s not. I think it’s preferable for people to align with nationalism and capital because they actually understand the truth of things, than to be deceived into a movement that targets the state and capitalism. Although this movement is toothless, people know when they’re being lied to and that will kill any positive engagement quickly and make your initiative look dishonest.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "sabrefudge",
            "body": "It would be nice to have the financial stability to be able to just ditch all cheap products and services, all speciality parts and tools, and shop solely with wholesome heckin’ local shopperinos.",
            "score": 3,
            "replies": [
                {
                    "author": "Crafty_Money_8136",
                    "body": "The problem is that from a Marxist perspective local businesses under capitalism are just smaller versions of the ones that exploit us and they can be more exploitative in my experience",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CoagulaCascadia",
                            "body": "Have you read Lenin's \"Imperialism: The Highest Stage of Capitalism\" ? \n\nI ask, as I feel it would give a bit more substance to your very natural ideas about small business and monopoly capitalism",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fubuvsfitch",
            "body": "I understand and your concerns and they resonate with me. Yet, as Marxists i can't help but feel we need to be asking ourselves what tactics we can employ to use these popular mass demonstrations to our advantage. \n\nIs there anything wrong with attending a protest like this? Can I employ tactics that advance our cause at an event like this without compromising my principles? Would this be a good opportunity to hand out zines or flyers? \n\nThe organizers of this event are not going to be able to maintain the narrative they desire. They can have all the hopes in the world that this turns into a lib version of \"Reawaken America Patriotism.\" But if enough people there, many of whom may already be primed and ready to hear a socialist message, can be reached then maybe it's a net positive for us.\n\nRegardless, much like Lenin wished for the defeat of Russia in the first world war, we should be opportunistic of any unrest here in the States. A sort of internal revolutionary defeatism.",
            "score": 3,
            "replies": [
                {
                    "author": "Crafty_Money_8136",
                    "body": "I love what you’re saying about opportunism and I agree. I think my discomfort is that I know a lot of people in the US are the opposite of primed to learn about socialism and are only in the position of questioning individualism and capitalism because they are seeing their basic needs go unmet suddenly. Any association with communism is received as a red flag and any history of communist organizing or a communist identity here has been revised and absorbed by liberalism. So I’m wondering how people who have been drawn to participate in something like this through nationalism/ populism can actually be redirected into class consciousness that goes beyond, ‘you don’t have this thing you need, wouldn’t you like to have it?’",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CoagulaCascadia",
                    "body": "Depends on the class makeup of the \"unrest\"... The Spartacist League in Canada thought along these lines with the Freedom Convoy and thought they could win the 'masses' over from this petty-bourgeois movement to a Marxist or class independent program... Didn't work. Doesn't mean these participants of the convoy are all going to be shitty reactionaries forever but, it is a mistake of putting theory into practice.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thanaterus",
            "body": "This \"it's not left vs right\" slogan is something I've heard people I know IRL start to parrot back.  It began with Luigi \n\nI'm convinced that slogans like this, whether you agree with them or not, are manufactured by the state and are used to get people to think a certain way.  \"The vaccines are safe and effective\" and \"::fill in the blank:: is a danger to our democracy\" are two others I can think of off the top of my head \n\nThe fact is, it IS left vs right.  Opposing the bougious ruling class is literally left wing and supporting is right wing.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ChristHollo",
            "body": "The liberal perspective is one that typically suspends all analysis of cultures of labor in favor of cultures of consumption. “We are a class of consumers, not producers”. And then you get shitty plans of “collective action” like this",
            "score": 2,
            "replies": []
        },
        {
            "author": "Crafty_Money_8136",
            "body": "Can you all help me pinpoint the reason for my discomfort with this? Every word is nonsense but I feel like it’s getting at a relatively common belief in the US which is not harmless. I know the factual harm of that belief- settlerism, nationalism, etc. \n\nWhat’s the alternative? It seems like many people here can only be rallied around nationalism. I know to organize we need to form an identity centered around communist values. How can that be done in this deeply nationalistic context?",
            "score": 2,
            "replies": [
                {
                    "author": "No-Oil-391",
                    "body": "Most of what this \"initiative\" supports is a sum of individual actions against a selected number of brands and companies. It's not advocating for a class organization nor for the fight against capitalism. It's filled with individualism and idealism.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "turkeywire",
                    "body": "Aside from it being nationalistic, which is really probably the most distracting part of this whole document, is that it is basically screaming at you. It's acting like it's coming from a place of authority yet it's from an anonymous profile, which makes it feel seedy(the author may have actually thought they would be in danger if their name was attached to this, but it could have been made by an FBI cell). And while there are calls to action, there are no actual plans or resources to do a lot of the things it claims the reader should do. It also doesn't reassure the reader really at all and back to the lacking of plans, there are no alternatives for what it is asking. Boycotts are a tool  the left should definitely use, when done right it proves to the proletariat that collective action works, but you can't just boycott everything. It has to be focused on else it's not realistic, and that is the last problem you are probably having with this. It is not realistic whatsoever. I personally think most of these things could work, and I don't think it would take very much ground work, but all of them at once, it is setting the reader up for failure, and maybe that is the point of the document.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Crafty_Money_8136",
                    "body": "I disagree, even on the first page they use phrases like ‘great American ..’ and ‘we the American people are united’ and ‘together we shall stand’ which are either pulled from the constitution or just adaptations of nationalist rallying phrases. It would only seem harmless if u don’t know the history of the US.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "turkeywire",
            "body": "I'm not sure, I've been hearing a lot about a general strike in my algorithms. This could be worded so non leftists aren't scared away from it, and I really don't know how to tell you this but if a country is already nationalized it's kind of hard to not use nationalist language since the population of that nation really doesn't care about the rest of the world. I think buzz is better than nothing. And this document does call for community building. This just sounds like an extremely naive progressive, that knows just enough about class consciousness to get themselves in trouble. We on the left have this really bad problem of not feeling like a safe place to land. We give annoying bitchy nerds online and it's alienating. We wonder how the far right is able to garner so many people from media in general and this is why. And it's not us being anti racist and anti imperialist, it's when someone tries to do something remotely left sounding we make it sound like that person is the stupidest person on earth. Is it really useful. I thought we were supposed to be the better side. Are most online socialists even fucking real or are y'all paid by the CIA and FBI, because y'all's \" um wrong...\" At literally every thing is giving plant.",
            "score": 0,
            "replies": []
        }
    ]
}