{
    "title": "Liberal economic theory does not take into account the possibility of overcoming commodity fetishism",
    "author": "SvitlanaLeo",
    "subreddit": "Marxism",
    "rank": 73,
    "score": 61,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/Marxism/comments/1iiwysd/liberal_economic_theory_does_not_take_into/",
    "id": "1iiwysd",
    "selftext": "Liberals often say: \"Well, practice has confirmed that Marxism does not work, all socialisms eventually turned to a market economy.\" In my opinion, this statement misses the point.\n\n\n\nFirst, Marx was not a theorist of a planned economy at all and never claimed that a planned economy would work in one particular country. Marx was a critical analyst of capitalism.\n\n\n\nSecond, Marx did not claim that when people have commodity fetishism in their minds, it would be easy and simple to create a competitive alternative to capitalism.\n\n\n\nHowever, unlike liberal economists, Marx did not accept commodity fetishism as an economical constant. For him it was a critical concept, not something natural.\n\n\n\nA liberal economics can be compared to Newtonian physics or Euclidean geometry. It is true that liberal economics works. But there are a few \"buts.\" Firstly, it works until commodity fetishism is overcome in people’s minds. Secondly, it works in an environment where it is normalized to draw motivation from satisfying one's arrogance. Capitalism works in favor of those who want to satisfy their arrogance. Liberal economics does not assume that this trait can be overcome in people.\n\n  \nCapitalism literally puts human vice at the basis of social production.\n\n\n\nUnlike liberal economic schools, Marxism allows for the possibility of overcoming commodity fetishism and philistinism in people. And in this it is still scientific, because firstly, there have been societies without commodity fetishism, and secondly, there is no psychogenetic evidence that people are prone to commodity fetishism and arrogance (although Marx lived before psychogenetics appeared).\n\n  \nSocialism with overcome philistinism mathematically wins the battle against capitalism. There is no reason why socialism, which has overcome philistinism and commodity fetishism, should lose to a system based on the ability of the capitalist to obtain surplus value in order to satisfy their arrogance.\n\n  \nIf economics wants to be truly scientific, it must unlearn to see commodity fetishism as a constant.",
    "comments": [
        {
            "author": "Zandroe_",
            "body": "Marx did claim socialist production would be rationally planned:\n\n>\"The nationalisation of land will work a complete change in the relations between labour and capital, and finally, do away with the capitalist form of production, whether industrial or rural. Then class distinctions and privileges will disappear together with the economical basis upon which they rest. To live on other people's labour will become a thing of the past. There will be no longer any government or state power, distinct from society itself! Agriculture, mining, manufacture, in one word, all branches of production, will gradually be organised in the most adequate manner. National *centralisation of the means of production* will become the national basis of a society composed of associations of free and equal producers, carrying on the social business on a common and rational plan. Such is the humanitarian goal to which the great economic movement of the 19th century is tending.\"\n\n(Nationalisation of land)\n\nAlthough he and Engels later recognised that capitalist production has become global and can only be replaced with a global system. Engels also puts it well in Antiduhring:\n\n>\"With the seizing of the means of production by society production of commodities is done away with, and, simultaneously, the mastery of the product over the producer. Anarchy in social production is replaced by systematic, definite organisation. The struggle for individual existence disappears. Then for the first time man, in a certain sense, is finally marked off from the rest of the animal kingdom, and emerges from mere animal conditions of existence into really human ones. The whole sphere of the conditions of life which environ man, and which have hitherto ruled man, now comes under the dominion and control of man who for the first time becomes the real, conscious lord of nature because he has now become master of his own social organisation. The laws of his own social action, hitherto standing face to face with man as laws of nature foreign to, and dominating him, will then be used with full understanding, and so mastered by him. Man’s own social organisation, hitherto confronting him as a necessity imposed by nature and history, now becomes the result of his own free action. The extraneous objective forces that have hitherto governed history pass under the control of man himself. Only from that time will man himself, with full consciousness, make his own history — only from that time will the social causes set in movement by him have, in the main and in a constantly growing measure, the results intended by him. It is the humanity's leap from the kingdom of necessity to the kingdom of freedom.\"\n\nAs for commodity fetishism, it is not some psychological defect, but a response to real conditions of production. The worker feels that the product of his labour has become some monstrous external thing that has power over him **because it has**. The abolition of commodity fetishism necessitates the abolition of commodity production and exchange. But then production has to be placed on another basis, and the socialist answer to this question is scientifically planned production for need.",
            "score": 26,
            "replies": []
        },
        {
            "author": "grimorg80",
            "body": "I just want to add that ANY message of the \"all socialism turns to markets\" misses the 60 years of CIA terrorism, systematically taking down democratically elected socialist leaders.",
            "score": 17,
            "replies": [
                {
                    "author": "TheCynicClinic",
                    "body": "Along with capitalist suppression of socialism within as well. The Nordic countries have progressive policies because they had to make concessions due to socialist influence. FDR was elected because his platform was simultaneously an acknowledgement of socialist sentiment and an undermining of socialist parties gaining traction.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}