{
    "title": "Marxian economics clarification, how are wages set at subsistence?",
    "author": "Interesting-Shame9",
    "subreddit": "Marxism",
    "rank": 58,
    "score": 7,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Marxism/comments/1ios1ir/marxian_economics_clarification_how_are_wages_set/",
    "id": "1ios1ir",
    "selftext": "So marxian economics belongs firmly within the classical school of economics and in many ways can be seen as a logical extension of the economics of Smith and particularly Ricardo.\n\nI find this whole school fascinating and learning about Smith, Ricardo and Marx is very interesting concept to me.\n\nI'm always looking to better my understanding of the nuance and details of the theory behind all this.\n\nAnyways, I recently realized that the Supply and Demand of the classical (and therefore marxian) school is fundamentally different from the neoclassical school.\n\nWithin neoclassical economics the supply curve is basically every quantity wherein MC >= AVC. The demand curve is created by plotting the intersection of the budget line and indifference curves at different commodity prices.\n\nBoth of these rely on marginalist theory to construct these curves. Given that the marginalists came much later than the classicals.... where did supply and demand curves come from in the classical school?\n\nI was trying to find an answer and stumbled across this paper: [https://digitalcommons.chapman.edu/cgi/viewcontent.cgi?article=1305&context=esi\\_working\\_papers](https://digitalcommons.chapman.edu/cgi/viewcontent.cgi?article=1305&context=esi_working_papers)\n\nIt was interesting. Basically their idea is that supply represents the cumulative reservation prices of all sellers in the market, and the demand represents the reservation prices of all buyers in the market.\n\nOk, as I understand it, the intersection of supply and demand represent the market price AT ANY GIVEN TIME. However the thing that interesting the classicals was the concept of value, or as smith called it \"natural price\". The natural price of any given commodity is the price around which market price tends to fluctuate. At any given time market price may be above or below natural price, but the market continually adjusts AROUND natural price. In essence, this is because if the price of a commodity is above natural price, more sellers enter the market, driving down the market price until it reaches the natural price. The reverse happens if the market price is below natural price. Market price is ephemeral, set by the intersection of supply and demand, but that intersection tends to revolve around a fixed point: natural price (or in marxian terms, value).\n\nOk, so, let's apply this logic to wages. This is where I get a bit lost in the details and want some clarification. The \"natural price\" of labor (or in marxian terms, the value of labor-power) is the cost of the means of subsistence. You need to offer workers a sufficient wage in order to sustain living and come back again tomorrow cause if you don't they won't work for you. Wages tend to stick at the cost of the means of subsistence because if wages rise, that draws more people in from the reserve army of labor, increasing labor supply and therefore driving down the price. The reverse happens if wage falls below the cost of the means of subsistence.\n\nSo here's where I get a bit tripped up. The supply curve represents the quantity of labor-power supplied at any given wage right? So if wages rise, that brings more workers from the reserve army of labor into the market, and thereby increases the quantity of labor-power supplied. What I don't get is why this would be the case at all price levels and thereby lead to an overall shift in the supply curve. Wouldn't the quantity supplied simply increase only at wages at or above the current wage because below that wage, workers would simply return to the reserve army of labor? That's what I don't get, why would quantity supplied increase at every price level and thereby lead to a broader shift in the supply curve?\n\nEdit:\n\nPerhaps I am overcomplicating this. Sure workers will leave the market in the long run but in the short run they're still in it while they organize leaving or whatever. You still need to eat while you are trying to organize an exit. So that means that their reservation prices are added to the market supply and therefore you see a shift at every price level? Does that make sense?\n\nSo in essence, the labor market supply represents the reservation price of every laborer trying to sell their labor. If wages fall below subsistence, then this leads to workers to stop selling their labor and instead shift to non-capitalist production (subsistence farming, domestic labor, etc) or whatever (or maybe just starving to death, point is that they are no longer trying to sell their labor), which means that they leave the market and therefore are no longer counted as a seller, thereby leading to their reservation price and the quantity of labor-power supplied at those reservation prices being withdrawn from the market? Is this correct?\n\nSo basically workers cannot immediately leave the market which means that wages below natural price are kept in the labor supply curve. But they do eventually leave leading to the shift leftwards.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Marxism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comprehensive_Lead41",
            "body": "In the short run, an increase in wages attracts more workers into the labor force, but these workers don't necessarily instantly withdraw if wages dip slightly. Once workers commit to employment, they must still cover their means of subsistence, so they remain in the labor market at lower wages until they either find something better or are pushed out completely. In the long run, the labor supply adjusts dynamically through demographic effects, immigration, and changes in capital accumulation. For instance, if wages remain high for a sustained period, more people may migrate to take advantage of the demand for labor, increasing supply further. Conversely, if wages stagnate or fall, people exit the workforce, delay family formation, or migrate elsewhere. \n\nWorkers are not perfectly elastic in their response to wage changes because of survival constraints. Even if wages fall slightly below the previous equilibrium, many workers remain in employment out of sheer necessity. Unlike in marginalist models, where workers choose their labor supply based on utility maximization, in Marxian economics, workers sell their labor because they must. They cannot withhold their labor indefinitely like a capitalist might withhold goods from the market to manipulate price.\n\nDuring economic booms, capital expands, absorbing more workers and driving wages up. But as accumulation reaches its limits (overproduction, falling profit rates, etc.), capitalists slow investment, shed workers, and recreate the reserve army, restoring downward pressure on wages. This cycle is what keeps wages tied to subsistence in the long run.",
            "score": 5,
            "replies": [
                {
                    "author": "Interesting-Shame9",
                    "body": "I think that fits with my edit? I copied below, is this a correct understanding?\n\nPerhaps I am overcomplicating this. Sure workers will leave the market in the long run but in the short run they're still in it while they organize leaving or whatever. You still need to eat while you are trying to organize an exit. So that means that their reservation prices are added to the market supply and therefore you see a shift at every price level? Does that make sense?\n\nSo in essence, the labor market supply represents the reservation price of every laborer trying to sell their labor. If wages fall below subsistence, then this leads to workers to stop selling their labor and instead shift to non-capitalist production (subsistence farming, domestic labor, etc) or whatever (or maybe just starving to death, point is that they are no longer trying to sell their labor), which means that they leave the market and therefore are no longer counted as a seller, thereby leading to their reservation price and the quantity of labor-power supplied at those reservation prices being withdrawn from the market? Is this correct?\n\n  \nSo basically workers cannot immediately leave the market which means that wages below natural price are kept in the labor supply curve. But they do eventually leave leading to the shift leftwards.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Comprehensive_Lead41",
                            "body": "Yes, you're on the right track. Workers do stay in the market for some time even if they are considering leaving. But it's not just that their reservation prices are added in the short term. The very structure of labor competition changes. The labor supply curve shifts because new workers entering the market don’t just disappear if wages fall slightly. They stick around as long as they can, creating a period where labor supply remains high even at lower wages before some are eventually forced back into the reserve army.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Umfriend",
                    "body": ">In the short run, an increase in wages attracts more workers into the labor force, but these workers don't necessarily instantly withdraw if wages dip slightly. **Once workers commit to employment, they must still cover their means of subsistence,**\n\nI don't get this. How did workers subsist prior to joining the labor force?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Internal-Enthusiasm2",
            "body": "Riccardo is the basis of both marginslist and Marxist economics.  Riccardo derived the iron law of wages based upon the fixed supply of land. Henry George extended this.\nMarx doesn't really disagree,  but the issue becomes the issue of surplus value and where it goes. Marx and the marginalists both choose to treat land and capital as the same. \nIm the marginalists analysis, the wage for a job is that a company will how until an extra person it's paid equal to their productive output and everyone gets paid whatever the least is willing to work for. \nThe analysis from all four economic schools results in,  more or less,  the same end result.  Wages go down until they are at subsistence.",
            "score": 2,
            "replies": [
                {
                    "author": "Internal-Enthusiasm2",
                    "body": "The market is always competing with \"what can I earn by myself without you?\"\nIf landlord / capitalists have full economic closure,  the margin of productivity without a job for a capitalist is below subsistence.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "salenin",
            "body": "wages are set at subsistence level due to the inherent power dynamic between the capitalist class and the working class, where capitalists aim to pay workers only the minimum amount necessary to survive and reproduce their labor force, essentially treating labor as a commodity with a price determined by the cost of living necessities required to maintain the workforce, not the full value of their labor produced.",
            "score": 2,
            "replies": []
        }
    ]
}