{
    "title": "Group discussion",
    "author": "Hasjojo",
    "subreddit": "Marxism",
    "rank": 38,
    "score": 15,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/Marxism/comments/1iutso8/group_discussion/",
    "id": "1iutso8",
    "selftext": "I'm a lifelong learner and I have very few like-minded friends in my surrounding. I want to gather and meet with some people to discuss Marx online, we can jointly decide on the platform for the discussions.\n\nI want to use David Harvey's lectures as the theme for the discussions. \n\nIf anyone interested let me 🫡🫡",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Marxism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CalligrapherOwn4829",
            "body": "I'd happily jump on a Discord. I haven't watched Harvey's lectures on *Capital* (and haven't read *Capital* myself in about twenty years), but I've heard good things. \n\nHave you read Cleaver's *Reading Capital Politically*?\n\nI'm currently finishing *Grundrisse* and, honestly, feel like I took more from it than from *Capital*, but part of that could be the benefit of the intervening decades.",
            "score": 5,
            "replies": [
                {
                    "author": "Hasjojo",
                    "body": "I'm shy to say I haven't read for marx or about classical Marxism except the manifesto 🥲\n\nI mostly read from Yanis, Nancy Fraser and Cornell West. So you can say I'm new to Marx. \n\nIn any case discord is good to me, I have another friend, I'm from Jordan and he's from Egypt and it would be nice to discuss with other people.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "juanperezjolote",
            "body": "100% agree. I move yo a small Town in my country and it's been difficult to find comrades to talk with about Marxism. I'm familiarised with discord and telegram to organise and dialogue with friends about specific topics.\n\nMy problem is that English is not my first language. But I can understand it well, just not good enough speaking to share my ideas fluently.\n\nIf you need any help, I'm here. Saludos! \nProletariados del mundo, uníos!",
            "score": 2,
            "replies": []
        },
        {
            "author": "JohnWilsonWSWS",
            "body": "For \"independent\" Marxists the only point of a discussion group is to decide which party to join and build, lest you fall into the trap of fake-Marxism that Marx himself identified 150 years ago. \n\n>... Just as Marx used to say, commenting on the French \"Marxists\" of the late \\[18\\]70s: **\"All I know is that I am not a Marxist.\"**  \n[Engels, Letters: Marx-Engels Correspondence 1890](https://www.marxists.org/archive/marx/works/1890/letters/90_08_05.htm)",
            "score": 1,
            "replies": [
                {
                    "author": "JohnWilsonWSWS",
                    "body": "Here are some critiques of David Harvey.\n\n* 23 November 2011 [David Harvey and the Occupy Movement - World Socialist Web Site](https://www.wsws.org/en/articles/2011/11/harv-n23.html)\n* 21 July 2018 [David Harvey’s Jacobin interview on Marx’s Capital A promotion of the “life-style” politics of the pseudo-left - World Socialist Web Site](https://www.wsws.org/en/articles/2018/07/21/harv-j21.html)\n\nEXTRACT \n\n>While *Capital* was grounded on a thorough-going scientific analysis of capitalist society, it was not an academic treatise. It was written with the aim of providing the working class, its historical gravedigger, with the theoretical weapons necessary for its overthrow and the transition to a higher socio-economic order, international socialism.\n\n>It is highly significant, therefore, that in Harvey’s interview on *Capital* and its significance, the words “social revolution” and “working class” never appear.\n\n>What then is the essential content of the interview? It is the dressing up in Marxist-sounding terminology of the politics of the middle class pseudo-left, focusing on protests against some of the irrationalities and outrages of the capitalist system, concerned not with its overthrow but “life-style changes.” Its role is to seek to divert those seeking answers away from a real grappling with and understanding of Marx’s masterwork.\n\n>Harvey presents the three volumes of *Capital* as something of a jumble, that Marx was saying “in volume one, I deal with this, in volume two I deal with that and in volume three I deal with something else.”\n\n>Harvey goes on to say that Marx has in mind “the totality of the circulation of capital” but then points to a problem because Marx did not complete volumes two and three (they were edited by Engels from Marx’s drafts) and so they “aren’t as satisfactory as volume one.”\n\n>The upshot of this focus on circulation is twofold. First, it leaves the impression that there is no inherent logic to Marx’s presentation. Second, it downplays the centrality of capitalist production, dissolving it in the process of circulation, a move which, as we shall see, forms a key foundation of Harvey’s political perspective.\n\n... CONTINUED",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JohnWilsonWSWS",
                            "body": "CONTINUED ... \n\n>Contrary to Harvey, Marx is very clear on the logic of the three volumes, which he sets out at the beginning of volume three.\n\n>There he explains that the investigation in volume one concerns the process of capitalist production itself, leaving out the external secondary influences on this process. But as he notes, the analysis does not complete the life cycle of capital and so in volume two he considers how the process of production is supplemented by the process of circulation.\n\n>In volume three the issue is to “discover and present the concrete forms which grow out of the process of capital’s movement considered as a whole.”\n\n>“The configurations of capital, as developed in this volume,” he writes, “thus approach step by step the form in which they appear on the surface of society, in the action of different capitals on one another, i.e., in competition, and in the everyday consciousness of the agents of production themselves.” \\[1\\]\n\n>The materialist method employed by Marx is to ascend from the most abstract forms to the concrete. *Capital*, therefore, begins with the cell-form of the capitalist economy, the commodity, in which the product of human labour—the basis of all society—presents itself in the social form of a product produced for exchange.  \n...  \n[A promotion of the “life-style” politics of the pseudo-left - World Socialist Web Site](https://www.wsws.org/en/articles/2018/07/21/harv-j21.html)\n\nEND",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Hasjojo",
                    "body": "I'm not dogmatic toward anyone, and I hold nothing as sacred, so I approach everything I read or study with a critical mindset.\n\nI don't understand why are so angry, and if you go around giving advice to people in this fashion I think you will not have too many friends.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}