{
    "title": "What if we organized a bank run?",
    "author": "Proof-Reception-908",
    "subreddit": "Marxism",
    "rank": 24,
    "score": 20,
    "upvote_ratio": 0.68,
    "num_comments (reported by reddit)": 25,
    "url": "https://www.reddit.com/r/Marxism/comments/1j0cv08/what_if_we_organized_a_bank_run/",
    "id": "1j0cv08",
    "selftext": "I’ll preface this by saying I have no background in finance so if I’m completely wrong about this then please correct me.\n\nBanks in the US are federally insured by the FDIC for up to $250,000 per depositor. Unless you’ve got over a quarter million sitting in your bank account then all your money is getting reimbursed regardless of what happens to the bank. Hypothetically, if we convinced everyone to pull all their money out on the same day it would primarily hurt the capitalist class. The bank would run out of money before everyone could withdraw their savings but the FDIC claims to reimburse depositors within 2 days of a bank failure. Certainly we could prepare ahead of time to take care of ourselves and provide mutual aid for two days while some people wouldn’t have access to savings.\n\nYou might be thinking “the government would just bail out the banks like in 2008” and you’re probably right. But if we did this regularly for a year, I can’t imagine the US government could get away with multiple bank bailouts in a single year. I think this could have 2 benefits. First, it could be targeted to break up large banks. Second, and more importantly, it could be a powerful demonstration of the fact that life would still go on without the banks. Our labor is the source of value and their system of accounting bares little impact on the lives of people already living paycheck to paycheck.\n\nI’m just riffing but I’m interested to hear y’all’s thoughts.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Marxism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "echtemendel",
            "body": "Marxism is very much based in material analysis, i.e. real things that happen and can happen, not hypotheticals. To be more specific:\n\n\n> Hypothetically, if we convinced everyone to pull all their money out on the same day\n\n\nif you could do that, you would already have, in practice, a working class with incredible class consciousness and mobilization. You wouldn't need to trick the system, you would already be engaged in outright class war, or even better.\n\n\nIn general, no trick, manipulation, funny business or whatever will lead to any long-lasting socialist system. Only real, consistent, honest revolution by the masses can achieve that. And even then it would ne a very long process (over generations), with a lot of setbacks.",
            "score": 81,
            "replies": [
                {
                    "author": "BreadDaddyLenin",
                    "body": "This cold hard truth is often why I feel despair. \n\nSo many apathetic, uneducated or downright fascist/hate filled people, coupled with a ruthless, internationally dominant oligarchy that controls the world infinitely brainwashing people with their power. \n\nThe Soviet Union is gone, and those left fight on but flounder meaninglessly without a strong power to connect the socialist bodies. Children are murdered on livestream, social media and no one cares. And the ruling class wants it that way forever. \n\nit feels like I am in the bad ending. and there’s no way out.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Bitter-Metal494",
                            "body": "Hey, it's mostly in the United States, mexico is pretty to the left, most of LATAM too, the pink wave is not as good as a revolution but it's changing things here in LATAM. Doomerism makes you believe that the change is never coming and that it's worthless to fight, but in reality the leftist ideology is blooming and you can always do something about it , propaganda, courses, support communes and unions.\n\nThe magic of the left is that it doesn't require a megastructure to work, it needs individual actions that turn into communal actions. So as long as there's people believing in the left there's comrades to work with .\n\nOr maybe I'm delusional for living in a country that was ruled by the right and oligarchy for 80 years that got a leftist ideology into all the posible Powers",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "assbootycheeks42069",
                    "body": "I mean, is the point about class war true, though? Because it's one thing for people to be okay with withdrawing money from their own banking account and quite another to convince them to take up arms; in the former, I can see situations where people who aren't even really marxists could get into it. More importantly, revolution is not an overnight process; the violent portion will take months, years, maybe even decades, and in the meantime strategies like this can absolutely supplement armed struggle. \n\nI also don't think OP is necessarily talking about doing this for a bank like Wells Fargo or BoA--if they are, then I agree that this is kind of an absurd hypothetical--and I think there are potential situations where smaller regional banks could be the target of an organized run even in today's America.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lezbthrowaway",
            "body": "The [Bolsheviks](https://en.wikipedia.org/wiki/1907_Tiflis_bank_robbery) did that. But it was more like, Stalin and his comrades would go into the bank with some guns and explosives, and take all the gold (Rubles?), and then sell it to raise funds for news papers and whatnot.\n\nA bank run? We don't have enough capital to do anything meaningful.",
            "score": 15,
            "replies": []
        },
        {
            "author": "JadeHarley0",
            "body": "1) I don't think working class people collectively have enough money in their bank accounts to truly affect the health of the banks.  Big financial institutions are making their money by handling the funds of other capitalists.\n2) this would do absolutely nothing to change the main form that capitalist exploitation takes: the fact that your boss owns the work you produce and can extract surplus labor value from it.\n3) if we can mass mobilize working class people to do something like this, we can also mass mobilize them to do much more effective things like unionize their workforces and/or have a general strike.",
            "score": 6,
            "replies": []
        },
        {
            "author": "OrchidMaleficent5980",
            "body": "This would be market manipulation, a federal crime. You are not allowed to artificially affect the demand for a security.\n\nCharacter count character count Character count character count",
            "score": 7,
            "replies": [
                {
                    "author": "No_Dragonfruit8254",
                    "body": "To be fair, revolution would also be a federal crime and if you have the numbers to do this, just do a normal revolution using one of the historically proven effective methods of revolution.\n\nedit: someone else said the exact same thing I didn’t read",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "SvitlanaLeo",
            "body": "It is necessary to understand that at the present time in society there is objectively a commodity fetishism. Through the commodity-fetishistic lenses, which are put on the eyes of the working class, banks are not perceived at all as something that can be undermined.\n\nAnd this is exactly what we need to do now, that is, tear away from the eyes of the working class, the majority of the population, the lenses of commodity fetishism through Marxist enlightenment.\n\nIf the culture of commodity fetishism is shaken, then the banks will also be shaken.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SvitlanaLeo",
            "body": "Those who are los und ledig have a class interest in undermining capitalism. Not those who have hundreds of thousands of dollars in banks. It is extremely naive to expect this group of people to just go and start collectively undermining the system.\n\nThis is from the same series: what if all the capitalists give ownership of the means of social production to the working class. Yes, if they give it, then Marx is wrong, and the revolutionary dictatorship of the proletariat is not needed. But they won't give it. For the same reason, people with serious deposits will not collectively withdraw money from banks.",
            "score": 2,
            "replies": []
        },
        {
            "author": "deadonthefloor",
            "body": "FIAT neoliberalism in a fractional reserve banking system doesn't have and will never have the funds to make this even a possibility.\n\nThis is by design to prevent exactly what you've said from ever happening again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JTSerotonin",
            "body": "All of you probably have a combined 2 grand lmao. But yeah go ahead. Most rich people stay rich because they own assets, not cash. The only thing that would do is hurt the single moms and low income families that are trying to save every penny they can to put food on the table",
            "score": 1,
            "replies": []
        },
        {
            "author": "rosemaryscrazy",
            "body": "The wealthy keep the majority of their money invested in the stock market. On top of that they also know the FDIC….insure limits…So they probably aren’t losing any money either if that happens. \n\nAlso what about elderly people…..They tend to have worked their entire lives as working class to have over 300k or whatever it is.\n\nJust because some elderly person happens to have 500k in the bank after they sold their house that they worked their whole lives for. While they are in the process transferring it somewhere else….",
            "score": 1,
            "replies": []
        },
        {
            "author": "Requettie",
            "body": "wtf am i reading \n\nsuxnejdnejxnenajfbejdbcFEEFduejxuejehxhxudhensiczFURNITURExhdbehxjsnznxhcjrnejxkdnencjfjabcdefghijklmnopqrstuvwsyznowiknowmyabcsnexttimewontyousingwithme",
            "score": 1,
            "replies": []
        },
        {
            "author": "-OooWWooO-",
            "body": "The government can step in and prevent a bank from failing if there's a run. You'd have to cause a bank run on basically every financial institution at the same time. Most banks are solvent enough where this not really feasible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thebeavs3",
            "body": "A series of bank failures would make life for working people incredibly hard, getting a loan for a car would become harder, forget about owning a house if you can’t pay cash, people who work as tellers and other working class people become jobless. The federal government ends up coming after the organizers for manipulation of a security, the thousands of people you organized the bank run with are blacklisted from using banks to keep their money safe ever again. Finally to top it all of unless you could somehow take down all or most banks in the country before your stopped then your just contributing to further consolidation of the banking industry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "glpm",
            "body": "What's the point?\n\nWhat matters isn't money or banks, but the production of goods. That's the core of capitalist society. A general strike is the most effective way to disrupt capital accumulation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "checkprintquality",
            "body": "There would be no better way to upend the system immediately. I’m open to arguments, but this is a legitimate risk in all but the top 5-7 banks. Even with them there would be significant impact. Basically pulling deposits would fail 99% of banks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "16ozcoffeemug",
            "body": "This is the dumbest post Ive ever seen. Not only would that be extremely illegal, but all the Marxists in the country dont have enough combined wealth to even make a dent.",
            "score": 1,
            "replies": [
                {
                    "author": "Jeffrey_Blepstein",
                    "body": "Since when is legality relevant?\n\nawdkjbhbawlkdjhalkdwjhawlkdjhalkdjhbalkjdhalkwkjdhalwkdjhalwkkdjhaflkdsrhjnglksdjbgfjshbfshebfksehbfshfbsjhfbsehfbwselifbsbtebgtfleshgtliusehlgiuheiguheliughtisaduhgliadsjhg",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_mean72",
            "body": "Bruhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh",
            "score": 1,
            "replies": []
        }
    ]
}