{
    "title": "Hermione and Harry make me uncomfortable as a romantic ship bc their bond is so familial.",
    "author": "CreativeRock483",
    "subreddit": "harrypotter",
    "rank": 8,
    "score": 83,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 140,
    "url": "https://www.reddit.com/r/harrypotter/comments/1heu27q/hermione_and_harry_make_me_uncomfortable_as_a/",
    "id": "1heu27q",
    "selftext": "Ofc this is not a slight against anyone who ships harmione. People are free to ship whatever they want. But I personally feel so odd whenever I see an edit of them in a romantic sense. I always go like 'that's basically his sister. Ew. Whers ron?' lol \n\nI see their bond as strong friendship with zero romance. ",
    "comments": [
        {
            "author": "Arctimon",
            "body": "I mean, that’s what it is.",
            "score": 67,
            "replies": []
        },
        {
            "author": "ThePumpk1nMaster",
            "body": "Well it’s a good thing they’re not romantic…?\n\nThis sub has a real issue with perceiving headcannons as cannon…",
            "score": 51,
            "replies": [
                {
                    "author": "DonJuniorsEmails",
                    "body": "Right? Just because my headcanon is Ron with Viktor Krum doesn't mean I have to complain about it. It just means I misread too far into jealousy issues that may not actually be there",
                    "score": 35,
                    "replies": [
                        {
                            "author": "swiggs313",
                            "body": "I wish everyone took this approach. I’m all for “like what you like” but people need to stop acting like their headcanon is a fact that desperately needs proving instead of them just interpreting things differently than what was written.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AStrayUh",
                    "body": "Yeah, I understand that fanfic is a big thing in the HP community, but it really does seem to bleed into canon for some people to where they can’t remember what’s what. I had someone argue with me that “Wolfstar” is canon. \n\nFor those who aren’t aware, Wolfstar is the theory popularized in a lot of fanfic that Lupin and Sirius were/are in love with each other and in a secret romantic relationship together.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Amazing-Engineer4825",
            "body": "Harry and Hermione are like brother and sister",
            "score": 48,
            "replies": []
        },
        {
            "author": "chiji_23",
            "body": "Well yeah that’s the right feeling because that’s how they’re written, the ship never made sense",
            "score": 19,
            "replies": []
        },
        {
            "author": "BoysenberryLive7386",
            "body": "I agree. There is literally no indication of attraction between them ever. I think it’s because maybe movie actors for Harry and Hermione have a bit of accidental chemistry. But books wise, zip.",
            "score": 10,
            "replies": [
                {
                    "author": "Boanerger",
                    "body": "That's a good distinction. It also helps that book Ron is a significantly more interesting person than film Ron.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "FaithHopePixiedust",
                    "body": "Goblet of Fire ended my potential Harry/Hermione shipping. He basically says that hanging out with her one-on-one is boring. So I avoid Harmony stories but don’t care how others get their jollies. 🤷🏻‍♀️",
                    "score": 7,
                    "replies": [
                        {
                            "author": "BoysenberryLive7386",
                            "body": "Literally he literally prefers Ron over Hermione as a life long companion 😅",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "wonki-carnation_501",
                                    "body": "For realz yet I barely see anyone outright shipping ron/harry when they make most sense",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "FaithHopePixiedust",
                                            "body": "The times I’ve ventured to read slash stories it’s been Ron and Harry. Harry and Draco is another ship that I personally don’t get, but it’s popular so 🤷🏻‍♀️",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "wonki-carnation_501",
                                                    "body": "People really enjoy enemies to lovers ❤️‍🩹",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Logical-Papaya4954",
            "body": "Yea I used to ship them, mostly because I hated Ron and Ginny’s characters and I thought they looked good together (I watched the movies, big mistake I know), but after the books, I know better.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mdx123",
            "body": "Seeing how people like to watch everything step sister/step bro now days i won’t say it is something  not to be expected by the public",
            "score": 13,
            "replies": [
                {
                    "author": "swiggs313",
                    "body": "I can still remember after DH and Harry telling us how he see Hermione like sister, that at least one very popular H/Hr forum started running with a whole  “then incest is best!” thing. \n\nIt was really gross.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Intelligent_Sense_14",
                            "body": "Never venture into the Supernatural fandom ",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "tafkat",
                            "body": "Incest is an anagram for nicest. That's even worse than the anagram for subtext.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Particular_Good_1512",
                            "body": "Pretty sure that was sarcastic, plus the discussions on the HPharmony sub are really intellectual from what I've seen",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "MattCarafelli",
                                    "body": "There's all kinds of active discussion on the pairing. I'm in that sub and I like how the fans of Harmony actually dissect the characters and analyze their relationship. I looked at the Dramione one as well. There's no discussion or at least VERY little of the actual dynamics of their relationship, it's all just fic recommendations.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "CreativeRock483",
                                            "body": "Probably bc they have nothing to discuss from books. Hermione has more interactions with kreacher than she has with Draco. What will they analyse? Lol",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Particular_Good_1512",
                                                    "body": "That's true 😂",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "CreativeRock483",
                                            "body": "Dramione could have been far more interesting than harmione if Draco was not Draco but a completely different person. That's what dramione fanfics do. Turn him into a completely different person. Not a fan of the ship bc i don't like OCs.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "MattCarafelli",
                                                    "body": "Not all of them change Draco. A lot just make Hermione a secret, either half blood or pureblood.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CreativeRock483",
                                                            "body": "Without changing Draco you can't make Hermione fall for him. He is a spineless incompetent selfish brat who is neither clever nor values friendship. \n\nI read some of their fics when I didn't read books and only watched movies. All I saw a blonde Ron lol. Sorry lmao\n\nChanging Hermione is even a bigger squick for me",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "MattCarafelli",
                                                                    "body": "I don't know who should be more insulted by that, Draco or Ron lol!",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CreativeRock483",
                                                                            "body": "Both. Both is good 😆",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MattCarafelli",
                                                                                    "body": "Lol",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Particular_Good_1512",
                                            "body": "You're so right!\nAbout Dramione...that's probably because it has almost no basis in canon, whereas Harmony does to a greater extent",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "MattCarafelli",
                                                    "body": "This is true! But I could still see 'What if...' discussion on how Draco and Hermione could potentially fall in love and have a relationship and the ramifications thereof. But no one does. Which is a shame. Half of the fun of having a ship is talking about how it does or does not, can or can not work.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Particular_Good_1512",
                                                            "body": "Hmm...I personally don't ship them but I see your point",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "MattCarafelli",
                                                                    "body": "Neither do I. But I've read some REALLY good Dramione fics. The stories are so well written and pull you in.\n\nI've also read some good Harmony fics as well, with cute little interactions and good or unique story telling. Although I've yet to read the Big Important Ones for either ( Unlike A Sister, In The Forest of Dean, Manacled).",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Vast_Reflection25",
                                                                            "body": "I just got recommended Unlike A Sister. Got a couple chapters in, and it’s really well written! I really like the style of writing. But I couldn’t keep going. They all have families and lives and kids and marriages and the author made it very clear that Harry and Hermione were going to cheat on Ron and Ginny and j just couldn’t handle that. I need Harmony fics that happen before the whole marriage/kids/careers bit. Considering how close they all are in canon, I just couldn’t see either Harry or Hermione blowing up everyone’s lives with cheating.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ZedisonSamZ",
            "body": "Agreed. There’s a siblingness about their relationship. I could personally never see them together and I think Rowling got it right the first time despite her apparent backtracking. I think it’s better that Harry and Ginny are together. Hermione and Ron had the sort of toxicity that is only solved by admitting they are actually into each other.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Independent_Prior612",
            "body": "Personally I’m not one for shipping people JKR didn’t ship. I’m reaching a point where I wish the fandom would quit looking for things to change, criticize and second guess, and just enjoy the damn story.",
            "score": 4,
            "replies": []
        },
        {
            "author": "swiggs313",
            "body": "Yeah, same. I know people want to argue they’re not sibling like (because apparently there’s only one way to sibling…? Idk), so I’ve started pivoting to them having a very close business partnership. \n\nLike, the pair of them would likely open an incredibly successful business together because they work well together and being that extra something to the equation that enables success. They’re in the trenches working together so much, naturally that close bond develops; they can’t do it without the other person. They need each other.\n\nBut once that task is complete and they step back, they don’t have much in common in terms of what makes them tick; they need something more than what the other can bring—and that something more comes from someone else.  \n\nThey need each other when they go to work; they need someone else when they want to relax and unwind. And that doesn’t diminish the importance of their relationship, but I struggle to see how people jump to romance unless they can’t see past  a blanket “two people are close, they must have some feelings for each other…” without any of the nuance.",
            "score": 4,
            "replies": []
        },
        {
            "author": "annlisters",
            "body": "You’re allowed to view them however you want! Just like other people are allowed to view them differently. This kind of post pointing fingers and trying to appear as though you have the Right Opinion™️ is really pointless",
            "score": 4,
            "replies": []
        },
        {
            "author": "Bad_RabbitS",
            "body": "I feel like the vast majority of Hermione/Harry shippers are people who only watched the movies and people who are very young and don’t realize how amazingly similar Hermione and Ron are",
            "score": 3,
            "replies": [
                {
                    "author": "Particular_Good_1512",
                    "body": "I'm pretty sure that's not true, because there were a LOT of Harmony shippers before the movies were even released, plus on the sub for this ship(HPharmony), almost all the discussions are book based",
                    "score": 15,
                    "replies": [
                        {
                            "author": "CreativeRock483",
                            "body": "I dont think hpharmony is the vast majority of harmione shippers. Lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ClioCalliope",
                    "body": "Nah, it's female fans who use Hermione as a self insert to be shipped with the male character they are attracted to. That's either the hero (Harry), the bad boy (Draco) or the canon love interest (Ron). Or literally any other male character, fanfiction exists for all of them lol.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dreaming0721",
            "body": "Although genetically he's probably furthest from Hermione since it's the pureblood families who are more closely related.",
            "score": 2,
            "replies": [
                {
                    "author": "Particular_Good_1512",
                    "body": "That's so true 😅",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mercfan3",
            "body": "I never saw them that way. His descriptors of her prior to him saying “she’s like a sister” aren’t the way you typically describe a sister. (From the way he spoke about her at the Yule Ball to his constant descriptors of her proximity to him, and how she’s touching him.) \n\nIn fact, I’d argue that the way Ron and Hermione treat each other - the constant bickering - is much closer to how siblings actually treat each other. And that it made for a toxic partnership (which even JK Rowling later admitted too). But I’m not one that finds bickering cute, charming, or romantic…",
            "score": 2,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "I saw them as familial long before Harry called Hermione his sister. It was in book 7 while I was calling them siblings since book 2. Hermione reminds me of molly the way she interacts with him. She knows he is an orphan thus showers him with love, is affectionate with him, hypes him up. She is not herself around Harry. She barely argues or looks for debates bc she knows bc of his abusive upbringing Harry finds those upsetting. \n\nWith Ron Hermione is 100% herself. Her emotions come to surface which are usually guarded otherwise, she is argumentative, wild, passionate, loving, mean all those things with Ron. Their dynamic is just chefs kiss",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Forsaken_Distance777",
                            "body": "You think she's not herself around one of her two best friends she spends all her time with for years? Really?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "CreativeRock483",
                                    "body": "Yes. She is not. She holds herself back with Harry. She walks around eggshells with him. When Harry yells at her she takes everything instead of retaliating. She doesn't even confront Harry about anything. Whenever harry gets angry instead of arguing she backtracks and apologises. She is different around him.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Forsaken_Distance777",
                                            "body": "You're saying their friendship is toxic and she's always hiding who she is to avoid triggering him. That's not friendship or healthy siblings.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CreativeRock483",
                                                    "body": "He is an abused orphan. Ofc she cant be herself around him. Ron is not himself around him either. They both coddle him too much.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mercfan3",
                            "body": "Their dynamic is toxic AF. 😂",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Lindsiria",
                                    "body": "My husband and my relationship must be toxic as fuck then.\n\n\nWe bicker all the time playfully,  like Hermione and Ron. It's just who we are. However, we rarely actually fight bad (the same as Hermione and Ron). ",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "CreativeRock483",
                                    "body": "\"We are chaos wrapped in passion and we never want to escape\"",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "slytherinight",
                    "body": "Couldn't agree more with you. The bickering between Ron and Hermione reminded me of siblings rivalry. Ron always acting like the youngest sibling to her and acting out in defiance of her. Rowling did realise this too and even said in an interview how Harry and Hermione had more chemistry as they grew up but it was too late to steer the characters without disrupting the plot. They were perfect for each other. I grew up with the books as they were coming out and with every re read this is reinforced.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dreaming0721",
                    "body": "THIS!! \nIndividually Ron and Hermione are amazing, but I can't stand the bickering, arguments and fights when they're together. It does remind me of how siblings act, to be very honest. \n\nBut JKR also did base their relationship on her ex husband, which I feel like was a little unfair to Ron and Hermione as characters",
                    "score": 0,
                    "replies": [
                        {
                            "author": "swiggs313",
                            "body": "Ron’s not based on her ex, he’s based on her childhood friend Sean, who she seems to imply she had a crush on and meant a great deal to her. She dedicated CoS to him.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "insertbrackets",
            "body": "Ron and Hermione also read like bickering siblings at times. I think the issue some people have is how underwritten the Harry/Ginny relationship is.",
            "score": 1,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "Lmao nothing about Ron and Hermione make it even remotely similar to siblings. Their dynamic was very very different from normal friends since book 1",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Forsaken_Housing_831",
                    "body": "No way they bicker like an old married couple lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gifted_GardenSnail",
            "body": "Yeah... I'm not against that ship, yet at the same time I find myself avoiding it even if I like the rest of the premise... ",
            "score": 1,
            "replies": []
        },
        {
            "author": "kusaku",
            "body": "What do you think of Ron and Hermione?",
            "score": 1,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "Love them. My harry potter OTP",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thin_Frosting_7334",
            "body": "agreed. just don't tell the wolfstar shippers stuff like this, they're the most obnoxious part of the entire fandom",
            "score": 1,
            "replies": []
        },
        {
            "author": "jakehood47",
            "body": "Yeah well they're not a couple so I dont see what you're worried about",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ilovetogame2",
            "body": "I ship Harry and Expelliarmus. Both seem inseparable from each other.😏",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alternative_Fox_6871",
            "body": "Harry and Ginny makes me even more uncomfortable as a romantic ship bcoz their bond is even more familial . So I'm ok with shipping him with his bestfriend than the girl who literally u saw grow up and thought she is an annoying Lil sister type who had a crush on you",
            "score": 1,
            "replies": [
                {
                    "author": "suverenseverin",
                    "body": "Little sisters usually don't have romantic crushes on their brothers though. The crush makes the relation non-familial.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Alternative_Fox_6871",
                            "body": "I'm talking about Harry's pov🤦",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "suverenseverin",
                                    "body": "From Harry's pov Ginny is a girl with an obvious romantic interest in him, he knows she has a crush from his very first visit to the Burrow and he knows that isn't sisterlike. Ginny's crush defines the relationship as non-familial even if Harry doesn't return those feelings.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Alternative_Fox_6871",
                                            "body": "Ok ur opinions are ur opinions and mine or mine . I hate debating",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CreativeRock483",
                    "body": "Not a huge fan of hinny",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Alternative_Fox_6871",
                            "body": "Tbh every ship in this hp book makes me uncomfortable. Every ship has some ick engrained in it. Jk really doesn't know how to right romantic couples",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "CreativeRock483",
                                    "body": "I love Romione 🤷‍♀️",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Grosradis",
            "body": "I get your point and agree. But who am I to judge, my ship when I was younger was toxic +++.",
            "score": 1,
            "replies": [
                {
                    "author": "Sea_Bank_7603",
                    "body": "now I want to know what that ship was, lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CreativeRock483",
                    "body": "I am okay with toxic ships but harmione feels like incest",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Particular_Good_1512",
                            "body": "Y'all will be okay even with toxic ships but not harmione who had such a good bond?? And then u judge us 😂",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "CreativeRock483",
                                    "body": "Well yes. Toxic ships can be entertaining atleast. Harmione is boring.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Forsaken_Distance777",
                            "body": "It might FEEL like incest to you but it's not.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CreativeRock483",
                                    "body": "That's exactly what I said?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Suspicious-Shape-833",
                            "body": "Well, it's not.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CreativeRock483",
                                    "body": "Doesnt matter. It still feels like that to me.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "CreativeRock483",
                                    "body": "Doesnt matter. It still feels like that to me.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "dreaming0721",
                            "body": "Genetically he's probably furthest from Hermione since it's the pureblood families who are more closely related.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Live_Angle4621",
                                    "body": "Genetically isn’t everything. Otherwise adopted siblings could date ",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MattCarafelli",
                            "body": "Boy do I ever have some bad news for you about Ron and Ginny...",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "CreativeRock483",
                                    "body": "I don't like Ron ginny either.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "MattCarafelli",
                                            "body": "Yeah, but one fic was so good, it got adapted into a major multi part original series that had a big budget Hollywood adaptation. Ever hear of the Mortal Instruments by Cassandra Claire?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SheepH3rder69",
            "body": "Relationship. There, I said it. Why are people absolutely refusing to say/spell out that word in its entirety anymore?",
            "score": -5,
            "replies": [
                {
                    "author": "Sgt-Spliff-",
                    "body": "I mean, ship is a verb in this context. It's slang that means \"to argue two characters in media should end up together romantically\"\n\nSo they're not just shortening \"relationship\" even if that was the origin.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "CrownBestowed",
                    "body": "It’s just an abbreviation. Not that serious.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "st4rscr33m",
                    "body": "Still not as bad as would *of*.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Forsaken_Distance777",
                    "body": "Saying I ship these two and I relationship these two are not the same thing. The second one doesn't make any sense.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "sagegreen56",
                    "body": "Thank you, I was trying to understand what they were talking about.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Forsaken_Distance777",
                            "body": "So you should have googled it",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "YodaDragonVulcan",
            "body": "Agreed. They would not work together. Ron and Hermoine are perfect for each other.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nabongie",
            "body": "It’s familial and platonic but that’s the fun in shipping. You can take something that’s not there and make it there—doesn’t mean it’s canon though. It’s a bit odd for me, as someone who has always enjoyed Romione, but when i see good edits from different shipping fandoms, I appreciate them anyway, because talent is talent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PCN24454",
            "body": "Is familial bad when it comes to a romantic relationship? They aren’t biologically related.\n\nYou say it’s familial because they feel comfortable around each other which is a big reason why they get shipped together in the first place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "20Keller12",
            "body": "I agree with you but when compared to her and Ron, it at least makes more sense than that.",
            "score": -1,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "Her and Ron make the most sense to me. She loves debates and arguments and wants someone to challenge her. Ron isn't afraid to say she is wrong and voices his opinion. Harry bc of his abusive family sees their debates as a sign of toxicity which it is not.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sassynickles",
                            "body": "Except most of their \"debates\" are mean spirited arguing, especially as they get older.  They both have a temper and hate to admit that they're wrong.  Harry has no benchmark for what's a healthy relationship or a toxic one.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CreativeRock483",
                                    "body": "No they aren't. Most of their debates are light hearted debates. Sometimes they are mean spirited but definitely not most. They were teens. They were still growing up. Plus they challenge each other. Harry is the only one who sees their debate as toxic bc of his upbringing",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChloeVuitton_",
            "body": "One could argue that Ron and Hermione's friendship was familial and appeared brotherly/sisterly too. I was never interested in the romantic aspect of the series and as a kid/teenager found all the relationships cringe. :P",
            "score": 0,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "I replied to someone how I view Ron and Hermione. Hermione is never herself around Harry. She is guarded and holds herself back. With Ron she is 100% herself and her emotions are always on the surface.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -2,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "Harry said he loved Hermione like a sister. So I see their bond as familial.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "No-Roof-8693",
                            "body": "He said he saw ginny as a sister too. We know what happened next",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CreativeRock483",
                                    "body": "I am not a fan of that relationship either. I am a romione shipper",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "sassynickles",
                                            "body": "So you're inherently biased",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CreativeRock483",
                                                    "body": "About what?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Sea_Bank_7603",
                                    "body": "not even a best friend. an incredibly close friend, but Harry never clicked with Hermione on a 1:1 basis as he did with Ron. Ron is Harry's best friend; Hermione is his very close friend who he loves as a sister.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "AlarmDry4102",
                                            "body": "Exactly 💯 💯 💯\nAfter all, Ron is the one person he'll miss the most.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Sea_Bank_7603",
                                                    "body": "I didn't know that only children cannot experience sibling-like love because they don't have siblings.\n\n>Harry feels a deep non-romantic love for Hermione\n\nYes, he does, and that's what he meant that he loves her like a sister. Dunno why the \"sister\" thing gets you so riled up, but whatever.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "dreaming0721",
                                            "body": "He and Ron are almost like brothers, they lighten up eachothers mood, they'd do anything for eachother.Harry and Hermione also have a deep connection imo. They understand the other without even using words. There are so many examples in the books, so I'd say he had a 1:1 connection with both R & H, maybe in slightly different ways",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Sea_Bank_7603",
                                                    "body": "I'm not saying they don't, just that they don't click as much as HarryxRon. It's obvious H&H have a really deep connection and love for each other.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "CreativeRock483",
                                    "body": "Yeah that's why I said I personally see them that way.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "Live_Angle4621",
                                    "body": "Harry doesn’t have real family, he can choose how he sees as his found family ",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Particular_Good_1512",
                            "body": "Do you remember the situation under which he said that...? Allso has Hermione ever said that she saw him as a brother?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "suverenseverin",
                                    "body": "Harry was reassuring his best friend about his feelings for Hermione. There is absolutely nothing to suggest Harry isn't truthful about his own feelings here,  he is the POV character so we readers have access to  his thoughts and emotions and we  know when he speaks untruthfully - the text makes it clear to the reader whenever that happens. We also know Harry speaks the truth here because he has never had romantic feelings for Hermione.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Suspicious-Shape-833",
            "body": "I'm sure two only children would have a perfect understanding of what a sibling bond is like, and come on, Harry also thinks of Ginny as a sister in HBP...",
            "score": 0,
            "replies": [
                {
                    "author": "upliftedfrontbutt",
                    "body": "Is that the one where Ginny tries to fuck him and he totally doesn't get it?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "octoberbroccoli",
            "body": "Not true. Leave this alone. Even JK regrets not pairing them together out of her internal rebellion to not succumb to what she thought could be seen as an obvious ‘cliche’ but some stories write themselves through fate- she regrets messing this one up. Good day to you too.",
            "score": -7,
            "replies": [
                {
                    "author": "Particular_Good_1512",
                    "body": "That's true, dunno why the downvotes just for speaking an actual fact...",
                    "score": 5,
                    "replies": [
                        {
                            "author": "CreativeRock483",
                            "body": "The downvotes are bc she didnt say it. She never said she regretted not pairing them or Ron and Hermione were a mistake. It was a quote taken out of context.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Particular_Good_1512",
                                    "body": "\n\n> Rowling explained “I wrote the Hermione/Ron relationship as a form of wish fulfillment. That's how it was conceived, really. For reasons that have very little to do with literature and far more to do with me clinging to the plot as I first imagined it, Hermione ended up with Ron.” She added, “I know, I’m sorry, I can hear the rage and fury it might cause some fans, but if I’m absolutely honest, distance has given me perspective on that. It was a choice I made for very personal reasons, not for reasons of credibility. Am I breaking people’s hearts by saying this? I hope not.”\n\n>In some ways Hermione and Harry are a better fit and I'll tell you something very strange. When I wrote Hallows, I felt this quite strongly when I had Hermione and Harry together in the tent! I hadn't told [Steve] Kloves that and when he wrote the script he felt exactly the same thing at exactly the same point.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "suverenseverin",
                                            "body": "The post you replied to had it right, there is nothing about regret  in that quote?",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "CreativeRock483",
                                            "body": "And Where does it say Harry should have 2ended up with Hermione and she regretted Ron and Hermione?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "The_Kolobok",
                    "body": "JKR never said that she regrets it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "IceCreamIceKween",
            "body": "Hermione and Ron are an odd couple to me honestly. I think their relationship is a bit forced. That's not to say that I think that Hermione and Harry make a better pairing. It's just that I think Hermione & Ron and Harry & Ginny were just forced together to retain a \"happy ending\" where they all have an excuse to stay in each other's lives. Some people settle down with their high school sweethearts, but most don't. It just seemed like JK wanted a way to keep the gang together after they graduated from Hogwarts and marriage seemed like the best way to do so. The romantic build up just isn't there for me and they all seem like couples of convenience.",
            "score": 0,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "I am not a fan of hinny and harmione. Love Romione though. I saw romantic connection since book 2",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dibbiluncan",
            "body": "One of my exes told me his female best friend was “like a sister” to him about a month before they both cheated to be together. Sometimes when people say that, they’re lying to themselves. \n\nHarry and Hermione don’t really act like siblings, so I can see a basis for the shippers. I also agree that Ron and Hermione act more like siblings, and JK herself later admitted they had a toxic relationship as a result. ",
            "score": -1,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "Y'all made up quotes about her to validate whatever you are feeling. She never for once said they had toxic relationship. And I saw them as siblings since book 2, long before harry said he loved Hermione like a sister. Absolutely nothing about Ron and Hermione looks like siblings. Nothing. They had tension since book 1. All enemies to lovers story starts the way Romione did. Even though it's more friends to lovers",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "wolfman3412",
            "body": "It’s better than ron/hermione. God that’s a toxic relationship",
            "score": -2,
            "replies": []
        },
        {
            "author": "Big-Today6819",
            "body": "But his best friend's sister is better? Honestly a paring of book Harry and Hermione had been perfect with a Ron never coming back, also would fit well into our world as some friendship ends and never gets renewed",
            "score": 0,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "Not a fan of hinny. Love Ron and Hermione together",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "13artC",
            "body": "Whereas Harry & his adopted sister Ginny are just kosher? \n\nI'm not here to change your mind. I just find Harry & Hermione to be the least sibling-y out of the trio. Both are sort of adopted by the weasleys. Hermione, less so, but their pairing definitely feels less weird to me.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Bebop_Man",
            "body": "Always thought Harry/Hermione made more sense. I ship them. They cheat on their spouses with each other in my fanfic.",
            "score": -1,
            "replies": [
                {
                    "author": "CreativeRock483",
                    "body": "I love cheating fics bc its thrilling lmao. But ofc with different ships.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}