{
    "title": "LPT: Keeping fresh apples in the refrigerator can keep them fresh for months.",
    "author": "Anadyne",
    "subreddit": "LifeProTips",
    "rank": 18,
    "score": 2954,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 97,
    "url": "https://www.reddit.com/r/LifeProTips/comments/1jc7r2v/lpt_keeping_fresh_apples_in_the_refrigerator_can/",
    "id": "1jc7r2v",
    "selftext": "If you have the room in your refrigerator, apples will keep fresh for months just sitting on a shelf or in a drawer.  I don't keep them in a bag, just set them in there.  Wash them off when you're ready to eat them.  Make sure to check them regularly, and remove any bad ones.  Buying in bulk is a good way to save money, and they will stay fresh for quite a while.\n\n",
    "comments": [
        {
            "author": "keepthetips",
            "body": "### This post has been marked as safe. Upvoting/downvoting this comment will have no effect.\n\n---\n\nHello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nucumber",
            "body": "FUN FACT:  The apples you buy in a grocery store have often been in storage for 6 to 12 months.  Same with oranges",
            "score": 1862,
            "replies": [
                {
                    "author": "dodgythreesome",
                    "body": "I always wondered why they are taste so tasteless here in the uk compared to fresh off the tree back home",
                    "score": 431,
                    "replies": [
                        {
                            "author": "HighlyProteinaceous",
                            "body": "So we switched from buying the bagged oranges (like 5 in a bag) to single oranges. The single oranges taste sooo much better.  Was unsure why until now... Assume maybe stored for less time? ",
                            "score": 163,
                            "replies": []
                        },
                        {
                            "author": "shifty_coder",
                            "body": "Because the ones sold in grocery are bred for size and color, not flavor. It doesn’t really have anything to do with storage time.",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "ThomasPopp",
                                    "body": "That sucks. I wish a grocery store would literally put it down and say our oranges don’t look as orange, but they taste better.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Sponsored-Poster",
                                    "body": "oranges are essentially painted to be more vibrant orange colored",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fuqdisshite",
                    "body": "came here to say it.\n\nwhen i read it it said they average 14 months.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "appendixgallop",
                    "body": "I don't consider apples that have been in controlled atmosphere to be \"fresh\" apples.",
                    "score": 36,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThePepperPopper",
            "body": "The cold apple tastes awesome also.",
            "score": 187,
            "replies": [
                {
                    "author": "DJ_Sk8Nite",
                    "body": "Especially on a boat in the summer sun!",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "goldmine000",
                    "body": "All my fruit (except for bananas) go in the refrigerator. Fruit tastes more like a treat when its cold.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Difficult-Educator-6",
                            "body": "Cold bananas are also good, not as tasty of course but the texture is much better in my opinion.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "madkins007",
            "body": "You can also recreate the old root cellar for apples, potatoes, onions, etc pretty easily with closed paper bags in a cool, dark place, like a corner of the basement.",
            "score": 447,
            "replies": [
                {
                    "author": "Recentstranger",
                    "body": "Reminds of the story of the family that died because of bad potatos in the basement",
                    "score": 194,
                    "replies": [
                        {
                            "author": "Lumpy_Benefit666",
                            "body": "Youre not allowed to do this.\n\nTell us the story.",
                            "score": 135,
                            "replies": [
                                {
                                    "author": "Suicidekiller",
                                    "body": "https://www.huffingtonpost.co.uk/2014/08/14/girl-8-orphaned-after-gas-from-rotting-potatoes-killed-her-entire-family_n_7360976.html",
                                    "score": 154,
                                    "replies": [
                                        {
                                            "author": "Fickle-Republic-3479",
                                            "body": "New fear unlocked",
                                            "score": 44,
                                            "replies": []
                                        },
                                        {
                                            "author": "Recentstranger",
                                            "body": "Thank you kind stranger",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "Suicidekiller",
                                                    "body": "Welcome, was curious and was too impatient to wait for your reply. Sorry",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "dargonmike1",
                                            "body": "Does one not smell the stench of rotting potatoes… holds breath, either gtfo, or quickly dispose of potatoes?? No?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Suicidekiller",
                                                    "body": "¯\\\\\\_(ツ)_/¯ guess not",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "gtfomylawnplease",
                                    "body": "It use to go around via fax at offices. It’s an old news wire story. The grandma passed out in the basement from gasses from her can goods. One by one they went after the last person to pass out until they were all dead.",
                                    "score": 42,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Dookie_boy",
                            "body": "Yo what",
                            "score": 19,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rastaguy",
            "body": "Cold apples are so good. The only way I will eat them.",
            "score": 247,
            "replies": [
                {
                    "author": "caffeine_plz",
                    "body": "Yeah my mom kept apples in the fridge when I growing up, so cold apples are just what I’m used to! They are so good!",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "tropicalhotdogdays",
                    "body": "I'm ashamed to say that it took me nearly 40 years of apple buying before I discovered this.\n\n A game changer for sure.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "MethNotEven0nce",
                    "body": "Bold of you to assume we can afford home.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LimpTeacher0",
            "body": "Wait where does everyone else store their apples?",
            "score": 107,
            "replies": [
                {
                    "author": "Prostock26",
                    "body": "Considering they are generally displayed in the open room temperature at the store, it's fair people maybe not be aware to refrigerate them",
                    "score": 77,
                    "replies": [
                        {
                            "author": "RocketMoped",
                            "body": "Not everyone has gargantuan fridges",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "darthkarja",
                    "body": "In a produce net hanging in my kitchen",
                    "score": 21,
                    "replies": [
                        {
                            "author": "lickitysplithabibi",
                            "body": "Yikes",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "darthkarja",
                                    "body": "For you to say that, I feel like you just aren't eating apples as fast as I am.  They don't have time to go bad with me around",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "lickitysplithabibi",
                                            "body": "No apples are just infinitely better when they’re cold and crisp",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "belizeanheat",
                                    "body": "Yikes what? ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hilton5star",
                    "body": "Fruit bowl on the kitchen counter?",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "cckriss",
            "body": "It’s almost like a refrigerator is used to…. preserve foods",
            "score": 15,
            "replies": []
        },
        {
            "author": "LadyA052",
            "body": "I have discovered Cosmic Crisp apples. OMG they are delicious! I get mine at Sprouts. Don't buy them anywhere else unless they're organic, they have no taste. I'm eating one right now, just out of the fridge.",
            "score": 103,
            "replies": [
                {
                    "author": "k8t13",
                    "body": "cosmic crisp is awesome, wsu is about to release another cultivar (we got a submit names !). they also bred the oxidation gene out of it so if you cut them they won't brown at all. you could cut them the night before and take them in a lunch the next day",
                    "score": 32,
                    "replies": [
                        {
                            "author": "rdcpro",
                            "body": "Go Cougs!",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "BubblebreathDragon",
                            "body": "WOOOOA!! GAME CHANGER!!!",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "LadyA052",
                            "body": "The only things they will be cut with is my teeth.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "carlotta3121",
                    "body": "Here's the post I was hoping to see! I just had part of one tonight, they are so yummy and they were bred to last a long time too.  \n\nI do online grocery pickup at Frys(Kroger), the last few orders have had HUGE apples. I order 2 or 3 individual ones each week because they're so large, they each last me 2-3 days.  One weighed 14.3 ounces, it was crazy good too. \n\nThey're the only apples I'll eat now, they've spoiled me.  And yes, always cold!",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "shawnshine",
                    "body": "They sell them at my Costco and they’re the best!!!",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "reviewmynotes",
                    "body": "Check out Ruby Frost, if you get the chance.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Miss_Pouncealot",
                    "body": "Yes! 🙌 cosmic crisp is so good! Also love a great pink lady",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gunzenator2",
            "body": "I eat an apple a day because they are on the counter and I see them. Too many have died it the back of the fridge. \n\nSidenote: the sell Carmel dip for them that is awesome!",
            "score": 133,
            "replies": [
                {
                    "author": "RexRow",
                    "body": "Store apples in the fridge, but leave just one sitting on the counter. When you pick it up to eat it, replace it with an apple from the fridge.\n\nI should buy apples.",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "nucumber",
                    "body": "Try using apple slices to scoop up vanilla yogurt\n\nDelicious and nutritious!",
                    "score": 25,
                    "replies": [
                        {
                            "author": "gizmo8b",
                            "body": "Mix half plain Greek yogurt and half peanut butter for a filling dip too!",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "zolazaps",
                            "body": "My go to healthy snack is Greek yoghurt, diced green apple, cinnamon, and a little maple syrup. It's not much work and tastes delicious.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sixbone",
                    "body": "caramel",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Kuuhiya",
                    "body": "Also, natural peanut butter with sliced apples tastes like caramel apples.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Im-Old_Gregg",
                    "body": "Keeps the doctor away as well.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "horsetooth_mcgee",
            "body": "My teeth are *shrieking* at the mere thought of biting into a refrigerator-cold apple. (Yes of course I could let them warm up to room temp first, I'm just saying.) Some people love cold apples and I'm like your teeth must be made of titanium",
            "score": 99,
            "replies": [
                {
                    "author": "Anadyne",
                    "body": "I chew ice cream and it drives my family crazy.  🤣",
                    "score": 24,
                    "replies": [
                        {
                            "author": "MyrMyr21",
                            "body": "How else should you eat your ice cream? I don't tend to really like it unless it's nice and firm and chewable. My dad, on the other hand, microwaves his ice cream for a few seconds to make it runny. Heathen behavior.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "TemporaryFed",
                                    "body": "You squish it with your tongue",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "MyrMyr21",
                                            "body": "For some reason I've never been the sort to lick my food, and I think it's because I'm just impatient. It takes too long to lick an ice cream cone, better to take a bite from it",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Squirrel_Apocalypse2",
                                    "body": "Chewing ice cream is the only heathen behavior here😂",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Earthemile",
                    "body": "Seriously. Change your toothpaste, my wife was the same when we met, I introduced her to Sensodyne Toothpaste and the sensitivity was gone on a couple of weeks. She still uses Sensodyne and has no sensitivity 25 years later.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Ichidou",
                    "body": "Sounds like you need to switch toothpaste or brush/floss more.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "horsetooth_mcgee",
                            "body": "It's not the latter, so it must be the former. Otherwise it's just genetic. But cold-sensitive teeth are far from uncommon.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "crespoh69",
                    "body": ">Some people love cold apples and I'm like your teeth must be made of titanium \n\nOr maybe not have any metal content in them at all lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "horsetooth_mcgee",
                            "body": "I don't know about you but I bite an apple with my front teeth. I don't have any metal in my front teeth.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Skinnendelg",
                    "body": "You understand that you can regulate the pressure and depth at which you bite things yes?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "StromboliOctopus",
            "body": "Cabbage lasts long, too. I had one I forgot about for a few months and it was fine.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Swimming-Most-6756",
            "body": "Avocados too, well not months. \nBut let them ripen to your liking on the counter and once ripened store them in the fridge and you can get a solid 7 days or so to use the avocado. \n\nNote once refrigerated it stops ripening so if it’s underripe it won’t ripen much more even if taken back out of the fridge.",
            "score": 4,
            "replies": []
        },
        {
            "author": "nanocurious",
            "body": "Apples off gas and cause other produce to wilt. It's a tradeoff.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ExoticMovie638",
            "body": "Apples will actually last pretty long unrefrigerated so long as they are in a dark place.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Temporary_Jolly",
            "body": "Not true for all varieties, but most will keep longer if refrigerator. There's one variety called Arkansas Black that is said to keep for several months.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jacks-",
            "body": "This goes double for regulation, Cosmic Crisp apples.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tawny_Harpy",
            "body": "Cold apples with peanut butter is the best",
            "score": 2,
            "replies": []
        },
        {
            "author": "MobileDeparture7379",
            "body": "One of my favorite snacks is a little prosciutto wrapped around an apple slice. It’s ridiculously delicious.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Helpful-nothelpful",
            "body": "So, what exactly is the LPT?",
            "score": 5,
            "replies": [
                {
                    "author": "allothernamestaken",
                    "body": "Food lasts longer in the fridge",
                    "score": 18,
                    "replies": [
                        {
                            "author": "frosty_balls",
                            "body": "Next you’re gonna tell me some foods last even longer in the freezer.  Quick, tell OP",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cabridges",
            "body": "I used to keep them on the counter so I’d remember them and because I liked the look. But we started getting little bugs flying around e couldn’t get rid of so in the fridge they went. They last a LOT longer there, I just have to make it a regular thing to grab one.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Salmon--Lover",
            "body": "Oh man, I can’t even agree with this freezer apple life. My fridge is always stuffed with other things, and when I buy apples, I want them to be easy to grab, like right there on the counter. But living in a warm place, I've totally learned that they ripen faster, which I kinda like sometimes 'cause they get juicy. Also, when you leave them out for a bit, and they start to get soft, boom, perfect for pie or smoothies without feeling guilty for not eating them in time. I just never really got behind the idea of having apples in the fridge next to my eggs or milk. Plus, sniffing around at a farmer's market more often to pick what you need makes fruit shopping more fun! Or maybe sticking them in the fridge is just smart grown-up stuff and I’m still living  in snack chaos, LOL.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Schallpattern",
            "body": "The plastic wrappers fruit and veg comes in is for transport only. Remove them immediately and then store in the fridge. They keep fresh for weeks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoastedRhino",
            "body": "How old do you think apples are when you buy them in spring??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Misplaced-psu",
            "body": "Also, a crisp, cold apple in summer is a delicacy from the Gods.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alienhaslanded",
            "body": "I remember having apples in my fridge for like three months and when I took one out to eat it's was totally fine. Very surprising.",
            "score": 1,
            "replies": []
        },
        {
            "author": "seychel_seashell",
            "body": "My current pregnancy cravings are cold peeled apples so I feel SEEN.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DroidLord",
            "body": "Same goes for any other type of fruits, berries or vegetables. If it's something that needs to ripen then I'll keep it on the counter for up to a week and then I'll pop them in the fridge to slow down the ripening process.",
            "score": 1,
            "replies": []
        },
        {
            "author": "liminality-",
            "body": "Damn this is the exact moment I leaned not everybody keeps their apples in the fridge 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaSmurfZ",
            "body": "Keeping anything in the refrigerator will extend shelf time. It's because the cold decreases the propagation rate of germs and bacteria. Germs and bacteria are like all other living organisms. They thrive within a certain temperature range. Too hot, and they die, too cold,  they die.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ViolettaHunter",
            "body": "Will keeping old apples in the refrigerator keep them old for months?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Irishgunner225",
            "body": "No this is amazing! I never knew this. I love apples but was annoyed how much I had to keep buying them because I eat so much! You have changed my life for the better. Thank you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "audible_narrator",
            "body": "But I hate eating cold apples.",
            "score": -1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*",
            "score": 0,
            "replies": []
        },
        {
            "author": "twd000",
            "body": "OP has discovered refrigeration. Welcome to the 19th century",
            "score": -1,
            "replies": []
        }
    ]
}