{
    "title": "LPT: Limit reading/watching the News to 20 minutes a day",
    "author": "K2alta",
    "subreddit": "LifeProTips",
    "rank": 9,
    "score": 807,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 164,
    "url": "https://www.reddit.com/r/LifeProTips/comments/1jdf0ev/lpt_limit_readingwatching_the_news_to_20_minutes/",
    "id": "1jdf0ev",
    "selftext": "I have been in a deep funk since the 2024 election. My anger and rage over the current political climate have affected my relationships, mental health and work. Limiting my news to 20 minutes a day (Never in the morning) has helped. ",
    "comments": [
        {
            "author": "keepthetips",
            "body": "### This post has been marked as safe. Upvoting/downvoting this comment will have no effect.\n\n---\n\nHello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SRV87",
            "body": "There is also a difference between reading/watching news and scrolling social media. And even going directly to “news” outlets ymmv depending on how editorial the content is.\n\nMy gut check is: “is this making me angrier or more informed?”.\n\nIf I’m just getting more worked up and not learning anything new, whatever I’m looking at is probably trash.",
            "score": 109,
            "replies": [
                {
                    "author": "von_sip",
                    "body": "> is this making me angrier or more informed \n\nThe problem is that it’s often both",
                    "score": 46,
                    "replies": [
                        {
                            "author": "SRV87",
                            "body": "Different for everyone for sure. It is, of course, upsetting to learn of bad news. However if news is ALWAYS getting you increasingly worked up then you could be too wrapped up in it. Kinda of like when it feels like your whole life depends on it. \n\nI can tell when my friends are in this state when they can’t hold a level conversation about a news topic. They are instantly angry, don’t consider other perspectives and start citing all kinds of evidence for their view which are usually reels, podcast, tweets, or videos they’ve been consuming on line. They have lost the ability to have an even keel conversation. (You should be able to do this with VERY hard/controversial topics imo). In really bad cases, they start ex-communicating or cutting people out of their lives that don’t parrot the perspective they have worked themselves up over. There are times where that can be warranted but those are pretty extreme and different for everyone. (An example for me might be explicit racism or hate speech)\n\nI get pissed at headlines or articles, but they don’t put me in that type of a state generally. I am mad at what’s happening but I am not like vein in my forehead is bulging mad- if that makes sense.\n\nIf after seeing a tough headline you think of the implications and actions you might take as a result but then move on with your day/life then you are mad at the news but you are not in a state of anger. Which is healthy imo.\n\nIdk if that helps, but just trying to distinguish the difference, for me. It’s kind of like not getting too worked up over it because that’s not gonna help anything anyway. Being angry doesn’t create change, it just deteriorates relationships. If you are that “upset”, channel it into things you can do and do them with grace not vitriol.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "K2alta",
                    "body": "Very true, social media has had a huge negative impact on so many people.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beautiful-Manner-907",
            "body": "I need to limit my news,  but I also need to be informed. I also am minimizing my social media because the stuff is also there and....it's just a lot",
            "score": 13,
            "replies": [
                {
                    "author": "K2alta",
                    "body": "I find social media feeds are so inundated with political stuff it becomes overwhelming.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "IdahoJoel",
            "body": "I hate that my small-town newspaper prints mostly reposts of national headlines. We can get that from anywhere, I want to know what is happening at the library, parks, city council, etc.",
            "score": 24,
            "replies": [
                {
                    "author": "jchapstick",
                    "body": "Local coverage has been decimated \n\nSome foundations are funding local reporting but it’s not enough",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nightcat666",
            "body": "LPT: Ignorance is bliss. /S",
            "score": 199,
            "replies": [
                {
                    "author": "Johnny_Grubbonic",
                    "body": "Frankly and bluntly... yes.\n\nIt's not good to hide from reality, but it's also not good to doomscroll. There has to be a middle ground or else people start giving in to despair.\n\nAs new as the concept is, there is still strong evidence [that it royally fucks us up.](https://www.health.harvard.edu/mind-and-mood/doomscrolling-dangers)\n\nWe don't need to be ignorant, no. But brooding on it isn't any better.",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "Actually-Yo-Momma",
                    "body": "As i get older, the more i change my mindset to this\n\nIm barely scraping by as is… and its not like I’m not helping anyone by deep diving on current ethnic cleansing going on in Congo but it will certainly destroy my mental state",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "msslagathor",
                    "body": "Yo sometimes, in specific circumstances *guestures vaguely at the things* it really is bliss. \n\nI tell people when there’s a Hope-affirming headline I’ll hear about it elsewhere and dance in the streets but no such headline has come up and as such, my personal peace bubble shall remain secured. Whiskey helps.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "GoBeWithYourFamily",
                    "body": " But actually yes. I don’t watch the national news at all, and I’m way happier now. None of it matters. I can’t change it, and no, voting doesn’t change it either.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "inaname38",
                            "body": "I don't really get this take. I get taking breaks and tuning out for ones mental health, but just checking out entirely?\n\nYou're happier now? I mean, good for you I guess. Are you aware that the government is now ignoring court orders and sending hundreds of supposed criminals (but who had no court hearing and we have no idea who these people are) to a prison in El Salvador known for human rights abuses?  Or that the government is targeting legal permanent residents for deportation and bypassing the legal process for revoking green cards because they don't like things they've said?  Or that the president just implied that Biden's pardons aren't valid and the entire January 6th committee should be investigated?\n\nSeems important to know that democracy is in free fall. Or just stick your head in the sand. Seemed to work out for plenty of Germans last century, until it didn't. At least you're happy! 😁",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "GoBeWithYourFamily",
                                    "body": "I did know most of that. \n\nNow let’s pretend I didn’t know that until you just now told me: What am I supposed to do with that information? What can I, a lowly citizen of the United States, do? \n\nIt is better to focus on my own life and to focus on news that can affect me personally. You are welcome to compare me to a citizen of nazi germany if that makes you feel better. I couldn’t care less what you think.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "violetascension",
                                            "body": "You alone can't solve these problems, but you can join groups who are desperate for informed members to take collective action. We have always had power in numbers and state media is constantly working to segregate and isolate us.\n\n\nThat said, being socially engaged is something that requires effort and attention that not everyone can commit to. I struggle with a disability for example, but I have been very active in ways that I am able. Imho, I think we should contribute \"what we can\", even if it just comes down to being a good friend or a responsible citizen. But if you can do more, I think it's a virtue to engage responsibly.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Haunting_Quote2277",
                                                    "body": "Not if there are more important things in life to focus on",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "BurntAzFaq",
                                    "body": "You're so smug about being informed and yet you just rattled off straight fucking propaganda fed to you by people who want to keep you angry. No thanks.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Lynx_Fate",
                                    "body": "Yeah, but the point is you can't change it. I don't really agree with this either but realistically there's nothing an individual can do outside of some Luigi cosplay. So if you aren't willing to do that then checking out makes sense.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "ShadowsBeans_",
                                            "body": "First they came for the socialists, and I did not speak out—because I was not a socialist.\nThen they came for the trade unionists, and I did not speak out—because I was not a trade unionist.\nThen they came for the Jews, and I did not speak out—because I was not a Jew.\nThen they came for me—and there was no one left to speak for me.\n—Martin Niemöller",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Flashy-Read-9417",
                                                    "body": "Exactly. Lol 'I'm not going to worry about it unless it impacts me'. That just screams privilege.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "BurntAzFaq",
                                                    "body": "lol. so wise.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "K2alta",
                            "body": "do you at least watch world news or no?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "4Ozonia",
                                    "body": "No",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GoBeWithYourFamily",
                                    "body": "That’s especially useless, ngl. My day to day life is not impacted by what is going on in Ukraine. People will try to tell you it is, but it really truly isn’t.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "chet___manly",
                                            "body": "I think you'd be surprised how much you're directly impacted by whats going on in Ukraine. \n\nI think you're thinking is flawed because to say you're not directly impacted without looking for evidence if this statement is true, is not different from your thought that if you \"just don't know then it won't matter \".\n\nJust take for example the price of products that are derived from wheat. Ukraine was a major exporter of wheat to the US and other major parts of the world. Now that the supply chain has been impacted the price affected you directly in your everyday life. You just chose to ignore that piece of information because it was convenient. Which is what the problem is, it's much more convenient for short term gain to maintain an uniformed status.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Haunting_Quote2277",
                                                    "body": "What does it change when you pay attention to the war?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "chet___manly",
                                                            "body": "Well if you take a look back in time, when WW2 broke out, a lot of services were cut and rations were introduced including in the US. You probably heard that for example in England there was a chocolate 🍫 ration. The US went through a period of directing all resources to building planes and tanks that there was a canned goods shortage. Other supply lines that were impacted were sugar, coffee, gas, tires, etc.\n\nhttps://www.therationroom.co.uk/british-ration-chocolate-bars-in-world-war-two-a-historical-overview#:~:text=Chocolate%20bars%20were%20also%20an,troops%20on%20the%20front%20lines.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "GoBeWithYourFamily",
                                                                    "body": "Cool. But answer the question: how does awareness help? Having extra knowledge (and thus extra stress) on what’s happening in Ukraine does what for me? WW2 was a slightly bigger deal than the current Ukraine vs Russia\n\nEdit: fixed misspelled word",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "chet___manly",
                                                                            "body": "Well for one, by being informed you can project in advance what industries will specifically be affected and act accordingly. What do I mean. Let's say I'm in the wheat business using the same example as above. I now have to look for a new supplier and doing so months in advance is more beneficial to me that trying to react once it's too late. This is an example in the micro sense, you experience this effect in the macro sense in your every day life.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "nucumber",
                                            "body": "> My day to day life is not impacted by what is going on in Ukraine.\n\nPeople said exactly that while Hitler was annexing swaths of Eastern Europe in the run up to WWII, and how did that turn out?\n\nPutin is doing exactly the same thing - he's publicly announced his ambitions to restore his vision of the Russian Empire (think USSR).  He's already taken Crimea and Odessa by force, and after conquering taking Ukraine he's going after Belarus, Moldova, and very likely eastern Poland and Finland\n\nBUT WAIT, THERE'S MORE.... China is closely watching how the US reacts to Russian aggression, because it has its eye on taking over Taiwan and gaining their state of the art tech industry\n\nWe can stop them now or stop them later.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "GoBeWithYourFamily",
                                                    "body": "By watching the news and stressing yourself about all of this, what has changed? I’m not arguing for total ignorance or apathy, I’m arguing for focusing on things that you as an individual can actually change. Unless you’re a senator, no amount of news watching will save the world.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "chet___manly",
                                                            "body": "What you are describing is inaction. \n\n\"I’m arguing for focusing on things that you as an individual can actually change\"--You in the individual level have the power to enact change. You dont believe you do because for the most part, as Americans you have had the chance to tune out and your lifestyle change would have been minimal. But change takes work, it takes getting out and meeting like minded people such as yourself in order to enact change. The only way to start in the path towards change, you have to start by at minimum being informed about the changing world around you.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Haunting_Quote2277",
                                                    "body": "And how has your support of Ukraine changed the outcome of the war? Is POTUS going to change his mind and start giving Ukraine aid? Also please think from another perspective you're supporting Ukraine/Taiwan because the MSM said so",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Burnett-Aldown",
                                                            "body": "These people parrot every single MSM talking point and then claim they're the resistance. 🤣🤣",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pinkynarftroz",
                    "body": "Bliss for you. But not for the people your inaction affects.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sarahmagoo",
            "body": "I go with 0 and if anything important enough happens I'll come across it anyway",
            "score": 70,
            "replies": [
                {
                    "author": "Mendoza8914",
                    "body": "Full head-in-the-sand probably is better for mental health, but I think *some* engagement with current events is your responsibility as a citizen in a democracy.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "sarahmagoo",
                            "body": "Any political news I read is just depressing shit I have no control over. \n\nAlso I'm not even American so all that American political news is even less relevant to me.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "wovenfabric666",
                                    "body": "Unfortunately I see it differently. The actions of the US administration affects us Europeans a lot.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "K2alta",
                                            "body": "I think every county in the world will be affected in one way or another.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "sarahmagoo",
                                            "body": "I'm not saying it's completely irrelevant, but less relevant than if I was an actual American citizen. \n\nAnd anything that affects my country directly is one of those things I'll come across without looking for it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Anony-mouse420",
                                    "body": ">  American political news is even less relevant \n\nI would argue that it is the opposite. The delay between America implementing something and (in my case) the UK receiving the bat signal is enough time to attend an MPs surgery and imposing upon them the lunacy of the idea to the point where it usually gets delayed till the US civil service decides not to follow along.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GoBeWithYourFamily",
                            "body": "It is not your responsibility. Especially when all media companies are more concerned with fearmongering you into watching them more than they are about delivering quality information.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Fair-Manufacturer456",
                            "body": "Midterms are two years away; how will following the news make someone a good citizen when they have already made up their mind on whether they agree or disagree with government policies?",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "vcr902",
                            "body": "This is becoming less of a democracy every day, besides which: if you're informed, what are you supposed to do with this information? Hopefully, the people that can fix it would already know and do something, though i think they're all too old to care",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "PsychologicalDebts",
                                    "body": "Why should I get educated? I can trust the people in charge have my best interests at heart, right? They'll take care of me when I'm sick and figure out how to budget for retirement, right?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Haunting_Quote2277",
                                            "body": "If you really want to get educated, start with studying the law and/or constitution before reading the news. Most people read the news but have no understanding of how thelaw actually works",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "vcr902",
                                            "body": "I'm thinking educated is different, like with classes and books...although it is kind of interesting that we're living through history right now. Of course, they don't have our best interests at heart: we're becoming a gerontocracy, and the wagons are circling together in common interests, i.e., taking as much money as they can from the people as possible\n\nI'm just saying it's really all depressing as hell",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "PsychologicalDebts",
                                                    "body": "Existence does seem increasingly bleak.\n\nI do think education is a life long journey and before it goes in a text book, it's in the news cycle.\nIt's not dis-valued to have a retrospective outlook but then it is inherently impossible to change anything.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "vcr902",
                                                            "body": "That is all true...all ideas in books usually pop up from somewhere. idk they never talk about bringing back good things like cheap gasoline and groceries lol",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Fair-Manufacturer456",
                                            "body": "You didn’t answer the question. \n\nAssuming someone has the relevant information to come up with a decision on whether they agree or disagree with current government policies, what’s the next logical step in your view?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "PsychologicalDebts",
                                                    "body": "Vote corruption out would be a good first step.\nIs that a difficult concept?",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Fair-Manufacturer456",
                                                            "body": "Midterms are in two years.\n\nAssuming someone has already made up their mind to vote for Democratic candidates in the upcoming midterm elections, how will closely following the news or not following the news at all affect their ability to vote in the midterms two years from now?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "PsychologicalDebts",
                                                                    "body": "How would they know who they should be voting for midterms if they weren't paying attention to the news?\nAre you trying to be daft? Regardless I'm not getting paid to tutor you for skipping civics class. It's really not a difficult concept to think that ignorance and stupidit isn't the goal of society but here we are. Cuts to education and someone on a soap box preaching about how not paying attention helps.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pump-house",
                    "body": "This is my approach. I have a group chat with my buddies who are way more dialed in than I am. If it’s important I’ll hear about it from them. \n\nOutside of that, it’s just doomscrolling. Thanks, but I’ll pass. I already vote in elections, I don’t need to constantly be depressed as well",
                    "score": 2,
                    "replies": [
                        {
                            "author": "K2alta",
                            "body": "I find talking with friends about it is good therapy in a way,",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ScarySherry510",
            "body": "I agree,had to get back into reading books for my own mental health 💗",
            "score": 6,
            "replies": [
                {
                    "author": "K2alta",
                    "body": "Great idea sounds like a healthy way to escape.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "samjjones",
            "body": "5 minutes is enough to know what's going on.\n\n\nGet off social media.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Haunting_Quote2277",
            "body": "Once i turned on custom feeds things are so much better. This sub, for example, rarely makes the top of my homepage because it doesn't usually talk about political things like posts from other subs. Now i just go straight to custom feeds and this sub oftentimes make the top of the list",
            "score": 6,
            "replies": [
                {
                    "author": "K2alta",
                    "body": "Good Idea. I'll give that a try.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Haunting_Quote2277",
                            "body": "i totally agree with not spending more than a certain amount of time per day because a lot of these political news just wants to generate more clicks/views",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ExpletiveDeIeted",
            "body": "You are probably right. But I feel like if I stick my head in the sand then I’m turning a blind eye to what’s happening. And even if it has affected me directly yet, I fear eventually it will and there will be no one to stand up for me.",
            "score": 19,
            "replies": []
        },
        {
            "author": "wawaweewahwe",
            "body": "All televised news is just propaganda. Whether it's Fox or CNN, there's a war going on for your mind.",
            "score": 7,
            "replies": [
                {
                    "author": "stanleyslovechild",
                    "body": "I’m genuinely interested what you consider a trusted news source.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Discobastard",
            "body": "I switched off from news entirely.\n\nLPT: Also leave a sub as soon as politics is posted regularly.\n\nI have left many subs recently :/",
            "score": 3,
            "replies": []
        },
        {
            "author": "jahworld67",
            "body": "I learned that when news became profit centers, much of what they report is anger clickbait.\n\nThe larger more meaningful items will always rise to my awareness without the daily anger infecting my peace of mind.",
            "score": 5,
            "replies": [
                {
                    "author": "Haunting_Quote2277",
                    "body": "Anger clickbait is such an accurate description. A lot of them just want more views",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "inboundmarketingman",
            "body": "What are you doing to solve some of the things that anger you? If nothing, then let go. Why be upset about things you cannot change.",
            "score": 8,
            "replies": [
                {
                    "author": "K2alta",
                    "body": "Well, when your county is falling apart and its democracy is getting stripped away, it's not that easy.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "defwad7",
                            "body": "Sure, doing nothing is easier than doing something. I think OP was trying to lead you to the idea that, instead of becoming angry and frozen by only reading the news, you can go out and make changes locally to help the situation, and to help your emotions and outlook.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "inboundmarketingman",
                            "body": "When was the last local election you voted in?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BurntAzFaq",
            "body": "You're on the right track. Don't take it so seriously. You'll get much more satisfaction if you focus on daily life and enjoy the everyday good moments that happen. Often forgotten or not noticed by people obsessed with national news.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CrisuKomie",
            "body": "The thing I read one day that helped me… there are millions of people fighting the fight…. If you need to step back for a while… another will step up to fill the gap. Take care of your mental health. Take care of your physical health. When you’re ready… get back in the fight.",
            "score": 3,
            "replies": [
                {
                    "author": "K2alta",
                    "body": "Thanks for the positive post, friend!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "fuddykrueger",
            "body": "I disagree wholeheartedly. Under these circumstances, it’s time we all should be READING THE NEWS (from all different sources) and doing way more than that.",
            "score": 6,
            "replies": [
                {
                    "author": "K2alta",
                    "body": "100% agreed. We just need to take time for self-care and realize when it's impacting the people around you,",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "sxales",
                    "body": "The problem, as I see it, is that most of \"THE NEWS\" is editorial and sensationalized engagement farming. Having cable news on all day does not make you more informed. Doom-scrolling social media does not make you more informed. We live in an era where people are so inundated with information that we have seemingly lost the ability to rank the importance of that information. \n\nAnd don't get me started on the sports-ification of politics.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "onewander",
                    "body": "I don't think you need to read the news regularly or doomscroll to do something.   \n  \nI think consuming a lot of info and worrying gives people the illusion of doing something, when in reality all they are doing is making themselves more stressed, disfunctional, and ineffective.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lopsided_Platypus_51",
            "body": "What’s frustrating is that the political discourse is seeping into everything. \n\nI’d love to bury my head in the sand, but I see it on every social media platform, it sometimes makes its way into ESPN. I tried buying jock itch cream recently and one review gave it 2 stars and said “Only liberals would like this cream.”\n\nLike at this point, I might give up and join the Amish",
            "score": 5,
            "replies": [
                {
                    "author": "K2alta",
                    "body": "I feel you man. Don't forget to take care of number 1.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Plisnak",
            "body": "Just cut that stuff out entirely.\n\nI don't need even the 20 minutes of negative experiences.",
            "score": 6,
            "replies": [
                {
                    "author": "mtfw",
                    "body": "I'd encourage you to find a podcast or something to get weekly or monthly information. News is very stressful and we don't need it in our lives daily, but there's some shit going down that everyone should be aware of imo. ",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Plisnak",
                            "body": "If it's important enough then I'll get informed one way or another, no need to actively seek it out",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "stanleyslovechild",
                                    "body": "This was an interesting study about “news finds me” if you want to read.   \n\nhttps://www.psypost.org/news-finds-me-study-identifies-a-widespread-phenomenon-linked-to-fake-news-susceptibility/#google_vignette",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Plisnak",
                                            "body": "The study assumes one consumes news offered, not that they actively avoid all news. Most people are definitely susceptible to fake news because they let others choose the news for them, or algorithms.\n\nBut you can also just disregard every piece of incoming information and only research what and when necessary. I for example don't keep up with the world in any way other than through my own research on topics that are precisely in my interest.\n\nSuch approach is somewhat difficult to learn and in many cases quite impractical, but it brings an immense peace of mind.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "K2alta",
                    "body": "How can I turn a blind eye when my county is losing its democracy",
                    "score": -4,
                    "replies": [
                        {
                            "author": "onewander",
                            "body": "As someone who is very concerned about this country, used to consume a lot of news, and now consumes 0: \n\nI used to confuse reading and worrying about things with actually doing something. I finally realized that me \"staying informed\" (or as I think about it now, letting news orgs and social media platforms monetize my attention) does not change anything. It's not like I still need help deciding who to vote for or what I believe about core issues. \n\nI think my energy is much better spent picking one cause or issue I want to dedicate time toward, and then spending some time on it each week. \n\nOliver Burkmann's newsletter The Imperfectionist has also helped me tremendously, especially the ones he sent in the immediate aftermath of the election. Happy to send them to you if you like.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "BurntAzFaq",
                            "body": "Maybe start with not being hyperbolic.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Made_Human",
                            "body": "We’re in an age of evil that we’ll unfortunately be stuck in for at least the next two years, but probably longer because I just don’t see Democrats getting enough control to stop Trump in midterms. \n\nI won’t say we need to ignore it but hearing about it every day isn’t healthy. It’s sickening watching a portion of the country cheer on a criminal scumbag while he works to enrich himself and his billionaire minions but me knowing every detail at all times won’t change it.\n\nI’ll definitely stay informed but I can’t stomach watching the news every day",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "neverincompliance",
            "body": "have you found any news source that isn't politically biased?",
            "score": 2,
            "replies": [
                {
                    "author": "K2alta",
                    "body": "Ground News is decent. It aggregates from both left and right news sources.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "neverincompliance",
                            "body": "thank you!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "shiitakebukkake",
            "body": "How when all of our rights, protections, and any sort of program you can think of is washed away right in front of our eyes? It's a fucking nightmare and no one can or will do anything about it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Personal_Poet5720",
            "body": "Yeah my friend watches the news 24/7 and sometimes I limit conversations with him because it just makes him angry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TucsonTank",
            "body": "I support this 100% I quit most social media for the same negative reasons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dumptruckulent",
            "body": "I turn on bbc news for my dogs when they’re alone in the house. Are they cooked?",
            "score": 1,
            "replies": []
        },
        {
            "author": "thecamzone",
            "body": "Just turn off the news entirely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KatherineCreates",
            "body": "As someone that rarely follows politics, I wish people around me would do this . \n\nSo happy/content mood wouldn't be ruined by people's doom and gloom political discussions and comments.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sgator87",
            "body": "Sometimes, you need to do this to other people too. Whenever I travel back home for the holidays, I enforce a hard limit on time spent watching the news on TV on my parents. Otherwise the day just becomes a total rant fest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Understanding4968",
            "body": "Thank you for this tip",
            "score": 1,
            "replies": []
        },
        {
            "author": "Koolest_Kat",
            "body": "Limiting Doom Scrolling is a LPT.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bennytehcat",
            "body": "It's amazing how, news networks must have breaking \"news\" every 30 minutes for 24 hours. Whereas PBS News Hour is ....one hour, all topics discussed, just the facts, no opinions or arguing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VintageBaguette",
            "body": "I haven’t watched the news since like bush’s first term - there’s no point. Traffic is gonna traffic, the weather is gonna weather, sports scores can be looked up. \n\nA friend of mine was rambling off about Vance a few weeks back and i had to ask her who tf she was talking about. Apparently he’s the vp 🤷🏼‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoubleNaught_Spy",
            "body": "Good idea. For years, I've always looked at Drudge Report first thing every morning, because it's a good news aggregator, pulling stories from dozens of different media outlets. \n\nBut since the last election, there are some days when i can't bring myself to even check the site. But on the flip side, some days I am pleasantly surprised. 🤷‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Burnett-Aldown",
            "body": "A bunch of y'all need to recite the serenity prayer like... 10 times a day. Lol. Control freaks with mental health disorders.",
            "score": 1,
            "replies": []
        },
        {
            "author": "azkeel-smart",
            "body": "I don't care for any news other than from my community and local area.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cr3s3ndO",
            "body": "You guys are reading/watching the news?",
            "score": 1,
            "replies": []
        },
        {
            "author": "KryanSA",
            "body": "I top out at max 10 minutes of headlines per day. More than that just gets me down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jay4523",
            "body": "Fuck that. GET ANGRY. \n\nAlmost nothing from the past 2 months has been acceptable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fruit_254",
            "body": "There is an essay by Rolf Dobelli in which he lists 15 reasons for why we shouldn't consume any news at all (although I though some reasons overlap):\n\n    https://gwern.net/doc/culture/2010-dobelli.pdf\n\n\nIt can basically be summarized as: **News is to the mind what sugar is to the body** . He argues that instead of consuming news, we should read books and magazines that actually explain the world and are well-researched (Nature, Atlantic Monthly...) and at most read the weekly summary page of The Economist to stay up-to-date.\n\nThe essay is 11 pages, and if you think that's too long to read and you can't focus on such a long text, then you've probably consumed too much news ;)  (news being short, easily-digestable articles and clips)\n\nThen there's also this article by Mark Manson (author of The Subtle Art of not giving a F*ck) on why you should quit the news:\n\n    https://markmanson.net/why-you-should-quit-the-news\n\nHe recommends to limit yourself to publications like *The Economist* , *Financial Times* , and *Foreign Policy* , because these don’t give a shit if their articles are fun or not. The main point of his article is: **You want your news to be a little bit dull. If you’re getting excited or worked up reading something, chances are you’re being taken for a ride.**\n\n\nAnd finally, there is another article by Mark Manson that's related to this, about the Outrage Cycle:\n\n    https://markmanson.net/the-life-cycle-of-outrage",
            "score": 1,
            "replies": []
        },
        {
            "author": "DingusMacLeod",
            "body": "I think you are on to something with \"never in the morning\". I'm going to try it. Nothing but porn until after dinner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "maxiderm",
            "body": "Sounds like a personal problem. I watch the news and I don't like what's going on either. But I'm happy, and everything's great.\n\nLPT for you OP: get therapy and calm the F down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MidDayGamer",
            "body": "Been doing this for awhile.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HedonicElench",
            "body": "Or less. Most news is stuff that most people really don't need to know. A train derailed, a senator or prime minister said something idiotic, a team won a game-- so what? You're not going to change it, most of it won't affect you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NemoNoones",
            "body": "We still watch the news? I’d only ever check locals news MAYBE. Better to just focus on your thing and your immediate surroundings vs be transported mentally to another state or country while ignoring your immediate responsibilities.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TMoney67",
            "body": "That's good. The bad news is it's going to be a seriously miserable 20 minutes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lostboy005",
            "body": "This is not a LPT and an ignorant post",
            "score": 1,
            "replies": []
        },
        {
            "author": "JedUsedToSkate",
            "body": "Does anyone try reading news from a source that is non biased?! Im tired of people falling for blatant lies conjured by either side.. last week, it was Trump is derailing medicaid/medicare/social security etc... \nWATCH OR READ NEWS FROM A NONBIASED SOURCE FOR CRYING OUTLOUD",
            "score": 1,
            "replies": []
        },
        {
            "author": "4Ozonia",
            "body": "We watch very little news on tv or streaming. I will read the main things maybe twice a day for 10 minutes, never near bedtime. I can sleep at night.",
            "score": 1,
            "replies": [
                {
                    "author": "K2alta",
                    "body": "Good tip.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dan7ebg",
            "body": "I'll do you 1 better - focus entirely on your life and the problems you can influence. I stopped reading news outside of the industries I care about after COVID. Best decision of my life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hotchi_Motchi",
            "body": "I'm a social studies teacher. It's my job to be aware of current events. I don't have the luxury of burying my head in the sand and hoping it all goes away.",
            "score": 1,
            "replies": [
                {
                    "author": "Rocko9999",
                    "body": "So what sources do you use?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vonyyxx",
            "body": "Or 0. If it is super important you’ll learn about it some way",
            "score": 0,
            "replies": []
        },
        {
            "author": "lespaulstrat2",
            "body": "So your solution to your anger and rage is to be uninformed? You know that is how we ended up in this mess, right?\n\nWe have raised generations who only care about themselves and their happiness and fuck the rest of the world.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BatdadsStupidBrother",
            "body": "I've been off the stuff since Obama's birth certificate was in question. I hate the world we live in.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ledow",
            "body": "I just stopped.  It's easier.  And you find out anything you want to know regardless.",
            "score": 0,
            "replies": []
        },
        {
            "author": "King_Artis",
            "body": "I simply don't read or watch the news anymore",
            "score": 0,
            "replies": []
        },
        {
            "author": "one_is_enough",
            "body": "I now stick to AP World News.   They are bipartisan (yeah, I know that the lunatics on either end of the spectrum would not agree) so never has the rage-bait that both Fox and MSNBC specialize in.   And by going directly to World News, you avoid most of the squabbling in the U.S. unless it spills out to get the attention of the rest of the world.",
            "score": 0,
            "replies": []
        },
        {
            "author": "SilverLose",
            "body": "A generation before us they fought on the beaches for our freedom and now we can’t even stomach reading the news for more than 20 damn minutes. Maybe we don’t deserve to survive as a species.\n\nEdit: mm yes please dv me you weak wussies",
            "score": -8,
            "replies": [
                {
                    "author": "onewander",
                    "body": "What do you feel that consuming news regularly accomplishes?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "SilverLose",
                            "body": "You stay informed and remember that this is not normal. You can start planning.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "neonlights326",
                    "body": "Don't condemn an entire species just because Americans are stupid.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "SilverLose",
                            "body": "Fair enough, but if we’re just going to repeat history over and over than maybe I will",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fuck-my-drag-right",
            "body": "I’ll go out and vote but otherwise it’s gay shit or food content for me. I don’t need Billionaires telling me there version of the truth.",
            "score": -1,
            "replies": []
        }
    ]
}