{
    "title": "meirl",
    "author": "crowkingg",
    "subreddit": "meirl",
    "rank": 13,
    "score": 11525,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 236,
    "url": "https://i.redd.it/e6qmqh8mmcpe1.jpeg",
    "id": "1jdtbwk",
    "selftext": "",
    "comments": [
        {
            "author": "ZWiloh",
            "body": "When we put my last dog down, he was so excited to go for a car ride. He couldn't even walk an hour prior, but he wagged his tail so hard to go for a ride with his daddy. That fact kills me to this day. He would've died any day though, he had cancer everywhere and was bleeding into his abdomen. Miss you, Foggy",
            "score": 3254,
            "replies": [
                {
                    "author": "mijikui",
                    "body": "Our family dog did the same thing last year when he was taken to be put down. Wasn't eating and barely drinking any water for weeks, could hardly walk and wasn't breathing well. He hardly had any energy but when my mom finally put him in the car to take him to the vet, he perked right up and seemed quite excited to be going on a ride.",
                    "score": 540,
                    "replies": [
                        {
                            "author": "Whaty0urname",
                            "body": "We are planning to have an in-home euthanization when the time comes but I know that when the people come in the door our dog will be so excited to see them. \n\nLiterally being excited to meet the Grim Reaper. I'm so torn up thinking about it and it's years off.",
                            "score": 90,
                            "replies": [
                                {
                                    "author": "0verlordSurgeus",
                                    "body": "He'll go happy though, yknow?  Surrounded by new friends and people who love him.\n\nBest wishes, I'm tearing up about it too reading your post.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "thatguy9545",
                                    "body": "It’s the best money you can spend on your family.  If it’s anything like the people we used they’re so kind and gentle to everyone that it really softened the experience.  Our little guy ate an absolute feast, then laid in the sun and got rubs from my wife and I while he gently slipped away.  \n\nGlad you’re doing your dog that favor.\n\nAlright, time to stop crying.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "thatguy9545",
                                    "body": "It’s the best money you can spend on your family.  If it’s anything like the people we used they’re so kind and gentle to everyone that it really softened the experience.  Our little guy ate an absolute feast, then laid in the sun and got rubs from my wife and I while he gently slipped away.  \n\nGlad you’re doing your dog that favor.\n\nAlright, time to stop crying.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "newSew",
                    "body": "Medical staff knows that, when someone is on the verge to die, their body might have suddently a sort of energy push: lost memories come back, patients start to talk again, etc.; it's heartbreakibg for the families, who think their beloved one is getting healthier, but still pass away a little after that energy push.\nI'm glad your dog had that energy push that made him happy in his last moments.",
                    "score": 751,
                    "replies": [
                        {
                            "author": "thegreatreads",
                            "body": "Yep, \"the surge\" or \"terminal lucidity\" is very common. Many families get a false sense of hope and often become very confused. It's a beautiful but fleeting moment of connection that can make the final goodbyes even more painful. It seems humans share that connection with many other animals.",
                            "score": 146,
                            "replies": [
                                {
                                    "author": "ffxivfanboi",
                                    "body": "Just reminds me of my mum who passed in her early 60s to cancer that was found too late and metastasized. I was only 27 or so at the time. I lived 3 hours away and didn’t have the financial means to take a lot of time off of work, so I was making trips frequently to come out and see her while my older sisters flew in from Cali to stay weeks here with her and my dad.\n\nI was her only son out of four girls, and everyone kept texting me about how she couldn’t wait to “see her baby boy” again and she really would always perk up a bit and seem a bit brighter and more lucid for a few hours after I made it over. Even on the day that she passed there was still a small burst of energy where she briefly woke up and spoke to all of us in the room and then me directly before taking that final sleep.\n\nCancer is such a bitch.",
                                    "score": 44,
                                    "replies": [
                                        {
                                            "author": "No-Trash-2033",
                                            "body": "My dad was diagnosed with pulmonary fibrosis at age 76. He was a person with active outdoor life. The diagnosis was at the last stage. His lungs had become very hard and it was very difficult to breathe. He was on ventilator for one week . The day before he died we thought he would make it, he had some aura in him. All I can say is he was in peace.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Haunting_Lime308",
                                            "body": "It's a pretty common phenomenon that people who are terminally ill will seem to become \"better\" right before they die. People will seem more lucid and energetic than they had been for weeks or months. Then usually within a day or 2 they'll rapidly become worse and pass. Doctors aren't exactly sure why it happens.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Bollo9799",
                                                    "body": "I remember reading that some belive it's because the body starts shutting down less necessary functions and is able to put more of the limited energy it has left to the core functions. Not sure if that's ever been verified but it does make sense to me",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "babyfacereaper",
                                    "body": "That happened with my great grandma , she was lucid and talkative, in really good spirits. Got to say goodbye to everyone with bright eyes, she passed the next day.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AccomplishedNail3085",
                    "body": "I let one of my really old cats walk around outside the day she was put down. It had been 5 years since i had seen her walk around like that",
                    "score": 67,
                    "replies": [
                        {
                            "author": "Crochitting",
                            "body": "My cat wasn’t moving much at all in her last days but she managed to get up and walk to me on her very last day. I wish I’d held her longer that day.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "AccomplishedNail3085",
                                    "body": "I had to work the day she was put down",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Crochitting",
                                            "body": "Oh that’s awful, I’m so sorry. 😞",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cbraun1523",
                    "body": "I had a similar experience. My Weiner dog lost the ability to use her hind legs. We let it go for a couple days to see if maybe she just pulled something. It wasn't getting better so we decided if she didn't get better, we may put her down. She's 17. She's got huge fatty tumors. She was overweight. All that jazz. Well she didn't get better. So we decided to go the next day. Well when I woke up on the day I couldn't find her. I searched everywhere. Turns out she forced herself outside just to experience the fresh air. When she saw me she worked as hard as she could to pull herself up the ramp. We put her down. And I still hate myself to this day. Maybe I should have given her longer. She clearly wanted to live as she tried so hard to get outside. \n\nI hope it's what was best for her. But I still cry when I think about it.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "IAmReborn11111",
                    "body": "[Great read, sad read](https://www.espn.com/espn/page2/story?page=simmons/090122)",
                    "score": 25,
                    "replies": [
                        {
                            "author": "tyronicality",
                            "body": "Bill Simmons …… god damn. He was such a great writer.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "IAmReborn11111",
                                    "body": "It's a shame that podcasts are the most popular medium now, writing was his best skill",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "tyronicality",
                                            "body": "I remember him addressing it a few years ago after his last book which was pretty great. That he doesn’t have it anymore. \n\nBut boy, he could write.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "leaderoftheKYLEs",
                    "body": "This hits hard. My girl was the same way. She declined pretty quickly, and it was obvious something was wrong. The vet suspected cancer. We scheduled the appointment that I was dreading, two weeks out. I spent those 2 weeks helping her to the bathroom and trying to make her comfortable. However, on appointment day, she was a happy dog. She was wagging her nubby tail and walked herself into the vets office. Being with her for her last breath was one of the most gut wrenching things I've ever had to do. RIP Belle. RIP Foggy.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ZWiloh",
                            "body": "I feel really bad that I couldn't be there for Foggy's. I haven't been able to be there for either of my dogs at their last. I just couldn't handle it, didn't have the heart. But before he went to the vet for the last time, I sat on the floor with him for an hour. I pet him and cried and hugged him. Then I walked him for the last time and at one point, he just stopped moving. We had to carry him inside. It reminded me of the times when he got away as a puppy and I had to chase after him and carry him home. \n\nWhat gets me is that he declined so fast. In early December we took him on a road trip to Florida. He was fine. Then a week after we returned, he started coughing. We didn't really think much of it for a few weeks. We laughed, we were like 'buddy, you okay?' Then we took him to the vet and they said it his lungs were not in good shape. Either it was cancer, a lot of it, or a fungal infection. But treating it like a fungal infection if it wasn't would have killed him. We put him down at the end of February. He was only four years old.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jpopimpin777",
                    "body": "Blessings to Foggy and good for you. Nobody wants to put their beloved pet down but it eventually becomes a case of considering how badly they're suffering now vs how badly you'll suffer after they go. I think everyone should have that realization moment and make the right choice for their beloved companion.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "IceNein",
                    "body": "Super sad, but it is *good* that they’re happy in their final moments.  It’s not for them to understand or cope with, that’s for us.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ValegrisIsJaded",
                    "body": "Fuck, now im depressed",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SgtDoakesSurprise",
                    "body": "Foggy…now my eyes are foggy 😭",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "kolosmenus",
                    "body": "Our dog had a collar made of tiny chainlinks, so it was very audible whenever you touched it. \n\nWhen he was being put down (the vet already injected him) my mom picked up the collar. He tried to get up from the table and go to her. Vet said it was the first time in his life he saw anything like that.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "John_EldenRing51",
            "body": "Nah, if your dog is suffering it’s time to go especially at that age.",
            "score": 3431,
            "replies": [
                {
                    "author": "KennyMoose32",
                    "body": "It’s all about quality of life. We can all learn from Dwight Shrute.\n\nIf you see an animal that doesn’t have the ability to have any quality of life it’s your responsibility to do the right thing. Just skip the freezer, imo…..\n\nIt’s hard. I know.",
                    "score": 1197,
                    "replies": [
                        {
                            "author": "m00nf1r3",
                            "body": "My dog still licked my face and would half-heartedly wag his tail when I came into the room, but you could tell he was miserable still. We put him down in September and I miss him with all my heart, but I don't regret what I did for a moment.",
                            "score": 606,
                            "replies": [
                                {
                                    "author": "_who-the-fuck-knows_",
                                    "body": "100% when I put my girl down (years ago now) she started getting a thumping in her chest when she breathed one night. Was happy as fuck up until that moment. And she gave me that look like \"I really fucking love you man but I'm really uncomfortable, can I go now?\"  Prolonging a life that is constant suffering is just selfish. Hardest thing I've done in my life I cried and stayed up with her all night before I did what had to be done. \n\nNow my new puppy is wearing her collar and was told it belonged to someone very special.",
                                    "score": 455,
                                    "replies": [
                                        {
                                            "author": "Barn_Licker",
                                            "body": "\"Prolonging a life that is constant suffering is selfish\" us also accurate when it comes to older people. A lot of old people would be fine with letting go but the family clings on to them but it actually makes them suffer",
                                            "score": 157,
                                            "replies": [
                                                {
                                                    "author": "Insane_Unicorn",
                                                    "body": "Assisted suicide is also illegal in most parts of the world so even we wanted, we couldn't do it for them",
                                                    "score": 67,
                                                    "replies": [
                                                        {
                                                            "author": "Deerz_club",
                                                            "body": "If theres natural causes like heart attacks pretty sure you can choose not to get saved",
                                                            "score": 16,
                                                            "replies": [
                                                                {
                                                                    "author": "Insane_Unicorn",
                                                                    "body": "Yes but if you are \"just\" suffering there is nothing you can (legally) do",
                                                                    "score": 20,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deerz_club",
                                                                            "body": "Can't you just go to country where it's legal and get it done?",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "jwismer",
                                                                                    "body": "That costs a lot of money that I'm sure suffering people don't have",
                                                                                    "score": 18,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "SlowHandEasyTouch",
                                                            "body": "Religion, ladies and gentlemen.\n\n“I’m on a diet so you can’t have that donut.”",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "maymunziki",
                                                                    "body": "İts not just because of religion we just dont let people to suicide or save them from it when we can   \nİts stupid",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SlowHandEasyTouch",
                                                                            "body": "Religious ideology doesn’t do well with nuance.  If “gOd sAyS nO” is your position, then there isn’t any distinction between an angsty teen wanting to end it all over a breakup and a cancer-riddled adult in unceasing pain.  Decent people with empathy are equipped to differentiate the two.  Bible-thumping zealots aren’t.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "mfranko88",
                                                                    "body": "There are valid reasons for this outside of religious beliefs.\n\nI find it hard to wrangle with the complications and conflict of interest. The people who are most suitable to come to a doctor for assisted suicide are often times the people that have financial interests in the death of that elder.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SlowHandEasyTouch",
                                                                            "body": "Agree, but all those valid reasons can be debated by reasonable people of goodwill, to forge a compromise and a way forward.\n\nReligion is generally not amenable to such a process.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Barn_Licker",
                                                            "body": "Thats true",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Midnight2012",
                                                            "body": "We call it hospice.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Karmek",
                                                            "body": "I've heard about people overriding Do Not Resuscitate orders for their parents.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "m00nf1r3",
                                                    "body": "My dad wanted to die for a long time before he actually did, and then when he finally did, it was a pretty unfortunate way to go. Wish he'd just passed in his sleep or something.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Barn_Licker",
                                                            "body": "I dont mean to seem rude, but wouldnt it have been better if he were able to get euthanized and pass away more pleasantly instead of the unfortunste way he did as you described?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "weeone",
                                            "body": "Your last sentence brought a tear to my eye. I had to make the toughest decision of my life this past December with my soul cat. It still hurts everyday. 💔",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Glittering-Habit-902",
                                            "body": "\"Can I go now.\" Is just peak cat behavior XDDDD",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "m44ever",
                            "body": "its crazy that this somehow doesn't apply to humans",
                            "score": 77,
                            "replies": [
                                {
                                    "author": "Gussie-Ascendent",
                                    "body": "illegal even in a ton if not most places. Can be begging to die and they'd force you to hang around",
                                    "score": 42,
                                    "replies": []
                                },
                                {
                                    "author": "stahpstaring",
                                    "body": "Friends of ours have a 83 year old mother who did everything in her life she could; had kids, took care of everyone , built a great life.\n\nNow she’s sick and wants out.. everyone is at peace with it. Including herself. \n\nBut doctors aren’t and she’s not allowed to leave. She has to suffer the rest of her time. Because someone who doesn’t even know her thinks “she’s still fine”.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "Dirk-Killington",
                                            "body": "Its really not that hard to assist a suicide at home. And nobody does autopsies on 80+ year olds who die at home. ",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "khavii",
                                                    "body": "Hospice usually gives you the tools to help as well. Morphine and opiates are given in large quantities andany cases. You are generally told to give it to them as they request it.\n\nIt's kind of a wink and a nod thing. At least this is what happened with my mother. She was clearly told how much it would take to overdose as a \"warning\" while I was not, I was told that she knows how much she will need based on her pain. In hindsight I realized she had said her goodbyes in a roundabout way to us then started asking for morphine more than usual. I was scared she was getting too much and started refusing but she insisted she had been told exactly how much to take depending on her pain level and she asked me to leave it with her so she could decide for herself. I felt enormous guilt until years later I ran into her hospice nurse and just broke down telling her what happened. She said that was my mother's plan all along and that is how it went with a huge percentage of hospice patients at end of life care stages. She said my mother knew exactly what she was doing. \n\nKeeping it all under the table like that is an absolute shame. Everything about how we treat the elderly is a shame.",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "buRto_b",
                                    "body": "This right here.",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "SensiFifa",
                                    "body": "Unfortunately if assisted suicide becomes widely available, which any of us decent people who have had a terminally ill/senile loved one have undoubtedly wished, you have to consider the other side of the spectrum - bad people who stand to gain financially from the death of their parents acting out of greed and not love.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Emm_withoutha_L-88",
                                            "body": "That's not even the most common, the most common is doctors suggesting it to disabled people who are about to lose their benefits. So they're unable to work and support themselves but the government still will kick them off disability, so the doctors will suggest assisted suicide so they don't have to rely on family or become homeless. \n\nIt's absolutely predatory as hell, there's a reason this stuff was made illegal. If a person wants to die it's not that hard to pull off.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TomBradyIsNotGoat",
                            "body": "The way I understood it, that cat was sick but had the chance to get better, so he kinda randomly killed it",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "that_mad_cat",
                            "body": "I had to convince my mom for half a year to put down our family dog. She pooped and peed herself constantly and barely walked. For half a year. It was painful looking at her and my mom still resents me to this day for \"forcing\" her to put Kora down (dog was 18 yo)",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "winter_mum11",
                                    "body": "She knows deep down you were right. Probably resents herself more. Good on you for making sure Kora didn't suffer longer 🖤.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Emm_withoutha_L-88",
                                    "body": "Just because something is in pain doesn't mean death is better. I get that you wanted to help but death isn't necessarily better just because something is in pain that won't get better. It hurts seeing those we love in pain, but them being dead isn't better for them, it's only better for us. The pain has to get really really really bad for it to get to that point. \n\nI'm not saying you were in the wrong, just that the idea that because something is in pain and it's terminal that doesn't mean getting it over with is better for them. It's often just better for the caretaker. That's something vets need to be more careful with, encouraging euthanasia before it's absolutely necessary. \n\nAgain not trying to call you out or claim you were wrong in that situation, just that the idea itself can be wrong.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "that_mad_cat",
                                            "body": "The thing is, she had 3 cancers throughout with most recent one migrating the large intestine. She had a year at most either way (we waited half a year with euthanasia bc my mom wanted to somehow save her but nothing worked)\n\nYes, I could have waited until her natural death. Yes, I wanted to \"kill\" her for my benefit of not seeing her suffer. I've been called selfish many times, but personally would rather be killed than suffer through full organ failure",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Emm_withoutha_L-88",
                                                    "body": "All I can say is I've seen this exact thing said about my mother when her dementia got bad and it was absolutely not true then. \n\nHell I've heard people say the same thing about me because I live with chronic pain. \n\nAs I said there's a point where it is the right thing. But it needs to be at the very end or when the suffering is extraordinary.\n\n>but personally would rather be killed than suffer through full organ failure\n\nWhen you actually get there you will likely see it differently.\n\nLiving with pain is better than not living. To a point at least.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "that_mad_cat",
                                                            "body": "Oh honey, I live with chronic pain since I was 11, with list of autoimmune illnesses. I KNOW that when it gets worse I'm going to the other side ASAP",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Emm_withoutha_L-88",
                                                                    "body": "But you're not there yet, even though you're in pain. Which was my point, life isn't automatically bad just because you're in pain.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "sisrace",
                            "body": "We don't do this to humans though..",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Second_Sol",
                            "body": "You mean the fucker who killed someone else's pet by poisoning it and tossing it into a fridge so that it would freeze/asphyxiate to death? Without even a proper diagnosis?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Slyboy2810",
                            "body": "The freezer was what made Sprinkles's death so horrifying. But I still stand with Dwight.",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "Emm_withoutha_L-88",
                            "body": "People said the same thing about my mom when she became bed bound from late stage dementia. She was not at all in agreement, she was still able to enjoy her life even if it was limited. Even if she only had a few hours of being fully there in the day, those few hours were worth more than any money could ever be.\n\nJust saying we shouldn't be quick to decide that death is better than more life even if the life is less than what it could be. \n\nThis kinda stuff should be at the last possible moment. A dog that can't walk can still be a happy dog, look at all the ones in doggy wheelchairs for examples. If they are still awake and aware and not in debilitating pain that can't be fixed, then it's not time yet. Even a dog that can't move can have happiness just from is owners love.\n\nI'm in constant pain from daily migraines, I've heard assholes say the same thing about me. \n\nThe idea that because something is disabled that means they can't enjoy life is just not true. \n\nVets in particular need to be more careful with how they decide this. Because there is a point where they're right and euthanizing is right. But that point comes a lot later than most seem to get. I think way too many see that the animal is terminal and act like ending it while they're still healthy is better. It's only better for the owners, not the animal. Enjoying every last second of life is what's best for the animal, even if it's extremely hard to see your beloved pet in pain in those last days, that's still going to be better than death. \n\nEuthanasia is right eventually but I feel like many times it's encouraged too early.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "100thousandcats",
                    "body": "Yeah, the test is if they’re in pain, can eat/drink on their own, can go to the bathroom easily, can walk easily, can enjoy treats, etc. there’s like a whole checklist I saw once, very helpful",
                    "score": 127,
                    "replies": [
                        {
                            "author": "Dynw",
                            "body": "- Doctor, have a back pain for a while.\n- Well, sucks for you, motherfucker! 💉\n- 💀",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Amelaclya1",
                                    "body": "Have you considered that you're faking it?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "No_name_Johnson",
                                            "body": "Oh you're *not* faking it? Ok, here's some unbelievably addictive pills that I totally don't get kickbacks for pushing.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Wikicomments",
                            "body": "Sounds similar to how we assess patients in the hospital",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "krisyboyy",
                    "body": "It hurts but the time asks no more !",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "JeshkaTheLoon",
                    "body": "We put down my bunny at age 15. He was very thin, as despite being fed properly (and him eating) he just didn't put on any fat any longer (like some old people tend to do), and he didn't move around a lot. He did however come to the side of the cage every day to get his daily yoghurt drop (not actual yoghurt. It's just called that) - this is important, as while you could pick him up and pet him, our bunnies have always been a bit less hand tame. And yet he came to the side of the cage for that treat. \n\nBefore he died, he had some kind of seizures now and then, where he couldn't quite control his one side, so he needed help to get up. This happened once or twice, but beside that, he was fine.\n\nBut at some point, he didn't come out to get his daily treat any longer. We knew it was time then.\n\nAlso, the vet was surprised to hear he was 15 years old, thinking his entry in their files was no longer relevant, as often people forget to tell the vet the pet died.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "an-emotional-cactus",
                    "body": "\"Better a day too soon than a week too late.\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "maxsteel126",
                    "body": "**Should have same rules for humans**",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nid45h",
            "body": "21 year old????? What???",
            "score": 257,
            "replies": [
                {
                    "author": "Crybabyredditmod",
                    "body": "Some of those little crusty white dogs are borderline immortal.",
                    "score": 284,
                    "replies": [
                        {
                            "author": "VictorChaos1776",
                            "body": "Poppins can't die!",
                            "score": 66,
                            "replies": [
                                {
                                    "author": "Alert-Switch1179",
                                    "body": "Sometimes, you have to pop his eyeball back in with your knuckle",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Special-Tangelo-9927",
                            "body": "Yeah - I had a lab mix live to be 17, so 21 for a tiny dog is totally plausible.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "captaincootercock",
                            "body": "Friend had a mini poodle growing up and that thing straight up looked rabid for a whole 10 years.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "whiterussian802",
                            "body": "Fr I swear",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "NFL_MVP_Kevin_White",
                            "body": "I’ve got a nineteen year old shorkie poo sleeping in a dog bed right next to me",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Johnnadawearsglasses",
                    "body": "My great uncle's chihuahua lived to 23.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "222Czar",
                            "body": "Tbf it seems like Chihuahuas play by different rules than other dogs, and I don’t mean just in terms of aging.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Nelsqnwithacue",
                            "body": "Hate is a powerful drug.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "animepuppyluvr",
                            "body": "I had one live to 22. He was my everything 💕",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wolfman513",
                    "body": "Years ago I knew someone with a 26 year old pomeranian that was still going strong, you'd be surprised how long animals can live with good care.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "YaumeLepire",
                            "body": "And luck. Longevity is a lot of nurture, but it has a part of nature, as well, which is to say heredity.",
                            "score": 24,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "222Czar",
                    "body": "I’ve had two 16-year-old dogs and both times I felt like they were ready to go well before I was ready to say goodbye. They suffered more than they had too, and I’ve never felt good about it. Keeping a 21-year-old is genuinely concerning to me, even though I know it’s a relatively common age for some breeds.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "fuckitholditup",
                    "body": "I have a12yr old now and she acts like she's half her age. I can't believe it some days. I've never had one make it much past 10.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "allthenamesaregone00",
                    "body": "My cat turned 21 a month ago. Believe it or not, I also canceled an appointment to have him put down about 2 weeks ago because he started feeling better. It's so damn hard.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mocod_",
            "body": "If your pet isn't in pain, please, please try your best to have them at home.\n\nIf they are suffering... Don't let them go alone. Be with them. I know it's hard and all... But don't let their last moment be with someone they don't know, scared/in pain, alone.",
            "score": 1427,
            "replies": [
                {
                    "author": "Less_Likely",
                    "body": "My Vet let me hold my cat while euthanasia was applied.  He had to go in back before for the IV, but after that they took him to me.  I couldn't imagine just dropping him off",
                    "score": 296,
                    "replies": [
                        {
                            "author": "GarboseGooseberry",
                            "body": "One of my biggest regrets in the past few years. My cat was sick and dying, and needed to be put down. My dad took him to the vet for it while I was out, and when I came back, he'd already come back. Had to go to that same vet later in the day to have my other cat checked, and found out my dad just left the sick cat and went back home.\n\nIf he told me, I'd have left to go stay with him immediately.",
                            "score": 165,
                            "replies": [
                                {
                                    "author": "LorenzoStomp",
                                    "body": "When I was about 10, our dog developed epilepsy. The vet didn't have any concrete answers about why, from what I remember, but they happened several months apart and only lasted a few minutes and she seemed fine in between them. Then a couple years later she had one while she was home alone with my dad. The rest of us came home from grocery shopping to find my dad had just taken her to the vet and had her put down. We were only gone a couple hours so I doubt he stayed with her. He wouldn't explain to us kids and my mom just said, \"He said it needed to be done\". \n\n\nHe's the sort of dude who always says they don't want a pet then loves all over them when they appear anyway. But he's always jumped to euthanasia as soon as they have any problem. People say, \"Oh, your dad is just afraid of how attached he'll get and knows he'll have to do all the work\". Nah. They're toys to him. He likes them as long as they're no trouble but as soon as they're 'damaged' they go in the trash like a broken VCR. ",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "big4demotivation",
                                            "body": "Probably didn’t want to deal with the cost of treating an unwell pet, no matter how manageable. Sorry to hear it.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Effective_Aggression",
                                                    "body": "I love that based off two paragraphs you think you understand this persons father’s motivation…",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "big4demotivation",
                                                            "body": "Hence the word ‘probably’. And common sense typically suggests that the most simple and obvious answer is often the true and correct one.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Effective_Aggression",
                                                                    "body": "Probably doing a lot of heavy lifting…",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "big4demotivation",
                                                                            "body": "Conversational common sense doesn’t come naturally to everyone, it’s okay",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Effective_Aggression",
                                                                                    "body": "You’re gonna fit in great around here",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Daemenos",
                                    "body": "That story hurts, so much.  \nA little personality you loved, and you thinking that someone will be there for them while they go, but then, them having to go to a strange place, sick and afraid.. alone. \nAnd then the quiet\n\nI'm so sorry😭",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Chardan0001",
                                            "body": "It sounds terrible but you just know the vet/assistant would have ensured the animal was soothed. It would be a small comfort.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SensiFifa",
                            "body": "Unfortunately during COVID this was how it had to be done, heartbreaking.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Child_of_God69",
                            "body": "Sorry about your kitty 😭 It was the same for me. I held him while the vet was doing the injection. I did ask him if I could be there while it happened and the vet told me that he encourages it, as then the cat isn't going to sleep alone. He told me \"it'll hurt you more than it will hurt him\" and man was he right. No regrets here though, I'm glad the last thing my boy did was lay on my arm. After him being so sick, it was nice to see him have that last moment of peace",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Kodfysh",
                            "body": "Even though it's been over 10 years, I will never forget the feeling of loving on my cat as he slowly drifted away... that final nudge against my hand into nothing broke me for a long time.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Teratoma_Soup",
                            "body": "I was lucky the vet let me, my mum and sister in the room when they euthanized our Luna. They had a comfy blanket pallet made for her on the floor and I laid there and held her when the vet injected her. I held her until her last breath. It's the most heartbreaking thing I've ever gone through, and im crying a bit just typing this. But I don't regret it for a moment. Our baby passed being held and knowing she was loved till the end.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ctgrell",
                    "body": "We had a dog who got sick. We couldn't afford treatment and even then it wouldn't have been a 100% cure so the vet said we can then either put her down now or take her home. My mom chose to take her home. I was just a kid but I understood that we couldn't even afford to put her down peacefully. But also my mom couldn't just agree to that either because she didn't want to let our dog go. Or at least that's how it felt until a couple of days later when our dog was unable to move anymore and my mom closed herself into the bathroom. So me a 9(ish) years old had to be alone with the dog and hold her paw for the last breaths. I will never forget. I knew I had to do it for her. I wasn't going to chicken out like my mom. I grew up with that dog. The bare minimum is to give her company in her last moments!\n\n\nNeedless to say I never ever wanted a pet, especially after that. I can't do that again.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "No-Rilly",
                            "body": "Geezus… Im not crying, you’re crying. You were a sweet and brave child.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ctgrell",
                                    "body": "I didn't even tell you all the details. I came home from school to find our dog on the floor. She would usually greet me with a gentle jump but now she was just laying there. So I put my stuff away and sat in front of her. She could only move her eyes. She looked at me and I looked at her. We were sitting like that for many hours.I yelled to my mother a couple of times to come out of the bathroom. Nothing changed. After a while I just felt I should hold her paw. She would usually take her paw away when I did that but she couldn't move so she was just looking at me. Once again stayed like that for a while and then the life was gone from her eyes. I never expected to be able to tell a lifeless eye from the still living one but it was so obvius when it suddenly happened. Yelled for my mom. Yelled she was gone. That's when my mom would finally come out. She then called for my brother to bring our car to the house (it was winter and during snowy days we would park it in a different part of the city where we rented a garage). They wrapped the dog up and then in the middle of the night she was transfered to yet another part of the city where we had a tiny farm kind of place. I had to go back to sleep because the next day was school again. When I've got home we went to the farm and there she was. My father made a little grave for her at the gate with big rocks. My mom would plant flowers on top. It was a nice little monument for our dog.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Owobowos-Mowbius",
                    "body": "Upsets me so much how many people won't be in the room with their pets when being put down. God forbid they have to do something difficult for their pet after all the years they gave them. Breaks me heart how often I see it.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "Finetales",
                            "body": "It's the hardest thing I've ever done but I would absolutely never allow myself to not be there. I sat on the floor next to my golden lab as he was put down and while I sobbed like a baby I will never ever allow that memory to fade.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Seth0714",
                            "body": "Because it's not easy. I've been with my animal every time, last time my poor girl who had cancer for years had finally gotten to that point. She didn't go down easy and fought despite how weak and sick she was, it's not an instant sleep injection. They jerk and gasp; they're dying. It's very hard to watch and I hate doing it but I would never choose the alternative of not seeing it. I always think, if it's this scary for me, just imagine the poor cat who has even less idea of what's going on. For you it's one tragic event, but for the animal it's likely the scariest part of their entire life. Every animal naturally fears death, and I'd like to think that I'm helping at least some by being there to comfort them. No creature deserves to die scared and alone, let alone someone who dedicated their life to being a perfect companion to their human. It's the least we can do for them",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "Khmer_Orange",
                                    "body": "Every pet I've had to see put down got a sedative first and then whatever medicine they used for the euthanasia for exactly that reason",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Seth0714",
                                            "body": "She was sedated, she wasn't thrashing about, just death jerks and shaky breathing. The only issue was that for some reason despite her condition she would not stop breathing entirely. The vet used more than enough medicine for her, poor girl just kept fighting so hard, but I was there with her. I just told her it was okay to let go and kept holding her. Tiger had suddenly took a turn for the worse the day before, but we knew she was sick for a while. She went from normal to not able to walk so quickly, within a day. It was her time and she was in pain, but damn do I miss her",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "lazysundae99",
                            "body": "I did an at-home euthanasia for my cat and the vet explained that after the first shot that put her to sleep, it was ok to leave the room before the second final shot, as I guess some pet owners found comfort in not seeing the final injection.\n\nI was like, absolutely not. This is already the worst thing I've ever felt, I'm not going to leave 5 minutes early and let her be alone, even if she wasn't awake to know I was there anymore.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TadRaunch",
                    "body": "In 2019 my cat had inoperable cancer and we had to put her down. We found a vet who did home visits.. it was more expensive but it was worth it.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Skook10",
                    "body": "Distressing story following here, but y'know.\n\nMy dog was unexpectedly attacked this year while the whole family was out of town. They found him hours after it happened and rushed him to the vet. The doc did everything she could, but he was hurt too bad to ever recover considering his age and injury history. At that point, all they could really do was save him any more pain.\n\nWe all got on the call to Facetime him while it happened. It was all we *could* do, it was so sudden. I get this pit in my stomach thinking about what happened, how he must have felt. He was so hopped up on pain meds and everything else when they put him down, I don't know if he was even able to register that the phone was there. I hope he was. \n\nI don't know. Even thinking about it, not being able to be there for him in that moment, I just feel hollow. I'm away at university and haven't been back since it happened, so it still doesn't feel real in some ways. I wish I could have been there for him. I wish anyone could have. But the phone was all we got, and I still don't know if that was even anything at all.\n\nI really hope it was.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "MonsterOfTheMidway",
                    "body": "I held my cat as he was put down and feeling the lofe leave him is one of the most haunting things I've ever experienced and I still cry thinking about it sometimes.  But he got to go in his home in the arms if the person that took care of him from when he was a kitten. I'd do it again for him if I had to, he deserved to be ad comfortable as possible",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "LorenzoStomp",
                    "body": "The \"best\" euthanasia I had to do was for a cat who went into organ failure while I was dating a vet tech. He swiped the meds and brought them to my house. She wanted to go outside even though she could barely walk, so I let her out and followed her while she slowly ambled around. By the time she got tired and laid down in the grass, he had arrived with the meds. I helped him do the injections and she passed without even a twitch. There are some vets who will do home euth, although I'm sure they are more expensive and if it's an emergency situation you're better off taking them in instead of waiting for an appt, of course. ",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Chardan0001",
                            "body": "That's oddly beautiful, sorry for your loss",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ProbablyStillMe",
                    "body": "I still get tears in my eyes when I think about the last moments of my two childhood cats' lives, even though it was nearly 15 years ago (they died about a year apart). But I was so glad to be able to be with them at the end.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "T-MoneyAllDey",
                    "body": "Nowadays there are a lot of vets that can come to your house and handle it all in the comfort of their own home",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CaptainPizdec",
                    "body": "When my pup time is up, she had already lost her eyes (it kinda just melted), can't stand straight without assistance, can't hold her bowels, not hearing very good, ticks and mosquitoes and other blood sucking insects swarms the house, she let off a final yell and then passed away. It still breaks my heart when I'm typing this. Spend your time with your furry friends, for you are the elves that never ages but they are the mortal that does.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "svanvalk",
                    "body": "For my 19 year old cat who was suffering from acute kidney failure, so she was pretty out of it to begin with, my mom and I were there with her. But before the administered the euthenasia, they sedated her first. I made sure that her final moments involved me holding her paws in comfort, but I wonder how much she even noticed me being there, if she even could.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "drjesus616",
                    "body": "My 14 year old boxer girl was in my lap with her head in my hands as they let her find peace.  We knew it was coming, not eating/ drinking as much, but that day, she went from capable and reluctant to unwilling to get up when I got home from work. \n\n  \nBy the time we got to the vet, she was hurting so bad she wouldnt even walk. \n\n  \nLucy got one last \"smooshy face\" and laid in her daddies lap.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "marino1310",
                    "body": "For my last dog we had a mobile vet come by and euthanize her in the back yard so she can feel safe and happy at home instead of in a scary vet office. She ate a bunch of chocolate and icecream before she was put down so she got to have some good treats before going",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Not_ur_gilf",
            "body": "When I put down my first dog, I made sure that it was a mercy. He was old, blind, deaf, and had facial cancer. The only way he really knew that someone was there was if they held him, and he could tell who was holding him. When we took him to the vet, he was wrapped in his favorite towel for after walking in the rain and I held him the whole way over. \n\nIt was hard, but my only regret is that I couldn’t ease his suffering sooner.",
            "score": 115,
            "replies": [
                {
                    "author": "newSew",
                    "body": "That's life experience. My parents had pets all their life; the older thry get, the dooner they put their pets down, because thry learned to recognize the signs telling that the pets won't have a good quality of life anymore, no matter the medications.\nBut don't worry, your dog knew how much you loved him. :)",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Parking1203",
            "body": "My dog wasn't in pain but his QoL deteriorated and it was obvious that he was just old. After months of being bed bound, he had an end-of-life rally, ran up his favourite hill and peed on his favourite spot. He went home to nap and died hours later. I am always glad he got that experience and got to die at home instead of a scary vet's office.",
            "score": 965,
            "replies": [
                {
                    "author": "NobodyLikedThat1",
                    "body": "There are home euthanasia options where I live.  After putting down our cat at a veterinary hospital I promised myself never again.",
                    "score": 242,
                    "replies": [
                        {
                            "author": "bazookajt",
                            "body": "We put down my first dog with a home euthanasia option and I'd absolutely recommend it. It's still awful, but at least she was at home and wasn't scared.",
                            "score": 99,
                            "replies": [
                                {
                                    "author": "monkeyman68",
                                    "body": "DO YOUR RESEARCH! We just grabbed the first one we saw when we looked on Fakebook. They walked in pushing homeopathy “nerve pills” for us humans. I declined. They couldn’t get the IV inserted, I did. The tourniquet broke so I was the one who clamped my hands around her leg to allow the drug to build up enough volume and force to put her out quickly and cleanly. When I should have been present for the passing of my beloved Alice, I was in work mode caring for a patient with an incompetent practitioner in command.",
                                    "score": 61,
                                    "replies": [
                                        {
                                            "author": "BurnedOutTriton",
                                            "body": "What a nightmare. That's funny in a pretty dark way but I'm sorry you had to go through that.",
                                            "score": 25,
                                            "replies": [
                                                {
                                                    "author": "monkeyman68",
                                                    "body": "A couple of months later I awoke to a request to check our other dog. He seemed agitated, a little swollen in the face, and was pacing. I said, “If he’s not looking better in the morning we’ll take him in.” and went back to bed. A couple of hours later I was awakened again and walked up to him just in time to see his last two gasps before he collapsed and was gone. \nThey were both almost 12 years old and breeds that rarely live beyond 10. Alice was a Parvo survivor who was sick with a fungal infection (Valley Fever) her entire life. She was on medication for the majority of her years and it was almost impossible to keep weight on her for most of her life. She died fat and happy which was the best I could ask for. \nDon’t worry… I’ve got a pretty twisted sense of humor and can totally see the irony in all of this. We often told them “We can’t wait to think of you fondly!” when they misbehaved. We do that pretty often.",
                                                    "score": 18,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ok_Nothing_9733",
                            "body": "I will never do it in a vet hospital again either. I just missed the deadline and didn’t have to do my cat’s euthanasia in an outdoor tent like many poor people had to (it was 2020). Walking in with my cat and out with an empty carrier is still one of the most crushing memories I have. Never again.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "nunchybonkey",
                                    "body": "our dog passed away in an animal hospital in 2021 and we still weren’t allowed inside, so we said our final goodbyes to her dead body in the parking lot in the rain. it still makes me so sad but when we had to put down another dog a couple weeks ago we got to have him euthanized at home and it was really the perfect way for him to go, belly rubs into deep sleep surrounded by his favorite people.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Ok_Nothing_9733",
                                            "body": "I’m so sorry to hear about your loss, that sounds super sad indeed, especially not being allowed inside. Thank you for sharing your story because it sealed the deal that I want my current babies to be safe and at home being loved when their time comes. You’re a good pet parent! ❤️",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "nunchybonkey",
                                                    "body": "the woman who did ours was a licensed vet tech i believe, we called the day before and she came on a sunday morning, with treats to make him like her and a cosmic brownie so he could finally have some chocolate on his way out. gave him some tranquilizers and then anesthetic and he basically just drifted off. we got to sit with him for as long as we needed and then she took him out on a stretcher and our vet gave us his ashes a couple days later. it was really the best way, frankly i wish we could do it for humans lmao",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Finetales",
                                            "body": "Thankfully I got your second experience at the vet hospital. Our golden lab was sprawled on the floor and we all sat around him giving him love in his last moments.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "whiterussian802",
                            "body": "There is where I am too and I did do it once. It was hard but I was so grateful to have that opportunity",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "theflyingburritos",
                    "body": "That is the fucking dream.  Hope my boy gets to do the same",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "CodeKermode",
                    "body": "A vet office doesn’t always have to be scary. My dog loves going to the vet, he gets excited to see his vet like when that family member he doesn’t get to see often comes over.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Finetales",
                    "body": "Dogs know when it's their time. My golden lab did all the stereotypical last day things, including sitting facing a corner he'd never sat at before. Didn't put up any fight when it was time.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "pepod09",
                    "body": "The vet I recently had used for an elder pup was actually very nice. They had a room near the front, with its own door, that had couches, bean bags, dog beds, and you spend as much time as you need with your baby. \n\nWhen you’re ready you press a wireless doorbell and the vet will come in to perform the euthanasia. After, they can take and cremate, or give you a box for your pet. We chose to bury on our property in her favorite blanket. \n\nThe whole time as well, in the front lobby they have a candle burning that indicates to others to be quiet and respectful. \n\nOf course I have also seen the vets where it is just done on the same exam room table as everything else. \n\nI would probably go for a home visit option when the time comes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Orangutanion",
            "body": "I recently put my cat down at 16.5 because due to bone cancer she was rapidly losing her ability to walk and her will to eat. And while I'm still sad about it, I know I did a good thing. I couldn't imagine letting her suffer any longer. When your pet starts dying, it happens so fast it's insane. She was basically the same cat for almost a decade and the entire process of her dying took less than a month.",
            "score": 32,
            "replies": []
        },
        {
            "author": "Dorrono",
            "body": "Do what's the best for the dog and not what's the best for you.",
            "score": 55,
            "replies": [
                {
                    "author": "Saw-Sage_GoBlin",
                    "body": "An upsetting number of people view their dogs through a lens of what the dog can do for them. It's a one way street, as they do almost the bare minimum to keep the dog alive. \n\nThey don't look at their dog and see a hairy person, they see an object with sentimental value.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Dorrono",
                            "body": "Or a trophy they can show off with, like people who only want a purebred dog.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Away-Reception587",
            "body": "She was telling you she was sad but ready",
            "score": 64,
            "replies": []
        },
        {
            "author": "disguy2k",
            "body": "If you can, get a home vet to do this where your pet won't be stressed. They can go to sleep relaxed at home. \n\nOur vet took care of everything and made it as stress free as possible.",
            "score": 16,
            "replies": [
                {
                    "author": "alistofthingsIhate",
                    "body": "I second this. We had to put our nearly 16 year old dog down this past December. She was clearly not enjoying life anymore. Vet came by and guided us through it. Lili was surrounded by her family in her own home and just went to sleep in my mother’s lap. It was heart wrenching but I’m so glad we did it that way and not in a sterile, unfamiliar office.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beeeeeeeeeeez",
            "body": "This posts comments have had me bawling, I've got two dogs, and I've never had to put an animal down before. I can't even begin to imagine how painful it's eventually going to be",
            "score": 15,
            "replies": [
                {
                    "author": "newSew",
                    "body": "It will be awful. But it will be more awful to see them deteriorate and suffer... The other option is that your pets eill quickly die on their time before the suffering would be too harsh, but it will still be awful for you because you eon't have time to prepare yourself to mourn and spend high quality yime with your pets in their last moments. :(",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "NFL_MVP_Kevin_White",
                    "body": "You basically get 5,000 beautiful days of happiness with your dog, and all it costs is worst day of your life, a gut-wrenching month, and pangs of good and bad memories ever after. Just remember not to waste one of the 5,000",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ZolaThaGod",
                            "body": "As an owner of an old dog who’s time is likely coming soon, one phrase I read that stuck with me was:\n\n> Don’t be a time traveler\n\nSimilar to what you said, don’t waste one of those 5,000 good days by “time traveling” to the bad day in your mind. There will be plenty of time for grief later. Don’t let that knowledge of the impending bad day rob you of the good days you have right now.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SpaceMutie",
                    "body": "If it helps to put it in perspective: your dogs trust you and rely on you to take care of them. They love your attention and your kindness. They love you unconditionally— so do your best for them unconditionally. If that means putting them to sleep, or caring for an elderly dog, or even rehoming them, you’re repaying their loyalty with your best judgment and responsibility. \n\nLove them to the best of your abilities through both affection and tough choices.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Krypt0night",
            "body": "Na this is selfish as fuck. It's hard but you have to make the choice solely for them, not you.",
            "score": 124,
            "replies": [
                {
                    "author": "vulpinefever",
                    "body": "I mean, we know literally no details beyond that the dog is 21 years old. For all we know the dog has a great quality of life despite the age and OP realized that in the car when the dog showed them love and joy.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "riptide032302",
            "body": "Is it just me or do most dog owners seem to prioritize how much they love their cute dog over the dog’s comfort, health, and survival? Not to mention everyone else’s comfort",
            "score": 57,
            "replies": [
                {
                    "author": "Meetpeepsthrowaway",
                    "body": ">they love their cute dog\n\nI'm not saying it's a rational choice, that just answers your question. Nobody wants to lose their loved one forever.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "riptide032302",
                            "body": "Yeah but if one loves the dog so much, then why would they care more about how much they love it than whether it’s okay or not",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Meetpeepsthrowaway",
                                    "body": "People get crazy in grief. They probably hope they can somehow make their life better, do something, wait it out and maybe they'll all of a sudden be fine. They aren't totally seeing the pain they're causing.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "Loj35",
                                            "body": "It's also tough if there isn't a specific event that drops their quality of life.  If it's just a slow decline over time, where do you draw the line? It's easy to justify keeping them a bit longer when they're that important to you.",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "anotherdepressedpeep",
                                    "body": "Honestly, its the same with people. So many prefer to have their braindead loved ones surviving due to a machine because they simply cannot let go.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "alistofthingsIhate",
                                    "body": "The human heart does not think like the human brain. Yeah, we know it’s the right thing to do. That doesn’t mean it’s easy.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ICantBelieveItsNotEC",
                    "body": "Yep. It's the same kind of dog owners who refuse to train or discipline their dogs because doing so gives them bad fee fees. As a result, their dog is an absolute nightmare that jumps up at strangers, steals food off the table, terrorizes local wildlife, etc.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "leegiovanni",
            "body": "I would want to be put down painlessly if I can’t enjoy the quality of life anymore. Wish more pet owners knew this, and also that this is an option for humans.",
            "score": 9,
            "replies": []
        },
        {
            "author": "drwildthroat",
            "body": "Better a day too early than a minute too late. ",
            "score": 11,
            "replies": []
        },
        {
            "author": "RedditIsGay_8008",
            "body": "This is why I don’t want a dog. Can’t handle that loss",
            "score": 3,
            "replies": []
        },
        {
            "author": "DethByCow",
            "body": "My dog started having seizures. Medication did the trick for about a year until he had a 5 min one. His noodle was a bit scrambled but he was ok. Then he had an 8 min one and he needed wraps and he started walking around in circles at night. A few nights later he had 6 seizures though out the night. \n\nI’m grateful it wasn’t a slow decline and I had to make the tough choice. But holding my dog throughout the night while he had seizure after seizure fucked me up for awhile. \n\nThere was no ER vet to get him to in my city and I’d have to drive over an hour to get to one. I knew he was donzo but I also didn’t want him having seizures in the back of my car where he could hurt himself and be in more pain and confusion. So I had to wait until the vet opened.",
            "score": 3,
            "replies": []
        },
        {
            "author": "otirk",
            "body": "A few years ago, we put one of our dogs down (12 years old pug) because her eye was rotting away and the only way to save her was to remove the eye - without anesthesia because that would have killed her (too old and weak). She was mostly sleeping the weeks before that. \n\nSometimes it's your duty to put your pet down, you're be doing them a favor.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Greggs-the-bakers",
            "body": "Damn, I miss my old dog. We got him as a rescue when I was about 15, he was 3. He had issues due to being mistreated and could sometimes be aggressive to people he didn't know. But he fucking loved us and over the course of the 10 years we had him, he calmed down a lot to the point where he was like a different dog. As much as we hated eachother at first, after about 6 months I was his favourite and he would eventually start waiting at the door every night for me getting home from work, even after i moved out of my parents house. We lost him almost 2 years ago after he let out a yelp and his back legs just stopped working randomly. He couldn't control his entire back end and hadn't had a pee for over 24 hours and was constantly crying in pain and trying to walk. Taking him to the vet was the kindest thing my parents could've done for him. I just wish I was there at the time as it was the middle of the night.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Humble-Plankton2217",
            "body": "I had a vet come to the house. It was one of the hardest days of my life, even though my 15yo girl was ready. Their little lives are far too short. She had an ice cream sundae, on her favorite rug, next to the Christmas tree surrounded by family and love. No vet office anxiety, it was the best way to do it. She was real, she was loved. I miss her terribly.\n\nI'm taking a break from pets for a while.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gmamya97",
            "body": "I wish we could do this with humans, when they are sick and don't want to live, just put them down. right",
            "score": 2,
            "replies": []
        },
        {
            "author": "Auzzr",
            "body": "We are insanely lucky good friend of ours are vets.  They’ve helped us tremendously by euthanising our pets on our laps.",
            "score": 2,
            "replies": []
        },
        {
            "author": "magnaton117",
            "body": "How is it 2025 and we still haven't cured aging",
            "score": 6,
            "replies": [
                {
                    "author": "Sunnywatch08",
                    "body": "Aging is not an illness",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "LarxII",
                    "body": "\"We've yet to defeat time. How do we suck so bad?\"\n\nEven without aging, you would EVENTUALLY die from something, likely violently.\n\nI'll take passing into the night gracefully thank you.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "sunshim9",
                            "body": "What? You want to die in your sleep like a freaking normie? You have to go with your guts splattered in the asphalt after crashing your bike at a Michelin inflatable at 235 years old... At least, that what I would like",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "LarxII",
                                    "body": "I lived life to the fullest -bloody smear on the pavement, 3422 A.D.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Confident-Grape-8872",
            "body": "It was definitely time. This is selfish",
            "score": 3,
            "replies": [
                {
                    "author": "LouiseEldritch",
                    "body": "If it makes you feel any better, this is a bullshit story made for engagement.  A 21 year old dog would put it in the top 20 for oldest dogs of all time.  Whoever made this should have gone for 15 or so, and even then it's still a little too on the nose to be believable.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Low_Parsley_2873",
            "body": "You must feel and know you are doing the right thing. We know when are wrong, and apparently, it didn't feel right to them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "patty7775",
            "body": "When my best friend was on the edge of death from hyperthyroidism, the vet suggested we end his suffering because he couldnt even function anymore and so as he was needled i looked into his eyes to transfer his soul to mine and hes been with me since. I hallucination him all the time and same with my 2 dogs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "comradejiang",
            "body": "pet owners will really make an animal suffer through anything as long as it pleases their own emotions",
            "score": 0,
            "replies": [
                {
                    "author": "Less_Snow5141",
                    "body": "Yes assuming animals just want to die is clearly superior.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SpaceMutie",
                            "body": "No animal really wants to die, that’s the problem here. They want to survive as long as possible, even if they’re little more than a walking corpse. True pet ownership and love is not just daily care and maintenance, it’s also about doing what’s best for them in the long term.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Less_Snow5141",
                                    "body": "That's exactly my point. There are different schools of thought on this question ",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "comradejiang",
                            "body": "not what i said, i mean you should be willing to kill your animal when their existence is just suffering day to day. you can be sad about it, just don’t do what this person did and put it off because of those uncomfortable emotions",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlbinoCakes",
            "body": "If OP could just turn round and go home it would suggest the dog didn't require a vet.  The question is then why was OP going to euphonise her pet if there was nothing wrong with it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "rolltrain",
            "body": "Damn, I had a little moment after reading this",
            "score": 1,
            "replies": []
        },
        {
            "author": "MightBeTrollingMaybe",
            "body": "This would be me if I had to put my dog down. I'd probably have to call some kind of psychological or medical support to bring both me and my dog to the vet and do the thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NFL_MVP_Kevin_White",
            "body": "Shoutout to the /r/petloss community for helping people get through the worst of it",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpaceMutie",
            "body": "I guess it’s a different perspective bc of their lifespan, but I raised rats that I loved dearly. Several of them were old, riddled with tumors, skinny, and clearly tired, yet they still happily ran up to me and boggled and asked for pets. I still had two of them put to sleep, both for their quality of life and my own emotional sake. I knew they were living a mere fraction of their best lives by then. \n\nBeing a responsible pet owner also includes knowing when to say goodbye. Some animals fight hard to stay alive because it’s in their nature— it’s our jobs as pet owners to relieve them of their burdens too. I get the OOP’s desire to hold on, but prolonging an already-long-lived life to soothe yourself saddens me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GreenZebra23",
            "body": "When I learned I had to let my cat go, just about exactly a year ago, the option was there to do it right that moment. Instead I chose to take him home for another day or two. He wasn't suffering as far as I or the vet could tell, but he had inoperable cancer and I knew he would be very soon. I knew it would be hard to take him back to the vet for the last time, but I'm glad I got that extra day with him. He got a lot of treats and pets and slept a lot, then I took him back into the vet to say goodbye. He went out doing the two things he loved most, eating and getting attention.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vaportrail",
            "body": "It was the same with my labrador. My parents had to make the decision for me.  \nShe was covered in huge tumors, like ones making her legs rigid so she could barely walk. She never cried, whimpered or showed any signs of pain, despite the vet assuring us how bad it must be. She was the same happy, smiley dog all the way up until the end. It still breaks my heart when I think about it. Good girl.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WheresTheAnyKey89",
            "body": "My cat Eamon, on the morning of his last day, suddenly got the energy to start playing, and even purred in the vet when we were all saying goodbye to him. I know it can feel like you are making a terrible mistake when they get that burst of energy out of nowhere, but that could be their way of saying goodbye to you, too. When it's time, it's time, and I believe that they know that, too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "derpycheetah",
            "body": "Dog finally getting up to heaven where they can understand English: \"my owner was going to take me WHERE that time we drove around and came back home???\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aerodrache",
            "body": "It still kills me thinking about the last dog I had to take to the vet.\n\nShe was up there in years, in her mid-teens I think (she was in the double digits before she joined the household.) She wasn’t very active, mostly spent her time napping on chairs; dogs weren’t allowed on the furniture but it wasn’t worth the fight to make her understand she was a dog.\n\nWe’d just taken another senior pet to the vet, and there’d been a suggestion that we just do them both at once; I’d opposed the idea, “because it’s convenient” didn’t seem like a good reason to put a pet down, and she still seemed… well, not “full of life”, but as lively as I’d known her to be.\n\nThen there was the incident… I didn’t recognize it as one at the time. It was supper time, and I’d filled her dish; she came out, flopped down next to it, and started eating. I thought she was just being dramatic - “oh, it’s been so long I almost didn’t make it.”\n\nI forget how much time passed after - weeks? Maybe a month or two? Certainly less than half a year, at any rate. Then came The Incident. This one, I clearly recognized. She’d just come up the stairs, and again, she collapsed. No whimpering or whining, but she just clearly couldn’t get back up again. It lasted for a while, and she just looked so scared.\n\nThat was it. The thought of that happening with nobody around, her just stuck somewhere, not able to get up and with nobody to help or comfort her, was just heartbreaking. With three of us in the house - one firmly against putting the dog down, one already committed to it, and me - I was the swing vote. When I said it was time for her to go, that settled it.\n\nI still wonder if it was the right choice. She didn’t seem to be in pain, and outside of those episodes she was doing alright. How many times did she need to lie of the floor helpless and afraid before it outweighed the time she spent… well, mostly lying in a chair sleepy and content? Did I take away a life that was still, on balance, acceptable for her?\n\nI like to tell myself that it would have gotten worse, that she would probably have had another few months of increasing decline, growing steadily more miserable… but I don’t know that. She might have had one episode a month for another year or two and been otherwise fine; she might have had plenty of life left to live.\n\nI still can’t think about it without tearing up; even just hearing about someone else’s pet dying threatens to bring the pain back up to the surface. I don’t know if I could ever have another dog now, knowing that I’d have the same choice in front of me again eventually.\n\nKnowing I might make the wrong choice, again.",
            "score": 1,
            "replies": [
                {
                    "author": "RedRune0",
                    "body": "From the way you describe it, I'd say you made the right call both times. Would be an ideal world if mercy was always easy.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bbq_R0ADK1LL",
            "body": "Cool story about your vet, sounds hot, but what happened to your dog?",
            "score": 1,
            "replies": []
        },
        {
            "author": "LittleSisterLover",
            "body": "...I'm sorry, but if they're not suffering to the point where letting them go is a proper choice, why the Devil were you taking them to do so in the first place?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Noonootk",
            "body": "This hit my feels",
            "score": 1,
            "replies": []
        },
        {
            "author": "abe5765",
            "body": "My dog developed cancer he couldnt eat and was deteriorating into skin and bones no strength left to withstand treatment. Cried the hardest I had in my life holding him till he was gone vet was there for me sent a card to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tubrick",
            "body": "What a pussy",
            "score": 1,
            "replies": []
        },
        {
            "author": "OneCauliflower5243",
            "body": "Dogs are the truest of friends we'll ever have.  They always mean what they say.  Their enthusiasm for just your company always makes a hard day better.  Nothing will love you quite like a dog will.  It's never a good time to say goodbye.  But when that time comes, it's 'see you later'.    \nThey're doing alright.  Running free of bodily pain and aging :)  They're doing alright",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tirux",
            "body": "When your dog is blind, can't walk properly, has to use a diaper, and can't even fucking eat the food, it's time to put the dog down.\n\nJust remembered this situation with a friend of mine and I was like \"bro... just do it already, dog is suffering now\".\n\nDog was between 16 and 18 I think.",
            "score": 1,
            "replies": []
        },
        {
            "author": "impossible-sunflower",
            "body": "I am so confused at the comments here... We only know that the dog is old, nothing about it being sick or in pain. Just being old is not a reason to put down a pet.\nWould you kill your grandma just because she turned 90? Old age does Not necessarily mean that they have a bad quality of life! You certainly should always put your pets well-being first no matter how much it may break your heart but to put an animal down just because it's old is just as selfish as keeping it around because you can't say goodbye.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mermaidleesi",
            "body": "I had my dog put down at home because she was terrified of the vet. I didn’t want her last moments to be tense. When the vet arrived, she happily hobbled over to greet her, wagging tail and all. It was so bittersweet, but I knew it had to be done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bobxgnarleyxmon",
            "body": "I remember when I gave the leash to the nurse to put my dog Max down he was so excited to go with her, jumping up and down.  It breaks my heart that was the last time I saw him. It's such a hard call to make for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "letsalldropvitamins",
            "body": "When it comes to pets at the end of their life, while heartbreaking and unbelievably difficult, I stand by my philosophy of “rather a week too early than an hour too late” I’m not saying OP did anything wrong, when it’s time it’s time and you’ll know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "madtownjeff",
            "body": "Google journeyspet quality of life scale\nAn amazing tool for making this tough decision.",
            "score": -2,
            "replies": []
        },
        {
            "author": "MisterVampire",
            "body": "what happened to this subreddit? is it just anything goes now? it used to be funny memes :(",
            "score": 0,
            "replies": []
        },
        {
            "author": "Blueigglue",
            "body": "I shot my dog in the head with tears in eyes. It was quick but that's life.",
            "score": 0,
            "replies": []
        },
        {
            "author": "KindlyContribution54",
            "body": "For those that feel their pets are family members, a good rule of thumb to help put things in perspective is: Would I still feel the same way about choosing euthenasia if this was my grandmother?  \n\n\"Grandma is getting incontenent, complaining about arthritis and doesn't seem very peppy.  I can't stand to see her suffer like this.  I guess we'll have to put her down...\"",
            "score": -36,
            "replies": [
                {
                    "author": "xenchik",
                    "body": "Dude, after watching my Dad suffer with his cancer and SJS for months, yes I absolutely would choose euthanasia over that. He wanted to do that anyway, but the cancer came on too quickly and he couldn't get the approval in time. But in his last few weeks, if we could have, we definitely would have. He was in SO. MUCH. PAIN. Just breathing was agony.\n\nBut a pet can't communicate that. They just sit there. The doctor knows how much pain their condition would be causing on a minute-to-minute basis, and yet, what, \"They're not speaking like a human so how do we know?\" \n\nMy cat, my best friend for fourteen years, had a brain tumour. It was pressing on her sinus so she couldn't breathe. She always seemed happy to see us, meeting us at the door and cuddling like normal, but come on, an adenoma that was taking up 50% of her skull and pushing her brain out of the way with its sheer size? Of COURSE she was in agony. Wait till you're in that much pain that you can't eat or drink or breathe, and then ask this question again.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "CuzRacecar",
                    "body": "And a good rule of thumb for regular people is not that.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "RocketNewman",
                    "body": "Brother, there’s a gulf between “complaining about arthritis, doesn’t seem very peppy” and laying on a terminal, agonizing deathbed with a thread holding on you onto a life you’re ready to be over, jesus christ. How many times have you fell on your head?",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "GrimmTrixX",
                    "body": "When I am old and I am suffering, I absolutely hope Euthanasia becomes an option. Your anecdote makes no sense because your grandmother isn't your pet. She still has a presumably working brain. \n\nBut if my mother is an absolute babbling and/,or catatonic mess, she already told me she does not want to keep existing in that state. We should be allowed to leave this world I a peaceful and safe space. Doctors should absolutely be allowed to help someone have a peaceful death as they do to trybto heal people to have a peaceful life.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "VoodooDoII",
                    "body": "Pets rely on us to make decisions for them because they can't. \n\nThey aren't humans so you can't compare the two.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BerneseMountainDogs",
                    "body": "The difference is that animals can't tell us what they want. They can't consent. Animals don't know why they're suffering. They only know that they're in pain. \n\nAs their caretakers, it falls to us to give them the best lives possible, and if they are more sad than they are happy, then it's time for things to end. \n\nWhen we treat a human for cancer, they can consent to the pain and treatment. They can consent to difficult treatments in order to have a longer life. They know that it is painful now but will probably be ok later. They know what it means to have a longer life and can know why they might want that. Animals don't know any of this. They don't know that life goes on, they don't know that suffering now will lead to a longer life later. They can't consent. They don't know why they're suffering. They only know that they're in pain. \n\nOur pets trust us. They trust us to keep them safe. They can't make these decisions for themselves. We have to make them. And we have to make those decisions with our pets in mind. They can't give meaning to their suffering. It doesn't mean anything to them. It's just painful. And no one deserves that. Especially not our pets who we love and who trust us.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Present_Abrocoma",
            "body": "Ewww ide of just thrown in out of the car of the freeway, nasty vermin deserve suffering before they die",
            "score": -7,
            "replies": [
                {
                    "author": "Flimsy_Imagination86",
                    "body": "You have one of the saddest comment histories I’ve seen in a while.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SatireSword",
                    "body": "\\-10/10 ragebait",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}