{
    "title": "How was Drogon freely flying in Valyria but when Balerion went to Valyria he was greatly injured?",
    "author": "TechnicianAmazing472",
    "subreddit": "gameofthrones",
    "rank": 0,
    "score": 604,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 73,
    "url": "https://i.redd.it/skufp5wrmgpe1.png",
    "id": "1je6jhw",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Livijing",
            "body": "Probably because he didn’t land. Can’t catch fire worms if you don’t dig in the dirt.",
            "score": 530,
            "replies": [
                {
                    "author": "Educated_Clownshow",
                    "body": "This. Drogon just flies over Valyria\n\nAerea hopped on Balerion and for more than a year, was missing. Balerion and Aerea very clearly landed in Valyria to get the wounds he got and she got a case of the dead’s eventually.",
                    "score": 233,
                    "replies": [
                        {
                            "author": "Livijing",
                            "body": "A better question is wtf was it that tore up Balerion the Black Dread so much?!? THAT’S something I wanna see!!!",
                            "score": 80,
                            "replies": [
                                {
                                    "author": "Educated_Clownshow",
                                    "body": "If GRRM wasn’t so damn old and behind on projects, it would be incredible for him to put down some framework that would cover up into the dance of dragons. \n\nI would love to watch something on Valyria, especially that",
                                    "score": 114,
                                    "replies": [
                                        {
                                            "author": "ljh2100",
                                            "body": "Let him know, he'll gladly add your idea to the list that sits above finishing The Winds of Winters 😆",
                                            "score": 40,
                                            "replies": []
                                        },
                                        {
                                            "author": "Crafterlaughter",
                                            "body": "I’d really like to see the Doom of Valyria and what led to that. As for Aerea, I think the mystery is part of what makes it so interesting.",
                                            "score": 45,
                                            "replies": [
                                                {
                                                    "author": "DekardN",
                                                    "body": "True, I’ve heard enough details about Aerea that I don’t want to know any more.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "boozillion151",
                                            "body": "I know everyone beats on GRRM, but *any* author of his caliber has their work meticulously written out far in advance. He's not just winging it and coming up with new ideas everytime he starts typing. He surely had the entire saga mapped out with more info than he will ever need (don't worry they'll print all that random note taking and boxes in the closet the second he's gone). \nMany books, especially those in series, are finished post mortem. \nNow everyone will hope he dies and some super-prolific Brandon Sanderson type takes over.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "LordCharidarn",
                                                    "body": "Martin has repeatedly said on his blog that his assistant has orders to burn his notes and the old DOS computer he writes on.",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "Sixpounder88",
                                                            "body": "He won’t do it, too much $$ to make",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "LordCharidarn",
                                                                    "body": "I doubt his assistant would make much money if there are legal documents stating what to do with Martin’s property.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Barbed_Dildo",
                                                                            "body": "There's a bit more legal nuance than \"if a will says burn everything, you have to burn everything immediately\".",
                                                                            "score": 6,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Livijing",
                                                            "body": "Oh my god!!! They better not! That is a crime against humanity! Honestly if they do that they are putting their life in jeopardy.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "GeoHog713",
                                                    "body": "Sure......",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Jonoabbo",
                                            "body": "He's a 76 year old man, let him chill. Guy has no obligation to work.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Educated_Clownshow",
                                                    "body": "Aside from this being a totally useless comment\n\nI have, on multiple occasions, stated that even if we never get WoW, the universe he put together is *still* one of the best we’ve ever had. \n\nPeople are allowed to make jokes about the “Its coming soon I promise” for more than decade guy, if it hurts your feelings, this might not be the sub for you. Lol",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Jonoabbo",
                                                            "body": "Never said it hurts my feelings, bit of a weird conclusion to draw. Hurling abuse at the elderly because they aren't still working is just a bit weird is all.\n\nWhat was the joke though? Just calling him \"Damn old\"? This wasn't an \"It's coming soon I promise\", it was just chucking out random insults.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Educated_Clownshow",
                                                                    "body": "“Hurling abuse at the elderly”\n\nWhat did I say that was abusive? Is old pejorative now? Or is pointing out missed deadlines now elder abuse?\n\nIn no way was I saying he has to keep working. Those of us who enjoy his content *want* him to finish his projects. \n\nThe 90 or so upvotes understood that my comment was playful, so for you, it’s either comprehension at issue, or there is a chip on your shoulder about something.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Jonoabbo",
                                                                            "body": "Calling somebody \"So damn old\" would definitely qualify as abuse. Go up to a stranger in public and say \"You are so damn old\", would definitely come across as an insult and abusive. I think you know this and likely don't need it explaining to you, so I'm not sure why you are asking. Of course calling an elderly person that you don't know \"So damn old\" is rude and insulting. \n\nIn my opinion, the 90 or so upvotes come from the commonly held opinion on this sub that this man in retirement years should keep spending the rest of his remaining years writing a fantasy novel for a series that the majority people have already rejected the ending of.",
                                                                            "score": -2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "National-Source-2414",
                                    "body": "That's the beauty of suspense. Not everything needs a lore explanation when our lack of information makes it so much more meaningful. Just like that painting of a dog looking at the dark abyss through a door ajar.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Wolfk1234",
                            "body": "A bad case of the deads",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LordCaptain",
            "body": "There are a few possibilities.\n\nTo start we don't know for sure that Balerion went back to Valyria. This was speculation by Septon Barth. It could be that he went somewhere else to receive those injuries.\n\nOn the assumption that she did though. It's possible this event didn't take place in show canon. Maybe Valyria just isn't as dangerous in the show universe as the books.\n\nAnother possibility is that certain sections of Valyria are more dangerous and they had a safer route, or that they just didn't happen to run into whatever harmed Balerion and infected Aerea. It's possible that it's specifically because they stuck to the waterways. I don't think those fire worms things that infected Aerea would be able to survive in waterlogged ground. Not hot enough. Balerion likely took Aerea closer to the volcanos where the ground was hot and dry. \n\nIt could be that Valyria has become safer overtime somehow.",
            "score": 95,
            "replies": [
                {
                    "author": "Vantriss",
                    "body": "I've always been under the impression her and Balerion caught the worms in Sothoryos. That place is supposedly riddled with all sorts of horrors. Isn't that where she came back from and reported she couldn't find an end to the land?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "o-055-o",
                            "body": "Different Targaryen, that one spent like 2-3 years flying over and exploring.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "LordCaptain",
                                    "body": "I think it wasn't even a Targayen. Just a Valyrian from before the doom.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "o-055-o",
                                            "body": "You are right, it was Jaenara Belaerys and she flew there for 3 years before calling it quits.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Vantriss",
                                    "body": "Hm, could have sworn that was Aerea.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Crafterlaughter",
                                            "body": "Nah, Aerea claimed Balerion and immediately disappeared for a year. When she came back she was really sick and only said, “I never..” before collapsing and dying within 24 hours. Balerion had a huge gash on his side a nobody knew what caused their injuries/illness.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Thereapergengar",
                                                    "body": "Well they lowered her body onto ice and the bumps under her skin started to move., then these slimmy things came out and made horrible\nSounds as they died on the ice.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Classic-Exchange-511",
                    "body": "Wait is it only speculation by septon barth? I thought whoever rode balerion said they went to valyria before she died?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "LordCaptain",
                            "body": "I believe I'm correct. I just googled it again to see and the wiki entries on Balerion and Aerea both say Barth speculated. I didn't dive back into the actual texts though because I'm at work so I'm not **100%** sure. I think it's the case though.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "darh1407",
                            "body": "All Aerea got to say was “ Please!…I never”. Before collapsing on the courtyard",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "Thereapergengar",
                                    "body": "Well they lowered her into ice and slimmy things came out from under her skin. It seems to me that those fire worms, use living things to incubate their young. And if ice was all it took to kill it. Theirs no way they’d be by the water ways.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "mocisme",
                                            "body": "Could be that the water there is warm (or at very least, not freezing). And it's the cold from the ice that killed them worms.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "themerinator12",
                    "body": "I think it's a waterways/outskirts sort of thing with the route that Tyrion/Jorah are taking. Whereas Balerion probably went closer to what could be considered the heart or center of Valyria could be. And perhaps Drogon was genuinely only flying over and didn't land, sleep, or spend any significant time there.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Jack1715",
                    "body": "What ever was there could have also died",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Thereapergengar",
                    "body": "I always figured those fire worms were vibrational hunters like so many other large under ground predators we see in tv.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "skratch",
                    "body": "I think you probably nailed it on the head w the show universe thing. They love ripping out anything magical or fantastical when they can",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "succubuskitten1",
            "body": "Show valyria is different than book valyria. In the books the place where tyrion sails around with the stone men isnt valyria, I think its called the sorrows. Book valyria is some kind of magical flaming hellscape and no one who has gone there since the doom has ever come back except for Aerea and book Euron (he might be lying though.)",
            "score": 59,
            "replies": [
                {
                    "author": "SandLandBatMan",
                    "body": "You're right it was called the Sorrows, I think it was the Rhoynish capital, or at least a large city on the Rhoyne. The show's version of Valyria does look a lot like the Sorrows with how foggy it was too.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beacon2001",
            "body": "Because that's F&B lore and F&B came out in 2018 while S5 was produced in 2014.",
            "score": 61,
            "replies": []
        },
        {
            "author": "Kratos501st",
            "body": "I have a friend that surfs he got bitten by a shark, I also surf and I have never been bitten by a shark. How is that possible? Same logic sometimes shit happens",
            "score": 26,
            "replies": [
                {
                    "author": "RagePoop",
                    "body": "lol so many theorists in the thread — which is fine, fun, and dandy — but this is the first thing I thought as well.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Kratos501st",
                            "body": "Sometimes the simplest answer is the right one, even in fantasy books or shows.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Khaki_Steve",
            "body": "Whatever attacked Balerion didn't attack Drogon. I don't think we have enough info to know why not.",
            "score": 48,
            "replies": []
        },
        {
            "author": "Effective_Ratio2432",
            "body": "Wasn't balerion there for years? What do you think is there besides fireworks. I'm pretty sure he was old asf when he went to Valyria. He had to land and it was probably tough for him to get back up coz he needed rest  from his flight from kings landing.  Then when he returned, he only flew one more time for vicerys(might of spelled that wrong). Dragon is on his prime and still young. Could get out of trouble if need be. Maybe he didn't have to land in Valeria. These are just my thoughts",
            "score": 7,
            "replies": [
                {
                    "author": "McEvelly",
                    "body": "Balerion lived for another 40 years after the Valyria incident and wasn’t claimed and ridden by anyone until that once by Viserys the year before he died. \n\nI’m sure he continued to fly plenty in that 39 year period, he just wasn’t claimed by any riders, as far as we know.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pipimer",
            "body": "Balerion go to Valyria Drogon flew above the smoking sea",
            "score": 5,
            "replies": []
        },
        {
            "author": "InnocentBunnyMaybe",
            "body": "He got bullied I guess",
            "score": 5,
            "replies": []
        },
        {
            "author": "McEvelly",
            "body": "The two incidents/visits were nearly 250 years apart.\n\nBalerion visited Valyria around 156 years after the Doom.\n\nWhatever was in Valyria 156 years after the Doom and injured Balerion - it could have been other pre-Doom dragons who had returned there from Sothorys for all we know - almost certainly had died by the time Drogon went there, around 400 years after the Doom.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rare_Grapefruit2487",
            "body": "Maybe because Drogon never actually went to Valyria. The picture shows Jorah as he sails down the Rhoyne. The river does not flow anywhere near Valyria.",
            "score": 7,
            "replies": [
                {
                    "author": "SandLandBatMan",
                    "body": "In the show they don't sail down the Rhoyne, they sail through Valyria and the stone men plot happens in Valyria. I don't think we ever see the Rhoyne other than its mouth in Volantis in the show.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Upturned-Solo-Cup",
                    "body": "You may be thinking of the books-I think in the show Jorah isn't taking Tyrion down the Rhoyne, he's taking him through the Smoking Sea",
                    "score": 2,
                    "replies": [
                        {
                            "author": "jaja9000",
                            "body": "Ironically one of the changes that started the major derailment of the show imo.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GaylicBread",
            "body": "It's not a fact Balerion went to Valyria, it's a theory, he could have gone somewhere else entirely and been attacked. \n\n\nBut assuming he did go to Valyria, It's likely he landed and spent quite some time there, he was the only being with a living memory of Valyria before the Doom so he would know it, but he wouldn't know what lives there now. We only see Drogon flying overhead as Jorah and Tyrion go through it, no indications Drogon landed or spent any time there.",
            "score": 5,
            "replies": []
        },
        {
            "author": "ComprehensiveDust197",
            "body": "In the show they mixed together The Sorrows and old Valyria. It also doesnt really make sense, that they are following a river. If they were sailing past valyria, this should be the smoking sea, which would look completely different and would be very deadly.",
            "score": 5,
            "replies": []
        },
        {
            "author": "darkse1ds",
            "body": "Its been hundreds of years, whatever attacked Balerion could simply be dead and there aren't any creatures of an appropriate size to challenge him. Magic has only recently been reintroduced to the world of GoT in this time whilst when Balerion was alive it was peaking before its decline.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Don11390",
            "body": "Valyria was big. Probably Drogon never went to wherever Balerion did. Or whatever attacked Balerion moved on. Or it died during the time between Balerion returning and Drogon visiting Valyria. Or, Balerion was injured somewhere else entirely; we really only have the septon's word that he was attacked in Old Valyria, even though he'd realistically have no idea if that was the case. Aerea died without confirming anything, since she was in extreme pain. Septon Barth just assumed that Balerion went back to what he knew; it was pure guesswork. \n\nAs to why Drogon went to Valyria? No clue. Maybe he picked it at random. There's no obvious reason given.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FarStorm384",
            "body": ">How was Drogon freely flying in Valyria but when Balerion went to Valyria he was greatly injured?\n\nDo you assume there's some magic barrier around Valyria that instantly adds injuries to a dragon that flies through it?  \n\nThen there's the fact it's 300 years later...\n\nAnd then there's the fact that this comes from Fire & Blood which wasn't written till years after this scene was filmed...\n\nThe fact that book canon and show canon are separate...\n\nLastly...there's no way to tell from this image if Drogon is actually flying over Valyria.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wide_Wrongdoer4422",
            "body": "Balerion was older than Drogon. The Black Dread was terrible in his day, but time caught up with him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "gorehistorian69",
            "body": "god. r/gameofthrones is painful to read sometimes.\n\nif you're being serious, Drogon doesn't go to Valyria. Canonically he hasn't left Essos. He currently just dropped Daenerys off in the Dothraki Sea after the Meereen fight pits. so around season 4 is where the story is.\n\nif just fun fan fiction theorizing. than i guess because he didn't land or encounter whatever Balerion did.",
            "score": 2,
            "replies": []
        },
        {
            "author": "trautsj",
            "body": "A lot of good points in other comments. Also it's been a good while since then and luck always plays a role. I hike a lot, sometimes I see animals that could kill me and sometimes I don't. That's just how it goes lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Atticus_Spiderjump",
            "body": "The show is canon to the show and the books are canon to the books. Balerion was injured in the books but it isn't mentioned in the show.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BleedingKnuckles69",
            "body": "That Balerion went to Valyria is speculation by Septon Barth. Balerion and Aerea were missing for over a year, he could have gotten those injuries elsewhere. Also the events of the show occur over 200 years after the death of Aerea, the place could have gotten safer with time. Or maybe its simply because drogon didn't land and stick around long enough to find out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "adamantium421",
            "body": "Full speculation mode on, but although balerion was injured, which tbh best guess at that time would be another dragon that survived the doom somehow, he could and probably did kill whatever attacked him. Dragons don't seem to run from fights easily.\n\nI suspect he defeated whatever it was and then went home with his rider who maybe only got hurt or infected during that moment.\n\nWe don't and probably will never know though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "freebiscuit2002",
            "body": "A different time, a different dragon…",
            "score": 1,
            "replies": []
        },
        {
            "author": "JPotential-706",
            "body": "Drogon is drogon",
            "score": 1,
            "replies": []
        },
        {
            "author": "Able1-6R",
            "body": "We should keep in mind that in the books this is not Valyria, you can’t approach Valyria as the seas begin to boil from the still active volcanos. In the books this is the land of the Rhoynar, where the Martells of Dorne have some ancestry. The show essentially bashed two civilizations together and cherry picked which lore to apply since the stone men originate from the river Rhoynar and that’s where the folks affected with Greyscale get sent to live out their days. No one gets sent to Valyria in the books, the only person to have (allegedly) visited the Doom and lived is Euron Greyjoy, though no one in the books confirms this since his crew have no tongues.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Malk-Himself",
            "body": "Drogon kind of forgot what happened to Balerion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Full_Piano6421",
            "body": "Because this is not Valyria.\n\n They mixed up the Sorrows with Valyria in the show.\n\nIn the books, it's not even possible to get close to the shores of Valyria without dying for most people. It's a hellscape of toxic fumes, volcanism and probably heavily mutated monsters. It seems to be even worse than the Shadow lands beyond Asshai.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Reyaric",
            "body": "Different canon. Asoiaf Valyria is more dangerous than GoT Valyria - there was no way that Tyrion and Jorah could have crossed Valyria if it was as dangerous as the one Balerion landed.",
            "score": 0,
            "replies": []
        },
        {
            "author": "AmazingBrilliant9229",
            "body": "Because whatever was there, Drogon killed it and avenged his ancestor. And that’s where Drogon took the body of Dany after the traitor Jon stabbed her.",
            "score": -3,
            "replies": []
        }
    ]
}