{
    "title": "Throughout the height of Valyria and all the years of riding dragons no one ever thought of a parachute?",
    "author": "PlungerMouse",
    "subreddit": "gameofthrones",
    "rank": 2,
    "score": 95,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 38,
    "url": "https://www.reddit.com/r/gameofthrones/comments/1jecjtw/throughout_the_height_of_valyria_and_all_the/",
    "id": "1jecjtw",
    "selftext": "Rhaenys, Lucerys, and countless others could have been saved. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low_Establishment434",
            "body": "This is the first unique thought I've seen here in quite some time. It does seem strange now that you mention it.",
            "score": 133,
            "replies": [
                {
                    "author": "PlungerMouse",
                    "body": "Oh thank you! I saw the Aemond taking a photo of Rhaenys falling meme and it came to me then. Surely someone has thought of this before? I searched the reddit for parachute and was shocked not to see it.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Low_Establishment434",
                            "body": "The maesters are really fucking up.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Breznknedl",
                                    "body": "the maester conspiracy: the maesters hate magic and anthing to do with it so they dont protect dragon riders as dragons are also big magic beings",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "OvechkinCrosby",
                                    "body": "Shhh, they’re coming….",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Key-Win7744",
            "body": "You know, you've got a really good point there. Medieval fantasy is supposed to take place in medieval times, of course, but necessity is the mother of invention. The unique fantasy aspects (which didn't exist in the true medieval period) should have spurred certain developments in the fantasy world. But instead, true to real life, all they ever have is mud and leeches.",
            "score": 45,
            "replies": [
                {
                    "author": "aksbutt",
                    "body": "Actually the first parachute designs basically do with the tail end of the medieval period- it's generally considered to have been around 475 AD until 1450 AD, and the earliest written design of a parachute is from 1470 AD, and then Da Vinci redesigned it.  Of course by that time it was firmly in the renaissance period, but certainly seems realistic that they would have had them in ASPIAF world.  If their were organic planes used in medieval times, I'm sure they would have developed way earlier than 1470s",
                    "score": 17,
                    "replies": [
                        {
                            "author": "AzorAhai96",
                            "body": "What was the reason for a parachute? Were balloons a thing already?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "aksbutt",
                                    "body": "Mankind has been building tall things and climbing tall things for thousands of years, I'd imagine it was related to that. \n\n[the Wikipedia page](https://en.wikipedia.org/wiki/Parachute#History) has some cool information in the history of it.  Even earlier than what i mentioned, is that:\n\n     In 852, in Córdoba, Spain, the Andalusian Armen Firman attempted unsuccessfully to fly by jumping from a tower while wearing a large cloak. It was recorded that \"there was enough air in the folds of his cloak to prevent great injury when he reached the ground.\"",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Swagasaurus-Rex",
                                            "body": "preventing great injury huh? What about moderate injury?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AffectionateAd147",
            "body": "Could it have something to do with arrogance? I’m sure having control of a dragon would do something to your ego, thinking your invincible and whatnot.",
            "score": 28,
            "replies": [
                {
                    "author": "Nw5gooner",
                    "body": ">\"It is the opinion of the board that the presence of such an apparatus might impair the fighting spirit of pilots and cause them to abandon machines which might otherwise be capable of returning to base for repair”\n\nThose are the words of the Air Board on the subject of issuing parachutes to RFC pilots during World War 1.\n\nI think you're right. It's totally believable that such inventions could have been offered  to Valyrian nobles over the years only to be snubbed that no true Valyrian dragon rider had use for such cowardly means of escape. Not least that  they may be looked down upon by other houses.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "AffectionateAd147",
                            "body": "Woahhhhh, really cool example. \n\nI’m not a ASOIAF reader so I don’t know too much about the context. But we’ve seen in HOTD that a dragon isn’t necessarily binded to a rider for life. So maybe when the targaryens were more plentiful it wasn’t crucial to save each one. It probably made it easier to control too if the most powerful riders suspected foulplay they can “get rid of” a troublesome rider using their dragon gap.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Pozilist",
                            "body": "Isn’t it also a little disrespectful to the dragon? They’re supposedly pretty smart. \n\nImagine you had some little creature riding you into battle, and it had a device to keep it alive in case you die. I think I wouldn’t like the implication of that.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Don11390",
            "body": "Maybe during the height of the Valyrian empire, it was. We know little about the internal politics of the ancient Valyrian people, and perhaps they were just too arrogant to consider the possibility that a dragon rider might need to escape from a dragon that died mid-flight. After all, Valyria controlled all the dragons, so they wouldn't necessarily have worried about things like that.\n\nAs for post-Aegon I-to-Dance of Dragons-Westoros? Again, the Targaryens (and certain close allies like the Velaryons) controlled all the dragons. The possibility of inter-dragon warfare was definitely a consideration, but not enough to think of things like parachutes. \n\nRiders were also usually strapped to their saddles precisely to prevent them from falling off. It's why Aemond was caught off guard when Daemon unbuckled himself from his saddle and jumped on him to stab him; it just wasn't done. Until it was.\n\nAnd yes, things like Meraxes getting killed by a scorpion bolt did happen, but the Targaryens saw this as very much an exception, not the norm.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Ethel121",
            "body": "That's a really good point. As far as I know, they theoretically have the technology for parachutes.\n\nDevil's Advocate:  \n  \nSuch technology might've existed in Valyria, but was lost. Besides, in a dragon vs dragon fight it turns you into a floating snack.   \n  \nThe Targaryens and dragons are so few in number that there probably wasn't much demand. Sure, an exclusive thing to help out the king might gain you favor, but it just as easily might be interpreted as an insult to imply their dragon might be slain.",
            "score": 7,
            "replies": []
        },
        {
            "author": "BlarneyBlackfyre13",
            "body": "It’s like being Amish, they just froze technological advancements at a random point in medieval history. A parachute invention would require a renaissance level inventor, such as Da Vinci, which would completely change the entire world.\n\nLike Edmund bringing an iPhone into Narnia and googling whether or not Turkish delights are supposed to be disgusting and then just uber eatsing some to the beavers house instead betraying his siblings. The story would just fall apart",
            "score": 3,
            "replies": []
        },
        {
            "author": "drewberry1738",
            "body": "Rhaenys yes- but was Lucerys not gobbled up?",
            "score": 2,
            "replies": [
                {
                    "author": "ozjack24",
                    "body": "He was eaten in the show but in the book it’s described as his dragon having his wing torn off and the two of them falling into the sea.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "drewberry1738",
                            "body": "Interesting, I didn’t know that. Thanks!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mdkynyc",
            "body": "Or at least like a bungee tether to stop them from falling completely. Maybe it was seen is abhorrent to the gift of the gods (dragons)",
            "score": 2,
            "replies": []
        },
        {
            "author": "boomer_energy_",
            "body": "Or even wings themselves!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Big_disppointment",
            "body": "They did. King's landing wasn't just a name",
            "score": 2,
            "replies": []
        },
        {
            "author": "GranFodder",
            "body": "I don’t wear a parachute when I’m riding Xerkarius, Shore Scourger because I believe in myself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Halkyos",
            "body": "I imagine parachutes just make you a slow falling target for dragon riders and ballistas.",
            "score": 2,
            "replies": [
                {
                    "author": "PlungerMouse",
                    "body": "I mean even for learning to ride. It would have made sense.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mkrishtop",
            "body": "Are you sure they haven't tried? Maybe dragons don't accept riders with the parachute. They are cruel and dangerous beasts with who knows what is happening in their brains.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Machdame",
            "body": "Parachutes are made from a specialized material that is both lightweight and durable enough to catch in the air. In medieval times, it might be a theoretical material, but there isn't a lot there that can be used to reasonably carry with you without it being unwieldy . Given that modern parachutes use synthetic fibers while having modern techniques like lamination, alternatives are unlikely to be as effective given the volume needed for a parachute. Given the material used by the Wright brothers for their first aircraft due to the light weight (muslin) it may be possible, but you would need a relatively large layered amount before you do anything with it (unless you are trying to make a fictional batman suit). For a decent sized parachute, you would more or less be carrying something that would make you look ridiculous. \n\nThis is ignoring some logistical issues like the fact that most of these materials are flammable and if you are in a dragon fight, the parachute may just end up being kindle before you even get to use it. \n\nBut even with all that noted, deployment is also an issue. The modern parachute has mechanisms to deploy them quickly and efficiently to do so, but even then, you are looking at a minimum height of 2000 ft or so for safe deployment. A dragon in danger won't even clear that height in a normal battle and of you are higher still, you may well just get attacked by the other dragon that you probably just lost against. \n\nOverall, you would be better served just winning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NumberMuncher",
            "body": "Do you wear a parachute on a commercial flight in case a door flies open and you get sucked out?  \n\nFalling off a dragon is a rarity.  Riders had saddles and were chained to them.  Warfare with dragons was fairly one sided with Valyria victorious.  Dragon vs. dragon was even more rare.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Trussita",
            "body": "Maybe instead of a more practical approach like a parachute, they just leaned into their overconfidence and thought they were untouchable. Velaryon hubris at its finest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "larionych",
            "body": "What's the point of a parachute if the dragon can turn around in mid-flight, and you on the parachute are the perfect target for a dragon snack?",
            "score": 1,
            "replies": []
        },
        {
            "author": "i_notold",
            "body": "Or saddles they could strap onto the dragons and then strap themselves into it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "VirginiaLuthier",
            "body": "Well- no one in the series ever fell off a dragon, so there's that",
            "score": 1,
            "replies": []
        },
        {
            "author": "AceMcNickle",
            "body": "To be fair this is on the continent where the Maesters have run a university with the largest library on the continent, and in the last few thousand years have made (checks notes) no new discoveries.",
            "score": 1,
            "replies": []
        },
        {
            "author": "darh1407",
            "body": "Why? Now you are just a tasty flying snack for the one who shot you down",
            "score": 1,
            "replies": []
        },
        {
            "author": "gaunterbox",
            "body": "It was one of the many arts lost in the doom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bagnorf",
            "body": "Well no one has tried falling from a great height on purpose. So no one would have ever conceived or fabricated a parachute.\n\nWhile it would seem practical, I would think that any dragonrider would want to have less weighing them down while they fly. A parachute would be cumbersome, and take time to deploy, not ideal when dragons can fly very close to the ground.\n\nNext is the logistics of stranding yourself in mid-air during a battle, if the opposing dragon won the fight, and you're falling to your death, you probably wouldn't want to make yourself super noticeable so a flying monster can finish you off with a bite, or just burn you and your very flammable parachute. If it is a major battle, the archers would have a fun time trying to arrow you directly, or damage the parachute enough that you fall.\n\nAlso the Targ's thought they were like gods, so the very idea of bailing out of a dragon fight would be so alien to them.",
            "score": 1,
            "replies": []
        }
    ]
}