{
    "title": "Doctors, patients try to shame insurers online to reverse authorization denials: “They just delay and delay and delay until you die. And you’re absolutely helpless as a patient.”",
    "author": "shallah",
    "subreddit": "progressive",
    "rank": 459,
    "score": 24,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 0,
    "url": "https://www.nbcnews.com/health/health-news/doctors-patients-try-shame-insurers-online-reverse-previous-authorizat-rcna101073",
    "id": "15yabpb",
    "selftext": "\n\nPrior authorization is a common cost-cutting tool used by health insurers that requires patients and doctors to secure approval before moving forward with many tests, procedures, and prescription medications. Insurers say the process helps them control costs by preventing medically unnecessary care. But patients say the often time-consuming and frustrating rules create hurdles that delay or deny access to the treatments they need. In some cases, delays and denials equal death, doctors say.\n\n\nThat’s why desperate patients like Nix — and even some physicians — say they have turned to publicly shaming insurance companies on social media to get tests, drugs, and treatments approved.\n\n“Unfortunately, this has become a routine practice for us to resort to if we don’t get any headway,” said Dr. Shehzad Saeed, a pediatric gastroenterologist at Dayton’s Children’s Hospital in Ohio. In March, he tweeted a photo of an oozing skin rash, blaming Anthem for denying the biologic treatment his patient needed to ease her Crohn’s disease symptoms.\n\nSnip\n\n“They take in premiums and don’t pay claims. That’s how they make money,” said Dr. Linda Peeno, a health care consultant and retired Kentucky physician who was employed as a medical reviewer by Humana in the 1980s and later became a whistleblower. “They just delay and delay and delay until you die. And you’re absolutely helpless as a patient.”\n\nBut there’s reason to hope things may get marginally better. Some major insurers are voluntarily revamping their prior authorization rules to ease preapproval mandates for doctors and patients. And many states are passing laws to rein in the use of prior authorization.\n\n“Nobody is saying we should get rid of it entirely,” said Todd Askew, senior vice president for advocacy at the American Medical Association, in advance of the group’s annual meeting in June. “But it needs to be right-sized, it needs to be simplified, it needs to be less friction between the patient and accessing their benefits.”\n\nCustomers are increasingly using social media to air their complaints across all industries, and companies are paying attention. Nearly two-thirds of complainants reported receiving some sort of response to their online post, according to the 2023 “National Consumer Rage Survey,” conducted by Customer Care Measurement & Consulting in collaboration with Arizona State University.\n\n\nSome research suggests companies are better off engaging with unhappy customers offline, rather than responding to public social media posts. But many patients and doctors believe venting online is an effective strategy, though it remains unclear how often this tactic works in reversing prior authorization denials.\n\n“It’s not even a joke. The fact that that’s how we’re trying to get these medications is just sad,” said Dr. Brad Constant, an inflammatory bowel disease specialist who has published research on prior authorization. His work found that prior authorizations are associated with an increased likelihood that children with inflammatory bowel disease will be hospitalized.",
    "comments": []
}