{
    "title": "do I get a 1080 as a budget card  or not for my first PC build",
    "author": "Immediate_Mind_5452",
    "subreddit": "buildapc",
    "rank": 12,
    "score": 15,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 62,
    "url": "https://www.reddit.com/r/buildapc/comments/1je1o4z/do_i_get_a_1080_as_a_budget_card_or_not_for_my/",
    "id": "1je1o4z",
    "selftext": "I have no idea since its cheap and I heard its good",
    "comments": [
        {
            "author": "Overall-Cookie3952",
            "body": "Don't listen to 1080 dickriders.\n\n\nIt's a 10 years old card. It lack a modern upscaler and RT. \n\n\nAnd the card itself would probably be in a bad status. \nIf you want something cheap buy a 4060 or something like that ",
            "score": 73,
            "replies": [
                {
                    "author": "atonyatlaw",
                    "body": "As always, it depends on the price and budget.\n\nA used 1080ti might be found around $100 if you look hard enough.\n\nA 4060 will undeniably be more than that.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Overall-Cookie3952",
                            "body": "A 1080ti could break after 5 minuts you installed it.\n\n\nA 4060 would at least have a warranty. ",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Immediate_Mind_5452",
                    "body": "Oh ok",
                    "score": 5,
                    "replies": [
                        {
                            "author": "dunkindeeznuts2",
                            "body": "For the right price its pretty good, but accept that you will have to upgrade later, since more new games require ray tracing. Maybe spend a little more, and get a 2070 or 3060/70",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "atonyatlaw",
                            "body": "Don't take this reply as gospel. The answer to this depends a great deal on price of the card, budget, the resolution you intend to play at, what games you're likely to play, and more.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Loupojka",
                    "body": "For 1080p, none of that stuff matters. You can save a lot of money in PC building by not chasing 4k like a rabid dog.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Overall-Cookie3952",
                            "body": "RT matter a lot since we're getting games with mandatory RT.\n\n\nAnd in any case the 4060 have better raster performance than a 1080.\n\n\nAnd a 1080 draws double the power, and electricity and psus cost money. \n\n\nYou also need to consider drivers, the GTX 10xx will not be supported forever. ",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "readdyeddy",
                                    "body": "dont worry about electricity or psu cost. the 1080 can run with 600w psu. ive already checked the voltage rails.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Immediate_Mind_5452",
                            "body": "1080p is MORe the enought 4k dosent even change that much",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "El--Joker",
                    "body": "Cant talk about RT and a 4060 in the same context. And 350 aint cheap for a low end gpu.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Overall-Cookie3952",
                            "body": "We can Indeed talk about RT with a 4060, since there are games that require RT and can run on a 2060.\n\n\n350 euro are too much for a 4060, but you could find some for 250",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "El--Joker",
                                    "body": "Alan Wake 2 doesnt(or didnt) run on the 1080 due to modern tech that aint RT. Youre better off saying modern titles. Bare minimum vs the actual really makes a difference. And theres no *new* 4060 under 350 listed online. And a used one at 250 really aint great, a used 2070 will last just as long due to vram and only costs 100",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "drake22",
            "body": "I got a 1080 ti for $100 recently. Honestly pretty legit for that price. Won’t be able to play modern games with high settings, but can play just about anything with the proper resolution and settings.",
            "score": 10,
            "replies": [
                {
                    "author": "Immediate_Mind_5452",
                    "body": "I found one for 60 LOL",
                    "score": 8,
                    "replies": [
                        {
                            "author": "atonyatlaw",
                            "body": "Jump on that shit. You won't find a better budget card for anywhere near that price.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Dabox720",
                            "body": "I only just recently upgraded my 1080. It ran everything I played at 1080p resolution perfectly fine. I only upgraded as I wanted to specifically play new titles at max graphics at 1440p\n\n60 bucks sounds like a great deal and ideal for a budget card, but I dont know the quality, condition, or brand of the card.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "KonyYoloSwag",
                                    "body": "What card did you end up replacing your 1080 with? Just curious as I am still using a 1080 myself",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ime1em",
                            "body": "Make sure it's not defective. My 1080ti can only game without crashing by limiting the power to like 50%",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Confident_Natural_42",
                    "body": "For $100, yeah, it's a great deal. But they go for 200 more often than not, and there's a \\*lot\\* more capable competition at that price point.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "randomrstalk",
            "body": "depends on your country if your somewhere with restricted tech or not, if not id look into a used 3060 should be around 150-200$ and newer hardware for dlss/rt and newer so less chance for aged failure and more recent driver support for modern software",
            "score": 4,
            "replies": [
                {
                    "author": "Immediate_Mind_5452",
                    "body": "Yeah possibly",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Massive-Exercise4474",
            "body": "Honestly right now with the prices and lack of stock. I got a prebuilt with a 4060 for about 20% off the price of the parts.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DarthReLust",
            "body": "3060ti used or AMD equivalent card",
            "score": 2,
            "replies": []
        },
        {
            "author": "BenCelotil",
            "body": "Brand new Intel Arc A770 with 16GB RAM are as cheap as USD$250 now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LCJonSnow",
            "body": "I'm on a 1080ti right now.  It's beginning to fail at running new games reliably at 1080p medium.  CoD was fine.  KCD2 was great.  Monster Hunter Wilds it's absolutely terrible.  \n\nDepending on what you want to play and at what resolution, it *might* be fine for a little while, but I'd really recommend spending the extra money and getting something that isn't in the middle of it's swan song.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mysickfix",
            "body": "4060’s aren’t too expensive and mine handles everything I throw at it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DuuhEazy",
            "body": "Depends on the price",
            "score": 1,
            "replies": []
        },
        {
            "author": "R-Didsy",
            "body": "Hey man, I might be able to help you here.   \nI've put together a budget machine from left-over parts for a friend, and we're using a GTX 1080.  \nI've got some numbers using Armored Core 6 as a reference.\n\n* CPU: i5-10600kf \n* GPU: GTX 1080 \n* Storage: Samsung 860 Evo \n* Memory: 16gb Ram\n* Game: Armored Core 6 \n\n* 4k resolution, lowest graphics settings: Reliably 50 to 60fps\n* 4k resolution, high graphics settings: Reliably 30 fps. Did hit 40 sometimes.\n* 1920x1080 resolution, high graphics settings: Reliably 50 to 60fps\n\n  \nWe're hoping we can probably find some settings to play Space Marine 2, smoothly.  \nI'm pretty confident something like Baldurs Gate 3 will run very well on a machine like this.",
            "score": 1,
            "replies": [
                {
                    "author": "Immediate_Mind_5452",
                    "body": "ive found  a resseller selling their old 4060 for 300 dollars so id probably get that unless I find out  its a scam",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Azors",
                            "body": "I wouldnt buy a 4060 for dogshit, that card is the enemy of this hobby for me.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Immediate_Mind_5452",
                                    "body": "why?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Immediate_Mind_5452",
            "body": "Ill get a a 3070 I dont need that good gaming tehnology I just want to  run CS go minecraft and those light games right now I can run cs go at 10fps  minecraft at 30fps with  lowest settings and I cant even run TF2",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soggy-North4085",
            "body": "Nah man go for the upgrade if you can. 40 series or AMD.",
            "score": 1,
            "replies": []
        },
        {
            "author": "capnduke",
            "body": "Something to consider is whether you want to be able to play any games that are coming out in the future. Indiana Jones, and many AAA games that are slated for release, will likely have Ray tracing as a minimum requirement. So I wouldn't personally want to be getting into anything less than a 20 series Nvidia card or a 6600 for AMD, cause I'm fine with low settings but I would hate to be limited like that. If you know you're only going to play current titles and have no plans to branch out, knock yourself out tho.",
            "score": 1,
            "replies": [
                {
                    "author": "Immediate_Mind_5452",
                    "body": "I dont need high end modenr games I just want to play normal  games that dont require insane graphics",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SlickRick734",
            "body": "Get a 2080. They're also cheap and they have ray tracing. My standard 2080 is still rocking games from 2020 and earlier with High/Ultra settings, on 1440p.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Immediate_Mind_5452",
            "body": "also thank you all for the help",
            "score": 1,
            "replies": []
        },
        {
            "author": "drkstrkr20",
            "body": "as a 1080 user dont get it cant even play mhwilds on it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Booshakajones",
            "body": "Either go AMD, or snag at least a 2060super you wanna take advantage of DLSS if you go Nvidia. \n\nWith that being said I only just upgraded last year and had a 1070ti. If you're on 1080p that thing ran almost any game at high settings 70+ fps so a 1080 running @1080p is gonna be just fine for you. Especially if you have a library full of older games like I did. \n\nHowever if you push that card to 1440p you are gonna wish you had DLSS.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Joonesn",
            "body": "Get a 3080 or something in that era. Very budget friendly now a days and will do you well for a bit.\n\nIf you are interested i have a 3080TI I just replaced and would be down to sell it! Dm me :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tech_support_Warrior",
            "body": "Take it from someone who had a 1080TI running on a PC until January.\n\nThe 1080 and the 1080Ti are getting long in the tooth. I sold the PC with the 1080Ti to someone who plays indie games like Dave the Diver and they are loving it, but for playing more modern games is was starting to get hiccups.\n\nI upgraded that PC to a 3070Ti and the user is much much happier.  If you are buying used look for something from the 3000 or 4000 series. If you are planning on buying new, buy a 4060.\n\nIf you don't need Nvidia, look into AMD.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrFreeLiving",
            "body": "1080 ti is fine, 1080 normal is not so good. Also it's only good for 1080p gaming, ideally if your budget is around $200 for the GPU then you should go for something better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mediocre-Compote4526",
            "body": "I had a 1080ti till a few days ago and changed it for a 7800xt, I’d recommend 4060 or maybe a 7600xt on the Radeon side.",
            "score": 1,
            "replies": []
        },
        {
            "author": "craigmorris78",
            "body": "What’s your use case and budget? It’s v v old now. Second hand 3080s are great value near me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "clarence_worley90",
            "body": "no, just get a used 4060 or something",
            "score": -2,
            "replies": [
                {
                    "author": "Confident_Natural_42",
                    "body": "They're hardly at the same price point, though... the 4060 is easily double or even triple the price of a 1080.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "atonyatlaw",
                            "body": "More than that even - he said elsewhere the 1080 was only $60 for him.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AlhazredEldritch",
                    "body": "Can confirm. I use a 4060ti. I'm not a serious gamer but this card is perfect for me. I easily run my meh games at 1080 and higher at good enough fps.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "KK1927",
                            "body": "i bought gt710 and i can play any game I WANT, so i recommend it to buy (that’s what you are saying)",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "AlhazredEldritch",
                                    "body": "Sure. 2gb is definitely the same as 8gb. So right you are. This is a forward thinker here everyone. \n\nIf he really didn't want to be a little B, he would get a 9999zz AMD GPU and get them frames boiiiii. \n\nGrow up.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "buildapc-ModTeam",
                                                    "body": "Hello, your comment has been removed. Please note the following from our [subreddit rules](https://www.reddit.com/r/buildapc/wiki/rules):\n\n**Rule 1 : Be respectful to others**\n\n> Remember, there's a human being behind the other keyboard. Be considerate of others even if you disagree on something - treat others as you'd wish to be treated. Personal attacks and flame wars will not be tolerated.\n\n\n\n---\n\n[^(Click here to message the moderators if you have any questions or concerns)](https://www\\.reddit\\.com/message/compose?to=%2Fr%2Fbuildapc&subject=Querying mod action for this comment&message=I'm writing to you about %5Bthis comment%5D%28https://old.reddit.com/r/buildapc/comments/1je1o4z/-/mif98ep/%29.%0D%0D---%0D%0D)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "KK1927",
                                            "body": "you grow up, recommending rtx 4060.\n\ni meant that no one gives a f that it’s perfect for you.\n\n„Can confirm. I use a gt710. I'm not a serious gamer but this card is perfect for me. I easily run my doom at 1080 and higher at good enough fps”",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Immediate_Mind_5452",
                    "body": "what is the cost?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Immediate_Mind_5452",
                    "body": "Actualy a good idea I found some 4600 in my country for 300 bucks is that a scam or?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Loupojka",
                            "body": "idk what currency you’re using but a 4060 for 300 USD is fair. That said, the 1080 is a very decent card. Budget card, absolutely will work. For 90% of online multiplayer titles, it will be perfectly fine. For something like the new Monster Hunter game though, it will struggle.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Professional_Arm794",
            "body": "Depending on budget, I would consider a used 3070ti or 3080. \n\nI’m upgrading my 3080 to a 5090. Plan is to sell the 3080. It works fine , I always upgrade every two generations. Im sure a lot of others do the same. So you should be able to find a good used gpu in this market since so many people are upgrading.",
            "score": 0,
            "replies": [
                {
                    "author": "Confident_Natural_42",
                    "body": "Those easily cost hundreds and hundreds, several times more than a 1080. They're not \"budget\" cards in any sense of the word.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Immediate_Mind_5452",
                            "body": "1000 is my MAX cost",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Adept_Development204",
            "body": "Get a 1080 ti instead. I am still using mine 7 years later. They are beasts.",
            "score": 0,
            "replies": []
        }
    ]
}