{
    "title": "Monthly Fitness Pro-Tips Megathread",
    "author": "AutoModerator",
    "subreddit": "Fitness",
    "rank": 6,
    "score": 20,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/r/Fitness/comments/1jbr12i/monthly_fitness_protips_megathread/",
    "id": "1jbr12i",
    "selftext": "**Welcome to the Monthly Fitness Pro-Tips Megathread!**\n\nThis thread is for sharing quick tips (don't you dare call them hacks, that word is stupid) about training, equipment use, nutrition, or other fitness connected topics that have improved your fitness experience.\n\nThis is **not** a questions thread. Do not ask for help or advice in here.",
    "comments": [
        {
            "author": "JubJubsDad",
            "body": "To get big and strong you need consistent effort in the gym *for a long time*. \nSo for most of us, the ‘optimal’ workout is the one that we enjoy, because if it’s not fun you’re not going to stick to it.",
            "score": 35,
            "replies": []
        },
        {
            "author": "Ruby__Ruby_Roo",
            "body": "Golfers elbow - which is tendonitis causing pain inside the elbow - I fixed mine completely with reverse wrist curls, two sets of 14ish reps twice a week.",
            "score": 6,
            "replies": [
                {
                    "author": "tartarus2",
                    "body": "Would forearm roller, rolling upwards, produce similar results?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ruby__Ruby_Roo",
                            "body": "No. Using something like a forearm roller may alleviate pain in the moment but in order to *fix* the problem and prevent it from happening recurrently, you need to *strengthen* the muscles and tendons that are being stressed. \n\nFor me and a lot of others I have spoken to, this problem occured and got worse as I started getting strong enough to do things like heavy RDLs, which were putting stress and pressure on that muscle and tendon. The reverse wrist curls made those stronger.\n\nThe reverse wrist curls aren't just to alleviate symptoms.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Such_Position_4748",
                    "body": "Do you perform the wrist curls with a straight arm or bent at the elbow? I have horrible pains in my elbow I’d like to get rid of. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ruby__Ruby_Roo",
                            "body": "Bent elbow, resting on my knee. I keep my forearm parallel with the floor. \n\nYou could also look into the Theraband flexbar, which is a rehab tool that physical therapists use for elbow tendonitis.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Such_Position_4748",
                                    "body": "Thank you!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ruby__Ruby_Roo",
                                            "body": "I hope it helps!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CustomGains",
            "body": "Supplements are for supplementing not the foundation. Nutrition is king. Vitamins and minerals are the biggest scam if you havent done blood workout and gotten hormones checked. Supplements are great for getting 10-20% more of an increase in life and fitness. But again diet and nutrition is the starting point.",
            "score": 6,
            "replies": []
        },
        {
            "author": "EliteAccess23",
            "body": "Track your nutrition, at least for a period of time, when starting out to better familiarise yourself with calories and macros for what you're looking to achieve (bulk, cut or maintain). People tend to under-eat protein in particular when eating intuitively and this often results in training for months and seeing little to no progress.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HelixIsHere_",
            "body": "Dropsets, and any sort of “intensifier” to an extent, are just not worth doing at all unless you want a good pump. The stimulus to fatigue ratio falls off VERY hard and dropsets aren’t shown to lead to an increase in hypertrophy. They really just build up fatigue and make it harder to perform your best afterwards + in following sessions",
            "score": 3,
            "replies": [
                {
                    "author": "tbone603727",
                    "body": "I disagree with this. If you have time constraints, they are an excellent way to maximize the volume you can do it a short amount of time. They're great for busy people",
                    "score": 4,
                    "replies": [
                        {
                            "author": "HelixIsHere_",
                            "body": "Yeah actually that’s mb, dropsets or supersets preferably are actually not the worst if you have quite limited time in the gym",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "It looks like you're trying to use a URL shortener. This is usually a tricky tactic to hide bad content, so your post has been removed. Please update your post to use actual links and then **[message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2FFitness&amp;subject=Please+reapprove&amp;message={{url}}%0A%0AI have fixed my shortened links.)** to have it approved.  \n\nIf you want a cleaner looking comment, the markdown for that is: [Hyperlinked Text](The URL).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}