{
    "title": "Moronic Monday - Your weekly stupid questions thread",
    "author": "cdingo",
    "subreddit": "Fitness",
    "rank": 2,
    "score": 55,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 300,
    "url": "https://www.reddit.com/r/Fitness/comments/1jd6r4k/moronic_monday_your_weekly_stupid_questions_thread/",
    "id": "1jd6r4k",
    "selftext": "Get your dunce hats out, Fittit, it's time for your weekly Stupid Questions Thread.\n\nPost your question - stupid or otherwise - here to get an answer. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer. Many questions get submitted late each week that don't get a lot of action, so if your question didn't get answered before, feel free to post it again.\n\n###**As always, be sure to read the [FAQ](https://thefitness.wiki/faq/) first**.\n\nAlso, there's a handy-dandy **search bar to your right**, and if you didn't know, you can also use [Google](https://www.google.com/) to search fittit by using the limiter \"site:reddit.com\\/r/fitness\".\n\nBe sure to check back often as questions get posted throughout the day.  Lastly, it may be a good idea to sort comments by \"new\" to be sure the newer questions get some love as well. [Click here to sort by new in this thread only.](https://old.reddit.com/r/Fitness/comments/1jd6r4k/moronic_monday_your_weekly_stupid_questions_thread/?sort=new)\n\nSo, what's rattling around in your brain this week, Fittit?\n \n---\n\nKeep jokes, trolling, and memes outside of the Moronic Monday thread. Please use the downvote / report button when necessary.\n\n---\n\n\"Bulk or cut\" type questions are not permitted on /r/fitness - Refer to the FAQ or post them in r/bulkorcut.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "# Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "hrvoje42",
            "body": "What would happen if I stopped taking creatine for a month? I'm going on a 3-4 weeks vacation to Thailand soon, I'd prefer not to carry a bag of white powder there. \n\nShould I get creatine pills? Or should I just not worry about it and resume normally once I get back? \n\nI also won't work out while I'm there",
            "score": 6,
            "replies": [
                {
                    "author": "Alakazam",
                    "body": "Just don't worry about it.\n\nThe point of creatine is basically to allow you to push a little bit harder in the gym. If you're not training, it'll basically have zero effect.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "gatorslim",
                    "body": "just enjoy your vacation.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "bassman1805",
                    "body": "If you stop for a month and then restart after your vacation, you *might* have slightly shitter workouts for the first couple of weeks back. But, you'll probably have some shitty workouts anyways if you aren't working out on vacation. You'll lose a tiny bit of strength, and get sore as hell after the first few workouts. So it'll take a couple of weeks to get back to normal anyways.\n\nWere I in your shoes, I'd just forget about taking creatine and resume after your trip.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "rakiim",
                    "body": "Enjoy your vacation you'll be fine in a month or two after coming back. Fitness is a life long journey after all",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crowarior",
            "body": "What's this sweet taste I get in my mouth after a really hard set?",
            "score": 5,
            "replies": [
                {
                    "author": "GingerBraum",
                    "body": "Victory.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "DayDayLarge",
                            "body": "😂",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SplandFlange",
            "body": "Not a question but a tip. I travel a lot for work and used to have 3 gym memberships like a dingdong. Through my healthcare they have a wellness program where i pay them a bit more per month and i can go to a ton of gyms. It is cheaper than the cheapest membership i had and i can still go to the same 3 gyms. Hopefully this helps someone else!",
            "score": 6,
            "replies": []
        },
        {
            "author": "PoorDoddle",
            "body": "Any tips on unracking bench? My forearms get insanely tired from benching, and I feel like I'm using all forearms when unracking.\n\n\nEdit: Apperently, I had deleted the form video. It felt fine in this video, but I don't have any other. https://imgur.com/a/rUtIFyK",
            "score": 3,
            "replies": [
                {
                    "author": "HelixIsHere_",
                    "body": "I think you’re screwed unless you can just put the rack higher",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PoorDoddle",
                            "body": "Hmm, that might be why. I remember feeling uncomfortable with the bench here when I first started since it was low. Thanks.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zlushiie",
                    "body": "I like to setup my bench by getting right under the bench with my hands where I want them, then pulling my feet as far towards my upper body as I can and planting them, then to lift off I drive my shoulders into the bench as hard as possible with my butt off the bench, unrack, set my butt down, and then lift.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Zlushiie",
                            "body": "https://youtube.com/shorts/7a-B2jEk-ag?si=RtAp-YXGgSWtFsX4\n\nHere's a yt vid similar to what I do",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PoorDoddle",
                                    "body": "Thank you. I will give it a try.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CursedFrogurt81",
                    "body": "It looks like the bar is sitting too far back in your hand.  Try keeping the bar over your wrist on the heal of your hand.  Otherwise, the weight is pulling your hand back, and perhaps your forearms are having to resist this?\n\nIt is somewhat hard to say, but it looks like your setup is good.  General advice I give on unracking.  Back tight, lift your butt off the bench to pin your upper back, think push into the bench and not lift the bar, perform a lat pull down to unrack the weight.  Looks like you are doing most of those things?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thestoplereffect",
                    "body": "Apart from keeping your wrist neutral, how would you rate your forearm mobility/flexibility? Try the following:   \n>Extend your arm straight out (palm facing down).    \n>Bend your wrist down so hand is perpendicular to arm.    \n>Fold thumb across palm   \n>Curl fingers over thumb.    \n>Imagine something pushing on the back of your hand, curling it in further.    \n   \nWith each step, you should feel a progressively deeper stretch on the underside of your arm (along your extensors). If any step is too painful, I'd recommend throwing in a couple stretches before you even start the lift to help everything move as it should.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Alakazam",
                    "body": "[I found this video years ago and have been using this technique for a self-unrack for everything, even in powerlifting meets](https://www.youtube.com/watch?v=zm0KuDe0v0g)\n\nUnracked and pressed 145kg with it without issue.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RKS180",
                    "body": "It looks like your wrists are extended (bent backwards). Your forearms are supporting the weight, which will lead to fatigue and eventually pain. \n\nYou should have neutral wrists (like in this [diagram](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTybXGo_Pn0qWxv6vGvfTeVCSfUCZfJ-Vz8og&usqp=CAU)) with the barbell at the heel of your palm, so the weight gets transferred through your forearm bones into the bench (\"stacked joints\").\n\nYou should be gripping the barbell tight, but your forearms shouldn't get tired doing that because they're not supporting the weight.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PoorDoddle",
                            "body": "Thank you. Accidently doing isometric wrist extensions when benching has gotta be the next level grip training. Since it felt fine in the video, my actual form must be diabolical. Kinda explains why my forearms are strong, and why I can't cure my wrist pain. ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "RKS180",
                                    "body": "Well, that made me laugh. Hope this and the other replies help you bench more…and more comfortably.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 3,
            "replies": [
                {
                    "author": "GingerBraum",
                    "body": ">Why is it so damn hard to get into shape after falling out of shape?\n\nCliché answer: because if it were easy, everybody would be in shape.\n\nIf you want results more than you want to be a couch potato, you'll find the discipline(not motivation) to do it. If not, there's nothing wrong with quitting. Fitness isn't for everyone.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Centimane",
                    "body": "> You need to eat right literally every day in a caloric deficit, you need to go to the gym 4-5x a week and actually give 100% and feel the discomfort of exerting yourself for 30-60 mins per session. \n\nIt doesn't need to be this difficult.\n\nI found food tracking was very helpful in *actually* hitting a calorie deficit reliably. The biggest issue I had was just not being aware of how much calories some things were - they were tanking my calories and not worth it. Some things are definitely worth cheating for, others are not.\n\nAnd you just have to be more under than you are over to lose weight. How consistent you are determines the speed, but if you want it to be easier a 100-200 calorie deficit and 20 minutes of cardio a day (jogging/cycling/swimming/etc. - more than just walking) would be enough to lose weight (about 0.5 pound per week).",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "FatStoic",
                    "body": "> Why is it so damn hard dude. I either need it to be easier, or I need to see results quicker to keep motivated. I don't have an endless well of motivation to just keep doing everything right for months and months and keep going despite not seeing any progress.\n\nDo it right for 8 weeks\n\nlose 8 lbs\n\ntake a break, relax, eat at maintenance, still get fit, feeling and looking better all the time\n\ntake another bite at the weightloss\n\nit's a marathon, not a sprint",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "NoCollegeKids",
                    "body": "Just get on Trizepitide.  That’s what everyone else is doing.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "imVeryPregnant",
            "body": "I took a couple months off from the gym and started a new program that starts out with high frequency lifts (like 10-15 reps instead of 3-5) and I gotta say, it’s killing me. Is this normal? After 3x10 squats, I feel like I can’t really do any more leg work because I’m soooo tired. I usually do lower reps higher weight so this is a bit different. I also never do cardio…",
            "score": 2,
            "replies": [
                {
                    "author": "Alakazam",
                    "body": "Yes, this is normal. In fact, I would say this is beneficial to you in the long run, because you're finding that you're weak in the higher rep ranges, which is indicative of an overall lack of conditioning and/or muscular endurance.\n\nGood programs will train you in a variety of rep ranges for a reason.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "dssurge",
                    "body": "Is it normal? Yep. Whether or not it's beneficial to train like that is highly debatable. \n\nConditioning is **much** easier to do without a barbell on your back, and when sets end up getting broken into chunks based on if you can breathe or not, it's hard to assess muscular fatigue properly. This can result in both a poor strength building exercise, and a really mediocre cardio session. This ain't HIIT.\n\nI personally don't train much above the 8 rep range for compounds because my conditioning is admittedly poor, but it's also not something I'm actively trying to improve. If I were, I *absolutely* wouldn't pick lifting weights as the strategy to do it.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "milla_highlife",
                            "body": "To be fair, the most specific way to condition yourself for high rep sets is to do high rep sets. \n\nYou can do as many emom burpees as you want, but it won't feel like a 20 rep squat set.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JubJubsDad",
                    "body": "Yup, 100% normal. \nEven without the break if I switch from low to high rep sets it destroys me. \nI hate to say it, but cardio really helps with this.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "NOVapeman",
                    "body": "Yes, it is normal; keep doing it and do some conditioning on your off days",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "indianajane13",
                    "body": "Sounds like you are building better endurance. I think it's a good thing. You're building strong connective tissue. Working in all the rep ranges throughout the year, is usually recommended.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Timely-Bumblebee-402",
            "body": "If I keep my cardio consistent, will my hands stop filling with blood while I'm on walks? It's so uncomfortable how swollen they feel but I don't feel like walking in a public gym with my hands above my head",
            "score": 2,
            "replies": [
                {
                    "author": "dssurge",
                    "body": "That sounds like a circulatory problem and you should ask your doctor.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Timely-Bumblebee-402",
                            "body": "If only I could afford one!",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Stuper5",
                    "body": "That's not super normal. Have you spoken with a doctor about this? It could be a symptom of various cardiovascular disorders.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Timely-Bumblebee-402",
                            "body": "Bold of you to assume I can afford a doctor, haha. I have athsma so I know i have some cardiovascular issues but when I Google \"Hands swelling while on walks\" there's a lot of people talking about it",
                            "score": -7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bethskw",
                    "body": "There are some tips here: [https://lifehacker.com/why-your-hands-swell-when-you-run-or-walk-and-what-to-1850770500](https://lifehacker.com/why-your-hands-swell-when-you-run-or-walk-and-what-to-1850770500)",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "teachloveandcoffee",
            "body": "I just signed up for a gym membership. I am 225lbs 5”5 with a bad lower back & knees. My main goal is fat loss. Tips, tricks, and advice would be appreciated! But my “stupid question” is where do I start when I walk in the gym?",
            "score": 2,
            "replies": [
                {
                    "author": "Memento_Viveri",
                    "body": "The wiki for this sub has answers. Probably best to start here but read most of the way of the wiki. It isn't long:\nhttps://thefitness.wiki/getting-started-with-fitness/",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Soccermad23",
                    "body": "If your main goal is fat loss, then make sure your diet is under control first (this is more important for this goal than going to the gym ever will be).\nAs for what to do in the gym, start with light cardio (walking and light jogging is good to start) and start following a basic beginners program in this subreddit.\nThe first month is the most difficult because you're making sacrifices and learning something new - try to stick with it and you don't have to go too hard (although you should still push yourself). Once you start noticing a difference (i.e. some lost weight and some muscle forming), it becomes addicting and you will want to push yourself harder - at this point, really dial in your diet and follow a good program (there are many to choose from).",
                    "score": 5,
                    "replies": [
                        {
                            "author": "teachloveandcoffee",
                            "body": "Thank you so much for the advice. I am down a little over 100 lbs, so I do feel that I have a handle on the diet for now. I know as I progress at the gym my calorie intake will need adjusting. I truly appreciate your advice.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Soccermad23",
                                    "body": "Oh wow, I didn't realise that you had already lost a lot of weight! That's great and honestly good on you - that is crazy good progress!\n\nNow regarding changing your diet when you add in gym work, be careful. If you're doing resistance training (i.e. heavy weights), you're not actually burning that many calories, so better to just keep your same deficit. If you're adding in cardio, you can up your calories a little bit, but not by a lot.\n\nThe big change, however, is changing your diet proportions. You want to ensure you are getting enough protein to build muscle, but also, don't overlook a healthy amount of carbs before training to give you the energy you will need. However, this is stuff you can focus on a little bit later, like I said before, just get in and push through your first month - once you get the motivation to keep going and doing better, you will naturally want to dial in these aspects to improve your performance.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mikeydale007",
                    "body": "In your case the best exercise for you might be swimming if that's an option for you: physically taxing, somewhat fun, and very low impact.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sdamus",
            "body": "i cannot consistently hit the same weight/reps on almost all of my back/bicep accessory movements. for example if i hit a 3x10 for 100lbs on the preacher curl machine i fail the next two sessions and then can’t seem to work back up to that weight, same happens with lat pulldowns and rows. should i just significantly drop the weight and go really slow and work my way back up?",
            "score": 2,
            "replies": [
                {
                    "author": "NOVapeman",
                    "body": "you aren't gonna be able to progress all the movements all the time session to session especially isolations that might progress over the span of months rather than days. Take the sets close to failure and add reps, sets, and weight when you can.\n\nProgress rarely looks linear.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Patton370",
                    "body": "I’ve found it helpful to add sets, when I can’t progress my isolation exercises in reps or weight \n\nFor example: if I can do 3x8 hammer curls, but can’t do 3x9, I might just do 4x8 as my next progression. \n\nOr consider progressing one rep at a time. \n\nWeek 1: 9, 8, 8\n\nWeek 2: 9, 9, 8\n\nWeek 3: 9, 9, 9 \n\nYou might also consider doing another variation of the exercise and progressing that instead",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Sdamus",
                            "body": "i’ve tried to progress 1 rep at a time but its been inconsistent as well. perhaps i should add an extra set, thanks!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "amrogers3",
            "body": "Does anyone have a good recommendation for a plate loaded horizontal leg press?",
            "score": 2,
            "replies": [
                {
                    "author": "Patton370",
                    "body": "You’d find better answers asking in the home gym subreddit \n\nThat’s also going to depend on your budget \n\nPersonally, I opted for a belt squat (I have the belt squat MD) for my home gym, only because there was one cheap on marketplace. I like it WAY more than a leg press I’ve ever used; I feel like it’s contributed to my squat skyrocketing the last few months \n\nIf your budget is high enough, people may recommend that you get something pretty pricey like the rouge rhino belt squat \n\nFor cheap leg presses, people have been buying the GMWD one and they seem to find it decent & very economical \n\nHonestly, you should probably just go on marketplace and find the best deal on either a belt squat, pendulum squat, hack squat, or leg press in your area, and go with that. If it’s a good deal, but you hate it, you can always sell it to get your money back",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Apprehensive_Cry_636",
            "body": "12-3-30 seems impossible to me… I can hardly get through 8-3-30 and my heart rate hovers around 180, is this a cause for concern? I’m 28F, 5’8” and 125lbs and moderately active. I saw someone comment that their heart rate is around 160 when they do 12-3-30.. my resting heart rate is also on the high end so i’m starting to worry that something is wrong",
            "score": 2,
            "replies": [
                {
                    "author": "Debauchery_Tea_Party",
                    "body": "Had to google the program so take the following with a pinch of salt. \n\n180's pretty high, but you are doing a pretty steep incline. If you're consistently high and you feel short of breath or have other signs and symptoms, talk to a medical professional as there can be lots of things that can influence heart rate. Also depends how long you've been doing it, it'll take time to build up and get used to it.\n\nOtherwise, don't try and hit some arbitrary gimmick number that some rando influencer does. Never heard of her before, as far as I can tell she has no qualifications in training or exercise. You can get significant cardio benefits at a lower heart rate than that so I wouldn't stress if you can't do that high an incline yet. Do what is comfortable, build up over time if you really wanna do those set parameters.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "bacon_win",
                    "body": "They must be better conditioned than you. Work your way up to it",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "accountinusetryagain",
                    "body": "do it slower til you can do it faster. the goal of 12/3/30 isnt the actual number its the fact that it should put you in “zone 2” aka the high end of what you can sustain for extended periods of time.   \n\nyou can estimate the high end of this zone 2 by seeing how fast you can go and have a conversation with medium-high difficulty. this threshold sjould improve over time",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Owl-6246",
            "body": "Getting back into lifting and I don’t have the flexibility to get a legitimate squat anymore. Should I stick to just the bar until I’m able to regain the flexibility to do a fully proper squat?",
            "score": 2,
            "replies": [
                {
                    "author": "mambovipi",
                    "body": "Just squat how deep you can and progress the weight. If you want to go deeper then over time you likely should be able to as you squat more and progress.  More weight will likely help you more than a light weight to get into a deeper squat too.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "donnievieftig",
                    "body": "Try doing a front bar squat or a goblet squat. Most of the time it's not a mobility issue but a balance issue. Balancing with front squat or goblet squat is easier, which means being in the bottom half is more comfortable. Once you get used to being in the bottom range of motion, incorporate back squats.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "cgesjix",
                    "body": "There's not much benefit in quarter squatting. I'd focus on hack squat, legpress, bulgarian split squats and leg extensions, since you'll get s better range of motion, while doing a daily stretch routine for the tight muscles. \"Movement by David\" on YouTube is an excellent source of all things flexibility.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Artistyusi",
            "body": "Should I half ass the gym for some time? \nMy life is going for the worse every single fucking day, and I feel incredibly depressed nowadays so I even the idea of working out for more than half an hour seems unfathomable. Tho I just did 3x bench and 3x squat and I feel like I could go with these two, maybe some deadlifts here and there for some time. \n\nAny advice?",
            "score": 2,
            "replies": [
                {
                    "author": "Soap2",
                    "body": "Going for 10minutes is better than nothing at all. Half ass is better than nothing at all.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "JubJubsDad",
                    "body": "Absolutely. \nIf your options are not going to the gym vs. going to the gym and half-assing it, then you are way, way better off half-assing it.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "bassman1805",
                    "body": "If fitness is not your top priority and going to the gym is making your life worse, it's okay to cut down while you sort out the rest of your life. A halfassed workout is better than no workout.\n\nI would caution against dropping gym work without using that time to work on whatever else has gone haywire in your life. There's a lot of woo science around it, but there definitely are mental health benefits to exercise and cutting it out completely might just put you deeper into whatever spiral you're currently on. But I don't know your exact situation, that's something you'll need to judge for yourself.\n\nI don't know what you're going through right now, but I hope you find your way to the other side of it soon.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "horaiy0",
                    "body": "Reducing volume or workout time doesn't mean half assing. If 30 minutes is all you can manage right now, I'd trim your movements down to just the most important ones, and make sure however many sets you are doing are high quality.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "rakiim",
                    "body": "Yea as long as you can get yourself into the gym I think you're doing good. When I'm depressed I force myself to go to the gym even for like 10-20 minutes because breaking that routine will really have me rotting at home all day, and it's easier to get out of that funk by just following my routine until I feel good enough to give it a proper effort.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Demolished-Manhole",
                    "body": "Listen to Pantera and let all the anger and sorrow out by moving weight. Seriously, lots of people work out just because their life sucks and the iron becomes their best friend. [The Iron Never Lies To You.](https://www.artofmanliness.com/character/manly-lessons/henry-rollins-iron-and-soul/)",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "turnleftright",
            "body": "Thinking of switching gyms, not because I don’t like the gym I currently work out at but just feel the need for a change in scenery and vibes. Really the only complaint I have is there’s really no one else there with me, which may be a blessing but over 10-20-30 sessions. It gets a bit… lonely? I guess?\n\nHas anyone else felt like this and if you’ve swapped gyms has it changed your motive/vibes to your sessions?",
            "score": 2,
            "replies": [
                {
                    "author": "Soccermad23",
                    "body": "I mean I get what you are saying, but man would it be a literal dream for me to have a gym where there was hardly anyone there!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Timely-Bumblebee-402",
                    "body": "Oh man I am Jealous!!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Jordan901278",
                    "body": "working out alone is a blessing",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "horaiy0",
                    "body": "I work out at home so no, but you'd be far from the first person to change gyms for that reason. The only caveat is that nothing guarantees the new gym will be any better, but you could always do some day passes to get a feel for that.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Sansasaslut",
                    "body": "Could you try one out for a couple weeks without signing up for a contract?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Demolished-Manhole",
                    "body": "I sometimes miss the days when I worked out at a gym where the same people worked out at the same times and we would chatter between sets. These days everybody has their airPods in and they mostly ignore each other.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "turnleftright",
                            "body": "For me I just like working out alongside others, it’s hard to motivate myself when it’s just me alone. I get it’s not the same for everyone and some prefer working out alone, but for me I personally like others working out because it pushes me to go harder.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LOLORSKATES",
            "body": "Does sucking on/or eating a piece of candy after a workout actually do anything towards protein synthesis ?",
            "score": 1,
            "replies": [
                {
                    "author": "bacon_win",
                    "body": "Probably not",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Alakazam",
                    "body": "If it does, it'll be minimal.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "CursedFrogurt81",
                    "body": "If I recall correctly, carbohydrate assists with amnio acid uptake by the muscle cells.  But this does not increase muscle protein synthesis.  This falls firmly into the \"probably doesn't do anything but also doesn't hurt to try\" category.  So if you have the room in your diet and you like candy, go for it.  If you have a second workout on the same day, I would focus on carbohydrates post workout.  Outside of that, probably not a benefit.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CyonHal",
                            "body": "Counterpoint: sucking on candy is bad for dental health.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "CursedFrogurt81",
                                    "body": "Not if they rinse their mouth out with soda.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "oldgorrillanuts",
            "body": "I have really week abs. Are there any exercises that are good for starting? I started to do Russian twists and my low back hurt for like a week cause it was making up for the lack in ab strength.",
            "score": 1,
            "replies": [
                {
                    "author": "PRs__and__DR",
                    "body": "Cable crunch",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Alakazam",
                    "body": "Are you sure its your abs that are weak and not just your back that's weak?\n\nBecause it sounds like your back was sore from the russian twists, not your abs. \n\nMost people's abs are fine in terms of actual strength. Most people's backs are their weakpoint. \n\nIf you really insist it's your abs, then planks, ab rollouts, hanging knee raises, and honestly, most ab movements will do the trick.\n\nIf it's your back that's weak like I suspect, then some kind of extension, hip hinge movement, or barbell squat will likely be the best way to build strength in them.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "thestoplereffect",
                    "body": "Planks and cable crunches are good, but you should start with the McGill big 3, esp if your lower back is hurting. I do them when I'm resting in between other exercises, but they make a huge difference.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Gullible-Spirit1686",
                    "body": "Planks are good.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "oldgorrillanuts",
                            "body": "I’ll give planks a try. Not a huge fan but that’s cause I suck at em lol. I also have a home gym without a cable machine I have barbell and dumbbells only.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PDiddleMeDaddy",
                                    "body": "As a complete starter-exercise, ok. But once you can go more than a minute, there really isn't a great advantage to them. I suggest loadable exercises with an actual eccentric and concentric movement. With a cable machine, cable crunches are ideal.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "musiclovermina",
                            "body": "I love doing planks on the bosu ball.... I alternate between elbow planks and straight arm planks",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tasty_Honeydew6935",
                    "body": "Cable crunches + hanging leg raises and/or ab wheel, and then if you want to build obliques cable twists or paloff presses.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "indianajane13",
                    "body": "Birddogs, side plank, and deadbugs are great for core strength. I'd stay away from twisting movements until you get really strong in those 3 exercises.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Fitness-ModTeam",
                    "body": "This has been removed in violation of [Rule #0 - No Questions That Are Answered by the Wiki, Searching Threads, or Google](https://www.reddit.com/r/Fitness/wiki/rules/rule0).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "Elegant-Winner-6521",
                    "body": "You could do that, but you could also keep it fully body but do some thoughtful arrangement of exercises so that you aren't doing the same heavy exercises on consecutive days. \n\nFor example, if you do heavy squats on wednesday, just make thursday a lighter leg day.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Fitness-ModTeam",
                    "body": "This has been removed in violation of [Rule #0 - No Questions That Are Answered by the Wiki, Searching Threads, or Google](https://www.reddit.com/r/Fitness/wiki/rules/rule0).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "oiwoman",
            "body": "I'm tired of weightlifting and of the gym... And I have all of the equipment I need to workout at home...would I eventually benefit more from a Les Mills subscription than from a subpar session at the gym where I lately only go like 50 min... I used to love the gym but lately I just get do easily tired",
            "score": 1,
            "replies": [
                {
                    "author": "bacon_win",
                    "body": "Did you have a question?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "oiwoman",
                            "body": "I guess it's hard to give up something I have been doing for 10years but I've reached the point of saturation",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bacon_win",
                                    "body": "So, no question?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "oiwoman",
                                            "body": "The actual question here is: is it comparable working out at home to working out at the gym? Can I still be healthy working out at home? \nCan I benefit as much from doing a body pump class or two a week? What routine should I be doing really?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bacon_win",
                                                    "body": "I don't know why the gym would be different from home. Your body doesn't know the difference. \n\nWhat are your specific goals?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "oiwoman",
                                                            "body": "Staying active and relatively fit and toned. Have a hobby to take my mind from work.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "bacon_win",
                                                                    "body": "If you don't have specific goals and just want to stay active, I'd just do what interests you",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "oiwoman",
                                                                            "body": "I used to have specific goals and a very specific program but with work and life in general I just want to do something for the fun of it",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DumbBroquoli",
                                                    "body": "It can be comparable working out at home as working out at a gym, of course. You can certainly be healthy that way. Depends on the space you have, ability to not be distracted, etc. But if it gets you moving, that's infinitely better than a gym you don't go to. Heck, you can check out r/bodyweightfitness for routines and suggestions that don't require my much equipment. It'll be harder to progress than a gym with lots of equipment, but humans were capable of being fit long before the invention of gyms.\n\nAs for the body pump class, that too will give you benefits. They may not be the same as self-directed lifting, but if it keeps you consistent it's great.\n\nThere is no one single routine to optimally keep you fit. You need to figure out what works with your lifestyle and do that.\n\nBased on what you're saying, I'm wondering if you'd benefit more from a skill-based fitness approach right now: rock climbing, kickboxing, gymnastics, etc. as opposed to a structure lifting. You seem aimless.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Appropriate-Egg773",
                    "body": "If you're tired of what you're doing, then do something else. Good luck!",
                    "score": 5,
                    "replies": [
                        {
                            "author": "oiwoman",
                            "body": "Maybe changing it up will make exercise fun again",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cilantno",
                    "body": "Do it then!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fitness-ModTeam",
                    "body": "This has been removed in violation of [Rule #2 - Posts Must Be Specific to Physical Fitness and Promote Useful Discussion](https://www.reddit.com/r/Fitness/wiki/rules/rule2).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Fitness-ModTeam",
                    "body": "This has been removed in violation of [Rule #2 - Posts Must Be Specific to Physical Fitness and Promote Useful Discussion](https://www.reddit.com/r/Fitness/wiki/rules/rule2).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brook3y",
            "body": "I swapped out dumbbell kickbacks for skullcrushers since I read they aren’t as effective, but I feel like I don’t feel the burn as much as with overhead extensions (which I do later in the week). I think my form might be off a bit, should I stick it out and improve my form or do kickbacks as the program dictates?",
            "score": 1,
            "replies": [
                {
                    "author": "BaeylnBrown777",
                    "body": "One exercise might be nominally \"better\" than another, but when people say that they are often  extrapolating from research, so it's not some hard fact that you'll make significantly more gains with one exercise vs another. It's definitely possible that form tweaks would make the skullcrushers feel better for you, but if you find kickbacks feel much better and your program calls for those anyways, just stick with kickbacks. As long as you feel good doing the exercise and you're able to push hard, it's a win.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Alakazam",
                    "body": "I think the difference between the two will be minimal.\n\nI also think that pushdowns are generally pretty easy to do right. There's a bunch of videos guides on proper technique. Just follow pretty much any of them and you'll be fine.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "CursedFrogurt81",
                    "body": "The problem with kickbacks is that there is very little resistance in the stretched position.  \n\nFeeling a burn is not always indicative of an effective stimulus.  If I hold a 5lb weight out to my side, eventually, my side delt will start to burn.  It is not a great method for developing strength or hypertrophy despite feeling a burn.  There are several factors that will dictate how an excersize feels. Sometimes, it is valuable information, and other times, not so much.\n\nIf you want to do kickbacks, I would strongly recommend using cables, much better resistance curve across the ROM.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Brook3y",
                            "body": "Thanks mate. I don’t have access to a gym right about now, is it worth using resistance bands for pushdowns instead?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CursedFrogurt81",
                                    "body": "Which head of the triceps are you trying to target?\n\nA general rule for hypertrophy is that sets of reps up to 30 have proven to be effective.  Bands are good as long as the resistance is enough to keep you in the proper range (less than 30) if your goal is hypertrophy.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikethomas4th",
            "body": "If you experience slight shoulder/wrist discomfort doing reverse grip chin-ups on a straight bar, will they loosen up over time with use? Or is it even worth it if all other pullup variations feel fine?",
            "score": 1,
            "replies": [
                {
                    "author": "GingerBraum",
                    "body": "A reverse grip chin-up would be a pullup, so I'm guessing you just mean chinups.\n\nIt may loosen up over time, but you could do some mobility work for those joints to make sure. Apart from that, other pullup variations are perfectly fine as well.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "tigeraid",
                    "body": "Do whatever variation causes no pain.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Mediocre_Wealth_9035",
                    "body": "Probably won't get any better just by doing chin-ups, you'd have to specifically stretch and train mobility of the wrist.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RU49",
            "body": "all I do for my shoulders is 3 sets behind the back cable lateral raises twice a week. is 6 sets a week enough to grow my shoulder width? I'm going to implement some sort of rear delts exercise too, which will also be 6 sets a week.",
            "score": 1,
            "replies": [
                {
                    "author": "horaiy0",
                    "body": "Provided the sets you're doing are at an appropriate intensity, yes. Personally, I'd add a vertical press too.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Fitness-ModTeam",
                    "body": "This has been removed in violation of [Rule #0 - No Questions That Are Answered by the Wiki, Searching Threads, or Google](https://www.reddit.com/r/Fitness/wiki/rules/rule0).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Fitness-ModTeam",
                    "body": "This has been removed in violation of [Rule #0 - No Questions That Are Answered by the Wiki, Searching Threads, or Google](https://www.reddit.com/r/Fitness/wiki/rules/rule0).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Leonidas701",
            "body": "When I do side lateral raises, I get a tension in the front sides of my neck, like the parts on either side of your throat. I mainly feel the muscle strain in the sides of my shoulders and not my back or traps, which i think is good, but I'm not sure if the neck tension is normal or not. What do you think? Is it some form problem or normal?",
            "score": 1,
            "replies": [
                {
                    "author": "dssurge",
                    "body": "You could try to lean forward slightly so the load shifts towards your rear delt more, which should stop your body from trying to recruit your neck. It's totally normal to shrug at the top of a lateral raise if you bring your arms past parallel, so it could be something with that (it's not something you should avoid.)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Leonidas701",
                            "body": "That's a good idea, I already tell myself to lean forward when I do tricep extensions so I don't curl my lower spine forward so it'll be good to remember to do it for both things",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CursedFrogurt81",
                    "body": "I think that is just straining your neck during the movement.  Does it happen with lighter weights?  How is your form?  I see some people pull their heads down/tuck their heads as part of the momentum they are using to move the weight.  This might also cause tension in the neck?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Leonidas701",
                            "body": "I only do this exercise with light weights 😅\n\nI think my form is fine, I just lift parallel with shoulders. It does feel like the normal strain in my neck from carrying something in my arms tbh",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CursedFrogurt81",
                                    "body": "I have not experienced this when carrying things or doing lateral raises.  How light is light?  What if you just raise your arms?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Leonidas701",
                                            "body": "If I just raise my arms I don't feel the strain. Light is 10 pounds, it's the lightest weights I have access too unfortunately. \n\nI feel the same sort of pulling strain in that area of my neck if I'm carrying like a decently sized bag of groceries on a walk back home. Nothing painful or anything but it is noticable",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CursedFrogurt81",
                                                    "body": "My guess is it may be a byproduct from engaging your traps as stabilizers.  A couple of things could help but it is difficult to say without knowing more.  Getting stronger and working on form, bodily awareness. When I did dumbbell lateral raises I would get a good brace in my core and tighten up my upper back.  I would try and be really smooth moving the weights to avoid any momentum or swinging the weights.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Distinct-Mind-925",
            "body": "can i take acetaminophen for muscle soreness?",
            "score": 1,
            "replies": [
                {
                    "author": "Stuper5",
                    "body": "Yes, it's effective for reducing DOMS. \n\nHowever there's some evidence that it may reduce training adaptations, especially hypertrophy so it's usually best to reserve it for times when it's really interfering with your life and not make a habit of relying on it.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "CursedFrogurt81",
                            "body": "Context matters.  Dose and frequency are factors.   A regular dose now and again will not do much, if anything.  In older lifters, it may even be beneficial.\n\n[Stronger By Science - Effect of NSAIDs on Hypertrophy](https://youtu.be/J_06dXlgtmM?si=TdkCW-ODcMhvRrM7)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Stuper5",
                                    "body": "Yeah that's what I was trying to get across. A dose every once in a while when you go a little overboard and can barely get off the toilet? No problem. \n\nRelying on it frequently? Probably want to review your programming and recovery instead.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Distinct-Mind-925",
                            "body": "Yeah I struggle to walk and pick up things.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dssurge",
                    "body": "You can try, but it might not do much since it's not an anti-inflammatory. A better solution would be to simply get up and get the sore muscles moving, even if it really sucks at first.\n\nNo joke, science still doesn't actually know *how* acetaminophen works.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Distinct-Mind-925",
                            "body": "Should I take an anti inflammatory medication?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dssurge",
                                    "body": "You should just move it around. It seriously helps to just use it.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "toastedstapler",
                    "body": "The product description says it's meant to be a barefoot shoe, so it's probably a pretty good fit. I've been wearing vivos for that exact reason, they tend to have fairly roomy toe boxes too and might be worth a look if you've not already",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "robotlogik",
            "body": "I'm a beginner and started resistance training for past few months with 15lb dumbells, 3 sets, gradually increasing from  8 reps up to 13 reps, noticed some nice muscle growth. Then for the last couple of weeks, I increased the dumbell weight to 20lbs and started with 8 reps. I started losing weight, but felt like all muscle gain from before was being lost, also didn't feel as tired after the workouts. Then today, I went back to 15 lbs with higher reps, feeling more muscle soreness/tightness, my muscles feel like they're tingling/growing again. Should I stick with 15lb + high reps or switch back to 20lb + low reps?",
            "score": 1,
            "replies": [
                {
                    "author": "Patton370",
                    "body": "Just do both and alternate between workouts \n\nAlso consider following a proven program, you’ll make better progress \n\nTrust me, I run a program (with minor modifications) and my bench max is 341lbs. Trying to build your own program is a mistake a lot of beginners do & it holds back their progress",
                    "score": 3,
                    "replies": [
                        {
                            "author": "robotlogik",
                            "body": "Thanks, I only lift every other day, from home is my only option for now, so I'll try alternating between the 2 weights. You recommended  alternating every other day? Or is it better to stay with low weights for a few weeks, then switch back to higher weight?\n\nMy goal is just  to get strong enough to use a squat rack. Right now, with the dumbells, my normal routine is: walking lunges, bent over rows, bench press, sit-ups, shoulder press, bicep curls, tricep curls. 3 sets of 8-13, waiting a minute between each set",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Patton370",
                                    "body": "Alternating every workout would probably be best because of your limited equipment \n\nConsider adding DB RDLs or kickstand RDLs to your routine. You’re missing a hip hinge movement",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "robotlogik",
                                            "body": "Thank you, I appreciate the help!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RevenantRoy",
            "body": "I was doing some pushups every day (working towards starting a strength training) but did something to injure my right tricep. I've stopped doing pushups for about a month but it still isn't healed. Whenever I push my  right arm against some resistance (i.e. putting on a sweatshirt or pushing up against car ceiling) I still feel pain on back of right arm. How can I most quickly heal this so that I can proceed with strength training?",
            "score": 1,
            "replies": [
                {
                    "author": "Patton370",
                    "body": "No injury questions here. \n\nAlso from your description, nobody here could know & any advice could hurt you \n\nA tricep tendon injury and tricep muscular injury have different rehab methods. If someone suggests the wrong thing, they could make it worse & it could also be something that’s not your tricep \n\nLong story short, see someone in person",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "tigeraid",
                    "body": "Rule 5. Speak to a physio.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "polloloco067",
            "body": "Im right through Creatine loading phase rn and last 3 workouts I’m consistently hitting less reps, weight than I was before starting supplementation, what gives?! Walking up stairs even seems harder! And yea I’m eating and sleeping the same, does anyone else experience this?!",
            "score": 1,
            "replies": [
                {
                    "author": "bethskw",
                    "body": "No, I think it's more likely that there's something else going on. Creatine doesn't usually have a dramatic effect in either direction. I'd take a look at what else might have changed.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Patton370",
                    "body": "Are you dehydrated? You gotta drink extra water when you start taking creatine \n\nAlso, when’s the last time you’ve taken a break or had a deload? When I start hitting less reps it’s usually due to: I need a break, I’m not sleeping enough, I’m stressed/sad, or I’m accidentally not eating enough",
                    "score": 5,
                    "replies": [
                        {
                            "author": "polloloco067",
                            "body": "I’ve been trying to drink extra, but maybe dehydration? only been working out again a few months so no Deload needed atm",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Patton370",
                                    "body": "Take 3 or 4 days off; it sounds like you need a deload",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mysterious-Fault8193",
            "body": "5’4 F 136lbs. Goal weight is in the 120 range. \n\nI’m starting a calorie cut for the first time. 1 week in and 3 lbs down. I noticed that I having been feeling more fatigued with my workouts and today I required longer breaks than usual with each set. I’ve been strength training for about a year now and I don’t mind losing some strength and going down in weights but I just want to what I’m doing is sustainable for a few more weeks. \n\nAre there any tips that can keep me going throughout my workouts or should I be upping my calories?\nIs it possible that this fatigue is temporary and I can just push on through it? \n\nAny additional tips also appreciated. Thanks for reading my stupid question ;)",
            "score": 1,
            "replies": [
                {
                    "author": "Patton370",
                    "body": "It’s normal to feel more fatigued on a cut. I usually have to cut down my volume a good bit (usually by around 20-25%) when I’m on a cut. I’m able to keep the same intensity, if I lower volume \n\nThat’s why I’m a fan of fast cuts (1-1.5lb of weight loss each week) and super slow long bulks (0.25lbs or so of weight gained each week) \n\nTry eating some easy to digest carbs, like a banana, close to the time you workout. Or if you’re like me, eat a banana or apple after the primary compounds are done (squat, deadlift, etc.) for energy on the remaining lifts",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Mysterious-Fault8193",
                            "body": "I’ll try that. Thank you 🙏",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "oddishkabibal",
            "body": "Hey I heard you can hit abs ( crunches, planks, etc) everyday. Is that true? At most I’d do 6 days a week .",
            "score": 1,
            "replies": [
                {
                    "author": "Soccermad23",
                    "body": "Abs are a smaller muscle so I guess its possible if you did say 1 ab exercise per day. But personally, I think its best to do abs about 2-3 times per week with about 2 exercises each time.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CursedFrogurt81",
                    "body": "You can work any muscle or group of muscles every day if that is what you want.  It is all dependent upon recovery.  If you program for it, you can squat every day without an issue as an example.  Most people prefer to push harder on fewer days.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "cgesjix",
                    "body": "For what purpose?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Green-Cat",
            "body": "I'm usually not afraid of heights, but the supported chin-up machine scares me. There's 2 huge steps and the same distance up on the support bar, and I can't reach the handholds unless I step on the bar and hop up a little. I have to be on tiptoes during the whole movement. I hate it.\n\nIs there another way to work up to chin-ups? I tried the lateral pull down machine, but it's always in use with a long queue when I'm there.",
            "score": 1,
            "replies": [
                {
                    "author": "bethskw",
                    "body": "If there are regular pull-up bars, drag a bench or plyo box over and keep one foot on the box while you do pull-ups. \n\nAnother way is to just use a Smith machine or a barbell in a squat rack. Set the bar as high as you can, then keep your feet on the floor or do jackknife pull-ups with feet on a bench. Once you work your way to full pull-ups, you can still do them from a squat bar by just tucking your legs up or your knees behind you. I do pull-ups like this on my squat rack at home.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Green-Cat",
                            "body": "You're allowed to use the barbell in a squat rack?? That's a game changer! \n  \nOur racks have pull-up handles at the top, but they're out of reach for me even with a box.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bethskw",
                                    "body": "Haha yep! All the equipment is fair game! Depending on the height you choose, you could possibly even work in with a tall person who is squatting.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DurhamBulls24",
            "body": "Diet question: I’m 40/M, 180 lbs, 5’11”. I run a lot - 40 mpw or more. I really wanna drop body fat and have abs (stomach is where all my extra weight goes). I try and eat healthy but am not a calorie counter and with running so much, I have to eat a fourth meal before bed or I go to bed hungry.\n\nWhat is a simple and flexible diet I can use to go down to 165 or so? With all my running, I should be leaner than I am…",
            "score": 1,
            "replies": [
                {
                    "author": "eric_twinge",
                    "body": "Eat what you eat now, just less.  You don't have to count calories if you don't want to, but it makes it easier to figure out what's going on.  Regardless, you need to eat less calories than you burn, and that will probably mean being a little hungry.  \n\nhttps://thefitness.wiki/weight-loss-101/",
                    "score": 4,
                    "replies": [
                        {
                            "author": "DurhamBulls24",
                            "body": "Thank you - helpful. I went on Weight Watchers once and lost 15-20 pounds in like 3 months and I ate plenty the whole time - but I ate the same stuff over and over we (eggs, oatmeal, chicken, protein bars). Got too difficult to maintain and boring. And man did those 15 pounds come right back on. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DutchShaco",
                                    "body": ">but I ate the same stuff over and over\n\nWelcome to cutting lol. Doesn't have to be like that but consistancy makes it easier to guess if you are in a calorie defecit.\n\nI love food, cooking and meal prep. Have several meals ready to go between 450-850 calories in my freezer. I eat what I like and if it fits my macros. An 850 calorie meal might be something I eat on my long run day. Calorie counting can be a bit of a chore sometimes but it makes my meals a lot more flexible",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cgesjix",
                    "body": ">I have to eat a fourth meal before bed or I go to bed hungry.\n\nWhen dieting, accept that it's okay to feel hungry and not eat.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "bassman1805",
                    "body": "If you wanna lose weight, you gotta be hungry. Just need to find some way to be zen about it. Shit's hard.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Repulsive-Tart4234",
            "body": "Are the only things you need for back a rowing movement and a pull down movement I only do lat pull down barbell rows and I’ll do a cable lat pull over",
            "score": 1,
            "replies": [
                {
                    "author": "Debauchery_Tea_Party",
                    "body": "You only need those general movements, yes. I'd probably do an actual vertical pull as well as the pulldowns so you work some of the other back musculature that aren't worked with pure shoulder extension.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "DutchShaco",
                    "body": "If you are following a decent program: not all that often. Take time to actually progress in strength/muscle. I followed my last program for 6 months. It got a bit stale and progress dried up, so I made a few adjustments.\n\nWith new exercises at the start you progress fast partially because neural adaptations.\n\nChanging every two weeks (like I see many people do) is going to keep you spinning your wheels. Also: when life gets in the way working out becomes a lot easier if you go to the gym and you know exactly what to do that day",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DamarsLastKanar",
                            "body": ">Changing every two weeks (like I see many people do) is going to keep you spinning your wheels.\n\nIt's one thing to undulate your sessions, or have extensive logs where you rotate lifts and set/reps in and out.  *Most people aren't this methodical*.\n\nStick with a program through its deload and reset cycle.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RidingRedHare",
                    "body": "If a program isn't a complete disaster, you should stay on it for at least 3-6 months (with some minor modifications) to learn how the program works and how your body responds to it, and to be able to track progress.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "bacon_win",
                    "body": "When you stop making progress",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "cgesjix",
                    "body": "Assuming your program and effort is good, diet will be the limiting factor.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rcht958",
            "body": "I did some squats yesterday and my quads are sore as hell. Is it a good idea to go jogging with my buddy today?",
            "score": 1,
            "replies": [
                {
                    "author": "whatThisOldThrowAway",
                    "body": "Yes, as long as it's not your first time jogging in months and it's not a huge, demanding jog by your standards? \n\nLight activity is one of the best ways to counteract DOMS. A few km walking or jogging is one of the first things I would suggest to help alleviate muscle-soreness post heavy resistance training.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "GingerBraum",
                    "body": "Yes. It'll make you less sore.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Tohaveheart",
                    "body": "It will feel like hell, but will speed up the healing time",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Important-Crow2882",
                    "body": "It’s fine",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Maximum-Factor8319",
            "body": "Beginner here, on my first consistent 3-4 months. what does progression realistically look like?\n\nI’ve heard you should try upping the weight every week but there’s no way that’s possible without enhancers (I hit 6-12 reps, when I feel comfortable at 12 I move to the next weight). Monthly seems more realistic to me. Am I just not pushing myself enough?",
            "score": 1,
            "replies": [
                {
                    "author": "Flat_Development6659",
                    "body": "The general beginner advice is to up the weight every week on large compound movements.\n\nYou can't realistically add 5lbs onto your bicep curl every week. You can probably realistically add 5lbs to your deadlift each week for a reasonably long time.\n\nIncreasing reps is a fine way to progressively overload though and I don't see any issues with progressing in the way you suggested. It might be slower but it'll work.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Maximum-Factor8319",
                            "body": "I can see why this thread has moronic mondays - I thought weekly progression included isolation exercises as well. Thanks man",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "toastedstapler",
                                    "body": "For those you can use something like double progression - perform 3-4 sets of 8-12 reps and when you're hitting the max reps on all sets increase the weight. It's nice and easy to keep track of",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Important-Crow2882",
                    "body": "Sounds like your program or pre workout nutrition sucks, you should be progressing quick with noobie gains, and gaining neural adaptation. It’s the hard truth",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Maximum-Factor8319",
                            "body": "I normally have a banana or granola bar then my pre workout like 20 mins before the gym, bassman1805 suggested a different program so I think imma switch to UL instead of PPL and just keep eating all day lmao",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Important-Crow2882",
                                    "body": "Great pre workout nutrition. Also a great idea. Just remember to manage your volume.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bassman1805",
                    "body": "As a total beginner weekly is doable. At that point you're training your skill in weightlifting as much as or more than your actual muscles.\n\nEventually that comes to an end and you need to find other ways to progress. What you're doing is called \"Double Progression\". You add reps until you reach some goal, then you add more weight, which drops your max possible reps. Then you start adding more reps again.\n\nThere's also \"Wave Progression\" where you train at some submaximal weight and go from higher rep/lower weight to lower rep/higher weight week after week. 5/3/1 programs do this, and usually have you adding weight every 3-4 weeks (depending on how often you need a deload week).\n\nAlso, what's your diet like? It's way easier to push more weight while bulking. I hit a wall during my cut and was barely adding weight on a monthly cadence, but now on a bulk I almost feel like I'm making linear progress again. I'm not adding weight to every lift every workout, but most workouts I'm adding weight to at least *one* of my lifts.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Maximum-Factor8319",
                            "body": "Diet I’m eating at a 200-500cal surplus (5’11”, 145lbs trying to reach 170lbs for now). I’d say roughly 1/4 of my meals during the week are fast food/takeout. I run a PPL split so I try and hit the gym 3-5 times a week. I’m thinking my calories aren’t enough, maybe my frequency?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bassman1805",
                                    "body": "Are you gaining weight week over week? Calorie goals are one thing but the scale is the one and only source of truth for whether your diet is a bulk, maintenance, or cut.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Maximum-Factor8319",
                                            "body": "I was planning on getting a scale this week, over the past 3.5 months I’ve gone from roughly 138 to 145-146",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "cgesjix",
                                                    "body": "If you aim for 1-3 lbs per month, or 0.5% to 1% of bodyweight, you'll avoid the excessive fat gain.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "bassman1805",
                                                    "body": "Sounds like you're generally on the right track then.\n\nPPL is best done when you're consistently working out 6x/week. That's not the *only* way to be successful with it, but it's what's usually recommended. If you only go 3x/week, that means you're only squatting once/week, for example.\n\nFor 3/week, full-body is usually ideal. 4/week I like upper/lower splits. I haven't run a 5-day program myself but I know such things exist. [Just make sure you're running a good program](https://thefitness.wiki/routines/), with information about what to expect progression-wise.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Maximum-Factor8319",
                                                            "body": "I appreciate your help big man 🙏🏼",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LongWalksOnThe",
            "body": "Hey guys, I seem to get soreness in my lats the day after lateral raises. I usually do them with a cable and I try to focus on using my side delts, but I feel like my lats are getting overworked when lowering the cable. Any advice?",
            "score": 1,
            "replies": [
                {
                    "author": "NOVapeman",
                    "body": "Yeah it doesn't matter.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "LongWalksOnThe",
                            "body": "Okay cool thank you",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sycamore_Spore",
            "body": "Thoughts on strength training in the morning before work (a mix of lifting and bodyweight fitness) and then running after work? I'm trying to balance scheduling.",
            "score": 1,
            "replies": [
                {
                    "author": "NOVapeman",
                    "body": "If it fits your schedule go for it. That's a pretty common way to lay it out.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "TR_Disciple",
            "body": "I'm getting back in the gym after an extremely long hiatus. I want to incorporate barbell squats into my routine like I used to, but the simple fact is that my gut is way too big to fit into a weightlifting belt. Should I just do squats with a low weight to get the full benefit of the lift, or keep on using a leg Press machine until I can properly fit into a belt?",
            "score": 1,
            "replies": [
                {
                    "author": "NOVapeman",
                    "body": "Not sure why not having a belt wouldn't allow you to go heavy.\n\nUsually the difference between somebody's belted Max and beltless Max isn't more than 10 15%.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TR_Disciple",
                            "body": "Just worried about hurting my back, but proper technique would alleviate that concern. Fair enough",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "NOVapeman",
                                    "body": "It's pretty well documented a belt doesn't prevent injury it just  helps with bracing if used properly which therefore means you can use more weight.\n\nWhether you hurt your back or not is going to be more determined by fatigue management, and how well you brace in general",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "TR_Disciple",
                                            "body": "Thank you, I appreciate it. It's been a long time for me. I just remember my old weightlifting coach not letting us squats without a belt when I was in school lol",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "accountinusetryagain",
                                                    "body": "just give yourself some time of ramping up weight from pretty submax in order to acclimate to the technique instead of immediately redlining hard sets of 5. if anything a power belly might help with bracing and you can still get a large cheap prong belt from the internet/facebook $15-25ish",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Important-Crow2882",
                                    "body": "Then load and train your spine, the belt should be only a reminder to brace, not a replacement. If bracing fails, what are you gonna do?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hyphen-ated",
                    "body": "you can get a bigger belt",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Important-Crow2882",
                    "body": "If you really NEED a belt, just use the leg press for now or buy a new one.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "emrc01",
            "body": "How many ideal sets per workout on a ppl routine? I’m going from 24-18 because of overtraining is that wise? Also this doesn’t include abs or cardio",
            "score": 1,
            "replies": [
                {
                    "author": "Important-Crow2882",
                    "body": "Whatever you can recover and progress from. I do 40 sets a week, 10 a session and I can barely recover from that going 0-2 rir a set.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "Memento_Viveri",
                    "body": "Very probably yes. Plan to adjust your calories in order to make your weight do what you want. If you want your weight to stay the same, track your weight and adjust calories every two to 4 weeks as needed to get your weight to stay the same.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Important-Crow2882",
                    "body": "Yep, keep the carbs high, 4g/kg body weight will typically maximize gains along with around .73g/lbs body weight in protein",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ContractRight4795",
            "body": "Hey all, I can't post bc app i dont have enough karma or smth, but i js wanted to ask how am i meant to place the bar on my back when squatting, bc every time ive tried, its like the bar digs into my spine nd js pokes it rly hard, it feels like its kinda being stabbed, i dont have any back pain, so idk the reason for it. I just wanna get into squatting bc i used to spam leg press and have decently strong legs, so yh. Also gna start deadlifting soon. - 17M",
            "score": 1,
            "replies": [
                {
                    "author": "NOVapeman",
                    "body": "Watch this playlist(especially the first two videos)and the deadlift pillars playlist\nhttps://youtube.com/playlist?list=PL1rSl6Pd49Iml8C8ApbN2f-lj-3kayP7y&si=ovzLCA2FTo0GSEWe\n\nYour bar position will depend on whether you squat high bar or low bar but for simplicity's sake let's say you are squatting high bar in that case the bar will sit on your upper traps. But not your neck!!!\n\nThis is probably going to feel uncomfortable at first because to be frank you have thin skin quite literally and if you are starting out you don't have much muscle mass so the bar is going to be pressing on bones more.\n\nFucking with your grip width can help if it creates a better ledge but in general it's going to be uncomfortable until you develop thick skin and an upper back.\n\nA lot of guys will have calluses on their upper back for this reason. \n\nand for God's sake don't put a pad on the bar",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnthonyS93",
            "body": "My left side of my back is visibly smaller than the right, mostly in the mid section, but trying to do my pull day, I can do the same amount of reps with the same difficulty on both sides. What should I do?",
            "score": 1,
            "replies": [
                {
                    "author": "Patton370",
                    "body": "Some people are slightly asymmetrical. If it’s not causing you pain, it’s not a problem \n\nSide note: check to make sure your legs are the same size and see if one shoulder is raised higher than the other, because that could cause you a problem \n\nSide note 2x: If I don’t stretch out the left side of my back/shoulder/neck, my left shoulder ends up higher than my right, making my back look like one size is bigger than the other. Stretching fixes that",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "whatThisOldThrowAway",
                    "body": "19/20 times 'visible asymmetry' is much more significant in a person's head than it is in reality. \n\nEspecially in fitness peopel can get obsessed over tiny details that aren't really there, or if they are, aren't nearly as significant as a person has made them out to be in their own head. \n\nMy recommendation? Go to /r/bulkorcut and post a photo of yourself asking what you should do to improve your physique. I give you good odds no one even mentions your 'back asymmetry'.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "rakiim",
                    "body": "Do you deadlift mix grip regularly without alternating grips on top set?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AnthonyS93",
                            "body": "I actually don't deadlift cuz I go to pf and I don't want to do them on the smith machines... For back on pull days I do lat pulldowns, wide grip rows for upper back, close grip for lats, and face pulls",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": []
        },
        {
            "author": "Repulsive-Tart4234",
            "body": "How come I’m able to do more reps after my first set for example 10 reps of chest flies then next set I’m able to do 12 minimum I do 3 mins of rest time I go to failure every set I never had this problem before you might think I cheat the reps or my form is different but I literally feel stronger on my next set I never experienced this within 3 years of lifting",
            "score": 0,
            "replies": [
                {
                    "author": "Careful_Loan907",
                    "body": "you don't properly warm up",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}