{
    "title": "Digimon is following PokemonTCGP? Incoming New TCG title for Digimon",
    "author": "Aiden-Damian",
    "subreddit": "gachagaming",
    "rank": 17,
    "score": 476,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 112,
    "url": "https://v.redd.it/yhu24kfoe1pe1",
    "id": "1jcjg5s",
    "selftext": "[https://x.com/digimon\\_tcg\\_EN/status/1901120096468430929](https://x.com/digimon_tcg_EN/status/1901120096468430929)",
    "comments": [
        {
            "author": "FallenStar2077",
            "body": "Finally, got a use for this gif\n\nhttps://i.redd.it/t4ismpg5h1pe1.gif",
            "score": 344,
            "replies": [
                {
                    "author": "Aswellas08",
                    "body": "Ah the \"mo-man-tai\" trainer! xD\n\nI had the chance to watch tamers because this gif was spammed back then as a joke during Duel Links early years. Only watched the original digimon adventure in my childhood days, so I was surprised to see this sequel having more cohesive plot and a much more mimetic structure for a kids show than the original one.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "flowerpetal_",
                            "body": "Tamers is one of the most cohesive \"children's show\" series because it was written by the guy who wrote Hellsing and Serial Experiments Lain. It's chock full of symbolism and darker themes.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "SolidusAbe",
                            "body": "tamers was pretty good but frontier is imo even better.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "KaiserNazrin",
                                    "body": "Nah, Frontier was shit. Turning into Digimon turn out is not as cool as having a partner Digimon.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "KantenBlue",
                                            "body": "Nah that's a matter of taste. The trade here is that the Humans actually do the action part and was probably used because of the success of Tamers' Mega forms. Frontiers was different just like how Yu-gi-oh tried to do children's card games on motorcycles and both were good.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Rain-Maker33",
                                                    "body": "As a Toku fan, having the kids transform was pretty good for me. The ost used in the transformations was pretty cool.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Sulphur99",
                                                            "body": "With the Will syncing up to their hand movements was peak kino",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dododomo",
                    "body": "I'm stealing this! XD\n\nBut damn, I miss Tamers. It's my 2nd favorite Digimon series after Adventure!",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "NPC1938356-C137",
            "body": "It always digimon late coming to the scene.",
            "score": 138,
            "replies": [
                {
                    "author": "DukeOfStupid",
                    "body": "I've always liked the setting and stories of Digimon more than Pokemon, but they've never released a polished game (the best game, which is almost certainly just my nostalgia, is Digimon World 1), even when compared to the graphical, lazy messes of modern pokemon games.\n\nI'm interested in what this will be, but I don't have high hopes it won't just be a less clean PokemonTCGP.",
                    "score": 59,
                    "replies": [
                        {
                            "author": "PimpGamez",
                            "body": "Cyber sleuth and Hacker's memory were pretty good",
                            "score": 49,
                            "replies": [
                                {
                                    "author": "Fearless-Ear8830",
                                    "body": "yeah but they were made with a horrible budget, the new one looks more polished tho so hopefully they invested more money into it. The franchise deserves it",
                                    "score": 28,
                                    "replies": []
                                },
                                {
                                    "author": "DukeOfStupid",
                                    "body": "I've only played Cyber Sleuth, and it was fine. But the game was clearly made on a budget and you could feel it. \n\nAlso a very grindy game from what I remember, I don't think I finished it in the end because I sadly got tired of the combat.\n\nSurvive was also pretty decent, but felt tedious for a visual novel, really needed more diversity between the routes, though I liked that the first route you do always had consequences.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "Roliq",
                                            "body": "When i played it i had to give myself a EXP multiplier, it made it more bearable",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "alteisen99",
                                            "body": "yeah cybersleuth budget was felt quite a bit. the attack sound effects of those games was pretty bad. also the grind was pretty bad too i suspect to lengthen the game artificially. save scum to get those USBs and then run around doing random battles, max level up, then level down and rinse and repeat to get the high level mons you want. even then some mons are just better than the others.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Bakatora34",
                                            "body": "I played Cyber Sleuth on the Switch where you could leave it in sleep mode while the game was open to farm exp when you put the Digimon on the farm, so it make the grinding easier.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MMO_Boomer22",
                                    "body": "You know a game is gonna be shit when both somewhat modern games combined are 5.5 gigs, horrible budget with game reusing renders for 90% of the time, I hope the next Story game that comes out this year it's gonna be better and I'm saying this as a big Digimon fan.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "avidania",
                                            "body": "You are aware that Cyber Sleuth is originally released on the PSVita, yes?",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "skyjlv",
                            "body": "Digimon World 1 and 2 are my favorites in the series.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "FishFucker2887",
                            "body": ">the best game, which is almost certainly just my nostalgia, is Digimon World 1\n\nI take personal offense at that \n\nTry digimon world on DS\n\nTry Digimon Cyber Sleuth\n\nTry Digimon Hacker's Memory\n\nTry Digimon Next Order\n\nI would recommend Digimon Survive which is basically a survival game making sure you ensure the survival of everyone, but the characters pissed me off so much i cant recommend it.\n\nOne that i recommend the most is Digimon World Re digitize : Decode",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "DukeOfStupid",
                                    "body": ">Try Digimon Cyber Sleuth\n\nTried and couldn't finish, it was cheap, clunky and grindy. The story was fine but not enough to carry it for me.\n\n>Try Digimon Next Order\n\nIs just digimon world without the nostalgia charm. Also I found the additional digimon just made the whole game more awkward and grindy compared to the original world. You now have to grind up two digimon, and if you want to do so optimally, you must do so out of sync with each other so that one can boost the other, leaving you with short time periods to actually play and progress with the game.\n\n>Survive\n\nIt was fine, but it's game is so minimal and easy it should be considered a visual novel more than anything, and like I said while I appreciate aspects of it, from a VN standpoint I think it's lacking.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "ricardo241",
                                            "body": "playing digimon next order with mods really can make a break on that game lol\n\n  \nwith all the mods available out there you can pretty much train one baby to mega super fast like there is one mod that lets chips gives you tons of stats so you don't need to train forever on  both map or gym....and its better that you can buy that chips later....and money is not a problem since they also got mods that lets you pretty much gain money infinitely just pressing arrow key \n\n  \noverall digimon game is really grindy that I really need to look for mod to kill most of it to enjoy the game",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "FetchBlue",
                                            "body": "And yeah not gonna lie, I only finished because of the passion for Suzuhito Yasuda art, and the game is hardcore grindy as hell. It’s super exaggeration when people says it’s better than Pokémon because I don’t grow attached to any of my digimon because all of them are just numbers and bigger numbers, no depth in movepool other than lightning 1, lightning 2 and lightning 3. And it has less playability than even sun moon.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "uneven_cactus",
                            "body": "I remember being in awe of digimon world as a child. Last year I played it again and it barely held up to what I remembered, even giving it the benefit of the doubt for being so old",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Kaaalesaaalad",
                            "body": "That's definitely due to nostalgia.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "riougenkaku",
                            "body": "There's a digimon card battle game in ps one that I really like",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LogMonsa",
                    "body": "Tbf Digimon is always a step behind. But no one would've expected Pokemon TCG to make that much money either. Outside of Pokemon Go, there wasn't any other Pokemon mobile game that do well before PTCGP",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Efficient_Ad5802",
                            "body": "Master Duel and Duel Links already proven twice that the concept will works.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "dead_monster",
                            "body": "Pokemon Cafe Remix is not a billion dollar revenue generator but still getting regular updates.\n\nAnd Pokemon Masters EX is still going strong.  Last time they reported lifetime revenue, it passed $300m.  So that would be like $6m/month averaged out.  That’s more than GFL2 and Reverse 1999 last month.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "InterestDue3713",
            "body": "there is no official pc sim for digimon tcg yet, so they choose to release the pocket ver to soft reboot the game? i hope it's going well.  the current tcg already feels like yugioh with how long the effect can be + long ass combo with little to no disruption available.",
            "score": 19,
            "replies": []
        },
        {
            "author": "RedBurny",
            "body": "Well I just need SSSSR swimsuit skin Angewomon..\n\n\nPokemon tgc have those right??",
            "score": 43,
            "replies": [
                {
                    "author": "HuCat21",
                    "body": "Best we can do is a fullart lopunny",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "Etheriuz",
            "body": "Please be f2p like md and not like vanguard",
            "score": 49,
            "replies": [
                {
                    "author": "Blackandheavy",
                    "body": "Vanguard was pretty F2P from its beginning, but the G update ruined everything by adopting duel links gacha system.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "chirb8",
                            "body": "the worst was the G rarity introduction",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "YiKangAng",
                    "body": "I wish their simulator will be as good MD (PC/mobile), hopefully I am not asking too much.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Initial-Associate-64",
                            "body": "Their 60 dollars paid sim feels worse than using a free yugioh websim i dont trust that company to make anything half decent",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Peacetoall01",
                                    "body": "Again. Bushi why are you like this? They genuinely made Nexon look competent",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "inspect0r6",
                            "body": "Don't get your hopes up. They fumbled DB tcg online client hard. I guess if they focus on pack openings instead of actual game like pocket it could not be a mess.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Peacetoall01",
                                    "body": "Well I genuinely think it won't be as bad as vanguard dear days 2. \n\n\nPlease don't be like that. It's just a pure stupid move.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Peacetoall01",
                    "body": "Or god fucking forgive. Dear days.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lycor-1s",
            "body": "i honestly like digimon more than pokemon tcg.",
            "score": 20,
            "replies": []
        },
        {
            "author": "rayhaku808",
            "body": "I always enjoyed Digimon’s TCG more the Pokémon’s. But formatting it for mobile is a different story.",
            "score": 10,
            "replies": []
        },
        {
            "author": "KoriCongo",
            "body": "All Bandai have to do is port the same game (none of this super simplified crap, your card game is already dead simple) and not make trading a cancer.\n\n\nCongrats, you will finally beat Pokémon for once in your life.",
            "score": 6,
            "replies": []
        },
        {
            "author": "drmaniac1",
            "body": "It's amazing how much bandai dropped the ball with Digimon. The card game was a hit since launch and they could have easily had a app that beat pokemon and yu-gi-oh to the market by years.",
            "score": 6,
            "replies": [
                {
                    "author": "Peacetoall01",
                    "body": "At the fucking least beat Vanguard in digital TCG. By just being free to play and have cross play and not region fucking lock.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "XeroMCMXC",
            "body": "If this game is anything like the TCG digimon in Digimon world 3 that would insanely cool.",
            "score": 6,
            "replies": [
                {
                    "author": "dododomo",
                    "body": "Not me spending more time card battling tamers then fighting wild Digimons in Digimon world 3/2003 XD",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "azure-ryuusei",
            "body": "About time, Digimon has always been a gacha game but eos fast. Card game could give them more chance as everyone likes to collect digital cards.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Vyragami",
            "body": "Ah it's TCG, I thought it's gonna be regular Digimon RPG... maybe it's for the best since all previous Digimon gacha failed miserably",
            "score": 12,
            "replies": [
                {
                    "author": "slash197",
                    "body": "They already announced the next regular game. https://store.steampowered.com/app/1984270/Digimon_Story_Time_Stranger/",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Vyragami",
                            "body": ">Digimon gacha",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "bluedragjet",
                                    "body": "China exclusive",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "InterestDue3713",
                    "body": "even the full-release title feels... subpar.",
                    "score": -13,
                    "replies": [
                        {
                            "author": "Fearless-Ear8830",
                            "body": "how so? Digimon fans are really excited about it, look way better than previous entries off the jump",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Mr_Creed",
                            "body": "I know nothing about the franchise and it just looks like store brand Pokemon based on that. So subpar seems on point.",
                            "score": -26,
                            "replies": [
                                {
                                    "author": "RevolutionaryFig5874",
                                    "body": "> I know nothing about the franchise\n\nYeah I can see that",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "Mr_Creed",
                                            "body": "So it giving that impression, is that a good or a bad thing?",
                                            "score": -18,
                                            "replies": [
                                                {
                                                    "author": "FishFucker2887",
                                                    "body": "I'd say, watch the anime and find out",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Listless_spidey",
                                    "body": "Ngl... that's really a shit take. Unless your comment is about the game, otherwise the only similar thing between two games are monster and evolution. The story theme, premise and everything else is just far far difference. To the point digimon is a unique series in itself.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ConstructionFit8822",
            "body": "Great. Really loved the Franchise growing up.",
            "score": 4,
            "replies": []
        },
        {
            "author": "bakamund",
            "body": "Hope the UI is slick and responsive. I dropped PkmTCG and GO cuz the UI were dogshit. If you have something like Clash Royale showing more info and vfx than these barebones UI in TCG, why the heck is it so darn slow.",
            "score": 3,
            "replies": [
                {
                    "author": "OddlyShapedGinger",
                    "body": "Vfx in tcgs is a touchy subject and a hard line to land on.\n\n\nYou don't want too many effects that are linked to playing a card: if the deck is meta you end up seeing the same effects hundreds of times, it slows down game/response times if it's unskippable, and it gets extra complicated in a tcg that allows responses because you're stuck waiting for your opponent to watch/load an effect.\n\n\nYou also don't want to have no UI or vfx because that shit is boring and doesn't make dopamine go boink.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Monkguan",
            "body": "Ofc, who doesnt love money?",
            "score": 3,
            "replies": [
                {
                    "author": "Peacetoall01",
                    "body": "*Looks at bushiroad making vanguard dear days 2*\n\n\n\nBushiroad doesn't like money. Genuinely it's a miracle vanguard survives to this day.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zekrom997",
            "body": "Bushitroad can't keep getting themselves humiliated this much",
            "score": 3,
            "replies": [
                {
                    "author": "Peacetoall01",
                    "body": "Oh they will \n\n\nTruly a bushiroad could never. \n\n\nWho else think pulling an Artifact twice is a good idea? Bushiroad",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brushner",
            "body": "Oh Renamon. They know their audience. They know their fucking audience",
            "score": 9,
            "replies": [
                {
                    "author": "Yotsubato",
                    "body": "At least they didn’t make a life size plushie of her",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Pandelicia",
                            "body": "Yet",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Yotsubato",
                                    "body": "https://i.redd.it/hpj96rgsv1pe1.gif",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "SolidusAbe",
                                    "body": "just wait a few months im sure bandai will make one",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hovermask",
                    "body": "im more sakuyamon or angewomon guy.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Peacetoall01",
                            "body": "Lilymon.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "AceLuan54",
                                    "body": "Rosemon.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aiden-Damian",
            "body": "[More News on Upcoming Livestream on DIGIMON CON2025, March 19th](https://www.youtube.com/watch?v=cOxDs02GQzA)",
            "score": 5,
            "replies": []
        },
        {
            "author": "Agreeable_Beach_1225",
            "body": "This could actually rival pokemon if they made it right. Imagine the evolution it could have and combo. I hope it not too much of a cashgrab.",
            "score": 6,
            "replies": [
                {
                    "author": "ifindhardittochoose",
                    "body": "Not really, Pokémon is literally the biggest franchise ever, probably 10 or more times bigger than Digimon money wise",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Jeannesis",
                            "body": "Yeah, I find it hard to believe how Digimon as a whole can garnered more revenue than the Pokemon franchise in its entirety. The latter have been marketed and promoted for a very long time compared to the former.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Yalrek",
                    "body": "> Imagine the evolution it could have and combo.\n\nThe phone showed the same image as the actual Digimon card game back, so we already know years worth of cards/sets.  The only question is if they release all the cards at once (so that it's up to date), or if they're going to slow drip them.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Octosage8",
                            "body": "Wouldn't be surprised if they skip some of the earlier stuff and open with liberator as an early focus since those decks are all around each other's level.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "qlsro",
            "body": "ahhh, finally",
            "score": 1,
            "replies": []
        },
        {
            "author": "SolidusAbe",
            "body": "was always mildly interested in the digimon tcg though i have no idea if the current one is even the same game as the one from over 20 years ago lol might give it a try when it comes out",
            "score": 1,
            "replies": [
                {
                    "author": "Yalrek",
                    "body": "> i have no idea if the current one is even the same game as the one from over 20 years ago\n\nIt's not, it's a new one that launched in... 2020, I believe?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lylat97",
            "body": "Oh please yes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SephLuis",
            "body": "I would love for it to be like the TCG game in the psx.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shidncome",
            "body": "A lot of digimon games are just straight up cursed, heres hoping this one isn't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ItzCStephCS",
            "body": "They saw that money lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sulphur99",
            "body": "Finally, a way for me to get the English version of the TCG cards. Seriously, I don't know why Singapore only has the Japanese ones.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GuyAugustus",
            "body": ">Renamon\n\nThey sure know whats up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "azure-ryusei",
            "body": "This might be related to the Digimon Card game comic they have been doing? Hopefully yes.\n\n[https://digimoncard.com/digimon\\_liberator/en/](https://digimoncard.com/digimon_liberator/en/)",
            "score": 1,
            "replies": []
        },
        {
            "author": "PlatFleece",
            "body": "I've been enjoying the Digimon TCG and been waiting for a digital sim for a while now. I'm wondering if this is it or if it's a modified version of the TCG.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Peacetoall01",
            "body": "#GOD PLEASE LET IT BE SO. \n\n\nI've always wanted to play Digimon TCG but it's kinda hard to find someone to play on paper. \n\n\nIf this game is basically a master duel for Digimon TCG. I can definitely say Vanguard could never. Like bro making an Artifact twice and hoping to have a good player base playing is pure insanity. Your Vanguard IP isn't as big as Dota and you expect to succeed where a franchise bigger than you failed is just pure stupid. Doesn't help that that IP has reset twice. \n\n\nGod why bushi like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AceLuan54",
            "body": "LETSGOOOOOOO CHACKMON AND FAIRIMON PLEASEEE\n\n(China already had a Digimon gacha called Digimon New Century, but, it's China only :\\[)",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeavensRoyalty",
            "body": "I'm so down for this",
            "score": 1,
            "replies": []
        },
        {
            "author": "handsoapx",
            "body": "Losercity advertising team",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Car-4307",
            "body": "im curious, are other TCGs more balanced? or they do the same bs as Yu-Gi-Oh, where you basically script your whole deck for a one turn kill?",
            "score": 1,
            "replies": [
                {
                    "author": "SolidusAbe",
                    "body": "well balance in card games is always all over the place depending on meta but i had a lot of fun jumping back into magic recently via the pc games. the one piece tcg is also apparently very good but i have no way to actually play it\n\ni was into ygo since almost day one in the west and played for nearly 15 years. tried to get back into it multiple times but its just way too fast with too many actions per turn and my 34yo brain cant keep up anymore lol",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Propagation931",
                    "body": ">im curious, are other TCGs more balanced? or they do the same bs as Yu-Gi-Oh, where you basically script your whole deck for a one turn kill?\n\nYugioh among all (or at least all the prominent ones) the TCGs I have played is special in how fast it is in Modern (aka effectively winning in one turn either by otking them or setting up an unbreakable board that the enemy conceded on their turn due to all your hand traps and negates).",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Microice001",
            "body": "My experience with Digimon card games was Digimon digital card battle and Digimon tamers 3 mini game both are ancient",
            "score": 1,
            "replies": []
        },
        {
            "author": "x4Rs0L",
            "body": "Desperate attempts to save a dying game. Should have done this years ago Bando.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Rafuria",
            "body": "Fck Pokemon.",
            "score": 0,
            "replies": []
        },
        {
            "author": "lughrevenge23",
            "body": "i wish its an actual digimon game and not TCG",
            "score": -7,
            "replies": [
                {
                    "author": "Mrhat070",
                    "body": "we are getting an actual digimon game but not for mobile",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "DS-Envy",
            "body": "The didnt even released the Digimon TCG yet. Been teasing us for years",
            "score": -2,
            "replies": [
                {
                    "author": "fluffyharpy",
                    "body": "What? The games been around since 2020.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DS-Envy",
                            "body": "The online game not the rl",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "YasuoAndGenji",
            "body": "This will make 10's of dollars",
            "score": -2,
            "replies": []
        },
        {
            "author": "Propagation931",
            "body": "Interesting they would choose a TCG instead of making a quality Digimon Mobile Game. Id give it a shot for my Nostalgia for Digimon though.",
            "score": -6,
            "replies": [
                {
                    "author": "Shipuujin",
                    "body": "Tbf they did try a couple times with Linkz and ReArise. Unfortunately, bandai likes to get money then run away after it got enough",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Aidesfree",
                            "body": "Linkz was way too grindy if you wanted to build a good Mon but I'd be lying if I said I didn't miss it. Good thing we're getting another Story game this year at least.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}