{
    "title": "Gacha game that has a dedicated White Day event.",
    "author": "Gunta170944",
    "subreddit": "gachagaming",
    "rank": 19,
    "score": 207,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 44,
    "url": "https://www.reddit.com/gallery/1jcmt9g",
    "id": "1jcmt9g",
    "selftext": "The only gacha game I play that has a dedicated White Day event is Fate/Grand Order, which features story events and special Craft Essences specifically for the White Day event. Each year, they alternate between introducing a new male character and giving an existing male character a new costume. Are there any other gacha games that also have a dedicated White Day event? If so, what content do they include in the event?”",
    "comments": [
        {
            "author": "otterswimm",
            "body": "White Day is a Japanese holiday, so it’s not surprising that it’s mostly Japanese gacha games that celebrate White Day. \n\nSome other Japanese gacha with White Day events include…\n* *Alchemy Stars* (RIP): White Day was a little different every year, but I remember a consistent feature was that you could earn “dark chocolate” to give to male characters to raise their affinity levels. And although AS doesn’t have the equivalent of FGO’s craft essences, the official AS social media accounts always posted gorgeous White Day illustrations every year. Plus there were some amazing White Day skins (like Pittman’s outfit).\n* *Puzzles&Dragons*: Has a “White Day Dungeon” that only lasts for one day but drops rare and powerful feeder mats. Happy farming.\n* *Divine Gate* (RIP): Had a dedicated White Day event, “Sweets Grand Maison,” which repeated every year. During the event you could farm for White Day-themed feeder materials and a free SS unit, Atsuyoshi (who was the betrothed of the free Valentine Day’s unit, Ise). \n* *Battle Cats*: Has a special White Day gacha every year in which you can roll for ultra-rare White Day units. \n* *Dragon Poker*: Gives an SS selector ticket every year for White Day. \n* *Granblue Fantasy*: I don’t play GBF, but u/RoryFuckingMercury already filled in the details below.\n\nAlso… I do find it interesting that more and more Korean/Chinese gacha games are doing fun little things to celebrate White Day, even if not full dedicated White Day events. I mean, hey, it’s a holiday about hot guys and chocolate. Even in girls-only gacha games, it’s still an opportunity for the MC to give gifts to the girls and get to experience their responses. As far as marketing for a gacha game goes, White Day is basically a golden opportunity served up on a silver platter. Even if White Day did start as a Japanese-only holiday. (Although I would argue that, like Valentine’s Day before it, White Day is becoming more and more internationalized.)",
            "score": 39,
            "replies": [
                {
                    "author": "Gunta170944",
                    "body": ">White Day is a Japanese holiday, so it’s not surprising that it’s mostly Japanese gacha games that celebrate White Day. \n\nAh, so that's why Chinese gacha game such as Arknights or Honkai Star Rail doesn't have White Day event.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "otterswimm",
                            "body": "HSR does post White Day-themed illustrations on their social media accounts! They do three different guys every year. This year they posted White Day illustrations of Aventurine, Jiaoqiu, and Boothill. The illustrations also come with a little story about the gift that each guy gives Trailblazer.\n\nhttps://preview.redd.it/g2de6zag03pe1.jpeg?width=1000&format=pjpg&auto=webp&s=28629dfa2a46503c26e60ec7776c477959b8c0a4\n\nLike I said, Chinese and Korean gacha don’t really do full White Day events (as far as I’m aware), but they don’t totally ignore the holiday either. Well, at least their marketing teams sometimes do a little something fun for White Day.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Permagate",
                            "body": "Well, Arknights also doesn't really do valentine events either (though them running CC event during some valentine dates is always funny lol).\n\nHSR also doesn't have valentine events, but they usually have social media posts for both valentine and white day occasion as far as I recall.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Gunta170944",
                                    "body": ">though them running CC event during some valentine dates is always funny\n\nI mean CC event does make my heart beat faster so I guess it kinda work?",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EtadanikM",
                            "body": "PGR had in-game White Day events (though less & less these days).\n\nMost gacha games have a Japanese release and White Day events help appeal to that audience, even if the game is made by Chinese or Koreans.\n\nThe amount of effort typically depends on how important the Japanese market is to the game. Companies aren't stupid. They know localization is important.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "daggerfortwo",
                    "body": "RIP Alchemy Stars. Such a fantastic and creative game, but I think it just needed slight gameplay tweaks. But instead they focused on other random stuff",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RoryFuckingMercury",
            "body": "In GBF, it is just that you can buy chocolate for your characters' experience and also have White day interaction with the character.",
            "score": 27,
            "replies": [
                {
                    "author": "Hakazumi",
                    "body": "TBH we do also have \"White Day\" alts. They're just released bit early.\n\nhttps://preview.redd.it/0stkq4n8e2pe1.png?width=960&format=png&auto=webp&s=7324d670c49fe6f8a938fb6d09fc2f1c5b1be8c7",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "Civil_Collection_901",
                    "body": "FGO covers all that in Valentines.  \nYou give chocolate to the guys, get from the girls and unidentified you can choose either or.  \nVoiced scenes are triggered for every chocolate.  \nIts sweet. Not everyone is romantic, most arent actually, and sometimes you even help couples make it for each other (or in Xu Fu's case make it for Yu Mei Ren).  \nWhite day for FGO is an almost male only event, and the headliner for the event has a message for you everyday for a week.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Gunta170944",
                    "body": "Fate/Grand Order also does that, but instead, they include a cutscene where the player gives chocolate to male characters during the Valentine’s event. The White Day event stories are mostly about male characters getting into shenanigans.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Kiseki-",
                    "body": "there's 2 man who doesnt want give me cookies/candies on white days. and one of them this dude\n\nhttps://preview.redd.it/961jidoen2pe1.png?width=419&format=png&auto=webp&s=00bbaac5343edb94e878793ea2b6b323a3d0f9c0",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "za_boss",
            "body": "Hold up, what is that first panel on the second image 🤨",
            "score": 20,
            "replies": [
                {
                    "author": "Ok_Advisor_7515",
                    "body": "# IT'S PEAK!\n\nhttps://preview.redd.it/bptpczbxf2pe1.png?width=1080&format=png&auto=webp&s=c8ffe41ae7a7b09a5ffc81c20ea527c43b1adac6\n\nJust a normal hang out session for the Paladins of Charlemagne",
                    "score": 60,
                    "replies": []
                },
                {
                    "author": "Brazilian_Hound",
                    "body": "Roland is an exhibitionist in fgo",
                    "score": 26,
                    "replies": [
                        {
                            "author": "hykilo",
                            "body": "And irl too basically",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "Cross_Toss",
                                    "body": "You get naked once in a fit of rage and sudenly that's what everybody remembers you for",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "ReadySource3242",
                                            "body": "if you're way of dealing with anger is becoming a nudist, that's uh...very memorable to say the least",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "Cross_Toss",
                                                    "body": "To be fair, he lost is sanity - as in, literally, physically lost it. Astolfo had to ride Elijah's flaming chariot to the moon to find it (also found his own sanity while he was up there)",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LordMonday",
                                            "body": "Look Roland, that's just how the Throne works okay.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "VampireDuckling8",
            "body": "https://preview.redd.it/pk0s0y11k3pe1.jpeg?width=1080&format=pjpg&auto=webp&s=69d3e34c2b94f81a2348f82e4041d42900c63487\n\nEnsemble Stars has a white day campaign every year!  \nWhat I also appreciate is the idolm@ster games doing the same despite having all female casts (aside SideM).",
            "score": 10,
            "replies": []
        },
        {
            "author": "PrimevialXIII",
            "body": "alright, i need third slide guys name RIGHT NOW",
            "score": 5,
            "replies": [
                {
                    "author": "Gunta170944",
                    "body": "Dante Alighieri from Fate/Grand Order JP server",
                    "score": 8,
                    "replies": [
                        {
                            "author": "PrimevialXIII",
                            "body": "thanks, love his design",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CrazyFanFicFan",
                    "body": "That is Dante Alighieri, the author of the Divine Comedy (most well known for defining the modern depictions of Hell, with its layered structure focusing on different sins). At the same time, he is also Dante Alighieri, the main character of the Divine Comedy. (Yes, the Divine Comedy is a self-insert fanfic of the Bible)\n\nI don't remember if the character is supposed to be the author thinking he's the character, or the character thinking that he's the author.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "EducationalNarwhal6",
            "body": "God I fucking love CBC events, gotta be my 2nd favourite after GudaGuda, whish they made a Yaoi themed one but alas TM continues to be cowards",
            "score": 14,
            "replies": [
                {
                    "author": "Gunta170944",
                    "body": "The closest thing we ever gonna get is when Ritsuka almost accidentally touches Takasugi’s “lever” when they both piloting giant robot.\nhttps://www.reddit.com/r/grandorder/s/RBTSPs8sa0",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Wait-And-Hope-",
                            "body": ">Hey, help me steer for a while, it's this leverー... Not that! The one to the right of that! No, the one right in between my legs, between my legsー... Huh?! Hey, you! Just where are you touching?! Just where?! Ah! Alright, that's it! \n\nhttps://preview.redd.it/dw809xnpt2pe1.png?width=1080&format=png&auto=webp&s=5961f5ed83faa48c7bdc4b69b13e154db036188b",
                            "score": 24,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JonathanTF5",
            "body": "Blue Archive had a White Day event on Twitter where you could read the students reactions to Sensei's gift\n\nhttps://preview.redd.it/7bp8si57o3pe1.jpeg?width=1080&format=pjpg&auto=webp&s=48cf23d47cf91e41b36056fd360af670a2db45b8",
            "score": 5,
            "replies": [
                {
                    "author": "Jeannesis",
                    "body": "Never knew this about Blue Archive considering it's made by KR devs, I've always thought that sort of event was exclusive to JP gachas only until now.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "EtadanikM",
                            "body": "Blue Archive is huge in Japan. Companies target their events based on their markets.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "icouto",
                            "body": "Koreans also celebrate white day",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MinazukiFey",
            "body": "Well, most joseimuke games have one.\n\nMahoyaku, A3! and 18trip all had it (from the games I play that weren't mentioned yet)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lucas_Xavier0201",
            "body": "The Battle Cats have white day too",
            "score": 1,
            "replies": []
        },
        {
            "author": "pluggynaruk",
            "body": "Last Cloudia also has a dedicated White Day event, featuring husbando banners for players who enjoy male character pools. You can find a variety of characters, from young boys to fatherly (daddy) figures, making it a great choice for those who appreciate diverse male designs.\n\nLike Fate/Grand Order, Last Cloudia celebrates White Day with exclusive banners and event content, making it a great time for husbando collectors to roll for their favorites!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Financial_Exit_7710",
            "body": "Fr",
            "score": 1,
            "replies": []
        },
        {
            "author": "IndicationOk8616",
            "body": "project sekai...",
            "score": 1,
            "replies": []
        },
        {
            "author": "ACFinal",
            "body": "Aren't those all Japanese gachas? ",
            "score": -4,
            "replies": [
                {
                    "author": "Euphoric_Metal199",
                    "body": "White day is mainly celebrated in Japan.\n\nAnd it's all from one game. FGO.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "Gunta170944",
                            "body": "Wait FGO is the game that starts the trend of a dedicated White Day event?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Euphoric_Metal199",
                                    "body": "All of these are from FGO, yeah.\n\nThe first two for the NA Server(which already happened in the JP server 2 years ago)\n\nThe last two are from the current JP event.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ACFinal",
                            "body": "Yeah, I should have rephrased that. Though I didn't know that was all fgo until you told me, so thanks for that. \n\n\n I was trying to say \"aren't all Japanese gachas the ones that celebrate white day?\" I've just never seen a Chinese or Korean gachas celebrate it. It seems exclusive to Japanese gachas.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AnimatorFresh8841",
            "body": "all these beautiful handsome men and you forgot their in a game thats like 90% women",
            "score": 0,
            "replies": []
        },
        {
            "author": "Jay2Kaye",
            "body": "Almost all of them. Usually valentines day events are just reskinned white day events.",
            "score": -7,
            "replies": []
        }
    ]
}