{
    "title": "Poll Shows Strong Approval for Trump’s 2025 Joint Address to Congress Among Viewers",
    "author": "BiggieTwiggy1two3",
    "subreddit": "Conservative",
    "rank": 68,
    "score": 278,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.theunionjournal.com/poll-shows-strong-approval-for-trumps-2025-joint-address-to-congress-among-viewers/",
    "id": "1j3w9ph",
    "selftext": "",
    "comments": [
        {
            "author": "mdws1977",
            "body": "As expected, but I wonder what polls would say about the Democrat’s childish behavior?",
            "score": 28,
            "replies": [
                {
                    "author": "nicfection",
                    "body": "Doubt it’ll win them any favor. Supposedly they’re adults, but they sure act like petulant children.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "GiediOne",
                            "body": ">petulant children.\n\nThe Leftists have no answer for a Trump hurricane.  All they could do was futility protest and leave asap before Hurricane Trump hit the scene.  This guy is a force of nature.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Enchylada",
                                    "body": "They're literally the equivalent of the toddlers who hold their breaths when they don't get their way right now and everyone can see it",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mnpharm",
                    "body": "That definitely played into the positive polls, it was a horrible look and an embarrassment to the party, but not surprising.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "LastManSleeping",
            "body": "Tbf, the distribution of Ds, Rs and Is are skewed R, this result should be no surprise. Would like to have the data normalized to have a better idea on the general population stats",
            "score": 18,
            "replies": []
        },
        {
            "author": "maanoot",
            "body": "There were adults today, and there were children. Thank God the adults are now in charge.",
            "score": 17,
            "replies": []
        },
        {
            "author": "____IIIII___ll__I",
            "body": "The normal people have spoken.\n\nThe demonrats are intent on catering to the freaks in the minority and embarrassing themselves.\n\nYou love to see it.",
            "score": 17,
            "replies": []
        }
    ]
}