{
    "title": "Time to kill? Daylight saving falls out of favor with most Americans - Washington Times",
    "author": "GeneralCarlosQ17",
    "subreddit": "Conservative",
    "rank": 47,
    "score": 85,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 43,
    "url": "https://www.washingtontimes.com/news/2025/mar/4/time-kill-daylight-saving-falls-favor-americans/",
    "id": "1j454gi",
    "selftext": "",
    "comments": [
        {
            "author": "jasommer14",
            "body": "Seems sort of silly to keep at this point.",
            "score": 9,
            "replies": []
        },
        {
            "author": "dire76",
            "body": "Every single time DST starts or ends we have this conversation, yet nothing is ever done. Make it permanent then never change it again, everyone wins.",
            "score": 8,
            "replies": [
                {
                    "author": "Jonathan-Strang3",
                    "body": "Have to wonder why nothing ever happens. Who does the current arrangement benefit?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "reaper527",
            "body": "falls out of favor? did we set the clocks back like 40 years? when was the last time daylight savings time in favor?\n\n(and by that, i mean actually changing the clocks twice a year. i'm aware that most people are in favor of making \"daylight savings time\" the normal 365 time standard in the us and completely eliminating the standard, non-dst time)\n\nthis seems like a \"low hanging fruit\" item trump could get done pretty easy.",
            "score": 16,
            "replies": [
                {
                    "author": "Nifty_5050",
                    "body": "Some freaks actually prefer standard time",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "miscstarsong",
            "body": "For decades I have wondered why we still bother.  Just pick one and stick with it.  That's how it is in Arizona and we function just fine.   When I lived in Calif and was working, I preferred when it stayed light later.  It was no fun leaving work in the dark and driving in bad weather during rush hour.  Wanted to just go home, period.  When it stayed light for a couple more hours, I still felt like doing something after work, even if just to stop at the store.",
            "score": 6,
            "replies": []
        },
        {
            "author": "SheetFarter",
            "body": "It’s been out of favor for years and years and years people hate it get rid of it",
            "score": 18,
            "replies": []
        },
        {
            "author": "Rapidfiremma",
            "body": "Actually most people prefer permanent daylight saving time.",
            "score": 23,
            "replies": [
                {
                    "author": "Creeepy_Chris",
                    "body": "Yeah, that’s what I’d want.  It would be light later in the winter which would be nice (unless I have that backwards…)",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Rapidfiremma",
                            "body": "Yes, as an avid hunter it would be nice to get an extra hour of sleep before the hunt during season. \n\nAlso it's great to have time after work to spend with my son outside playing.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "triggernaut",
            "body": "I keep hoping Trump will announce this week he's signing an EO to cancel DST until a law can be passed to cut it permanently.",
            "score": 9,
            "replies": [
                {
                    "author": "GeneralCarlosQ17",
                    "body": "He said He was going to. I guess Timing is everything. /pun",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "CptMcCrae",
                    "body": "Good one!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "curlbaumann",
            "body": "I honestly thought this would’ve been the first thing Trump passed to get an easy bipartisan win with the new congress. Surprised he hasn’t done it yet tbh.",
            "score": 5,
            "replies": []
        },
        {
            "author": "bw2082",
            "body": "I think it's fine as is and really isn't a big deal.  If you change to either standard time or DST permanently, either way you will have very early or very late sunrises for some people at certain times of the year, especially if you are at the border of time zones.",
            "score": 8,
            "replies": [
                {
                    "author": "xAdakis",
                    "body": "If we get rid of daylight savings time, then I am willing to bet that people and business will change their hours of operation seasonally instead.\n\nThis will lead to chaos as people struggle to adapt to various scheduling conflicts.\n\nFor example, on March 11th, school will start at 9AM instead of 8AM. However, your employer is going to continue requiring you to be at work by 8:30AM. Meaning, tons of kids will arrive to school too early, and you'll still be rushing to get to work on time.\n\nThe one things DST does is keep us all on the same schedule.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MeLlamoKilo",
            "body": "Instead of falling back or springing forward... why don't we just move the time 30 minutes to the middle and \"call it a day.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unlucky-Prize",
            "body": "I love fall back.\n\nI hate spring forward.\n\nIs it possible to only have fall back??",
            "score": 0,
            "replies": [
                {
                    "author": "luderiffic",
                    "body": "You are wrong friend.  We need daylight after work, not in the morning.\n\nThis is also why nothing will probably happen because there is a sizeable disagreement on which is right.  (But I am of course)",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Fluxus4",
                            "body": "You are correct. Obviously.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}