{
    "title": "Democratic Senator Says Dems Out of Touch",
    "author": "intrigue-bliss4331",
    "subreddit": "Conservative",
    "rank": 30,
    "score": 144,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/Conservative/comments/1j476hu/democratic_senator_says_dems_out_of_touch/",
    "id": "1j476hu",
    "selftext": "[Dems Out of Touch](https://thehill.com/homenews/house/5165486-democrat-party-has-fallen-out-of-touch-with-the-majority-of-americans/) with majority of Americans per Rep Moulton (D-Mass). Yes, I think they showed us that last night.",
    "comments": [
        {
            "author": "OutlandishnessMain56",
            "body": "For some reason I see all these Canadian and Europe subs now. They are full of whiny liberal Americans apologists. They are totally out of touch with the country and the people in it. Even your standard issue Dem still loves our country. \n\nIt’s sad because the Canadians reject them and make fun of them, and they hate Republicans. So they just roam from sub to sub humiliating themselves and spouting woke nonsense.",
            "score": 26,
            "replies": [
                {
                    "author": "Rough_Transition1424",
                    "body": "They are a bunch of pick mes",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "According-Activity87",
            "body": "![gif](giphy|fs6pkH5wz1a7zvblds)",
            "score": 23,
            "replies": []
        },
        {
            "author": "-Istvan-5-",
            "body": "Hugely out of touch. \n\nIt's utterly bizarre to every normal American to see fellow Americans not cheer on statements that benefit us all as Americans. \n\nYou can not like trump, but still support this great nation.\n\nAs an example - planting a flag on Mars is a universal lofty goal that we should all support.\n\nThe Dems have let their egos get in the way of what they are supposed to be doing, improving this nation for its citizens.",
            "score": 35,
            "replies": []
        },
        {
            "author": "-Erase",
            "body": "Lots of Democrats are saying this all over, like Rham Emmanuel and Bill Clinton, but it seems pretty universal that those people aren’t the ones in Power. So it shouldn’t make a difference.",
            "score": 13,
            "replies": []
        },
        {
            "author": "baseball_Lover33",
            "body": "No shit Sherlock, after last nights performance of civil unrest.",
            "score": 40,
            "replies": []
        },
        {
            "author": "Zaphenzo",
            "body": "He's a rep, not a senator. But yeah, considering every single democratic senator just voted against banning men in women's sports, which some polls show even a majority of Democrats support, I'd agree with the assessment.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Priest93",
            "body": "He’s not a senator, he’s a representative. Our senators are Markey and Warren.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Right_Independent_71",
            "body": "He's gonna get the all those Mass dems angry...er...angrier.",
            "score": 3,
            "replies": []
        }
    ]
}