{
    "title": "The Democrats Seriously Haven’t Learned, Have They?",
    "author": "CartridgeCrusader23",
    "subreddit": "Conservative",
    "rank": 10,
    "score": 349,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 126,
    "url": "https://www.reddit.com/r/Conservative/comments/1j48qee/the_democrats_seriously_havent_learned_have_they/",
    "id": "1j48qee",
    "selftext": "\nI know there have already been a ton of threads about the Democrats refusing to stand for objectively good things during the speech, but what baffles me the most is how they think their rhetoric is going to win them any votes.\n\nIn my opinion, part of the reason they lost so badly is that they veered too far left. You’d think after such a catastrophic defeat, they’d adjust their strategy and find new ways to appeal to the broader voting base. But instead, they just keep doubling down on the same tired narrative—acting like anything President Trump does is automatically bad, without offering any real alternatives.\n\nTrump was 100% right when he said that if he somehow cured cancer, the Democrats would still find a way to shit on it. If they keep this up, the midterms are going to be an absolute bloodbath for them.",
    "comments": [
        {
            "author": "SeriousBlak",
            "body": "it feels like a blessing in disguise that he is in office now instead of in 2020. I think he has a better chance at actually getting things down now because the rest of the party has finally gotten supportive.",
            "score": 19,
            "replies": [
                {
                    "author": "HeReallyDoesntCare",
                    "body": "It's kind of like alcoholics and needing to hit rock bottom before they get better. It took four years of Biden puppetry for a lot of the country to realize we were at least on trajectory for rock bottom.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "RandolphE6",
            "body": "The Democrats that learn are no longer Democrats",
            "score": 30,
            "replies": []
        },
        {
            "author": "ApricotNo2918",
            "body": "It's not the Democratic Party any longer.  It's the Marxist Party.  It's a party of hate and self importance.",
            "score": 60,
            "replies": [
                {
                    "author": "Abrookspug",
                    "body": "I was just thinking about how much the parties have flipped over the years...it used to be republicans who were old and grouchy, clutching their pearls over anything fun or lighthearted, rich, elitist, and not able to crack a smile...or at least that was the stereotype for a long time, esp the 80s and 90s. \n\nNow that sounds like the democrat party politicians and many of their supporters...seemingly always angry, calling everyone dumb and uneducated, making fun of people who can't afford eggs and gas, and assuming anyone who thinks differently is literally hitler and should be shut up and/or murdered. Not any happiness to be found unless they're discussing the downfall of a conservative. It's weird because I even see my liberal friends morphing into that when they're online and talking politics...luckily they're more normal in person for now, but I worry about them slowly becoming nancy pelosi or joy behar as we age lol.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "No-Werewolf541",
                    "body": "It’s simple. You can’t move past hate if you hate yourself. The more left you are the more you hate yourself. \n\nThey hate themselves so much that they pin their problems on absolutely everything but themselves.\n\nUntil they can realize their problems in life are created by themselves not the government, not the nazis, not maga, not slavery, not billionaires, not big pharma, not corporations etc.. they will never change.",
                    "score": 29,
                    "replies": []
                }
            ]
        },
        {
            "author": "According-Activity87",
            "body": "No, they haven't and we have them right where we want them.",
            "score": 38,
            "replies": [
                {
                    "author": "SeemoarAlpha",
                    "body": "We have a long history in the U.S. of the political pendulum swinging back and forth.  There was a lot of talk after a successful 2 terms of Reagan that there never would be a Democrat president again.  Then along came Clinton.  The Dems will evolve.  Trump has fixed the \"woke\" and if he doesn't fix the \"broke\", it will open a gap for a Dem.  People tend to vote their wallets.  In Trump's first term, his dalliance with tariffs resulted in hurting farmers, they were made whole by the taxpayer, i.e. [farmer bailouts](https://en.wikipedia.org/wiki/Trump_administration_farmer_bailouts).  We need to be honest here, Trump needs sources of revenue to keep his promise of corporate tax cuts which very well could diminish the living standards of his supporters and independents.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "According-Activity87",
                            "body": "These are historic times, and Trump has won the party a historic victory. He's looking to cut everyone's taxes, not just corporate taxes. The Democrats, on the other hand, are in a difficult position, stuck in a \"death loop\" reminiscent of the Civil War era. They've chosen to focus on unpopular issues, which will likely continue to hurt them. Despite potential challenges, I have faith in Trump's economic policy, and I believe that without unexpected disruptions like COVID, America will experience unprecedented prosperity leading up to the next presidential election.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "kaytin911",
                                    "body": "I hope this is the era that a new party will appear and replace the Democrats.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WhiteTrashInNewShoes",
                    "body": "Exactly. I say, \"don't change a thing, Democrats\"",
                    "score": 16,
                    "replies": [
                        {
                            "author": "duracellchipmunk",
                            "body": "Yes keep getting rich out of touch celebrities to endorse you ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Single-Stop6768",
                    "body": "Really at this point the only way mid terms don't go our way is if Trump goes too far on various issues or if the economy isn't in good shape at the time. Personally I put my money on Trump going to far on deporting groups of people that while illegal are part of a group that independents feel for. Like children brought here by their parents. That's just my guess though, hopefully Trump keeps in mind that while it's important to keep up the pace and following through it's also important to win in 28 because if he loses the House then his admin will be impeached again and have his admin handicapped.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Specialist-Cover-316",
            "body": "According to Democrats The sky is constantly falling and they are the only ones who can stop it.",
            "score": 6,
            "replies": [
                {
                    "author": "Flare4roach",
                    "body": "Ah ah ah, they can stop it providing we pay for it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gone-Fishing89",
            "body": "The thing is that we were nowhere as bad as them during Biden's term. We didnt like Biden, but we stood up and clapped when he was announced. We still gave him dirty looks when he did his Union addresses, but we still gave him the respect.",
            "score": 68,
            "replies": [
                {
                    "author": "Pinot_Greasio",
                    "body": "We also didn't try to assassinate him multiple times.  These people are sick.",
                    "score": 67,
                    "replies": []
                },
                {
                    "author": "WhiteTrashInNewShoes",
                    "body": "I thought about this, but then you have outliers like MTG who act out and give your argument no merit.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "irishkenny1974",
                            "body": "True, but - MTG (who is from my state and I’m not a fan of hers) and Lauren Boebert have been vocal during past Biden speeches, and they didn’t need to be escorted out of the hall because they stood down and respected the Speaker.\n\nAl Green is an embarrassment, and the Democrat leadership (WHAT Democrat leadership?  Ha-ha) SHOULD be raking him over the coals today.  But they probably won’t.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "RealisticTadpole1926",
                            "body": "Did she not stand for a child with brain cancer because she hated Biden?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "chriscrowder",
                    "body": "TDS is a real thing",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "maitlandia",
                    "body": "Yeah, but remember there were a lot of RINOs who voted for him in that chamber during his term.",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "jcr2022",
            "body": "Just look at the polling on the major policies that Trump is supporting: border control, government audit and reduce spending, end men in women's sports, free speech initiatives - these are all in the \\~70% range of support. What can you do when you are on the other side of those issues?",
            "score": 10,
            "replies": []
        },
        {
            "author": "BigFlippa",
            "body": "At this point it’s not that they haven’t learned, it’s that they don’t want to. They still think they have the media to protect them but don’t realize the media as they know it is dead.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Academic-Tell4215",
            "body": "Let them do this. I encourage it. This will get us another victory in the next election cycle.",
            "score": 16,
            "replies": []
        },
        {
            "author": "maitlandia",
            "body": "They know that the media won't paint them in a bad light. Last night should not have surprised anyone; this is the way they are, and have been for a long time. Almost half the country still voted for them in the last election. I don't think last night will move the needle at all unfortunately. I hope I'm wrong.",
            "score": 12,
            "replies": []
        },
        {
            "author": "No_Line9668",
            "body": "I work in mental health care and I assure you Trump derangement syndrome is a real thing. ",
            "score": 5,
            "replies": [
                {
                    "author": "Imissyourgirlfriend2",
                    "body": "And in about 3 years, it will be Vance Derangement Syndrome",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Imissyourgirlfriend2",
            "body": "The losing will continue until the lessons are learned",
            "score": 1,
            "replies": []
        },
        {
            "author": "btapp7",
            "body": "Their response video was actually extremely moderate, almost to a tone where they agreed with most of the current R talking points. Their main gripe was that the economic plans were going to fail.",
            "score": 1,
            "replies": []
        }
    ]
}