{
    "title": "Was Percival bad after his bug fix?",
    "author": "None",
    "subreddit": "GranblueFantasyRelink",
    "rank": 18,
    "score": 6,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 30,
    "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1jaakx7/was_percival_bad_after_his_bug_fix/",
    "id": "1jaakx7",
    "selftext": "I hadnt played since the Luclilius patch but I vaugely heard how a lot of folks were calling him terrible after the bug fix and animation cancels were removed. But were people overreacting? Just curious.",
    "comments": [
        {
            "author": "Roarne",
            "body": "Most of the tier lists I've seen still put him in the middle of the pack somewhere, so he's not unplayable or something. It just really hurt his DPS because you can't infinitely use his abilities anymore. He's still one of my favorite characters and I've done all the content in the game with him so like most characters it doesn't really matter unless you're trying to speed run or something.",
            "score": 5,
            "replies": [
                {
                    "author": "None",
                    "body": "I mean I mained Seigfried (because big sword) and only after the fact I stopped playing that my freinds informed me I was playing one of the worst characters in the game.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "JumpingCoconut",
                            "body": "Don't give a shit about that. Also Siegfried is S tier as bot so now you can replace your mean friends with him lmao ",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I was thinking for trying Lance or Vasaraga when coming back how are they?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "JumpingCoconut",
                                            "body": "Both also good, Lancelot gives you carpal tunnel syndrome sure and Vaseraga is super cool power guy. Ghandagoza is similar to Vaseraga but does even more damage in one hit. If you miss the hit you'll hate yourself.\n\n\nAll characters are viable even at the hardest endgame fight. Sandalphon is generally the best though. You unlock him at the end of the game. ",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "I was mostly intrested in Lance because I saw people perfect dodge entire boss mechanics while continuing the attack it looked super fun.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "JumpingCoconut",
                                                            "body": "Yeah fight or flight Lancelot. You get that sigil from curios. It reduces your damage a lot and makes your dodges a lot better.\n\n\nThen your other sigils make up for the damage loss auf you spam X which is an attack that also counts as dodge. ",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "So he has an attack that is also a dodge built into his base kit? not a skill?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JumpingCoconut",
                                                                            "body": "Exactly. And you want to use it to perfect dodge all the time. Which is super easy with FAF.\n\n\nIn endgame many characters unlock such a skill though. Typically it's charge attacks. Narmaya, Percival and Yodarha all can hold X and if they let it go at the right time it's a perfect dodge that gives them a damage boost on top. \n\n\nFor Lancelot it's just press X to attack/dodge. He doesn't even need endgame for that. But it doesn't become OP until you get the flight or fight and other dodge sigils which only exist in endgame. ",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "Yea from Lancelots I have seen it seems way more spamable of a dodge than the other characters. I have seen some perfect dodge Lucilius's 7 trumpets while still just maintaining melee pressure it looked so fun.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vaccaria_",
            "body": "Schlat cancel Percy was top 2 DPS in the game. After the nerf he became shit and everyone I knew, even in the discord Percival channel stopped using him",
            "score": 3,
            "replies": []
        },
        {
            "author": "WatcherVT",
            "body": "I'm someone who complained about Percieval on this sub. People on this sub only parroted and never tested anything, so I did test him a LOT(around 50 hours). I've played all the melee characters with similar hours played as well(have 1000 active hours on this game)\n\nAll I can say is that he's pretty much average when it comes to DPS. The only problem is that that's the ONLY thing he can do, DPS. If you can only do DPS and only deal mediocre damage, you kinda suck. His only non-DPS is his CC which is pretty bad.",
            "score": 15,
            "replies": [
                {
                    "author": "None",
                    "body": "How are Lance and Vasaraga? other than Percival those two were on my list to main when coming back. I used to main  Seigfried  back when I played by I hear he isnt super good ethier.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WatcherVT",
                            "body": "Sieg, even not as an AI, is really fcking broken. Most people don't know how to use Perfect Execution cancelling so they don't know what they're talking about. It's just really hard to time. Basically his final Triangle/Y button(the one where he does an upper cut and a downward cut dealing massive damage, can be canceled into another one of it by dodging at the very last moment.\n\nVaseraga is one of the top DPS, just behind the \"OP ones\"(Charlotta and Sandy) and has a high skill ceiling. Lancelot has pretty low DPS but that's because he's mainly an SBA generator(which he can share to his allies through his skill btw) and the best CC in the game. He also has very easy access to CDR if you build FoF w/Nimble Onslaught.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Was the Sieg perfect excution cancel a thing thats always been there I vaugely remember somthing like that in the pre lucilius patch.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "WatcherVT",
                                            "body": "It was never patched out I still use it to this very day. It's really hard to be consistent with it though unless you commit to being Sieg.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "I like Sieg hes my fav character conceptually so if there is a way I can make him good ill commit to it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "WatcherVT",
                                                            "body": "[Here](https://www.reddit.com/r/GranblueFantasyRelink/comments/1jaboxb/for_people_who_didnt_know_sieg_has_an_important/) is the move to remind you how to do it.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kurage_pop",
                    "body": "Can the people downvoting all of WatcherVT's posts actually explain *why?*  \nWatcher sounds like they know what they're talking about but if they're wrong please *explain why* instead of just downvote and leave.\n\nPeople like me want to know why you disagree since I don't know the game too well.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WatcherVT",
                            "body": "I understand why they downvote it. My views has already been \"marred\" with a thousand hours of playtime. If someone new who likes Percival sees a comment like this they will lose motivation to play him, even though he's isn't \"unplayable\", only bad compared to other characters.\n\nIMO a better comment is to just tell them that he's good so they would try him. But I'm the type of person who likes to say what I think even with the negatives just to provide facts. Especially since there's a lot more \"positive\" people around to balance it lol.\n\nI'd like to say that even if Percieval was \"bad\" when comparing to other characters, I enjoyed the heck out of the time I spent with him. Particularly the a big part of Percieval's skill ceiling is the Supp damage he gains in his charged parry. His charged parry is also easier to pull off so it made me very satisfied(I think? Hardest was Narmaya).",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "mhireina",
                            "body": "I personally am wary of people who play characters at the expert level saying a character is bad because most of the time people aren't playing at the expert level or minmaxing. I don't agree with the pointless down voting but I'm also not inclined to listen to anything Watcher or CCs have to say because it's likely I don't play the way they do and I find my own way  to optimize the character based on my play ability, build capacity and reaction timing.\n\nIt could be related to that or people just being salty of someone else's educated opinion which is pretty silly ngl.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Kurage_pop",
                                    "body": "Yeah, but downvoting without explanation doesn't add to the discussion almost at all.  \nLike, a little bit, but it's not hard to type out your thoughts.\n\nI sometimes wonder if Reddit would function better if you could only downvote by leaving a reply.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "mhireina",
                                            "body": "Nah I agree. I can see the frustration about it because people want actual discussion here but most just wanna throw the updown doots without meaningful anything for the conversation.\n\nIt probably would function better to a point but the backlash would probably be worse than when YT removed down vote numbers all together lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "xritzx",
                            "body": "People down voting then not explaining why is one of the things I don't like about Reddit. Sometimes people are left wondering why something was downvoted and the downvote is not helpful in that situation. People adding constructive criticism to downvotes so there is an explanation would be appreciated.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Stygia1985",
            "body": "All characters should have had animation cancelling left in their optimal rotations. It's absolutely silly that it was removed. It allowed sweats to have more fun while having zero impact on casual pilots.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kurage_pop",
            "body": "So this bug was fixed?  \nI watched some guides on him from YouTube and was wondering what I was doing wrong.\n\nI really wish someone would make decent YouTube guides that are actually up to date because I've gotten so much misinfo from outdated guides...",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "Yea it was fixed back in march.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "okami_brush",
            "body": "I play Percival from time to time. He is nowhere near the top tier DPS characters, but he is very easy to play if you build him right.",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "I did hear that he makes up for it somewhat with his easy to perform parry and his stun build up.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lost_History_3583",
            "body": "Dude i straight up quit because of that. One of the most fun mechanical characters in the game just became boring af overnight. i might be on the unpopular end, but these \"fixes\" basically took a lot of the charm of learning the character and reduced (at least Percy) it to a basic unga bunga formula",
            "score": 1,
            "replies": []
        }
    ]
}