{
    "title": "This game still has an active playerbase in-game? (matchmaking, PS5)",
    "author": "t1Rabbit",
    "subreddit": "GranblueFantasyRelink",
    "rank": 19,
    "score": 2,
    "upvote_ratio": 0.63,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1jah8n5/this_game_still_has_an_active_playerbase_ingame/",
    "id": "1jah8n5",
    "selftext": "Im really at the edge of getting this game but i like to play endgame content with people via ingame matchmaking. Or people only play this through discord? (PS5)",
    "comments": [
        {
            "author": "xritzx",
            "body": "PS5 player base is active for quick quest and barely active for end game content.\n\nI've used the built-in matchmaking to meet everyone I've played with on PS5. There is a quick quest feature that works really well, you should get a match in under 10 minutes. I've done about 50 quick quests. I've often gotten matched in less than 5 minutes but there were a couple outliers where it took about 15 minutes. Quick quest can have end game quests but not usually because it queues people randomly. The people you match with in quick quest will probably have less than 1,000 quests completed. People in more difficult proud missions will probably have 2,000 or more quests completed, I've saw a player with as many as 40,000 quests completed.\n\nYou can also queue for individual quests, I highly recommend setting region to any and turning off power adjustment when doing this. The game has multiple tiers of difficulty with proud being the most difficult. I probably queued for 2 hours for pre-proud missions and never got any matches so I don't recommend pre-proud quest queueing. In proud, I've queued and can get matched at 15 minutes usually. Sometimes it's faster, sometimes I've waited 30 minutes and got no matches. Once you get a match for a specific quest, you can usually keep re-queing and do back to back quests until others are done farming it. The game also has a built-in repeat quest feature but it's rare to get 4 people that want to farm the same quest for another hour. I also met a group with 4 of us that have played about 30 quests together when we are all on at the same time. So if you matchmake with others, inviting each other again in-game or through PSN messaging can be useful.\n\nAlso, your time zone is very important for non mainstream games like this. I usually play between 6pm to 9pm EST and sometimes between 7am to 8am. If you play at other times such as noon EST (I've tried on weekends) then you will probably not find many matches, you can see this by looking at the concurrent players dip on steam charts. Steam charts is not completely accurate but it's close enough you can draw overall conclusions on how active a game is and what peak play times are. As an in-game example, I can get matches in this game for Zathba's volunteers proud boss rush quest at 7am EST when mostly people in Asia are playing but have never gotten a match for that quest at 7pm EST.",
            "score": 5,
            "replies": []
        },
        {
            "author": "okami_brush",
            "body": "I strongly recommend using the Discord.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tigerpower77",
            "body": "To late for the party, i use the pinned discord",
            "score": 1,
            "replies": []
        },
        {
            "author": "LsAstral",
            "body": "PS5 player here. I use pinned discord. Haven't had any trouble getting groups.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ralvainn",
            "body": "I'm down to play on psn:)",
            "score": 1,
            "replies": [
                {
                    "author": "Finalstan",
                    "body": "I am as well. Very experienced player. Game is still so much fun for me!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello, your post was removed due to your Reddit account either being less than a day old. This is done to combat against bots. We apologize for the inconvenience and would kindly ask for you to please wait until your Reddit account is 1 day old before trying to post again.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GranblueFantasyRelink) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ill-Lengthiness-9401",
            "body": "The discord chat suggest otherwise",
            "score": 1,
            "replies": []
        }
    ]
}