{
    "title": "New player, What advanced and broken tech still works in the current version of  the game?",
    "author": "Purple-Reputation899",
    "subreddit": "GranblueFantasyRelink",
    "rank": 11,
    "score": 2,
    "upvote_ratio": 0.56,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1jbk9y3/new_player_what_advanced_and_broken_tech_still/",
    "id": "1jbk9y3",
    "selftext": "Hello, Im a new player and been watching all types of content/ guides and a lot of the stuff I see in the videos for characters seem to have been patched out and fixed. What advanced tech still exists that majorly improves a select character for the game. For instance I keep seeing things about dodge cancels but I dont understand how to do them or if they still work. Since the game is kind of dead and im playing solo I would like to be able to output the most damage on harder levels of difficulty and play optimally.",
    "comments": [
        {
            "author": "Drepolam",
            "body": "Most of the stuff I would say is broken has been patched out, like damage cap inheritance, and *some* of the dodge cancels have been patched, but mostly just the skill followup ones, you can still dodge cancel through your light attacks to get to the heavy attacks you want on Vaseraga, you can still dodge out of Vaseraga's first heavies to spam them for movement, you can still dodge cancel into infinite perfect finishers on Siegfried, though I will admit I only really know much about Vaseraga (my main) and a handful of specific tech that I've seen around here",
            "score": 8,
            "replies": []
        },
        {
            "author": "StirFryTuna",
            "body": "If you want highest DPS just play Charlotta and unlock her warpath sigil. Once she has her warpath sigil, she jumps above the rest of the cast with the highest DPS by a good margin with the easiest and safest gameplay too since she can abuse invincible frames to ignore/dodge mechanics.\n\nWarpath+ is only in the transmarvel system which unlocks once you hit the highest difficulty so until then, you can get by playing whoever you want.",
            "score": 6,
            "replies": []
        },
        {
            "author": "purrifery",
            "body": "Don't have one but I suggest looking into the speedrunning community of GBF relink as they would incorporate broken techs in their runs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tigerpower77",
            "body": "You just need to understand the basics, you can clear the game comfortably without any \"broken tech\" unless that's fun for you.\n\nMaybe put the characters you're playing so people can give detailed explanations.\n\nLast thing is : i recommend using the pinned discord for lfg",
            "score": 2,
            "replies": [
                {
                    "author": "Purple-Reputation899",
                    "body": "I play mostly narmaya and yodorha, but I just unlocked Id and really liked his character so I want to put time into him too. I wanted to have a pocket range character so I pick up cagliostro but I don't really understand her kit.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "tonberrycheesecake",
                            "body": "Cag is honestly more of a melee moonlighting as a ranged character",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zylch_ein",
            "body": "Just play the game normally. Most of the game is not that hard. Of course it's a given that you also upgrade your AI teammates' loadout.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LoliNep",
            "body": "just dont die\n\n  \n(hold block while dodging)",
            "score": 0,
            "replies": []
        }
    ]
}