{
    "title": "Mod Announcement: Zero Tolerance for Rule Violations",
    "author": "I_AM_KIRA7111",
    "subreddit": "Funnymemes",
    "rank": 1,
    "score": 46,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 76,
    "url": "https://www.reddit.com/r/Funnymemes/comments/1drgzi7/mod_announcement_zero_tolerance_for_rule/",
    "id": "1drgzi7",
    "selftext": "**Mod Announcement: Zero Tolerance for Rule Violations**\n\nHey r/Funnymemes community,\n\n**We've noticed an increase in memes and comments that violate our subreddit rules, specifically those involving political content, sexism, hate speech against any religion, and toxic behavior. As a result, we are implementing a zero-tolerance policy effective immediately.**\n\n**Here's what you need to know:**\n\n1. **No Political Content**: Memes involving political figures, events, or ideologies will be removed, and the user will face a permanent ban without warning.\n2. **No Sexist Content**: Any meme or comment that promotes sexism or degrades individuals based on gender will result in an immediate permanent ban.\n3. **No Hate Speech Against Religion**: Memes or comments spreading hate against any religion will lead to a direct permanent ban.\n4. **No Toxic Behavior**: Any form of toxic behavior, including harassment or excessively negative comments, will not be tolerated and will result in a permanent ban.\n\n**Why are we doing this?**\nOur goal is to maintain a fun and inclusive community where everyone can enjoy and share memes without encountering offensive or harmful content. We take these rules seriously and expect all members to do the same.\n\n**What can you do?**\n1. **Follow the Rules**: Familiarize yourself with our subreddit rules and abide by them.\n2. **Report Violations**: If you see any rule violations, report them to the mods so we can take appropriate action.\n3. **Stay Positive**: Keep your memes and comments positive and enjoyable for everyone.\n\nThank you for your cooperation and understanding. Let's keep r/Funnymemes a fun and welcoming place for all!\n\n— The r/Funnymemes Mod Team",
    "comments": [
        {
            "author": "Captain_Morgan-",
            "body": "Let me guess,\n\n* Biden Good \n* Trump Bad\n* TransChildren Good \n* American Pediatrician said that we need stop made gender surgery  Bad\n* Left God\n* Right Bad \n* Democrat God\n* Republican Bad\n* Christianity Bad\n* Muslim God",
            "score": 48,
            "replies": [
                {
                    "author": "Tigxette",
                    "body": "Simply :\n- Respect Good.\n- No respect Bad.\n\n\nStrange that it isn't easy for everyone.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Nah looks like these mods haven't been bought by Democrats, other subs are full of America politics",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "zuzuk2",
                    "body": "True… Thank you for understanding.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Captain_Morgan-",
            "body": "Welcome to Fascist Era where Censorship is the Key.",
            "score": 27,
            "replies": [
                {
                    "author": "foladodo",
                    "body": "its in the rules, no political memes",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Kaltovar",
                            "body": "\"The rules are stupid\"\n\n\"Yeah but the rules say ...\"",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "homeostvsis",
            "body": "Sounds like it'll become another shitty r/facepalm type of sub, adíos!",
            "score": 24,
            "replies": [
                {
                    "author": "Don_Examoke",
                    "body": "Technically it's not gonna \"become\" it always were but no one was respecting it...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Can I still talk about how I’m gay and my dick is small?",
            "score": 13,
            "replies": [
                {
                    "author": "sprinkill",
                    "body": "I mean, mate, you can *especially* still talk about that.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "gonnago4",
                    "body": "This whole website was built for that.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Financial_Problem_47",
            "body": "Ayo, am I semi banned from this community?\n\nI called put a reposted and since then I got like 4 replies from people trying to justify reposts and now I am unable to even open that post so I can't even reply to thoss human excrement holes",
            "score": 8,
            "replies": [
                {
                    "author": "_SirLoinofBeef",
                    "body": "Yeah I got hit too…warned wtf I thought my shit was tame…oops can I say shit? Or poop? Uh oh I’m up poop creek and lost the paddle…can I say paddle? I give up",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mission-Background-2",
            "body": "*no political memes against Democrats. Here I fixed it for you",
            "score": 8,
            "replies": []
        },
        {
            "author": "Giuseppe-Testerone",
            "body": "Rule #1 Have fun making memes making fun of stupid people, stupid shit and stupid ideas.\n\nRule #2 Don't hurt anyone's wittow feeweengs.\n\nRule #3 Say what you want here!\n\nRule #4 Know what offends anybody and everybody at any time!\n\nRule #5 The rules may change at any minute, if it seems like the breeze to follow.\n\nRule #6 We're fucking reddit, you built us, and fuck you, we'll do what we want, it's our hot body!",
            "score": 8,
            "replies": [
                {
                    "author": "Yeralrightboah0566",
                    "body": "its simple: if you need to make fun of groups of people (women/ethnicity/orientation) to be funny, youre not funny and youre pathetic! thats all you have to do :\\]",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Interest-7220",
            "body": "Another sub down the censorship drain. Thank you, hero mods.",
            "score": 22,
            "replies": [
                {
                    "author": "I_AM_KIRA7111",
                    "body": "Dont worry memes would still be funny without insulting someone or being toxic 😉",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Ok-Interest-7220",
                            "body": "Wrong. That’s why everyone knows the left can’t meme. They don’t have a sense of humor because they literally are the joke. Imagine telling a comedian he can’t be offensive because of your feelings.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "Captain_Morgan-",
                                    "body": "Exactly",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "Yeralrightboah0566",
                                    "body": "ah one of those \"you cant say anything anymore!\" \n\nits almost like this is the way society is moving now. getting the hint yet? that kind of \"humor\" is lazy and damaging at best, toxic and dehumanizing at worst.\n\ngo find some other sub to post sexist memes in. eventually you'll struggle. women are equal to men in society, your crappy humor was never funny. stay mad.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Tricky-Kangaroo-6782",
                                            "body": "it is funny",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Get_wreckd_shill",
                                    "body": "Ppl like you are the reason they ban the shit in the first place",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Ok-Interest-7220",
                                            "body": "No, they censor because sensitive people like you can’t hear differing opinions. You’re perpetual victims.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "foladodo",
                                                    "body": "differing opinions is not the same thing as lightly veiled hate. You cant call those memes",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Yeralrightboah0566",
                                                    "body": "only edgelord losers who still think boomer humor is funny would call sexist memes \"differing opinions\"\n\nsir this is a meme sub. go post your shitty \"opinions\" (aka hate) in some other sub. funny memes dont have to be racist/political/sexist to be funny. youre just lazy and have no real sense of humor and so have to rely on shock value.\n\novercome your crippling insecurity, realize everyone is a human with individual hopes and dreams. someday you'll develop a personality and a real sense of humor, maybe.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Get_wreckd_shill",
                                                    "body": "The only victim i know was a rape victim. Do you think rape is funny too?\n\n![gif](giphy|8R8uwMohh3gX2XqELd|downsized)",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "Ok-Interest-7220",
                                                            "body": "Yes. Hilarious actually.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "Yeralrightboah0566",
                                                                    "body": "youre not special for being an edgelord dude. we're not in high school anymore. society is moving on, adapt or get left behind :\\]",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Get_wreckd_shill",
                                                                    "body": "What's the funniest thing about it?",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Captain_Morgan-",
                                                            "body": "If you censor something you are in the same level that Fascist and Propagandist. \n\n  \nWoke aka Leftist, love compare their enemy with nazi but they forgot the meaning of the acronym of nazi.\n\n**Nationalsozialistische Deutsche Arbeiterpartei** (German for 'National Socialist German Workers' Party')\n\nAND For **ww1**, the **Social Democratic** Party of **Germany** (SPD) used several key arguments to **justify their support for World War I**.\n\nIt was NEVER right wing that began the war in ww1 and ww2. That's happened TWO times in BOTH World War. Coincidence? For sure not!!!",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Yeralrightboah0566",
                                                                    "body": "imagine bringing up nazis and defending them because you cant post sexist memes in a subreddit anymore",
                                                                    "score": 3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Get_wreckd_shill",
                                                                    "body": "So you think censoring child porn is too \"leftist\" for you? \n\nOk, you can have that one.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Captain_Morgan-",
                                                                            "body": "Better\nLet's Kill al Pedophile, Serial Killer and Corrupt Politician !\nOh! I forgot both side, Leftist and Right, have friend in this circles.\nPoliticians that you support lie to you about and prefer that you fight stupid social fight.\n\nDon't forgot how good idea were \"Take down Wall street\"",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Get_wreckd_shill",
                                                                                    "body": "Yea, youre def a normal american. /s\n\nWhat do you think about Putin rewriting the constitution to stay in power forever? Such a small, weak man who diddles kids. 🇺🇦",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Captain_Morgan-",
                                                                                            "body": "Me AmerikDumb ?\n\nYou are totally BRAINwashed. Do you think that all the world is in America ? \n\nEres un tremendo chupapinga ptm causa, das palta.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Yeralrightboah0566",
                                                                                                    "body": "are you having a stroke? you should seek medical attention.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Funnymemes-ModTeam",
                                                    "body": "Respect others: No harassment, bullying, or toxic behavior. Treat all members with kindness and maintain a positive community environment.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Dor1000",
                                            "body": "i see what the sub owners want. from rule one: \"Don't post anything that would start a general discussion in the comments.\" i hope they dont whole-heartedly meme that. but its written right there. the problem is, sometimes the comments are better than the meme, and certainly worthwhile. humor without any edge has such limited mileage.\n\na lot of comments predicted the crackdown coming. due to shenanigans last two weeks. if everyone chills out the mods are more likely to chill and let things slide. if they see sincere contributions. i see both points - make friends!",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Get_wreckd_shill",
                                                    "body": "Thats crazy. I didnt even know they didnt want us having discussions. I guess we can speak in memes?",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Yeralrightboah0566",
                                                    "body": "follow sub rules = no conversations?\n\nsociety is moving on from sexist/boomer humor. adapt or get left behind. women are equal to men in society, in case you missed the memo",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kyle_Reese_Get_DOWN",
                            "body": "I’m grateful I can be protected from the people of the internet. There is nothing funny about politics or genders.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Captain_Morgan-",
                                    "body": "Welcome to Fascist Era where Censorship is the Key.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jungle-fever-retard",
                    "body": "“Sexism bad”\n\nYou: “WHY ARE YOU CENSORING MY BELIEFS?!”",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Yeralrightboah0566",
                            "body": "hit dog gonna holler",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "sprinkill",
                            "body": "Ya' know, I shouldn't do this, but I was forced to upvote your comment because it made me chuckle.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Law9_2",
            "body": "Bans on memes on a meme page is kinda wild 😂 🤣 😳 good thing I only lurk and steal content to share with friends....",
            "score": 3,
            "replies": []
        },
        {
            "author": "Worried_Ad_9667",
            "body": "Twitter called, they said “great job!”",
            "score": 9,
            "replies": [
                {
                    "author": "jungle-fever-retard",
                    "body": "You mean the Twitter that’s currently being run by a guy who got sued for racism in the workplace and lost and retweets Jewish Question posts agreeing with them? _That_ Twitter?",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Seems like I get nothing but these type of posts suggested unless I go directly to your subreddit",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "Bullshit, the sheer amount of reposting going on here would have you working this sub like a full time job, and you seemingly haven't even tried, this post is 3 months old, and the most popular post, even now, is a re-post. You shouldn't make grand statements that you have no intentions of following.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Plucky_Afleet_Alex",
            "body": "Jalen Hurts---> Crazy Pun here, Jailin\n\nBlack (Fe)Male----> Blackmail\n\nJayden Mcdaniels----> any name with Jayden, Jaded\n\nTaylor Swift----> Tailored Swift",
            "score": 2,
            "replies": []
        },
        {
            "author": "MakeUpAnything",
            "body": "I was noticing recently that I don't have to skip by this sub on r/all as much anymore. I appreciate the rule changes. I'm sure they weren't popular with the dredges here, but it's nice to be able to at least smirk at these as opposed to constantly rolling my eyes at the \"women and minorities bad now laugh\" stuff that used to flow from here so often.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Yeralrightboah0566",
            "body": "thanks mod team, maybe ill actually take this sub somewhat seriously now. it has devolved into some kind of boomer/edgelord/racist/sexist cesspool",
            "score": 3,
            "replies": []
        },
        {
            "author": "Dor1000",
            "body": "preventing low-effort unfunny toxicity makes sense, but banning politics is just to make it easier to moderate; to reduce the chance of chaos. one approach is no current/future politics, which is still too strict but an improvement on no politics.",
            "score": 2,
            "replies": [
                {
                    "author": "Captain_Morgan-",
                    "body": "Welcome to Fascist Era where Censorship is the Key.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Yeralrightboah0566",
                            "body": "monkey copy paste comment onto every comment! me smart\n\nadapt to a sense of humor that isnt 10-year old edgelord inspired. you'll be much happier",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ayanokoji-Kun-",
                    "body": "Come on ppl are getting so sensitive these days and reporting every single meme they find offensive 🤡 so the mod team have to take action or the mod team might get terminated xD",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Captain_Morgan-",
                            "body": "Welcome to Fascist Era where Censorship is the Key.\n\nA New Cold War will begin in few year you will see",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Yeralrightboah0566",
                                    "body": "women and men are equal in society. \"censorship\" (following sub rules but ok we'll pretend thats censorship lmao) is society saying your boomer humor is outdated and not wanted anymore.\n\nadapt or get left behind. you got a big storm comin!",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Dor1000",
                                            "body": "-reports you guys not making friends-",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Tigxette",
                                                    "body": "I mean, being an asshole is a good way to not get friends.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "There goes the funny on this page.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "WOW, I just scrolled through dozens of memes....\nAll of them are so lame.\n\nWhat happened?\n\nOh, PC cops are here now.\n\nDon't bother baning me, I'm un-subbing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "daevl",
            "body": "keep  an eye on the bots, your sub is overrun",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dirty_Job_3150",
            "body": "I'd say everything you wrote is incredibly subjective. In other words, the posters must subscribe to your view on the universe (which remains undefined). Otherwise they will be permanently banned. \n\nMakes perfect sense to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nishnig_Jones",
            "body": "https://www.threads.net/@realmaddox/post/DEx8NMlTe8f?xmt=AQGzKQepGYL8SpJ3RV_rNNgmauNjGfE-vUOhVGPHDC18Ng",
            "score": 1,
            "replies": []
        },
        {
            "author": "FluffyAd8209",
            "body": "I have not violated any of the rules, why are my posts no longer being seen?",
            "score": 1,
            "replies": []
        }
    ]
}