{
    "title": "First Dog, need insight",
    "author": "Cinnamoroll_Girl_",
    "subreddit": "Dogtraining",
    "rank": 39,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ilozsm/first_dog_need_insight/",
    "id": "1ilozsm",
    "selftext": "Hello!\nGonna be long so please bare with me:\n\nSo, mid december i went through and adopted a 5 yr old intact male from my local shelter.\nHe’s 6.5 kgs and apparently a mix of Pincher and some sort of Terrier, named Bilbo ( yep, like Bilbo Baggins).\nWe dont know anything about his background, just that he was found roaming with no microchip and that has been in the shelter, quarantined, for a month and a half prior to adoption, as per local laws.\nAt the beginning he was pretty much shutdown but he slowly opened up a bit and there are some behaviours that are… proving challenging to say the least:\n\nFirst and foremost: Marking \nHe was marking literally every day in every corner especially at night or when i wasnt looking (like i have two rooms, not a mansion and he stilll managed to do that while i was in the bathroom). I tried moving his last walk (of 4 total in the day) later at around 9pm while i usually wake up between 7 and 8 and removing the water when we are back and it didnt do much. What made things improve was bringing him to sleep with me. ( he has a bed, that went pretty much overlooked since day one besides treats and cuddles and praises). That brought the marking down by - a lot-  to the point i thought it solved. Nope.\nHe did it again twice this week.\nFirst time it was the first day i was away for half a day ( i work from home everyday, just had to go in the office that one day. I tried to get someone come in but my mom was sick and i was away. From 7 am to 4 pm, left him treats scattered around to sniff, his kong, tv on with music) and second time today. I was here all day…and god knows…i probably fell asleep on the couch idk.. i just know i noticed at some point before dinner the smell and yeah, he peed the unused dog bed. \nOfc i didnt scold him and cleaned with enzy cleaner before throwing it in the washing machine… but idk i feel defeated.\n\nWhen i was out he didnt even touched the treats or kong. He waited for me.\n\nI hired a trainer and he said he’s too attached and he knows he can get everything from me so we’re gonna work on this and on basic obedience… and i hope it works.\n\nHe learnt his sit and offers it spontaneously but doesnt listen to me pretty much at all, maybe 40% even when i have treats and definetely not outside.\n\nI love him to pieces, pet him often and have a very strict routine (yay autism) but i feel so confused. I thought there would be some improvement so far and i dont know if it’s normal that things are still so rocky\n\nAny imput is welcome and thanks for putting up with me\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Cinnamoroll_Girl_",
                    "body": "I have read the wiki and well what i tried is in the op. I just need input from others",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}