{
    "title": "Looking for advice to become a dog trainer",
    "author": "Gearbear94",
    "subreddit": "Dogtraining",
    "rank": 35,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ilxcsf/looking_for_advice_to_become_a_dog_trainer/",
    "id": "1ilxcsf",
    "selftext": "I live in Charlotte NC and don't really have any dog training schools close to my area to go to, so I was wondering about the credibility of these online programs such as CATCH, Karen Pryor, ABI, and academy for dog trainers. I currently work full time at a doggy daycare and love every second of it and I know that working with these animals is what I want to do with my life. Any tips and recommendations of how to get into this line of work would be greatly appreciated. I've thought about finding a mentor but don't really know how I should go about that.",
    "comments": [
        {
            "author": "rebcart",
            "body": "Post flair has been changed to [INDUSTRY].\n\n[INDUSTRY] threads have [relaxed professional verification requirements](https://www.reddit.com/r/Dogtraining/comments/rtjrtd/new_post_flair_industry/). This means we do not remove comments claiming to be a trainer, even if the user has provided no proof whatsoever that their statement is true. \n\nAll the regular rules still apply.\n\n---\n\nOP, did you check our wiki article on [becoming a trainer](http://www.reddit.com/r/Dogtraining/wiki/becomedogtrainer)?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Gearbear94",
                    "body": "Still need help with knowing the credibility of these programs and advice on getting my foot in the door",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}