{
    "title": "How do I get my dog to listen?",
    "author": "Kiku-Snape",
    "subreddit": "Dogtraining",
    "rank": 10,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1in2zry/how_do_i_get_my_dog_to_listen/",
    "id": "1in2zry",
    "selftext": "My family owns a 1yo dog. He is quite a strong and heavy mixbreed and most of the time well behaved. The problem is he often does not listen to the point that it's often problematic. \n\nHe always pulls on the leash, he wants to run after joggers other dogs and bikes and just compleatly stops listening once he spots them. Like he ignores my calls and commands and everything, wich is especaly bad when he is off the leash.\n\nThe worst thing however is that, when my mom or dad goes home from a walk, (we go on 3 a day,wich are actually quite long and tiring for him each as we do let him run without leash and play with him for example running either him or kicking stone and sticks for him to run after) he plops down on our property (and sometimes even the street, though that doesnt happen often) and refuses to stand up. He actually always trys to get out of the collar and then runs around. My mom can only get him home when my grandpa or me walk with her with him into the house. Our dog doesn't do that with me but he just won't stop doing that with my parents..\n\nHe also often steals stuff from the table or kitchen and even the trash and cabinet and we just can't get him to stop\n\nDo you guys have any tips to get him to not steal and listen to our comandos (and get him inside without my parents having to get me ir my grandpa)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Kiku-Snape",
                    "body": "The guide didn't work sadly so i'm hoping for other advice",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}