{
    "title": "Training \"bad\" behavior for good reasons?",
    "author": "ContributionFit1243",
    "subreddit": "Dogtraining",
    "rank": 8,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1in4hnq/training_bad_behavior_for_good_reasons/",
    "id": "1in4hnq",
    "selftext": "My dog has been in physical therapy for a while, and there are exercises we do at home. One of the things the PT wants him to do is stand up on his hind legs (the transition between two and four legs is what's important, since it's his hind legs that we're trying to strengthen.)\n\nSo I didn't really think about it, and I taught him \"stand up\" in addition to \"sit\" and \"down\" for his daily drills.\n\nHe was never much for jumping on people before, but as his leg has been getting stronger, he's started doing that to strangers and so on. So acknowledging that I probably screwed up by teaching him it's OK to jump on people, how can I salvage this?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "ContributionFit1243",
                    "body": "Looking through the wiki, I see lots of resources on training dogs not to jump on people, and I'm cool with that. The problem is that I want him to get up on his hind legs \\_sometimes\\_, and am looking for advice on how to differentiate the circumstances, or if it's even possible.\n\nAdvice is appreciated.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}