{
    "title": "20 Month old dog can't be trusted and I feel like I am at my wits end.",
    "author": "Holyshitheckhounds",
    "subreddit": "Dogtraining",
    "rank": 5,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1inarm6/20_month_old_dog_cant_be_trusted_and_i_feel_like/",
    "id": "1inarm6",
    "selftext": "My partner and I own a roughly 20 month old 16lb rescue mutt adopted when she was roughly 9 months old (as well as a 4 year old dog not the subject of this post). We completed beginner obedience with her and she was the best behaved dog in class. The problem is the second you have your back to her she is into trouble.\n\nNow I know a certain amount of mischief is normal for young dogs. We have been there with our other dog but this feels beyond. Behaviors when our back is turned include stealing food and garbage, chewing up items, and sometimes even pooping or peeing in the house.\n\nSo far we have tried: \n\nProviding her with lots of toys and appropriate chews and re directing her if she chews on something she shouldn't. This works if one of us is with her but the second we leave she is chewing on any item she can get her paws on including furniture, curtains, our vacuum etc.\n\nLots of stimulation to try and get rid of energy (runs, hikes, camping, doggy daycare). This may work for a few minutes but if she sees that we aren't there she is into something right away.\n\nDog proofing our home with gates and trying to put things away. We do are best but she is incredibly sneaky if she gets out of your sight will go to pretty great lengths to get to stuff. This includes jumping at tables or counters to knock stuff off, climbing on top of dressers, and even grabbing a backpack off a table then undoing the zipper and chewing through a plastic bag to get to chocolate inside. Even just turning my back and she may dive head first into my hot chocolate.\n\nLots of walks on a regular schedule to do business. She has never gotten the hang of alerting us if she needs to go. So we take our dogs out on a regular schedule. If we keep her with us at all times she never has an accident but occasionally if she slips out of our site she may pee or poop. This isn't consistent and we can't seem to pick out a pattern.\n\nI am hesitant to use her crate more when I can't give her 100% attention as she will shred any bedding or blankets we but in with (even with a toy present) so she is stuck on the bare plastic.\n\nHas anyone dealt with a mischievous dog like this and have any advise? Will she grow out of this with age? Or is there more we should be doing to set her up for success? Any thoughts are appreciated. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Holyshitheckhounds",
                    "body": "I have read through the wiki previously many times looking for tips for potty training, destructive chewing, and counter surfing. It's still feeling like we are not getting very far with her and I was wondering if anyone had similar experiences and could provide tips or guidance.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}