{
    "title": "8yo blue heeler training",
    "author": "Careful_Dress_732",
    "subreddit": "Dogtraining",
    "rank": 2,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1innrb5/8yo_blue_heeler_training/",
    "id": "1innrb5",
    "selftext": "Hey! I got married about four months ago and my wife has had her blue heeler for 8 years. We live on a ranch and have about 150ish head of cattle. He is a super smart dog, however he is a massive doofus. Due to lack of time and training he doesn’t do much with cows. He spins them in circles and just causes issues. I’ve been working with him, my only experience is helping friends and their dogs. He is different than any other dog I’ve worked with though. (Worked with is a loose term, I’ve taught friends dogs tricks and stuff but by no means any training or any true experience. I just like trying new things and the challenge.) We are currently night calving so we’ve had time to work with him. I’ve taught him how to spin, sit and wait before coming inside (and sometimes before going outside but we don’t enforce this like we do with him coming in), he knew how to sit and lay down, he heels and will follow us but is pretty easily distracted and needs reminders semi frequently. He is still a fairly hyperactive dog even though he’s older. Because of this he struggles with focusing even when we’re training. I’ll keep reading because I saw the part about hyperactive tendencies and stuff. Was more so curious if there’s any good recommendations on how to continue his training to maybe even being able to be in a field with cattle and not leave us, or even just stay put and not worry. Also wondering how far I can go with training him? He’s definitely ingrained with some habits (ie when he sits or lays down he circles around you and sits behind or next to you like 3/10 times) so what are some good places to start or is it worth taking the time to try or should we just leave him be because of his age? Thank you! I’m open to anything!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Careful_Dress_732",
                    "body": "I’ve been working with him slow, I never knew the information about “dominance” or submission. Is grabbing the dog considered a fear thing? Never to hurt it or anything just to get its attention. I’ve heard that it relates to them being puppies kinda like cats getting scruffed? I read the guide and didn’t find too many answers specific to my needs, however it seems like it’d be helpful to most!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cursethewind",
                    "body": "> Is grabbing the dog considered a fear thing?\n\nYes.\n\nIt's not \"getting their attention\" seeing you can get their attention with something like squeaky noises or a rattling of a treat bag.\n\nHave you read the basics on how to train in the guide? Or the ABCs of problem solving?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Careful_Dress_732",
                    "body": "I didn’t see that, I’ll look for it now!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Careful_Dress_732",
                    "body": "We do the abcs! I didn’t know that’s what it was though. We just figure we can’t blame him for behaviors that are natural. If he’s hungry and the cat’s food bowl is in reach, he’s going to want to eat from the bowl. We don’t do leash training because we are out in no where Montana so there was no reason to, however I was thinking about starting. That’s another reason why I reached out here! I didn’t see the training section thank you! The hiking sections aren’t available to me, I think that’d be the closest thing to us working in the fields. Just looking for some guidance! Thanks.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}