{
    "title": "Apple executives believe users will ‘love’ upcoming iOS 19 overhaul, per report",
    "author": "Snoop8ball",
    "subreddit": "apple",
    "rank": 13,
    "score": 2679,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 646,
    "url": "https://9to5mac.com/2025/03/16/apple-executives-believe-users-will-love-upcoming-ios-19-overhaul-per-report/",
    "id": "1jcw1fx",
    "selftext": "",
    "comments": [
        {
            "author": "winterblink",
            "body": "LOL, what else are they gonna say?\n\nAside from that, I'm actually curious what they've got cooking. I'm okay with evolving UI designs, and they've been doing some interesting things so far even with iOS (thinking about the Sports and Invites apps and how different they are from other Apple apps).",
            "score": 1534,
            "replies": [
                {
                    "author": "nutmac",
                    "body": "Tim Cook: iPhone 19 is our second best iPhone ever. It's not as good as iPhone 18, but we.think it's still pretty good.",
                    "score": 544,
                    "replies": [
                        {
                            "author": "unitedfan6191",
                            "body": "Tim Cook: I can’t deny the fact that we like iPhone 19. Right now, we like it!",
                            "score": 105,
                            "replies": [
                                {
                                    "author": "alien-reject",
                                    "body": "We’re gonna love it, even if you don’t!",
                                    "score": 52,
                                    "replies": [
                                        {
                                            "author": "martindrx1",
                                            "body": "Why do I read these with Trumps voice in my head… dammit!",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Snowlandnts",
                                    "body": "Tim Cook: Sometimes I miss Steve Jobs reaming my ass.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "kiradotee",
                                    "body": "Sounds like Trump lol",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "unitedfan6191",
                                    "body": "Nope. Paraphrased from Sally Field’s second Oscar acceptance speech.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Mysterious_Sea1489",
                            "body": "We already have an iPhone for people who love great cameras, the iPhone 16! ^/Mattrick",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Eruannster",
                            "body": "\"We think our users are going to absolutely hate the new update, and our new phones are slightly slower this year.\"",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "fyrelawd",
                            "body": "iPhone 20- it’s fine™",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Patarokun",
                            "body": "“Iphone OS 19. Honestly, it probably won’t be your cup of tea.”",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "f50c13t1",
                            "body": "With the colors that our customers know and love.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Old_Dealer_7002",
                            "body": "🤣",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sup3r_hero",
                    "body": "“Our new ios version sucks balls. I wish steve was still alive to save this abomination”",
                    "score": 49,
                    "replies": [
                        {
                            "author": "demunted",
                            "body": "\"we tried to copy everything Google is doing, but as per usual we're holding back on a number of practical ideas for a few more generations, copy and paste really wasn't that important at the start\"",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Op3rat0rr",
                            "body": "Tbh they probably do say that sometimes",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "_Rand_",
                    "body": "Always laugh when a company says something like that.  \n\nLike they are going to put out something and say this thing is crap and you’ll hate it.",
                    "score": 132,
                    "replies": [
                        {
                            "author": "DeviIOfHeIIsKitchen",
                            "body": "This is an internal report. It has the possibility of being negative. It’s not marketing.",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "Kwpolska",
                                    "body": "Is it really an internal report, or is it something written specifically for the rumor mill to promote the new design?",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "DeviIOfHeIIsKitchen",
                                            "body": "Really an internal report. It is genuinely not that deep, we do not live in a TV show, this is bog standard Bloomberg, just like the meeting revealed about turmoil with AI embarrassment last week.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Coffee_Ops",
                                                    "body": "Intentional leaks aren't deep conspiracy theory, they're pretty common.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "filmantopia",
                                                            "body": "But intentional leaks don't usually include messages about how the company believes products and features will be received, so I'm inclined to believe this is a genuine expression of satisfaction with what they have done, even if it's intentional.\n\nWe had a lot of reports about internal debate and frustration with the Vision Pro prior to its release, so it's not like it's always rosy news from within.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "DeviIOfHeIIsKitchen",
                                    "body": "Most F500 companies will acknowledge the negatives internally, pretty normal imo.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "kus1987",
                                    "body": "> Most F500 companies will acknowledge the negatives internally, pretty normal imo.\n\nWhich is why the Amazon Fire Phone was such a surprise. How come nobody dared criticize Jeff Bezos' baby? Like come on the 3D gimmick was nonsense. No Google Play was nonsense. I mean if it was cheaper and a loss leader, I could still understand it but it wasn't even that. It was priced to make a profit. Well, can't make a profit if nobody buys it but still executives were more focused on saving their own asses by being yes men than doing their jobs.\n\n-------- \n\nedit: just for giggles, I asked claude to make my above comment more politically correct and written from the perspective of an Amazon dot com executive: \n\nWhile most large corporations do acknowledge internal challenges privately, the reception to the Amazon Fire Phone was certainly unique. In hindsight, there were some design choices and features that, while innovative, may not have fully resonated with customers.\n\nThe 3D 'Dynamic Perspective' functionality, while an interesting technical achievement, perhaps did not provide enough practical utility to justify the investment. And the lack of Google Play support, while a strategic decision, did limit the available app ecosystem.\n\nIn terms of pricing, the team sought to position the Fire Phone as a premium, profitable offering, but that approach may not have been the optimal strategy given the competitive landscape. Ultimately, the sales performance fell short of expectations.\n\nLooking back, there are certainly lessons to be learned about balancing innovation with customer needs and market realities. As an organization, we will continue to reflect on this experience and apply those learnings to future product development efforts. Our focus remains on delivering the best possible experience for our customers.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "mxzf",
                                    "body": "It's still marketing, it's just less overtly marketing than some other stuff.",
                                    "score": -5,
                                    "replies": []
                                },
                                {
                                    "author": "DeviIOfHeIIsKitchen",
                                    "body": "No, it’s not. Just like the internal dialogue about what a mess Apple Intelligence is not marketing.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ILOVESHITTINGMYPANTS",
                            "body": "I have no issue with a company saying that. Of course they feel that way. I just think it’s incredibly stupid to report on it as news.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "DontMemeAtMe",
                                    "body": "The source is a website completely devoted to reporting on just Apple things… It’s their “news”.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ILOVESHITTINGMYPANTS",
                                    "body": "I understand that, but “Apple thinks product they are working on is good” is not news. Might as well write an article like “Craig Federighi ate breakfast and then took a shit this morning”. Ok? 1, I figured, and 2, why the hell would I care?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "DontMemeAtMe",
                                    "body": "I don’t disagree with you at all. However, I believe their target audience would read it with gusto anyway.\n\nTo me, it’s bizarre that so many publications are devoted entirely to a single corporation — but here we are.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sheravi",
                            "body": "This one wasn't our best. Murray was the lead designer and he really dropped the ball. Dammit Murray, do better.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "qanunboi",
                                    "body": "Murray was busy enhancing his croquet skills when he was supposed to practice tennis and now it has led to him underperforming and dropping the ball for the umpteenth time.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ellacoya",
                            "body": "I bet these crackheads will like our new \"flavored crack\" (written on a IPad).",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SirPooleyX",
                            "body": "Apple says it with literally every single iPhone release.\n\n\"This is our best iPhone yet.\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheDragonSlayingCat",
                                    "body": "They kind of have to do that; if they didn’t, they’d fall victim to the [Ratner Effect](https://en.wikipedia.org/wiki/Gerald_Ratner#Career).",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Exist50",
                    "body": "I think iOS will be fine. Just worried about macOS. The last few updates have felt like a step back in some ways, and while this may be a great opportunity to fix some of those issues (e.g. settings), it may also double down. Tbd.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "blazingasshole",
                            "body": "man I’m baffled why they haven’t fixed the search yet. It’s atrocious I’m just shocked. Like literally not being able to search for a file in a directory even if I out the full filename",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "dccorona",
                                    "body": "On the one hand it obviously shouldn’t be that bad, but on the other hand it doesn’t really matter to me because you can just install a better search on macOS.",
                                    "score": -5,
                                    "replies": []
                                },
                                {
                                    "author": "justastuma",
                                    "body": "One of the best (or at least most common) arguments for Apple products used to be “it just works”. So such a basic feature like search not working properly out of the box kinda is a big deal.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "alt-right-del",
                            "body": "MacOS will be replaced by iOS — makes no sense from a cost perspective to have two different OS running on the same chip — give it 3-4 years.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Exist50",
                            "body": "I'm skeptical they could get away with that. Not unless they relax most of the iOS restrictions around app installation and permissions.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "21Shells",
                            "body": "I’ve never owned a Mac so don’t know how entirely true this is, but my understanding is that most Macs are used by creators that need powerful software (Adobe CS or FL Studio for example) because those are the only people i’ve seen use them irl. Chromebooks have taken the “just need a browser and email” market, X86 Windows and Linux desktops and laptops are significantly better for gaming currently too. Supposedly saves a lot of frustration for independent creators who don’t want to troubleshoot Windows software. \n\nThey would have to open iOS up to run all of these apps as well as they did on MacOS. I think it’d be easier to replace iOS with a new OS based on MacOS than the other way around.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ElkMasterGeneral",
                            "body": "So to you it’s not about the use case but the chip behind it.\n\nIf what you said was true then iPadOS wouldn’t exist.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "DaggumTarHeels",
                            "body": "It makes no sense to replace an OS with one that doesn't have feature parity. \n\nIf Apple tries to force a locked-down OS onto their desktop devices, that's the end of the Mac. I don't see consumer sales picking up the slack from the absolute curb-stomping their numbers will get from professionals. \n\niPadOS, VisionOS, and iOS are absolutely useless for actual work.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "JamesEdward34",
                            "body": "step back how? can you give an example or two?",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "Exist50",
                            "body": "The settings app is the one thing that sticks out in my mind, inconsequential as it may be. And the only reason I can think of why it was made this way was to be more iOS-like. That's my only concern with a similar visionOS-inspired rework. I want the UI on each platform to cater to that platform's specific circumstances, not necessarily all look and act the same.\n\nEdit: Also, this is less a UI thing, but the Disk Utility app has gotten seriously nerfed over the years. Would love to see that spruced up.",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "WindozeWoes",
                            "body": ">Also, this is less a UI thing, but the Disk Utility app has gotten seriously nerfed over the years. Would love to see that spruced up. \n\nWhat's been nerfed exactly? I know some settings are hidden by default (\"show all devices\") but I can't recall what has been taken away. I use Disk Utility weekly.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Exist50",
                            "body": "El Capitan was the big change, iirc. Lot of stuff like partition and RAID management, disk burning, some disk verification features, etc got removed or weakened.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "karma_the_sequel",
                            "body": "I agree on both counts.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "https://youtu.be/XzyNPoI17rE?feature=shared",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "dccorona",
                            "body": "I think the complaints about the settings app are mostly due to people not liking change. I’m not saying the new one is good, but its problems aren’t due to being more like iOS, and they’re not so much new as they are different. It is poorly and confusingly laid out, but it was poorly and confusingly laid out too. It just worked because people learned it anyway.\n\nIn other words I don’t think interface convergence is the issue here. ",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "cherry_chocolate_",
                            "body": "I haven’t been able to drag files while peeking the desktop since the latest os update months ago. It’s the same update that introduced clicking the desktop to peek which was already annoying, but now also it’s broken too!",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No-Bar7826",
                    "body": "“We tried really hard, and spent a ridiculous amount of money on overtime, however; we feel that we kinda dropped the ball on this one. Some of it feels half-baked, while other parts feel overdone, so we’re fairly satisfied in describing this as three-quarters baked. \n\nAnyways, we feel you just gonna abhor it.\n\n- alternate universe Apple”",
                    "score": 18,
                    "replies": [
                        {
                            "author": "sgt_based",
                            "body": "I miss Steve. He’d have def said 💩 like this while still being loved and adored by fans. I love brutal honesty.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The_Great_Baebino",
                    "body": "“We’d like to announce one of most dogshit updates we’ve ever come up with. It’s truly amazing how fucking ass this is going to be for everyone. I can not honestly pinpoint a worst thing we’ve ever even thought of before. Have fun fuckers.”",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "dccorona",
                    "body": "This is not a public statement so there’s plenty of things they could be saying. They could be internally expressing skepticism or there could be disagreement about whether or not it’s going to work. The only thing that wouldn’t make sense would be a universal lack of confidence because then it wouldn’t be happening.  ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "karma_the_sequel",
                    "body": "The word on the street is that the iOS interface overhaul is intended to align its design language with that of the Sports and Invites apps.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "kangadac",
                    "body": "I’m fine with evolving UI designs. It’s the complete rewrites that have half the functionality to be added at a later, unspecified date that infuriate me.\n\nThankfully, Apple has been good about this. Settings to System Preferences didn’t bother me much other than the loss of muscle memory. Microsoft, though, still has yet to get everything into their Outlook or Teams rewrites. I don’t use Sonos, but their ill-conceived rewrite was enough to impact their stock and show the CEO the door.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "winterblink",
                            "body": "Microsoft’s example is an interesting one. They are how far into Windows 11 and the settings app doesn’t have all the control panel functionality still.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "mxzf",
                                    "body": "Especially when they've been trying to move stuff off of Control Panel since, what, Windows 8?  Or was it 10?  Either way, it's not like it's a new shift in 11.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AliveInTheFuture",
                    "body": "Just go look at what Android features iPhone didn’t have the last 2 years.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Perceptions-pk",
                    "body": "iOS 19: expect mildly underwhelming!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "redditproha",
                    "body": "we'll love it if it fixes all the bugs",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rotates-potatoes",
                    "body": "What else are they going to *believe*?\n\nIf they don’t think they’re building the right things, they can and should pivot. The problem isn’t whether execs believe they’re right or not, the problem is when they are *wrong*. Which happens to every company.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SandKeeper",
                    "body": "I really love the sports app. I really hope they add the ability to look at teams and players individually even if they don’t have a game going on",
                    "score": 1,
                    "replies": [
                        {
                            "author": "winterblink",
                            "body": "I’m not a big sports person myself but the app style is an interesting departure from the norm.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SandKeeper",
                            "body": "They have been making it a little better each month usually. Adding features slowly. I imagine the team working on it is small. But it works well for what it is right now.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dustsmoke",
                    "body": "More new features fighting old features. Trying to select some text? How about we add 10 seconds of lag so we can run that through some apple intelligence or a dictionary? For some reason? You like that right? The fact that you cannot simply select some text anymore? Oh wait, here comes siri.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "oski80",
                    "body": "-“we think you gonna hate it!”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheBonnomiAgency",
                    "body": "Except the stupid stuff, like they just defaulted email to their new category view and forced people to change it back.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "winterblink",
                            "body": "I actually don’t mind that change all that much. It’s easy to switch to all mail with one tap, and turn off for those who don’t prefer the new view. They could have just made it a permanent switch for all, which would not have been cool.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "imaginedaydream",
                    "body": "Our shareholders gonna love it until they don’t",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Avandalon",
                    "body": "“Everyones gonna be pissed but after the nth update it will be fine”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mennydrives",
                    "body": "Honestly, my first and last favorite iOS update was iOS 12. It was a \"we  didn't do shit, just optimized the fuck out of everything internally\" update, and I could not have been happier.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SuperRob",
                    "body": "“We think you’re going to love iOS 19 so much, you might even forget that whole bait ‘n’ switch on Apple Intelligence we used to sell you the iPhone 16.”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "anothermatt8",
                    "body": "Sports is a massive opportunity for them given the hot garbage ESPN’s app is. Especially as they get rights to more games, etc. \n\nNeed to integrate a score crawl into CarPlay.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "zooeymadeofglass",
                    "body": "Agreed - The only thing I'm not overly fond of are the mail categories. Everything else, I dig it. Of course, I mostly use my phone like a glorified iPod.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PretzelsThirst",
                    "body": "They’re making everything like the new photos app. Aren’t you excited?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "croholdr",
                    "body": "Maybe they will introduce an AI powered cook book; but recipes will all have one thing in common: its main ingredient apples!!!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Evening_Job_9332",
                    "body": "Not say anything at all given the mess that is currently going on?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Niightstalker",
                    "body": "Not like they put out a press statement. This is some crappy article about some unspecific sentence some self proclaimed Apple insider said.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "PleasantWay7",
                    "body": "It is become a meme because Jobs used to say it. But everyone loved their shit back then. They’ve kept using it but are seemingly drifting more out of touch each year, so now it is just a joke.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "klavijaturista",
                    "body": "They’re generating hype",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "InitialDay6670",
                    "body": "AI generated setting finder. For all those settings about one thing but in a completely different spot!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "mikeyd85",
            "body": "This is the latest version of iOS, and we think you're going to love it.",
            "score": 1989,
            "replies": [
                {
                    "author": "Nikiaf",
                    "body": "“It’s our best one yet”",
                    "score": 692,
                    "replies": [
                        {
                            "author": "wwabc",
                            "body": "\"it has the highest number ever!!\"",
                            "score": 386,
                            "replies": [
                                {
                                    "author": "BigBagaroo",
                                    "body": "«It is embiggened.»",
                                    "score": 85,
                                    "replies": [
                                        {
                                            "author": "flojo2012",
                                            "body": "Perfectly cromulent",
                                            "score": 41,
                                            "replies": [
                                                {
                                                    "author": "humanreboot",
                                                    "body": "... what's the charge?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "tangledwire",
                                                            "body": "Tree fiddy",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Snidrogen",
                                            "body": "“A noble soul embiggens even the smallest update.”",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "WingZeroCoder",
                                            "body": "[ Number incrementing intensifies ]",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Shleemy_Pants",
                                    "body": "“Some features Coming this fall, with additional features in 2026”",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "aykay55",
                                            "body": "We’re taking some more time to ensure that your experience with these features will be the best it can be (we haven’t even compiled the code yet)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SillyMikey",
                                    "body": "It’s our most highly quality professional camera yet and only works with the 17 Pro Max Plus.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "type104",
                                            "body": "*some features",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "jspeed04",
                                                    "body": "With the rest coming this spring in a future update.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "snowdn",
                                                            "body": "Spring 2027.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "sgt_based",
                                                                    "body": "The poors are still gonna get 60hz screens tho.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "doctorblowhole",
                                    "body": "Alu-mini-um (in British)",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Welcome to the English language.",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "AccomplishedCoffee",
                                            "body": "Jonny Ive left several years ago",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "buttplugpeddler",
                                            "body": "It’s pronounced Aluminum",
                                            "score": -6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Tearaway32",
                                            "body": "Just like uranum and lithum. ",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "buttplugpeddler",
                                            "body": "I was going for funny. \n\nBig miss. \n\nOh well.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Tearaway32",
                                            "body": "So was I - we missed together. I guess Jony Ive’s belief is simplicity was misplaced. ",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "buttplugpeddler",
                                            "body": "🤝",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "DrFloyd5",
                                            "body": "You say tomato. I say tomato.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "notthathungryhippo",
                                    "body": "immediately i think of silicon valley’s gavin belson and his execs that tell him what he wants to hear",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mikerichh",
                            "body": "lol gaming companies do the same thing. With call of duty it’s always “the most innovative” one yet. Or “most advanced”",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Adammmmski",
                                    "body": "Fifa does this. New ball movement technology or some bullshit that just ends up being the same tired game year on year.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "turbo_dude",
                    "body": "You’ll love how we got rid of the headphone jack, restricted the battery ability without telling you, randomly changed the photos app even though no one asked for it and still didn’t fix the keyboard etc etc",
                    "score": 55,
                    "replies": [
                        {
                            "author": "villageidiot33",
                            "body": "God I still hate this photos app. Nothing I do to settings makes me like it. It just 100% sucks.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Londumbdumb",
                                    "body": "Why can’t I see my albums first????",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HurasmusBDraggin",
                            "body": ">You’ll love how we got rid of the headphone jack\n\n**c o u r a g e**",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "sgt_based",
                                    "body": "You’ll love how we kept the 60hz for the poors.\n\n**p o v e r t y**",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "nicuramar",
                            "body": "Very few people “love” that they got rid of the headphone jack, but most people don’t care and prefer to use wireless headphones. ",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "turbo_dude",
                                    "body": "I'd say about 1/4 of people I see still use wired. I get all the arguments for and against and personally have different headphones wired/wireless, for different situations.\n\nTo my mind it would be like getting rid of the keyboard and telling everyone to use the dictation function.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "doommaster",
                            "body": "The fact, that we still have phones with headphone jacks today, goes to show that many people still love them.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "turbo_dude",
                                    "body": "I also loved removable storage and batteries.\nRIP Nokia",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SendClown",
                    "body": "We have decided to forgo customer satisfaction and have intentionally designed an OS that stinks.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "pierreor",
                    "body": "TIM ORANGE: We really screwed up with this one guys. I don’t even feel like showing it to you. We think you’re gonna hate it… I don’t even know how this happened. Craig, look at this and tell me what we did wrong.\n\nCRAIG: Let me see, I’m sure it’s not that b— AAAAAAAAAAAAAAHHHHHHHH!!!!",
                    "score": 18,
                    "replies": [
                        {
                            "author": "sgt_based",
                            "body": "Tim: It’s so lame I can’t do another meaningless stylised launch sermon. Here’s a power point presentation from one of our interns.\n\nAudience: **orgasmic euphoria**",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TETZUO_AUS",
                    "body": "Before the comments loaded I was expecting this one haha",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "mikew_reddit",
                    "body": "I'm fairly confident I could ask AI to generate the script for an Apple event and it would predict with reasonable accuracy what is going to be said.\n\nAlso, the content of the article is garbage.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "M4wut",
                    "body": "Will we finally be allowed to change individual sound volume and have more than 1 audio play without freezing or stopping the other audio source or video? How about real multitasking in the background? And landscape mode back again? Holy shit long over due for iOS to get the basics down",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "EasyMode556",
                    "body": "“This changes everything. Again\n\n\nAgain.\n\n\n\n\n…..again”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "THEMACGOD",
                    "body": "It had “courage” built in!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Free-Pound-6139",
                    "body": "hey everyone, this version sucks, I would skip it. We will try harder for next time.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "drewheyn",
                    "body": "Over 50% of iOS users are new to the new iOS.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bouncescotch",
                    "body": "this line has become the Wilhelm scream of Apple keynotes alongside \"crack marketing team\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "99OBJ",
                    "body": "GOOD MORNAANG CUPAHRTAYNOOOO\n\nHEYUR AHT AHPUL WE BELEHV IN CRAYATING PRAHDUCTS THAT OWUR CUSTOHMERS LAHV",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "nanocookie",
                    "body": "\"Everything is computer\" 🤣",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Koopacha",
                    "body": "Hilarious and original comment",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "Evening_Job_9332",
                    "body": "Just like the script for every keynote",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "sgt_based",
                    "body": "This is our best ios update yet!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mikeyd85",
                    "body": "It was my turn for karma farming, OK?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "likwitsnake",
                    "body": "apple cloth now compatible with ios19",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "musexistential",
                    "body": "I learned it from you dad!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SaltineAmerican_1970",
                    "body": "This is the latest version of iOS, and you **will** love it, or else.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Jeffreyknows",
                    "body": "Apple AI coming in 3035",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Huckleberry199",
                    "body": " There is nothing to love about a Nazi product.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Robert_Cutty",
            "body": "For once, I’d like for Apple to say:\n\n“Honestly guys, we’re fresh out of ideas. We made some incremental improvements. Update your devices if you want. We don’t give a shit.”",
            "score": 402,
            "replies": [
                {
                    "author": "zippy72",
                    "body": "That would work for me, to be honest. I'd update.",
                    "score": 101,
                    "replies": [
                        {
                            "author": "Hustletron",
                            "body": "Screams level-headed stability tbh",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "ChildishRebelSoldier",
                                    "body": "That screams a 10% drop in stock prices",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "bonsai1214",
                                    "body": "snow leopard update bby.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "jollyllama",
                                            "body": "I always wonder how many people talking about snow leopard were actually here for it, because 10.6.0 was a disaster ",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "bonsai1214",
                                            "body": "Was it? I honestly don’t remember and never had any issues with it (or pretty much any OS X update). It was also like what, 15+ years ago?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lost-mypasswordagain",
                    "body": "I feel like when they keep comparing their new hardware to M1’s and Intel models that’s pretty much what they’re saying. \n\n“The M4.  It’s pretty good if you haven’t bought a new computer in 4-6 years.  We think you’re going to love it.”",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Jolly-Variation8269",
                            "body": "I mean that’s a pretty typical lifespan for a computer",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Fragrant-Hamster-325",
                                    "body": "I love it when gadget nerds on Reddit get upset with the yearly incremental product updates.  \n\n“Who would buy this, it’s only slightly better than last year’s model!”  \n\nLike come on dude, it’s not for you or those people. It’s for the people who have a 4 or 5 year old model. People just can’t see things from another perspective.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "mccalli",
                                            "body": "This goes way back. I can remember people on Slashdot complained that these new fangled USB mice didn’t offer enough reasons to upgrade from their PS/2 ones. \n\nThe idea that it might not necessarily be targeted at upgrades, and was simply the new standard that would come with a new machine, completely passed them by.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "DontBanMeBro988",
                                            "body": "It's so weird. No one complains that cars have new models every year.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "ChildishRebelSoldier",
                                            "body": "Mobile devices changed everything. Apple finally made laptops compelling again so now the tech nerds want to buy a new toy every year. Plus mobile phones are reaching or exceeding MacBook prices.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "darthjoey91",
                                    "body": "Depends on what you’re using the computer for. Like I do upgrade computers roughly that much, but like my old MacBook Pro from 2017 is still chugging, but I gave it to my brother to finish his associates when I got the M1, and it still chugs and somehow the keyboard still works. That was arguably the worst MacBook Pro made, and it still does fine for web browsing and such, even if it doesn’t get feature updates anymore.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thesourpop",
                    "body": "That’s what they did with iOS 12 and it was fine. No wheel reinventing, just an improvement overhaul",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Shawnj2",
                    "body": "Apple used to do this with Snow Leopard, El Capitan, High Sierra, etc. but they lost the plot at some point and stopped for some reason",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cinderful",
                    "body": "aka Snow Leopard\n\n\nHell yeah, I'm in.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FortLoolz",
                            "body": "macOS especially needs a Snow Leopard. But for SL, they rewrote a lot of stuff, and optimised it, so a lot of work was indeed done, it's just that they didn't add new features",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SkyGuy182",
                    "body": "Yeah a publicly traded company will *never* do that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "alepher",
                    "body": "I definitely wouldn't mind if they had a Snow Leopard style update jist focusing on efficiency and bug fixes",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Few_Major_8226",
                    "body": "“We don’t have many new features so we’ve focused on bug-fixing and pretty noticeable performance and battery life optimization” would be freaking perfect",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DankeBrutus",
                    "body": "I would rather they release a stability and performance update. The drop in software quality from Apple has made the experience of using their products noticeably worse.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "chowchowthedog",
                    "body": "engineers might said that, executives won't.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "michoken",
                    "body": "That would not work with the investors, sadly.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Barbanks",
                    "body": "How about, hey, we’re taking a break from new features and just going to fix shit. The old Apple motto of “it just works” has faded quite a bit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pw5a29",
                    "body": "Given the whole iOS 18 release, i would say incremental improvements are good enough already",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unitedfateful",
            "body": "Please love each iOS version equally.",
            "score": 625,
            "replies": [
                {
                    "author": "Orange_tornado",
                    "body": "Praise Kier.",
                    "score": 242,
                    "replies": [
                        {
                            "author": "DigiQuip",
                            "body": "Mac OS Coldharbor",
                            "score": 97,
                            "replies": []
                        },
                        {
                            "author": "thefowles1",
                            "body": "Ah, a wild Severance reference.\n\nDevour feculence, fetid moppet.",
                            "score": 42,
                            "replies": []
                        },
                        {
                            "author": "Potential-Bass-7759",
                            "body": "Wozniak. \n\nYo woz thanks for all the cool shit we have because of you!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JamesXX",
                    "body": "Your outie has a large collection of black turtleneck sweaters.",
                    "score": 81,
                    "replies": []
                },
                {
                    "author": "Venqis_",
                    "body": "Your outie pays his bills within three business days.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "No_Maize_230",
                    "body": "How can you pick a favorite child?",
                    "score": 15,
                    "replies": [
                        {
                            "author": "beegtuna",
                            "body": "I don’t care for Gob.",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "Tearaway32",
                                    "body": "Look at me - getting off on being withholding!",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "No_Maize_230",
                                    "body": "Poor Gob.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "tanaka-taro",
                                            "body": "Gobs not onboard",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "poka64",
                                            "body": "Hello darkness my old friend",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Illustrious-Ad-5902",
                    "body": "Devour fec",
                    "score": 7,
                    "replies": [
                        {
                            "author": "correcthorsestapler",
                            "body": "“It’s our most feculent iOS yet, and we think you’ll love it!”",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "iamatoad_ama",
                    "body": "18 was a real uggo!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "CoreyLee04",
                    "body": "You’re outtie empties the files in their trash bin daily.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "superspeck",
                    "body": "Welcome to Costco. I love you.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rainbowsunrain",
                    "body": "You must be cut to heal.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JThrillington",
            "body": "“And the execs believe you’re gonna love it”",
            "score": 176,
            "replies": [
                {
                    "author": "EagerSubWoofer",
                    "body": "you won't be laughing when this article wins a pulitzer prize",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "meat_lasso",
                    "body": "I’m Tim Apple, and this is our best product yet. I love it and so will you.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "huecobros-MM",
            "body": "Didn’t they believe the same for apple intelligence?",
            "score": 260,
            "replies": [
                {
                    "author": "Portatort",
                    "body": "And it probably will be loved… if it ever ships",
                    "score": 88,
                    "replies": [
                        {
                            "author": "121jiggawatts",
                            "body": "*Arrested Development Scratch*. “It wasn’t”",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "YourAdvertisingPal",
                                    "body": "This is the story about a phone, and the one update keeping it all together. \n\nIt’s iRested Development. ",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Switch815",
                            "body": "It won't be loved.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -1,
                                    "replies": []
                                },
                                {
                                    "author": "bluegreenie99",
                                    "body": "Apple isn't gonna let you hit it bro",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Switch815",
                                    "body": "Uh.... nice one? Lol",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "trkh",
                    "body": "I don’t think even think Apple said that about AI",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "flux8",
                    "body": "Meh, I kinda think they were forced into putting something/anything out to simply to show they were in the AI game.  I think they knew they were just buying themselves some time.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Kwpolska",
                            "body": "Does Apple **have** to be in the AI game? Apple saying that LLMs are overrated, copyright infringing bullshit generators and that they will focus on good software instead would have been a service to the world.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Azusuu",
                                    "body": "But not to shareholders",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Kwpolska",
                                    "body": "Apple could pull off telling shareholders AI is a grift.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cronin1024",
                    "body": "And the 2016 MacBook Pro? That update went over like a lead balloon",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Neirchill",
                            "body": "Funny that the touch strip at the top is just gone now. \n\n\nAlso, glad we have the magnetic charger back now. Changing it out for a USB c style connector was an awful idea",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thisischemistry",
                    "body": "I'd love it if they dropped the whole AI thing because that's the only way I'm turning OS updates back on. I don't want the battery drain, the extra storage, and the braindead suggestions on my device.\n\nAt this point, just give me security updates because I don't see anything I want in the newest versions.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "NotHearingYourShit",
                    "body": "Nah they knew it was garbage but wanted to pump the stock",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SciGuy013",
            "body": "Well it’d be pretty funny if they thought we’d hate it",
            "score": 65,
            "replies": [
                {
                    "author": "Outlulz",
                    "body": "The people warning execs that users will hate decisions they made are rarely listened to.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "venicerocco",
            "body": "ios19 will “alter the way people interact with their devices for many years to come.”\n\n\nuh oh",
            "score": 21,
            "replies": [
                {
                    "author": "Vetiversailles",
                    "body": "And the shareholders go wild! \nEveryone else goes mild",
                    "score": 4,
                    "replies": [
                        {
                            "author": "gatsby712",
                            "body": "All new pop-up ad feature when switching between apps. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SkeletonWarSurvivor",
            "body": "Will the Photos app be better? I hate the current version.",
            "score": 97,
            "replies": [
                {
                    "author": "PappyPete",
                    "body": "Seriously.  This is the main reason I won't upgrade to iOS 18. \n\nThough, I did find a 3rd party app (Hashphotos -- I have no affiliation with them) that is more like the old photos app plus has some extra functionality, and even more functionality if you pay for it.  If I HAD to upgrade to iOS 18, I'd use that app over the stock photos app that it comes with.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "5uNmk",
                            "body": "Get rid of the iOS 18 nag screen by installing this profile https://betaprofiles.dev/install/block-ota/ I have it installed in both my iPhones and iPad m2",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Embarrassed_Ear_1917",
                            "body": "You can switch back to the old view",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "PappyPete",
                                    "body": "How?  I have a spare phone that I installed iOS 18 on and I didn't see that option when I was in the photos app.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Embarrassed_Ear_1917",
                                    "body": "I think it’s just in settings but if it’s not there a quick Google will solve it.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "wierdness201",
                                    "body": "How?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Embarrassed_Ear_1917",
                                    "body": "I believe it’s in the photo settings",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DoingCharleyWork",
                    "body": "I just want them to change it back.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "rawrcutie",
                    "body": "I think it's better now. What do you like with the old?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SkeletonWarSurvivor",
                            "body": "That the favorites folder was really easy to access. Ever since the change it takes me a lot more time and taps to get to it, even though I’ve pinned it.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "BananaStandFlamer",
                                    "body": "Mine is literally right there \n\nhttps://i.imgur.com/pza0xEM.jpeg",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SkeletonWarSurvivor",
                                    "body": "how did you get \"pinned collections\" to show above \"Recent Days,\" \"Albums,\" (and 3 lines of huge previews of my albums,) and \"People & Pets.\" The people previews are the hugest.\n\nMy Pinned Collections are under all of that. I've tried to move things those things around and I can't figure it out. If doing so is going to take me watching a YouTube tutorial then I think it's a bad product.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BlackSnowR",
                            "body": "Video playback was infinitely better before",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "chopcult3003",
                    "body": "The new photos app is terrible, I can’t stand it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "userlivewire",
                    "body": "You can customize the layout of the Photos app to your heart’s content.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "VastTension6022",
                    "body": "So how do I add a navigation bar on the bottom with camera roll, albums, and search? Oh wait – you can't.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "userlivewire",
                    "body": "If you want to be stuck in a UI from 10 years ago you can use an old phone but progress marches on.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Walmar202",
            "body": "Tim: “we are so happy to introduce iOS19 with Apple Intelligence and Siri. Together, Siri will give you the correct answer up to 60% of the time on the third try. We think you’re going to love it.”",
            "score": 14,
            "replies": [
                {
                    "author": "jrtt4877",
                    "body": "Omg third trying had me lol",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Walmar202",
                            "body": "Thanks!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jpham_toronto",
            "body": "Have we ever seen anything like \"Executives think users will HATE upcoming products?\"",
            "score": 25,
            "replies": [
                {
                    "author": "money_loo",
                    "body": "Netflix.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "littlebiped",
                    "body": "A lot of Nintendo execs were bullish about the DS especially in light of the upcoming PSP and that’s why they tried to pitch it as not a GBA successor but a ‘third thing’ to stand alongside it and the GameCube— this angle was quickly dropped once the DS was a huge success.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "sai-kiran",
                            "body": "Yo, doesn’t bullish mean they were aggressively confident? Because your statement doesn’t make any sense",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "littlebiped",
                                    "body": "Sorry I used the word wrong. I meant skittish",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dccorona",
                    "body": "No because they’re the executives so if they think that they just kill the project. AirPower never shipping was basically the equivalent of that. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KeepingItSFW",
                    "body": "Anything Elon Musk \"helps\" with?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "UniversalBagelO",
            "body": "If they make it any more like what they did to the Photos app I'm gonna switch to Android. Apple has become everything they were against in recent years.",
            "score": 13,
            "replies": []
        },
        {
            "author": "mattdw",
            "body": "I'm begging for just a Snow Leopard-esque release, please.",
            "score": 10,
            "replies": []
        },
        {
            "author": "darthaddie",
            "body": "Announced in WWDC 2025, coming in oct 2025, delayed until iOS 20. Bugged until iOS 21. 🤣",
            "score": 41,
            "replies": [
                {
                    "author": "DinosaurAlive",
                    "body": "And only available on whatever iPhone comes out at that time.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "knvanand",
                            "body": "Yeah, they tried that with Visual Intelligence, and now the 15 Pro series will get this feature too.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hecho2",
            "body": "they never do. the users will always hate redesigns. \n\n  \nAlso will came with a lot of bugs and limitations. \n\n  \nWill be another shit show. Hopefully will actually be a change for the better, otherwise apple will have a serious problem.",
            "score": 44,
            "replies": [
                {
                    "author": "Portatort",
                    "body": "People love something new. \n\nIt will all be very exciting for a month\n\nThen 4 months of complaining about bugs",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Exist50",
                    "body": "> they never do. the users will always hate redesigns.\n\niOS 7 was very fondly received, if memory serves. Hoping for the same this time.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "DoingCharleyWork",
                            "body": "There were a LOT of people who were pissed about skeumorphism going out. \n\nNo matter what there is always going to be a group of people that are mad about any change. And if there's no change a different group will be mad about that.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Exist50",
                                    "body": "I mean, sure, not *everyone* liked it, but you're never going to please 100% of the people 100% of the time. On the whole, however, it was very well regarded.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "I just mean there was a very vocal group of people only who were not happy with the flat design.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Exist50",
                                                    "body": "Let's just say that if the redesign goes as well as iOS7's, most people (and Apple) would consider that a success.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "DoingCharleyWork",
                                                    "body": "I'm not disagreeing with that or that iOS 7 was popular dude. I'm pointing out that there were some people that were very vocally against it and that is what colors the perception of some of the people in this thread thinking it wasn't well received.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "dccorona",
                            "body": "A lot of people disliked how minimal it was. And as much as I thought it looked good, they had a point. It was nigh impossible to tell the difference between a button and just text. The only reason I could was because I knew where the buttons were already.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "FancifulLaserbeam",
                            "body": "Huh?\n\niOS7 was a shitshow. You couldn't tell what was a button and what was just text, because Jony didn't like buttons. They took beautiful, interesting icons and changed them for crap that looked like it had been designed in Microsoft Word.\n\nIt was garbage.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "DelayedNewYorker",
                            "body": "I was in high school and I remember *everyone* trying their hardest to update their devices when iOS 7 dropped. No one was able to do it that afternoon since the school Wi-Fi and Apple's servers were absolutely slammed. But once we were able to update, it was \\*the\\* talking point for a few days. I miss the days when software updates got people excited",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dramatic_Mastodon_93",
                    "body": "Users hate any kind of change... and then they get used to it.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Apart_Block_7523",
                    "body": "People loved iOS 7 lol. It reviewed nice and the average consumer loved it",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "airtimemachine",
                    "body": "This is a crazy revision of history lol",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Apart_Block_7523",
                    "body": "iOS 7 is TechRaders second highest rated software ever. And no software was downloaded as fast by as many people.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "chipsnapper",
                    "body": "Maybe if they didn’t have an iPhone 4. It ran like molasses on there.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "kigastu",
                    "body": "It was completely opposite of what you said. It was a total shit show and people refused to update from iOS 6 for a long time.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Apart_Block_7523",
                    "body": "iOS 7 had the fastest adoption rate of any software in history. \n\nAlmost doubling every iOS before it and until iOS 12. \n\n https://www.statista.com/chart/15591/ios-update-adoption/",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "Apart_Block_7523",
                    "body": "https://preview.redd.it/p9n1bx4fd4pe1.jpeg?width=960&format=pjpg&auto=webp&s=75a6527eda77b43d4f014b10a1b3b0e942b5150d\n\niOS 7 had double the adoption rate of any software before it and the next following 5 iOS’s.\n\nIt’s the fastest growing software Apple has ever released.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "LBPPlayer7",
                    "body": "that was because of the QOL improvements and new features, not the design\n\npeople were either indifferent or outright hated it",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Apart_Block_7523",
                    "body": "It was adopted twice as fast as the next closest iOS system, and 5x as fast as the average iOS update. Plenty of iOS have had featured filled releases, none came with a redesign.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "No-Revolution-4470",
                    "body": "If they drop the bottom tab bar across all apps it will be a massive shitshow. The Photos app is still way less intuitive than it was before. Idc how pretty it looks.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Just-Sheepherder-202",
                    "body": "🤣",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Abhinik",
            "body": "If Apple knew their shit, there wouldn’t be so much iOS bugs or false launches or the 16e. \nIts clear that they don’t know squat, they are getting lazy and sloppy",
            "score": 11,
            "replies": []
        },
        {
            "author": "mgd09292007",
            "body": "That’s what they say every single release “we think you’re gonna love it”",
            "score": 4,
            "replies": []
        },
        {
            "author": "Dino_Spaceman",
            "body": "Edit: hit submit too early. Added this:  \nI would actually love a new UX. Purely because I think the current one could benefit from more customization.  Give me more power to make my phone screen exactly what I want to show.  Like I want the ability to have icons be actually live, showing content. And able to expand them to fit my needs.  \n\nMy guess is this is setting up for the folding devices next year.  \n\nBut also — I can’t wait to have like half of the actual important features and key benefits hidden behind completely incomprehensible multi finger touch controls.",
            "score": 6,
            "replies": [
                {
                    "author": "andyring",
                    "body": "Not gonna happen. Apple HATES customization.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gingerdanger123",
            "body": "Universal back gesture?\nAbility to get to app settings from inside the app?\nAbility to control notifications types of an app on os level and quick access from notification itself?\n\nThose would be cool, but probably we will just get some gimmicks",
            "score": 3,
            "replies": []
        },
        {
            "author": "anonteje",
            "body": "What did you expect?\n\nI'd love something more honest: This is our next version. Nothing revolutionary. We just continue with super small changes while urging you to buy a new overpriced device which we barely innovated anything on except a new chip which is faster (btw you don't need that anyway since you can't use those devices for anything demanding in the first place).",
            "score": 4,
            "replies": []
        },
        {
            "author": "dingbangbingdong",
            "body": "I’ll love it if it looks like iOS 1-6. ",
            "score": 4,
            "replies": []
        },
        {
            "author": "MightyOwl9",
            "body": "Apple been doing a lot of over promise, under deliver type of things.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Lambor14",
            "body": "I don’t doubt it honestly. I like where Apple is going UI wise as seen on Vision Pro and the sports app.",
            "score": 6,
            "replies": [
                {
                    "author": "Shleemy_Pants",
                    "body": "I installed the Sports app just to see the design and it’s just meh.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "koolaidismything",
            "body": "I won’t care since I have an iPhone 11. I’m fine w 18 and security updates. I wanna try and pickup a 15 next year when they are a couple years old and hitting that $450 mark on Amazon refurb. I’m still happy with this phone mostly. Battery sucks and sometimes apps like reddit can make it freeze up for a couple minutes but those are both newer issues.. maybe incremental update related, I’m not sure yet. I’m",
            "score": 3,
            "replies": [
                {
                    "author": "thisischemistry",
                    "body": "I'm stuck on a 13 mini until they make another small form-factor phone. And, no, a paper-thin and/or foldable one doesn't count.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "i_am_really_b0red",
            "body": "What else did you expect them say ? \n\n“We are Apple and we believe our users are going hate our new design, but we don’t give a fuck so we are going to make it anyways”",
            "score": 3,
            "replies": []
        },
        {
            "author": "baskinginthesunbear",
            "body": "https://preview.redd.it/bbox170k86pe1.jpeg?width=600&format=pjpg&auto=webp&s=07a80c872c407bb8f87f33ec28aa7a208a4d815d",
            "score": 3,
            "replies": []
        },
        {
            "author": "LAS_6601",
            "body": "If Apple actually makes iPadOS 19 more like macOS (unlimited apps on the dock, a more robust file system, a better Stage Manager, the ability to run more complex apps), I’ll actually “love” it. If it’s gonna be like the last few updates (just add one or two new features), I won’t “love” it.",
            "score": 3,
            "replies": [
                {
                    "author": "itsaride",
                    "body": "If you want a Mac buy a Mac. An iPad is its own space.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "andyring",
            "body": "They’ll just remove a bunch of stuff people like and use constantly, label it a “feature” and think they did something good.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Specialist_Brain841",
            "body": "If you loved the recent photos redesign you’ll love what we have in store!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Street_Classroom1271",
            "body": "Since when has apple done some sort of sudden major UI overhaul? It happens, but happens slowly and for a very good reason\n\nApple has a massive userbase of people with all sorts of levels of ability, includng of course many users with disabilites, with many different level of ability to adapt to change. Apple does not simply switch things out and around rapidly. This is how they've gotten hundreds of millions of users to regularly update their software for the last  whatever it is years now.\n\nRumours like this simply do not pass the smell test.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Vaxion",
            "body": "Considering the current iOS 18 was also labelled as \"complete overhaul\" and \"New design\" and all. But all we got was the ability to change icon colors and pin stuff anywhere on the screen and that too was implemented in such a bad way the hardly anyone uses it. I don't have any high hopes anymore. I guess on software side Apple is just out of ideas or out of people who can actually make something groundbreaking. Only the hardware side is making groundbreaking stuff while the software is stuck in the past.",
            "score": 3,
            "replies": []
        },
        {
            "author": "zjunk",
            "body": "Awesome, can’t wait for all the boomers who are barely able to navigate the current OS try to adapt to a complete overhaul. Good luck to anyone under 50 who’s going to have to handhold through this - double points for anyone caring for someone with any kind of cognitive impairment",
            "score": 5,
            "replies": [
                {
                    "author": "fuck_off_world",
                    "body": "Finally someone says it. \n\nI hoped for AI to enhance navigation with Siri, so my dad can tell the phone what he wants, since after the last few updates he has difficulties moving around in the os. ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "agnyc",
            "body": "I’d love.if.the keyboard work ed",
            "score": 9,
            "replies": [
                {
                    "author": "Zackeizer",
                    "body": "What is wrong with the keyboard?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Koopacha",
            "body": "“And we think you’re gonna love it”\n\n“Breaking news: tech company says latest product is their best product” \n\n“Can’t we just get a bug fix update?”\n\nLet me know if I missed one, pretty sure I got em all",
            "score": 6,
            "replies": []
        },
        {
            "author": "PlanAutomatic2380",
            "body": "If they go back to iOS 6 aesthetics then I’ll love it, but considering the direction they have been going it’s probably going to be worse than already is.",
            "score": 6,
            "replies": []
        },
        {
            "author": "TwoDurans",
            "body": "Have Apple executives ever said “boy our users are going to fucking hate this thing we’re releasing”?  This seems like a dumb article to write",
            "score": 2,
            "replies": []
        },
        {
            "author": "Notallowedhe",
            "body": "Let me guess we have to disable Apple intelligence again",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Manufacturer-3315",
            "body": "Sure just like we will love the “ai” that is absolutely garbage.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lobabobloblaw",
            "body": "Ahhh, intelligence with a lowercase ‘I’.",
            "score": 2,
            "replies": [
                {
                    "author": "Shleemy_Pants",
                    "body": "N’telli Gents",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OneOfAKind2",
            "body": "You know what users would love? Lower prices. Why is Apple's memory and storage so fucking outrageously expensive?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Diseased-Jackass",
            "body": "That means we will hate it then.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SkyLow4356",
            "body": "One more thing… \n\nWe are all screwed",
            "score": 2,
            "replies": []
        },
        {
            "author": "resist888",
            "body": "I’m hoping it’s more about usability and not just UI widgets.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Thermistor1",
            "body": "As much as we love the new Siri?",
            "score": 2,
            "replies": []
        },
        {
            "author": "geronimosan",
            "body": "Great. Thanks for letting us know.",
            "score": 2,
            "replies": []
        },
        {
            "author": "The21stPM",
            "body": "Does the overhaul remove all AI bullshit? If not, I don’t care really",
            "score": 2,
            "replies": []
        },
        {
            "author": "maybeinoregon",
            "body": "So currently, I get the notification your Apple Watch has unlocked your iPhone, after I’ve been using my iPhone for 5 minutes.\n\nDoes 19 lower the late notification time to 2 minutes?\n\nWhoa, be still my heart…",
            "score": 2,
            "replies": []
        },
        {
            "author": "RemyhxNL",
            "body": "They can only amaze with a foldable. Better late than never 😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "revocer",
            "body": "They always think we will love whatever they come out with.",
            "score": 2,
            "replies": []
        },
        {
            "author": "WhyUReadingThisFool",
            "body": "iOS has become too bloated and too slow for any serious and fast work. I mean just look at the copy/paste button, by the time that thing appears after clicking on text, you could write the whole text by hand",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pat-El",
            "body": "Give us a sneak peek, maybe then we will tell.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ten-oh-four",
            "body": "I'm so fearful it's going to be an entire user experience designed around AI, which I absolutely do not want running on my phone.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jasoncross00",
            "body": "Other things Apple executives were confident we were going to love:\n\nApple Intelligence\n\nApple Vision Pro\n\nI get it, they always are going to say that. Who thinks they're making a bad thing, right? But some parts of Apple have shown themselves to be out of touch with what people want and like, and how they use their devices, lately. (They've been killing it in other areas.)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Extension_Canary3717",
            "body": "When executives said \"guess they gonna hate it \"",
            "score": 2,
            "replies": []
        },
        {
            "author": "jNSKkK",
            "body": "I just want a.good.keyboard",
            "score": 2,
            "replies": []
        },
        {
            "author": "UpDownLeftRightGay",
            "body": "I look forward to the announcement of features delayed until the following year.",
            "score": 2,
            "replies": []
        },
        {
            "author": "vnmslsrbms",
            "body": "iOS 19 is great, the best, until 20 comes out of course. That one is better for sure. But for now, 19",
            "score": 2,
            "replies": []
        },
        {
            "author": "Laicure",
            "body": "Fresh coat of paint and another set of bugs the public can report /meh",
            "score": 2,
            "replies": []
        },
        {
            "author": "colemichelle",
            "body": "Something tells me it will be the best iOS ever.",
            "score": 2,
            "replies": [
                {
                    "author": "commonnameiscommon",
                    "body": "And you’re gonna love it",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dandigangi",
            "body": "As long they fix the Photo Ui I’ll be happy",
            "score": 2,
            "replies": [
                {
                    "author": "R89_Silver_Edition",
                    "body": "They will keep it the same only this time it will resemble even more a frosted glass 😉",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PrimoKnight469",
            "body": "As an Apple executive, let me tell you that you are going to HATE this update. We are trying our best to make this the worst update ever and we want you to suffer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mafamaticks",
            "body": "You’d think they’d learn their lesson from hyping up Apple Intelligence. Yet here we are again",
            "score": 2,
            "replies": []
        },
        {
            "author": "letmedietonight",
            "body": "Will make your phone overheat, drain battery faster, lag and insure users will upgrade to our newest model 🥰🤩🤩🤩",
            "score": 2,
            "replies": []
        },
        {
            "author": "Orange_tornado",
            "body": "They think that about literally everything, what do you think marketing is!?",
            "score": 6,
            "replies": [
                {
                    "author": "Shleemy_Pants",
                    "body": "Also, tell someone they love something long enough and eventually, they will.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Warm_Confusion_2337",
            "body": "Not unless Siri is still dumb lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "mattevs119",
            "body": "They also loved the Vision Pro and thought it was a worthwhile investment at only $3,500.",
            "score": 3,
            "replies": []
        },
        {
            "author": "pjkny",
            "body": "Literally just want a functional autocorrect please",
            "score": 1,
            "replies": [
                {
                    "author": "decadent-dragon",
                    "body": "What a ducking great idea",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "sohrobby",
                    "body": "It’s maddening that they still haven’t figured that out after all this time. It’s still so bad.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pjkny",
                            "body": "Its gotten much worse from what I can tell.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Confident-Grape-8872",
            "body": "They have said this with literally every major software launch since the first iPhone came out in 2007",
            "score": 3,
            "replies": []
        },
        {
            "author": "actuallyz",
            "body": "I love the new iOS 19, with incredible new capabilities, the most technically advanced we have ever created, remarkably easy to use, and beautifully designed, with top-of-the-line Apple Intelligence integrated. You will have no choice but to love it. - Cook 🧑‍🍳",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mediocre-Telephone74",
            "body": "They also said we’d love apple intelligence.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kimantha_Allerdings",
            "body": "It definitely needs uniting under one set of UI principles, because it's a mess now. Hopefully they do things like putting the most commonly used navigation buttons in the same place on every screen in every app, on the bottom of the screen where they're easily reachable with one hand. My hope is also that they'll consolidate the today view, app library, & spotlight into one function in one place. There's way too much redundancy there at the moment.\n\nWhat I suspect we'll get is an end to tabs with everything in every app on one infinitely-scrolling page (like the Photos app), burger menus in the top left (like the Invites app), glass effects, and some round buttons. Maybe some slightly rounder icons. Oh, and more prominent drop shadows. Beyond that, I'll honestly be surprised if much changes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ElvisMcPelvis",
            "body": "Going to be the best iOS 19 ever released",
            "score": 2,
            "replies": []
        },
        {
            "author": "kdw87",
            "body": "I’ve learned to not believe nothing they say anymore after the apple intelligence grift. What a scam!",
            "score": 2,
            "replies": []
        },
        {
            "author": "kasakka1",
            "body": "Let me guess...all surface, no real features that make it better to use..like text prediction in my native language? A feature found on every Android phone for the last 10 years?",
            "score": 2,
            "replies": []
        },
        {
            "author": "tunmousse",
            "body": "Considering Apple’s recent track record, I find the thought of a major overhaul frightening.",
            "score": 2,
            "replies": [
                {
                    "author": "Taki_Minase",
                    "body": "Yes, I'll be waiting until 19.2.3",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Internal-Agent4865",
            "body": "“Radical hardware such as foldables and touchscreen Mac’s” ok so stuff everyone else has had for nearly a decade plus.",
            "score": 2,
            "replies": []
        },
        {
            "author": "texaslegrefugee",
            "body": "Anytime Apple \"executives\" are quoted as saying something like this, you can be assured that a complete disaster is coming.",
            "score": 2,
            "replies": []
        },
        {
            "author": "c0l245",
            "body": "Company believes  consumers will want things they sell. News at 11.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Weak_Let_6971",
            "body": "I hope i would love it too, but using an XS im pretty sure it wont get the update, or if it does it might end up like the iPhone 4 was.",
            "score": 1,
            "replies": []
        },
        {
            "author": "markfernandes",
            "body": "The definition of ‘upcoming’ has changed a lot over the years",
            "score": 1,
            "replies": []
        },
        {
            "author": "Actual-Lecture-1556",
            "body": "Gives us improved functionality instead... (iPad Pro users crying in a corner)",
            "score": 1,
            "replies": []
        },
        {
            "author": "escientia",
            "body": "*We think you’re gonna love it*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ashyyyy232",
            "body": "And here im stuck on ios 17 cause of insufficient storage...",
            "score": 1,
            "replies": []
        },
        {
            "author": "drygnfyre",
            "body": "What if I don’t?",
            "score": 1,
            "replies": []
        },
        {
            "author": "buttfuckedinboston",
            "body": "Tim always says, “And we think customers are going to love it.”  Then nobody loves it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Motawa1988",
            "body": "Like we love AI?",
            "score": 1,
            "replies": []
        },
        {
            "author": "raise_the_sails",
            "body": "“Make Siri good plz” in the key of “healthcare plz”",
            "score": 1,
            "replies": []
        },
        {
            "author": "safetaco",
            "body": "What comes after circle icons? Spherical icons?",
            "score": 1,
            "replies": [
                {
                    "author": "lost-mypasswordagain",
                    "body": "Icons embedded in your body. \n\nWho needs a screen when you are the screen?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Dino_Spaceman",
                    "body": "Drop shadow is back.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fender0327",
            "body": "HAHAHAHA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gjc0703",
            "body": "I’m so ready for drastic change to the OS’s",
            "score": 1,
            "replies": []
        },
        {
            "author": "beta_2046",
            "body": "they believed lots of things ~",
            "score": 1,
            "replies": []
        },
        {
            "author": "CD_4M",
            "body": "Is my iPhone 15 gonna lag? Cause my iPhone 15 lags currently and it’s driving me so crazy I’m genuinely considering switching from iPhone for the first time in over 15 years",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutumnSunshiiine",
            "body": "Fix the bullet points not appearing in the Notes app and I might love it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ayearinaminute",
            "body": "I wonder if my 2020 iPhone SE will love it though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jgreg728",
            "body": "Hahaha this is walking right into the meme.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Entire_Routine_3621",
            "body": "They always think we will love. I have to point out that rumors were for ios18 to be a big design overhaul. Pretty sure it’s been coming for a few years now. Believe it when I see it. That said I don’t care what they do as long as they fix iOS. Every year they add worthless crap no one asked for while adding bugs. You know the number of UI issues in 18? It’s entirely embarrassing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remarkable-Tale428",
            "body": "Ok",
            "score": 1,
            "replies": []
        },
        {
            "author": "xkvm_",
            "body": "No shit they do",
            "score": 1,
            "replies": []
        },
        {
            "author": "HighlyPossible",
            "body": "What they THINK doesn't matter. What matters is what we think.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BunnyBunny777",
            "body": "Same execs who agreed on the Mother Nature commercial?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wise-Baker-3231",
            "body": "I hope it gets a UI redesign. The current design is so old and stale for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darwing",
            "body": "Ssuuuurrrrreee we will",
            "score": 1,
            "replies": []
        },
        {
            "author": "PebbleFan",
            "body": "“These new software designs will potentially set the stage for more radical hardware. That includes foldable devices and touchscreen Macs, according to Gurman.”\n\nSounds fairly obvious but don’t expect “foldable devices and touchscreen Macs” from Apple for at least another year after that.",
            "score": 1,
            "replies": [
                {
                    "author": "Throwaway021614",
                    "body": "If this opens the way for a physical qwerty keyboard, then I’m on board.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kemistrythecat",
            "body": "I loved the last one so much I moved to Android.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Usual_Growth8873",
            "body": "When it’s Moses I give roses",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScienceNeverLies",
            "body": "Byyeeeeee",
            "score": 1,
            "replies": []
        },
        {
            "author": "ForwardLavishness320",
            "body": "The overmind has told us that our new subliminal OS is the best.\n\nZuckerberg is God. \n\nEnd of line",
            "score": 1,
            "replies": []
        },
        {
            "author": "atiensivu",
            "body": "I know it doesn't sell phones but I'd like them to concentrate on fixing crash bugs and other longstanding issues that have been carried over version to version.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dmfuller",
            "body": "Just please get rid of the AI crap lol it’s so bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "sir_duckingtale",
            "body": "I would love to get my ideas for Apple out\n\nI don’t wanna work for them\n\nBut with them\n\nAnd just get my ideas out and share them with them\n\nAny ideas of how to do this?\n\nAs the official website says not to send in ideas\n\nWhich I do believe kinda sucks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LebronBackinCLE",
            "body": "Right, because all of these companies with their trillions of dollars haven’t sat down with a user and leaned how much they HATE change.  Hate it with a passion.  CANNOT fuckin stand changes and relearning things they did before and now they can’t do it without hassle and figuring how what is different from before.  I like to learn new stuff because for me that’s part of technology.  But I work with a lot of older folks and all this sort of thing does is make their devices less useful to them.  But hey, job security for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Embarrassed-Emu-8248",
            "body": "Siri?  Siri?! SIRI?! \n\nUseless",
            "score": 1,
            "replies": []
        },
        {
            "author": "SebHig",
            "body": "well in winter I kind of like when my phone converts to a hand warmer",
            "score": 1,
            "replies": []
        },
        {
            "author": "yasarfa",
            "body": "“The adjective-est update ever”",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheModeratorWrangler",
            "body": "As long as Tim Cook delivers his classic “we know you’re going to love it” line so buttery smooth… I’m all in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dshark",
            "body": "This is like an onion headline.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Touup",
            "body": "“the shareholders want you to love it”",
            "score": 1,
            "replies": []
        },
        {
            "author": "spinozasrobot",
            "body": "\"We think you're going toi love it!\"\n\n\\-Tim Cook, every feature and release ever",
            "score": 1,
            "replies": []
        },
        {
            "author": "2moist",
            "body": "This statement almost guarantees it will be awful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "meowmixmotherfucker",
            "body": "OK. I mean, it would be weird if they thought it was a dumpster fire we'd all hate but they were still going to release it...",
            "score": 1,
            "replies": []
        },
        {
            "author": "dcdttu",
            "body": "Dear Apple, put the back button, I didn't know, near the user's finger, maybe? Kthx",
            "score": 1,
            "replies": []
        },
        {
            "author": "dramafan1",
            "body": "I predict it'll be an iOS 18 \"S\" type of update with the way they rolled out iOS 18 and Apple AI terribly.\n\niOS 19 is going to be what iOS 18 should have been.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Smart-Plantain4032",
            "body": "I’m scared … after the photo app rehaul last year ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Damianmorni",
            "body": "In my opinion iOS is getting less reliable and more prone to issues.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fine-Subject-5832",
            "body": "I just wanna see a slide that literally says “We optimized everything” ",
            "score": 1,
            "replies": []
        },
        {
            "author": "agreeduponspring",
            "body": "Can you put an MP3 you downloaded off the internet into your Music library?",
            "score": 1,
            "replies": []
        },
        {
            "author": "yp261",
            "body": "they believed with photos app overhaul as well? its so fucking bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "ramit_m",
            "body": "Will come with more AI feature promises that won’t actually be available anytime soon. Basic AI features won’t be available worldwide before iOS 20.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TLDReddit73",
            "body": "Will it be the best iOS yet?",
            "score": 1,
            "replies": []
        },
        {
            "author": "drvenkman9",
            "body": "That’s right, folks, it’s time to get stoked for iOS 19. This is the biggest update to iOS since iOS 7. For the first time ever, Apple is reinventing the user interface to make it sleeker, faster, and more powerful. Apple can’t wait to see the incredible things customers do with iOS 19. Apple thinks you’re gonna love it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "lost-mypasswordagain",
            "body": "I have doubts. \n\nI’m just feeling something rotten at the core. \n\n(Please forgive the pun.)",
            "score": 1,
            "replies": []
        },
        {
            "author": "dpschramm",
            "body": "Users typically hate any form of change, as there's a concrete cost to relearning how to do everything. They're going to have to have some pretty big benefits in the new versions in order to offset that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mighty_ShoePrint",
            "body": "As opposed to \"users will hate this. It's garbage.\"?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Koleckai",
            "body": "They said we would love Apple Intelligence as well. Some of us are still waiting for useful functionality.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sprmcy23",
            "body": "Another we think you’re going to love it moment lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "uCry__iLoL",
            "body": "Yeah I'm sure folks are dying to see drop shadows again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ilovehaagen-dazs",
            "body": "hopefully they fix the atrocious Photos app",
            "score": 1,
            "replies": []
        },
        {
            "author": "GlassCityUrbex419",
            "body": "Honestly if they just let me change the photo albums back to pre iOS 18 I’d be happy. I’d also like to see live wallpapers/custom live wallpapers and support for Wallpaper Engine. I’ve got a 13 Pro so there’s so many life wallpapers that would look gorgeous in 120hz OLED",
            "score": 1,
            "replies": []
        },
        {
            "author": "VictorChristian",
            "body": "Just make it so widgets don't disappear randomly on my iPhone 16 pro max... :-|",
            "score": 1,
            "replies": []
        },
        {
            "author": "weeblewobble23",
            "body": "Bug fixes > new UI with bugs and features that don’t work 🙄",
            "score": 1,
            "replies": []
        },
        {
            "author": "Logical-Issue-6502",
            "body": "I no longer trust what Apple says. I’ll just wait to see what they actually deliver.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tight-Operation-27",
            "body": "3 years to late",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Revolution-4470",
            "body": "So many repetitive “haha what else will they say” comments but I don’t see anyone actually pondering whether making every app function like Photos/Sports/Invites is going to be a good idea.\n\nEvery one of those has what will apparently be the new design and they are all huge steps backward in UI design.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Dealer_7002",
            "body": "did they say why?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zy212",
            "body": "Tbf they think we love everything",
            "score": 1,
            "replies": []
        },
        {
            "author": "creedx12k",
            "body": "I’m ready to beta test.   \nBring on the week of June 9th.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slow_Investment_2211",
            "body": "Why can’t Apple create a feature to where I can long press on an app icon, and have a menu pop up to where I can tell it what folder to move it to?  The whole drag and drop thing is such ass, because it then always rearranges my other icons when I don’t want it too!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "bbeeebb",
            "body": "And yet you can be assured, people will bash and bash, all the way until this comes out. And all the way after it comes out.\n\nHaters just gonna hate. They got nothing else to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSkyking2020",
            "body": "AI everything. Probably. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "fraize",
            "body": "How is this news? What would be news would be if Apple executive believed users would hate it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yafeters",
            "body": "As opposed to hating it of course 🙄",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoupNazi615",
            "body": "Watch IOS 19 just be all the things they promised for IOS 18 that they never realized or released and didn’t work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MisterFingerstyle",
            "body": "It's the Stephen King update.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sonic10158",
            "body": "They always say this only for the major update to be more emojis. I mainly just want bug fixes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fragrant-Bowl3616",
            "body": "Were you expecting them to say people will hate it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jamesgang65",
            "body": "Sonos thought their new app was gonna be killer also",
            "score": 1,
            "replies": []
        },
        {
            "author": "Archangelic1",
            "body": "I want to believe",
            "score": 1,
            "replies": []
        },
        {
            "author": "itsRobbie_",
            "body": "Well my phone auto updated to iOS 18.3.2 the other night and the new calculator app is horrid. It’s so dumb now. It used to be smarter. For example, if you were trying to subtract 10% from a number, before this update when you clicked the percent button after typing in the number 10 it would show you the exact number that 10% equals. But now it just shows the full equation like “2-10%” instead of showing “0.2” when typing in 10%. Pretty ironic for a company that is very focused on making smarter software and smart ai lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "das_zwerg",
            "body": "I have a feeling people not on an iPhone 14 or higher won’t like it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Megacitiesbuilder",
            "body": "While the Siri is lacking behind so much and so much bug iOS 18 has, yet the still decided to go for a visual revamp is just…\n\n\n\n\n\nBut I still welcome a new visual UI changes after sooo many years after iOS 7",
            "score": 1,
            "replies": []
        },
        {
            "author": "paperman990",
            "body": "Please clap",
            "score": 1,
            "replies": []
        },
        {
            "author": "gsamflow",
            "body": "They thought we would love Snow White iOS 7…. Hated it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pirate-game-dev",
            "body": "It's the worst compliance with sideloading and allowing developers to link to their own payment options we've ever invented!\n\n\\**Tim beams at camera*\\*.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rodon",
            "body": "“We think you’re gonna love it!” ಠ_ಠ",
            "score": 1,
            "replies": []
        },
        {
            "author": "tarrat_3323",
            "body": "no. we absolutely won’t",
            "score": 1,
            "replies": []
        },
        {
            "author": "braedizzle",
            "body": "Can’t wait for them to move some small setting that didn’t need to be moved now that I’m muscled memory to",
            "score": 1,
            "replies": []
        },
        {
            "author": "Free-Pound-6139",
            "body": "Do they change the photo app back? WHat a disgrace? Every time I use it regret it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Manny55-",
            "body": "Samsung has been doing it for years",
            "score": 1,
            "replies": []
        },
        {
            "author": "Duckmandu",
            "body": "Uh-oh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beginning_Night1575",
            "body": "I would settle for going backwards. I hate my 16 pro. I don’t know what happened with the keyboard, but it is unusable. Also, I get the USB-C switch, but the idea that it was supposed to create less waste is not panning out yet. The world is still dominated by USB-A in places like airports, hotel and cars. The charging cords that came with the phone and the most common one I’ve seen is USB C to C. So I’m finding myself without the ability to charge often. \n\nSmall gripes I guess, but these Apple traditionally nailed some of the basics.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot-Sock3403",
            "body": "The problem is. They’re doing so horribly on the AI for 18. Waiting till September. I don’t think it’s gonna help some people retain Apple loyalty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot-Sock3403",
            "body": "Biggest thing I am waiting for is just a little more compatibility with being a lot smarter than they are",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoxsterMan_",
            "body": "Oh Jesus, it’s gonna suck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Randomae",
            "body": "Hopefully it doesn’t go the way of Apple Photos. What a terrible app design.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StockComb",
            "body": "Sounds exciting. Definitely looking forward to the first Dev Beta.",
            "score": 1,
            "replies": []
        },
        {
            "author": "funkpolvo",
            "body": "What else are they’re going to say?",
            "score": 1,
            "replies": []
        },
        {
            "author": "tehdang",
            "body": "Oh Gods, what fresh hell will they unleash after this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "imurhuckleberry63",
            "body": "They say it every time. Every. Damn. Time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DFisBUSY",
            "body": "They said the thing!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lord412",
            "body": "People hate change so they will complain about it for at least 3 months. Some will refuse to update till they are forced to do so and they will complain the most. lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "AppropriateTie5127",
            "body": "They said that about Apple \"Intelligence\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "rorowhat",
            "body": "Sure sure",
            "score": 1,
            "replies": []
        },
        {
            "author": "bluespiderfl",
            "body": "If we can’t make the technology work, by god make it pretty lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "GodAndEverything",
            "body": "When you're in prison you eat the food slopped onto the tray.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Correct-Boat-8981",
            "body": "“Paves the way for new devices such as touchscreen macs”\n\nAt what point do the iPad and Mac product lines just merge together?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Daladain",
            "body": "So, closer to Android then?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chance_Zone_8150",
            "body": "They have live action translation software...id actually like that",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bananarelated",
            "body": "“You can disable Siri, and Apple intelligence”",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrMunday",
            "body": "*Reverts back to old Siri*\n\nOMG ITS SO MUCH BETTER",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aggravating-Sir1471",
            "body": "What an empty fucking platitude.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wacktool",
            "body": "Here they go again with being brave.  Its going to suck",
            "score": 1,
            "replies": []
        },
        {
            "author": "owenmh04",
            "body": "They think we’re gonna love everything they make, what’s different 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "ped-revuar-in",
            "body": "Wow really?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Potter3117",
            "body": "iOS needs to take some pages out of OnePlus' book. App duplication. Bigger battery. Faster charging battery. Well, that's about it really. And change the photos app back to the way it was before. \n\nApp duplication is weirdly a big selling point, for me anyway. I own two businesses and I need to track things for both using apps that only allow one login. App duplication is great.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cottonmafia",
            "body": "Good news :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shleemy_Pants",
            "body": "Show off the new iOS in June 2025. Drop a Few features in ”Fall”. Then another few features in “ Spring 2026”. At lease when google drops an update it’s the entire package.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shleemy_Pants",
            "body": "Tell someone they love something long enough and eventually, they will.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Annual-Gas-3485",
            "body": "I might buy an iphone again.. when they are sized like phones and not small tablets.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dry_Explanation_9573",
            "body": "Narrator: they won’t",
            "score": 1,
            "replies": []
        },
        {
            "author": "imaginaryResources",
            "body": "I just got my photos albums back to how I like them please don’t move more shit around you fuckfaces",
            "score": 1,
            "replies": []
        },
        {
            "author": "py_account",
            "body": "Didn’t I just update like 6 months ago?",
            "score": 1,
            "replies": []
        },
        {
            "author": "userlivewire",
            "body": "Why can’t my security cam app have a live widget on the screen?",
            "score": 1,
            "replies": []
        },
        {
            "author": "brownmanta",
            "body": "Please let there be a universal back gesture.",
            "score": 1,
            "replies": []
        },
        {
            "author": "A55B700D",
            "body": "I'm loving still using my phone that still works after ignoring many calls from my provider telling me that I am eligible to uppgrayde my phone. What the fuck is a Mac?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Son_of_Annunaki",
            "body": "I would love the ability to use any other assistant than Siri.. how about an updated keyboard ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jimbrutan",
            "body": "I think they wanna get away from AI fast because how much of a disaster it was",
            "score": 1,
            "replies": []
        },
        {
            "author": "repeatrep",
            "body": "am i getting it right that we are going to get round icons, right after MacOS went square?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xaqx",
            "body": "If apple sales team have had there hand on it then 100% no… you can spot there grubby hands all over apple intelligence pops and the ads for it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kakarot-3",
            "body": "Does it bother anyone else that the iOS isn't aligned with the iPhone? Like iOS 19 will come out with the iPhone 17 lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "qanunboi",
            "body": "Their belief (& customer’s money) is what keeps Apple running. 😂.   \nBe ready for another shitty underwhelming update.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lencastre",
            "body": "Not the executives… nobody tells them the truth",
            "score": 1,
            "replies": []
        },
        {
            "author": "fmac702",
            "body": "I’d really rather opt out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_mattyjoe",
            "body": "I will love it if it has no bugs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "benswami",
            "body": "Apple executives believe that users will lap up the lies they tell themselves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZZzfunspriestzzz",
            "body": "Bruh they need to change the look of the phone",
            "score": 1,
            "replies": []
        },
        {
            "author": "therealgingerone",
            "body": "I would just like it if my camera didn’t have a fit every time i opened it.\n\nNo just chance of taking a quick photo it’s ridiculous",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emergency-Research69",
            "body": "What u got? Security update?",
            "score": 1,
            "replies": []
        },
        {
            "author": "soldieroscar",
            "body": "Let me guess, revolutionary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "oldbloodscarynothx",
            "body": "Remove the AI and fix all the jank like controlling Apple TV sound being inconsistent and yeah, maybe. Also abandon any starlink plans.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThemeHelpful9784",
            "body": "Samsung ready with pen and paper",
            "score": 1,
            "replies": []
        },
        {
            "author": "BraskSpain",
            "body": "I prefer that iOS works correcly than visual overhauls",
            "score": 1,
            "replies": []
        },
        {
            "author": "SigmaLance",
            "body": "They’re finally fixing the keyboard?\n\nThat would be the greatest improvement that would change the way I interact with a touchscreen device.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key-Substance-4461",
            "body": "I hated the new ios overhaul. Everything feels half thought out and too complicated. Only reason i buy iphone is for the simplicity and ease of use.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aggravating_Loss_765",
            "body": "After terrible iOs18 i am afraid they are totally delusional  and ignore customer feedbacks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dreadsin",
            "body": "Who cares what executives think though? Tell me what the designers and engineers think",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordAssPen",
            "body": "I’ll believe it when I see it. Not after what they did with Apple Intelligence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MetaVaporeon",
            "body": "hasnt been correct in 18 iterations. I'm sure it wont be correct this time either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "freedomachiever",
            "body": "It will be another step to eventually combine iOS and macOS design languages. It will be very gradual on both sides.",
            "score": 1,
            "replies": [
                {
                    "author": "chukijay",
                    "body": "This will never truly happen though. There will always be artificial segregation between the 3 main device lines.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "j_melodic78",
            "body": "😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Designer_Koala_1087",
            "body": "Isn't macos also getting redesigned?",
            "score": 1,
            "replies": [
                {
                    "author": "Crack_uv_N0on",
                    "body": "You should read the article. It’s not just iOS as the headline implies.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Steamstash",
            "body": "It always feels like we get some minor improvements with the risk of them fucking it all up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bilkel",
            "body": "Of course they BELIEVE!!!  What?  You don’t?  Step closer, into the reality distortion vortex!",
            "score": 1,
            "replies": []
        },
        {
            "author": "D_Anger_Dan",
            "body": "Why? Because of a new emoji?  Next.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SplendidPunkinButter",
            "body": "Oh, are they removing the pointless AI features?",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordTopley",
            "body": "I’m looking forward to a new look to iOS, but I fear it has the potential to feel like one of those Android apps that gives android a new theme.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KampKutz",
            "body": "This sounds like the only interesting part for me “adapt to an era adopted by artificial intelligence assistants, rather than people continually dipping in and out of applications.” That would be cool but I can’t quite picture it without seeing what they mean. Maybe you can just call content or kind of paste between apps without having to open them or come out of the current app you are using or something? Hopefully it’s going to be compatible with at least the past few devices and not just the absolute latest. Apple has form for killing old devices with updates though so I’m not holding my breath.",
            "score": 1,
            "replies": []
        },
        {
            "author": "emkaka",
            "body": "Just bring back the first iOS UI and we'll be all happy. It was intuitive, easy to use and wasn't overflown with gestures. Maybe it would need a slight visual upgrade, but it was the best one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thewinedup",
            "body": "We think you're gonna love it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "jakedup",
            "body": "I’m glad 9to5Mac tagged it as a rumor because this one seems like a pretty sketchy one at best. I always thought Apple executives had the mindset that their users would hate upcoming releases.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChiefinLasVegas",
            "body": "if the tap to place cursor anywhere on the screen with one tap (not press hold drag) isn't fix, i'll hate ios19",
            "score": 1,
            "replies": []
        },
        {
            "author": "AshuraBaron",
            "body": "\"Apple executives believe upcoming iOS 19 overhaul is gonna suck shit and users are gonna hate it. They plan to release it anyway.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "UlanInek",
            "body": "Just stop sending me useless notifications during navigation & watching videos",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crack_uv_N0on",
            "body": "Apple knows that no matter how much complaining there is, the vast majority of Apple device users will stay with Apple. The more Apple devices a person has, the harder it is to leave the Apple universe.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RufusAcrospin",
            "body": "This makes me very concerned about said changes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zsoltkaracsony",
            "body": "Well... they said the same thing about basically every update since iOS 7, so this doesn't really say much 🤷‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "d_o_cycler",
            "body": "They’re gonna bet it all on a new “thing” and alienate a bunch of longtime users. Because in their minds they HAVE to innovate. I’m reality they don’t. \n\nThey really, really don’t. Their fans and supporters know what iOS is and feel safe and comfortable within it and that’s what they want. Not something else. Some shined up turd with a bunch of bells and whistles no one requested.",
            "score": 1,
            "replies": []
        },
        {
            "author": "audigex",
            "body": "I've decided a long time ago not to reject change for the sake of it - I've been using MacOS since OS X Snow Leopard and iOS/iPadOS since iPhone OS 3, and generally they've both improved over time... if anything I'm hoping for bigger improvements in MacOS so that I don't have to eg install third party apps to make mouse acceleration feel vaguely okay\n\nAs long as they're actually working on improving it, rather than changing it for the sake of something \"new\" as marketing hype, I'm fine with it\n\nBut I'll sure as shit be turning automatic updates off for a while when this releases, and waiting for the bugs to be ironed out",
            "score": 1,
            "replies": []
        },
        {
            "author": "DontBanMeBro988",
            "body": "How reassuring",
            "score": 1,
            "replies": []
        },
        {
            "author": "tribak",
            "body": "Believe what you want.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RunnyBabbit23",
            "body": "If it’s anything even remotely like the photos app in iOS 18, that will be patently untrue.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jpcjtrtj2",
            "body": "When are they gonna start using Roman numerals to confuse us as to how many phone versions there are?  iPhone MCM sounds kinda cool",
            "score": 1,
            "replies": []
        },
        {
            "author": "whamikaze",
            "body": "Get ready for more Memoji expressions :) :D >^< (^_^)v ↖(^ω^)↗",
            "score": 1,
            "replies": []
        },
        {
            "author": "R89_Silver_Edition",
            "body": "Yep, but we already love the new AI Siri, there is only so much room in our hearts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dibsies",
            "body": "Just like we all LOVE the new photos app! 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "PixelSushiRobot",
            "body": "Tim Cook: We are removing Siri and Apple Intelligence on iOS 19\n\nPeople: Wait, that's actually better! 👏👏👏",
            "score": 1,
            "replies": []
        },
        {
            "author": "RaphaTlr",
            "body": "Why don’t they fix iOS 18 first?? Folks seem to hate it. The new photos app is awful absolutely horrible",
            "score": 1,
            "replies": []
        },
        {
            "author": "ACxx130",
            "body": "Add more wallpapers",
            "score": 1,
            "replies": []
        },
        {
            "author": "madmike76",
            "body": "Apple has used the words “believe” and “love” at every event, launch and new feature. It’s their emotional bonding technique.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Marcel69",
            "body": "Will my iPhone 11 be able to receive the update?",
            "score": 1,
            "replies": []
        },
        {
            "author": "KingKonNL",
            "body": "Just like everyone’s loving all the Apple Intelligence features right now. Oh…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accomplished-Gap-139",
            "body": "Just like we love Apple Intelligence in Europe, right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "hydraByte",
            "body": "I would have more confidence if iOS 18 hadn't been one of the worst updates in memory, launching with missing features that were then released late yet still half-baked, in some ways deteriorating user experience.\n\nI just want computer devices that work as I expect it to, and it seems like Apple is having a harder time with that recently.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bostonkittycat",
            "body": "Just please make it stable. Also we don't need Stage Manager for iOS!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SignInWithApple_TM",
            "body": "To Apple Execs: Oh, SHUT UP",
            "score": 1,
            "replies": []
        },
        {
            "author": "Reasonable-Bend-24",
            "body": "Just go back to the old photos app please.",
            "score": 1,
            "replies": []
        },
        {
            "author": "smakusdod",
            "body": "Still waiting for the last iOS.  WWDC will hit before they release the full Monty possibly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LilLit98JT",
            "body": "We better love it. iOS 18 is just absolute trash right now. Apple needs to redeem themselves, lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mundane_Anybody2374",
            "body": "Just fix the goddamn photo library Jesus Christ!",
            "score": 1,
            "replies": []
        },
        {
            "author": "majeric",
            "body": "Okay. Proof is in the pudding.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sohrobby",
            "body": "They need to fix the bugs and inconsistencies in their entire software stack.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lemon_aide081",
            "body": "\"Best iOS we've ever made\" lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Retard7483",
            "body": "We hear this every year, I’ll believe it when I see it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "madc0w1337",
            "body": "They will add 3 new emojis?",
            "score": 1,
            "replies": []
        },
        {
            "author": "0hMy0ppa",
            "body": "Unless it can run desktop apps in some vm sandbox it’ll be a flop. They’re so scared to eat into their computer market that they’re gimping iOS even though it’s got the same damn processor as the latest MacBook Air. Phone sales have significantly stagnated and most of the high end Mac hardware is being discontinued, plus the trade wars happening. Apple is definitely pivoting to SaaS models but the competition is far more fierce in that space. Maybe they’ll get lucky and get approved for a Disney merger to dominate the streaming market. AI sure as hell hasn’t been to their benefit and never will, I mean just try to run an SDXL on an m3 vs a windows machine from a few years ago to see.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Barbapapa74",
            "body": "Is it going to make all my apps obsolete?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SwingLifeAway93",
            "body": "I haven’t not liked any iOS revision, so they’re not wrong.",
            "score": 0,
            "replies": []
        },
        {
            "author": "MyThinkerThoughts",
            "body": "Is there a leadership problem at Apple? Honest question",
            "score": 0,
            "replies": []
        },
        {
            "author": "Accomplished-Sun9107",
            "body": "Who needs leadership when everyone’s huffing their own farts.",
            "score": 2,
            "replies": []
        },
        {
            "author": "classycatman",
            "body": "I doubt they’d say, “This will be received quite poorly and we’re looking forward to it!”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anonymous157",
            "body": "iOS 19 coming soon but the UI changes will be in 19.3 and will be the following year in October- likely Apple move",
            "score": 1,
            "replies": []
        },
        {
            "author": "longlegsdaddy",
            "body": "They should take a solid 2-3 years and really focus on putting time and effort into an iOS update, while providing security updates. \n\nI want to be impressed and excited like I was when I went from iOS 6 to iOS 7. \n\nBring back favorite features from other updates. That’s what I feel should happen but it never will.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dontrefresh",
            "body": "I think that the concepts I've seen so far look pretty nice so they may not be entirely out of touch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Voidfang_Investments",
            "body": "What are the concepts?",
            "score": -2,
            "replies": []
        },
        {
            "author": "dontrefresh",
            "body": "The new guiding design principle is neumorphism where items appear to protrude or recess from the screen instead of being a flat design. It gives the UI a depth that looks very pleasing to my eyes. This post shows what the iOS keyboard could look like under this new style that already exists within VisionOS [https://www.reddit.com/r/ios/comments/1jcbci7/cant\\_wait\\_for\\_this\\_design\\_in\\_ios\\_19/](https://www.reddit.com/r/ios/comments/1jcbci7/cant_wait_for_this_design_in_ios_19/)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Voidfang_Investments",
            "body": "Thank you.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Just-Sheepherder-202",
            "body": "Try searching.",
            "score": -1,
            "replies": []
        },
        {
            "author": "dissected_gossamer",
            "body": "I would hope Apple's executives believe users will love it, otherwise why would they have wasted all that time, effort, and money working on it? lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drus561",
            "body": "It’s still going to fall short of expectations. It will be buggy and lack functionality. Apple doesn’t do software well",
            "score": 1,
            "replies": []
        },
        {
            "author": "youriqis20pointslow",
            "body": "They are moving away from the white frosted glass and squircle icons that made ios look iconic imo. Not really a fan from the more grayish Vision OS which is somehow even more boring visually.",
            "score": 1,
            "replies": []
        },
        {
            "author": "smashnmashbruh",
            "body": "Executives so hot right now. So in touch with user base. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "zippy72",
            "body": "I'm still mad at the iOS 7 redesign, so good luck with that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheOddEyes",
            "body": "\nI don’t know about that, but there’s the Osborne Effect. Osborne Computer Corporation hyped up an upcoming model while the current one was still on sale, causing people to hold off on buying it. As a result, the company lost money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Throwaway021614",
            "body": "Can I jump to the bottom of a photo album? Probably not? Because Apple will hate to admit that was a terrible decision to remove that feature?\n\nThen I probably won’t like the overhaul.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Obvious_Librarian_97",
            "body": "If iPadOS isn’t scrapped and replaced - I’ll be very disappointed",
            "score": 1,
            "replies": []
        },
        {
            "author": "racingpineapple",
            "body": "By the same people who thought we would love Siri Abe Apple intelligence",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lucy_Goosey_11",
            "body": "Same crack team that gave us all the System Settings app in Mac OS",
            "score": 1,
            "replies": []
        },
        {
            "author": "BILLCLINTONMASK",
            "body": "Most people will be fine with it. \n\nA few hundred will complain about it on the internet. \n\nLife will go on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GSUSISBEAST",
            "body": "OVERHAUL?! LMFAOOOOOO THEY SAID THIS ABOUT IOS 13, 14, 15, 16, 17, AND 18!!! 😭😭😭😭😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "CardiologistStock685",
            "body": "if they remove their shitty AI stuffs then yes!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Suzzie_sunshine",
            "body": "They're drinking too much of their own coolaid at Apple. It may surprise them, that like many others, I don't give the slightest shit. I like my iphone and ipad, and my only expectation is that updates don't make my iThingies worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aredeex",
            "body": "Apple: “you won’t hate it enough to switch to Android”",
            "score": 1,
            "replies": []
        },
        {
            "author": "kadakpav",
            "body": "Here we go again",
            "score": 1,
            "replies": []
        },
        {
            "author": "adh1003",
            "body": "Is that because there are no new features but, instead, a focus on very serious, deep and numerous bug fixes?\n\nI mean, they still don't even have a working Control Centre revamp - it's buggy as all hell - the customisable lock screen still screws up pretty often (plenty of posts about things overlapping, all being left-aligned, wrong sizes, whatever), and they haven't even got their dark mode or icon tinting to work reliably.\n\nI'm supposed to believe they can re-skin the entire OS and it won't be a massively bloated utter clusterfuck?\n\nYeah, right.",
            "score": 1,
            "replies": []
        },
        {
            "author": "desertrat75",
            "body": "Using iPadOS is the single most frustrating activity in the Apple ecosystem.  If they can make improvement there, I'll be happy.  But that's not going to be accomplished with someone's idea of cool new icons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandomRedditor44",
            "body": "Lol this is the same company that released that terrible Photos app redesign.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BriGuyBby",
            "body": "Sounds like an immediate fail to me if the suits are hyping it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wolf873",
            "body": "Just listen to your base and at least change the photo app back!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rent-Impossible",
            "body": "It better have a new Photo layout. That's the sole reason I haven't upgraded to iOS18 yet. But RCS keeps tempting me with each passing day...",
            "score": 1,
            "replies": []
        },
        {
            "author": "2dark2light",
            "body": "…..as they break more stuff.  Push out MORE updates and more false promises",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aromatic_Fail_1722",
            "body": "I genuinely loved it when they introduced copy/paste. Everything after has been pretty meh.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Steam23",
            "body": "“Reality is that which, when you stop believing in it, doesn’t go away.”",
            "score": 0,
            "replies": []
        },
        {
            "author": "Jusby_Cause",
            "body": "I was like, “Another Gurman story?” and, yup, another Gurman story. This is what he does instead of leaks now. :)\n\n”Apple Store workers, according to sources, think customers will like their new displays they’ll have in late 2025.” Can’t reveal my sources, but, yup, you can ONLY find information like this from ME.",
            "score": 0,
            "replies": []
        },
        {
            "author": "EagerSubWoofer",
            "body": "Holy shit!",
            "score": 0,
            "replies": []
        },
        {
            "author": "AltoExyl",
            "body": "So the iPad is going to actually take advantage of all that power and become more than just an expensive web browser for most people outside the creative industry?\n\nWe’re going to have better file management across all devices and now most apps are unified they can all run on everything yeah?\n\nOr is it just a lick of paint?\n\nI’ll bet on the latter.\n\nI love Apple, but they don’t half cripple some devices and features in favour of pushing buyers to buy one of everything.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ziggggy-stardust",
            "body": "Stop treating users as fools",
            "score": 0,
            "replies": []
        },
        {
            "author": "BossHogGA",
            "body": "Nobody loves the new Photos app.  Worse than the old one in every way.\n\nNobody loves Apple intelligence.  It's worthless garbage.\n\nWhat exactly gives them confidence that anyone will love these changes?",
            "score": 0,
            "replies": []
        },
        {
            "author": "floorshitter69",
            "body": "iOS 19: We think you'll love the overhaul.\n\niOS 20: We intentionally made it bad just to try something different.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ok-Priority-7303",
            "body": "Round icons, the most innovative change in history.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Rwekre",
            "body": "I mean, no not really 😂 but change is necessary to keep the pace",
            "score": -1,
            "replies": []
        },
        {
            "author": "Beekibye",
            "body": "Dam this is idiotic ",
            "score": -1,
            "replies": []
        },
        {
            "author": "Click_To_Submit",
            "body": "Uh oh!",
            "score": -1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Yea yea yeah… building hype since early on. Like if people would forget the ai fiasco and forgive you… well, there’s a reason Trump got elected so probably yes everyone will forgive.\n\nChange whatever icons you wanna change, but first give me a stable release, remove all that ai garbage and leave Siri more usable and fix the damn keyboard. Then you have our permission to do anything else",
            "score": -1,
            "replies": []
        },
        {
            "author": "Dry-Recognition-5143",
            "body": "iPhone 17 and iOS19 are Apple’s last chance for lots of people. If it misses the mark those with iPhone 13s etc will go elsewhere.",
            "score": -1,
            "replies": []
        },
        {
            "author": "ThatGuyFromBRITAIN",
            "body": "iOS feels pretty messy recently. It’s not as stable as it used to, and some of the features Apple have released (mainly regarding AI) has been incredibly flawed. Especially the Playground. The tech is legit 2 years behind anything else. It’s so weird. It almost needs to be wiped and started again.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Huckleberry199",
            "body": "I’m getting rid of all Apple products. Partnering with a Nazi is beyond the pale.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Mardo1234",
            "body": "Whos going to break the story about Tim Cook's sex trafficking ring he had?",
            "score": -3,
            "replies": []
        }
    ]
}