{
    "title": "Apple’s iPhone 16e Is Outselling iPhone SE But Won’t Reverse China Slide – Bloomberg",
    "author": "TheVitt",
    "subreddit": "apple",
    "rank": 14,
    "score": 255,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 67,
    "url": "https://www.removepaywall.com/search?url=https://www.bloomberg.com/news/articles/2025-03-14/apple-s-iphone-16e-is-outselling-iphone-se-but-won-t-reverse-china-slide",
    "id": "1jd83r1",
    "selftext": "",
    "comments": [
        {
            "author": "djbuu",
            "body": "Turns out armchair tech company CEOs of Reddit are wrong once again.",
            "score": 171,
            "replies": [
                {
                    "author": "Agreeable-Weather-89",
                    "body": "\"But it misses 1 GPU core!\"\n\nNothing Apple cut mattered to the vast majority of consumers.",
                    "score": 74,
                    "replies": [
                        {
                            "author": "siddhuncle",
                            "body": "I didn’t see one person complain about the GPU core. Most people complained about MagSafe. That’s a feature that even the average person can appreciate during the lifetime of the phone.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "GoSh4rks",
                                    "body": "And the average person can appreciate a 5x zoom or 120hz. Doesn't mean that they want to pay for it.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "siddhuncle",
                                            "body": "Actually, the average person cannot tell 120hz from 60hz. That's exactly why they don't pay for it lol. I'm arguing that 1 GPU core isn't something people were complaining about. An actual usable feature is missing though.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "rezzidue",
                                    "body": "A case with MagSafe circumvents the issue entirely",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "turtleship_2006",
                                            "body": "Or stickers.  \n\nI bought 5 of them for like 70p on AliExpress",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Quepiid",
                                    "body": "You don’t need MagSafe built in. Any MagSafe case will work. ",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "siddhuncle",
                                            "body": "This is true, I forgot that this was an option that most people would pick.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "djbuu",
                                    "body": "Appreciate yes. But budget minded buyers don’t want a feature they have to pay extra for, and buy extra accessories for, when the phone comes with a USB charging cable for no extra charge.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "wakkha",
                                    "body": "I’m the target customer of the 16e, my SE started to die and I wanted the cheapest iPhone possible. I literally had to google what MagSafe is, and even then honestly I just don’t care that much.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Imtherealwaffle",
                                    "body": "And really most people complained about the price. Obviously its sold well but i dont think it was misguided to think that the high price mightve hurt sales",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "djbuu",
                                            "body": "\"Sales\" isn't a complete metric. Are they looking to maximize revenue or units? Who knows. We don't have that data. Us sticking our finger in the wind guessing if it \"hurt sales\" doesn't mean anything to Apple.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WendysChiliAndPepsi",
                    "body": "Reddit is wrong about literally everything related to real life. Chances are if you align with Reddit on any belief (politics, tech decisions, relationship advice) you're probably in the minority. ",
                    "score": 32,
                    "replies": [
                        {
                            "author": "djbuu",
                            "body": "I like that this comment almost creates a paradox.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "beef-taco-supreme",
                            "body": "reddit virgins with no life experience are constantly wrong?\n\nquelle surprise!",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "ihaterussianbots",
                            "body": "Reddit was right politically in 2008 2012, 2020",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NecroCannon",
                    "body": "For me, it got me to plan on dipping out on iPhones. From the lack luster updates and I’m personally tired of the Apple price ladder bs they got going on just because I want more storage. Fall is my make or break, around that time there’ll be plenty of mid ranged android options to consider",
                    "score": -3,
                    "replies": [
                        {
                            "author": "djbuu",
                            "body": "If you think the grass is greener, by all means see ya.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BluePeriod_",
            "body": "I knew this would. It’s sleek and affordable. Having multiple friends in the Apple Store, I always laugh at the “You could get a 14PM refurbished for that cost and even…” bro the average person doesn’t give a shit about that at all.",
            "score": 43,
            "replies": []
        },
        {
            "author": "Washington_Fitz",
            "body": "The 16e is going to sell extremely well.",
            "score": 95,
            "replies": [
                {
                    "author": "Deceptiveideas",
                    "body": "People on this sub thought it was going to flop because of its high price, despite it being $200 cheaper ($599) than Apple’s mid range phones ($799) yet having very similar specs.\n\nWe picked one up for my sibling who is disabled. He doesn’t need all the extra bells and whistles of the more expensive iPhones. Why pay more for features he will literally never use?",
                    "score": 73,
                    "replies": [
                        {
                            "author": "Fignapz",
                            "body": "Another factor people always forget, these cheaper baseline devices are often used for corporate phones. I have a 12 (base model) for work and I’m sure when they push an upgrade on me later this year, it’ll be the 16e. \n\nWhen all you need is corporate email, maybe some proprietary apps or travel apps for corporate travel, and basic communication, these devices hit the mark. Now scale up that $200 difference by the number of employees in a Fortune 500 company and it’s significant savings. ",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "shivaswrath",
                                    "body": "Glad I just snuck in and got a 16 before my company switches to 16e",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Extension-Ant-8",
                                    "body": "Hi there. This is me. I literally have Apple Store receipts big enough to buy a nice big house. \n\nI buy the base model, so it will be this one on my next order. I only deploy a few apps to the fleet and, it’s completely locked down due to my industry requirements.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "NooktaSt",
                                    "body": "Yup. Im sure work will replace my se2 with one. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Maik-li",
                            "body": "I picked one up, since I just wanted an iOS device as a secondary phone with long battery life, USB-C, and newer chipset and costs less than $400 (got it from Straight Talk at $365). \n\nComing from an S24 Ultra, I've adapted to the 60Hz display quickly. Didn't mind the notch. It makes a good commuter phone due to the size and battery life. I'm now thinking about using this as my primary.\n\nEven on my S24 Ultra, I rarely use the ultra wide camera. I don't use AirTags, so no need for UWB. And the same goes for wireless charging.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "turtleship_2006",
                                    "body": "Also, on my s25+ I have 120hz most of the time, but I set it to 60 when im at work to save battery. Can I just about notice 120 looking nicer? Sure. But 60hz is still more than usable (including when I use my other devices or help someone with something on their phone etc)",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "princemousey1",
                                    "body": "The S24 Ultra has a 5x optical and 25x digital zoom? How do you go from that to 1x optical?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Maik-li",
                                            "body": "I’ll still carry both phones. I’ll still have the S24 for its zoom lens. I’m just saying I rarely the ultrawide lens, that I don’t miss it on the 16e.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "OligarchyAmbulance",
                            "body": "I've seen so many people claim it's too close to the price of the 16, but that $200 buys you an extra camera and some magnets. Why would anyone spend $200 on that??",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "zmzzx-",
                                    "body": "Agreed. I bought the 16e and put a case on it - it feels like having MagSafe. This thing sticks to my normal accessories. I don’t use wireless charging because it’s always slower anyway.\n\nComing from a 13 pro it feels great, I haven’t noticed the refresh rate really. This camera is better, maybe not by a large margin.\n\nI’m not going to pay 33% more for a better camera and worse battery.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "zmzzx-",
                            "body": "$200 cheaper with a better battery but worse camera. If you don’t take pictures daily, it’s a no brainer.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Deceptiveideas",
                                    "body": "Shame on you for conflating “he will never use” with “he won’t notice”. Not only that, but he has told me how much of an upgrade it is from his previous phone and he’s extremely happy with it. \n\nThink before you comment.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "oblivic90",
                                            "body": "I was about to comment on his msg but it got deleted..\n\n“Worse than.. iPhone 16 pro max he doesn’t want/need? Get the f off with that virtue signaling.”",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Exact_Recording4039",
                                            "body": "People are mostly complaining about the bad value this phone is compared to the competition.\n\nThink before you comment :)",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "RadicalMGuy",
                                                    "body": "Value isn't the main consideration for a lot of people",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Deceptiveideas",
                                                            "body": "Not sure if you’re aware but the user stated I didn’t care for my disabled sibling because I got them the 16e over the 16. Looks like they deleted their comment.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Exact_Recording4039",
                                                            "body": "Yeah I know only the smarter people take value into consideration but there’s still nothing wrong with talking about a company not offering something as good as the competition ",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "VerusPatriota",
            "body": "That can’t be right. This is a horrible value! That’s what all the guys that own 16 Pro Maxes posted.",
            "score": 24,
            "replies": []
        },
        {
            "author": "nobuhok",
            "body": "I am typing on one. Battery is insane. I'm on day 3 with normal usage and it just hit 20%.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Butgut_Maximus",
            "body": "Bought mine day 1. Upgraded from the SE 2nd gen. \n\nI have battery life!",
            "score": 3,
            "replies": []
        },
        {
            "author": "PeakBrave8235",
            "body": "Pump dump pump dump. Bloomberg working its magic to change the stock price with its “market moving news”",
            "score": 14,
            "replies": [
                {
                    "author": "SUPRVLLAN",
                    "body": "Show us on the chart where the pump is.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "AoeDreaMEr",
                    "body": "That’s all they do.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheDragonSlayingCat",
            "body": "And let’s go [look through the looking glass](https://www.reddit.com/r/apple/comments/1it8y1b/apple_debuts_iphone_16e_a_powerful_new_member_of/) from a month ago. Redditors whine and complain about little technical nuances + the slightly higher price, while in the real world, it turns out to be a hit.\n\nEven [my own comment](https://www.reddit.com/r/apple/comments/1it8y1b/comment/mdmy0dl/) pointing this out got downvoted, and it turned out to be correct.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KingDaDeDo",
            "body": "yeah this isn't surprising. It's Apple's new budget phone. while i do think $499 would be a better price range for this phone, it being $200 less than the standard 16 will be a draw for a lot of people who are looking for a simpler iphone. my sister just got a 16e from her work and it's pretty nice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sloopeyyy",
            "body": "Passed by an Apple store few days ago and played around with the 16E demo. It really is... unimpressive to say the least. Which is odd because despite what the mainline models are and have been in the past, handling them at the store usually leaves a solid impression. The 16E just didn't cut it and the price tag is a joke. It really needed to be atleast a whole hundred dollar less for it to be even considerable. Its almost nothing like what the Pixel a-series and Samsung's FE phones are. The 16E feels really dumbed down compared to the others.",
            "score": -27,
            "replies": [
                {
                    "author": "setokaiba22",
                    "body": "What exactly didn’t hit you? You maybe aren’t the target audience but if you on in an Apple Store nearly all the phones feel the same.\n\nEvidently the Pro is smoother, quicker and noticeable but really they all mostly the same outside of that on a quick play with - the Plus just having a larger screen",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "RedbirdRiot",
                    "body": "…it’s an iPhone 16 with a few cut down features. I get everyone got wishful thinking because some leakers said $499 and got it wrong, but the hand-wringing over this phone is ridiculous. ",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Appropriate-Role9361",
                            "body": "Nothing much else to talk about I guess?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Appropriate-Role9361",
                    "body": "You’re not the target audience ",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "sanirosan",
                    "body": "And yet it is outselling the iPhone SE",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "External-Ad-1331",
            "body": "Lol why should it? AI is the rage and 🍎 is sliding backwards in that regard. Not to mention the new SiC technology which is already seen in upper mid range android phones",
            "score": -27,
            "replies": [
                {
                    "author": "elgatomegustamucho",
                    "body": "What are you trying to say?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "clonked",
                            "body": "He doesn’t know",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bishime",
                    "body": "I too am confused about the SiC comment",
                    "score": 5,
                    "replies": [
                        {
                            "author": "External-Ad-1331",
                            "body": "Silicone Carbon battery",
                            "score": -5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PeakBrave8235",
                    "body": "Huh? It literally does not use new battery tech lol",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ChemicalDaniel",
                    "body": "This isn’t an upper midrange phone, unless you think the regular iPhone 16 is a flagship device.\n\nCan any producer of SiC batteries make 50M units without supply chain issues? Yeah, the Lenovo P90X might have it because three and a half people purchase them a year. Try to match Apple’s scale and you see why half of the “new innovative features” only come once supply chains are ready.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "External-Ad-1331",
                            "body": "Price wise I'd say it sits confidently in the upper midrange phone market, beck Samsung a56 is even cheaper, we're talking why people don't buy it, because they want more value for their money",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}