{
    "title": "Apple Canned Larger iPhone 17 Air Model Over Fears of Bendgate 2.0",
    "author": "chrisdh79",
    "subreddit": "apple",
    "rank": 12,
    "score": 648,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 98,
    "url": "https://www.macrumors.com/2025/03/17/larger-iphone-17-air-referred-to-prototype/",
    "id": "1jdavo7",
    "selftext": "",
    "comments": [
        {
            "author": "colin8651",
            "body": "Nonsense.  They were too cheap to include unobtainium to strengthen the larger model.",
            "score": 48,
            "replies": []
        },
        {
            "author": "rennarda",
            "body": "So…company developed un-announced product and deduced in engineering testing that it didn’t meet their quality standards, and decided not to continue development ?\n\nSee also: Bears takes a dump in the woods, and Pope is Catholic. Now here’s Tom with the weather…",
            "score": 670,
            "replies": [
                {
                    "author": "AzettImpa",
                    "body": "Article: Here’s some entertaining rumors/news if you want an insight into how Apple operates. Read it or not and take it with a grain of salt.\n\nReddit every time: How dare you even INSINUATE anything about Apple! I must now complain!!!",
                    "score": 112,
                    "replies": [
                        {
                            "author": "OldManBearPig",
                            "body": "The fact that it's completely faith-based is the annoying part. I simply do not trust \"insiders.\" Any of them. They'll say whatever they can for clicks. \n\nI can make up all kinds of shit about how Apple is making their own pickup truck with a railgun attached, but then decided to abandon development so it isn't actually happening. \n\nUnless Apple themselves announce this, there's absolutely zero merit to it in my mind. \n\nThe only time I think we've ever gotten an intended product release/cancellation acknowledged by Apple themselves is with the Airpower mat, I think.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Tookmyprawns",
                                    "body": "That’s funny. Apple has no secrecy anymore. There hasn’t been a phone released in over a decade that we didn’t know everything about months before release. \n\nIt’s possible to take things as unconfirmed but possible and not get mad.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "AzettImpa",
                                            "body": "Literally everything that comes from Apple is leaked beforehand.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "nWhm99",
                                    "body": "Wanna bet Iphone Air is a thing and coming out this year? Put some money on these things they \"make up\", how's that?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Crapitron",
                                            "body": "What does making a “bet” on this extremely specific thing have to do with insiders routinely throwing a bunch of shit at the wall to see what sticks? Are you really stupid enough to believe everything they say? \n\nDo you run a tech blog or are you just the insiders’ favorite internet user because you routinely fall for clickbait?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "OldManBearPig",
                                            "body": "Why do I need to \"bet\" on this? I can already see shit they were wrong about. The same guy who wrote this article announced the last iPhone event was on September 10th. He was wrong. \n\nWhy are you trying to defend these people?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "nWhm99",
                                                    "body": "Lol, too afraid to put your money where your mouth is.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "OldManBearPig",
                                                            "body": "Okay, I'll bet you personally $5,000 that one of John Gruber's predictions for 2026 is incorrect.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "nWhm99",
                                                                    "body": "Lol, love the cowardly moving of the goalpost. \n\nSure, I can bet you $5000, well ask a mod in one of the betting subs as escrow. \n\nTerms are, “A product named iPhone air will come out this year.”  \n\nSimple enough, but let me guess, you’re too afraid to do it.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "OldManBearPig",
                                                                            "body": "What \"moving of the goalpost\"?\n\n*You're* the one moving the goalposts. \n\nI said they get shit wrong plenty. I'm willing to bet that they get more shit wrong. \n\nYou're unwilling to take that bet because you're scared to put your money where your mouth is. \n\nClaiming \"they'll release an iPhone in September\" isn't some fucking monumental revelation, lmao. I can predict that too, here's my prediction: WWDC will happen sometime this summer where they'll announce iOS 19. Crazy, right?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "nWhm99",
                                                                                    "body": "This entire topic is about the Air. The original bet was about the air. You’re the one moving the goalpost. \n\nIn fact, look at how we each proposed it:\n\nMe: if this one specific thing is true, I win. \n\nYou: if just one of countless predictions is false, I win. \n\nYou see how cowardly you are? Lol.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "OldManBearPig",
                                                                                            "body": "> This entire topic is about the Air.\n\nThis topic is about \"insiders\" making up shit all the time. \n\nIn fact, look at our comments:\n\nMe: Insiders are wrong and make shit up all the time\n\nYou: If this one single specific thing is true, you're wrong.\n\nYou see how stupid you are? You're literally the one arguing for an exception to prove a rule.\n\nedit: lol, loser blocked me because he's scared to make a bet",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "nWhm99",
                                                                                                    "body": "I see that you're still clumsily dodging the bet. It seems like you know you're wrong, so you're afraid to put money on it. It's ok, don't worry about it. When the air comes out, I just want you to feel a tiniest bit of shame, that's all, I don't need your money, as you clearly won't put any on the line.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Dinnerpancakes",
                                    "body": "When I saw “faith-based” I thought you were talking about in the original comment where they said the pope being catholic. I was wondering how this was a debate.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "AngryHoosky",
                                    "body": "\"Trust me, bro.\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LyrMeThatBifrost",
                            "body": "You people must complain about everything",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bourbonaddicted",
                    "body": "Water is wet",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "sluuuudge",
                    "body": "It’s definitely interesting to know that Apple played with the idea of a large Air device, but I agree that it’s odd to see it talked about as some big controversy. \n\nAlso, unpopular opinion, but if you’re applying enough pressure to your phone to bend it then you’re applying too much pressure. I had an iPhone 6 Plus and wore it caseless in jeans for two years without so much as a little bit of warping.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "EU-National",
                            "body": "You expect Apple customers to possess common sense?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "proton_badger",
                                    "body": "Well, let's not leave out Youtube Influencers who're thirsting for views.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NoNSFWAccount",
                    "body": "This is more interesting that a bear takes a dump in the woods and pope is catholic because some people might be disappointed that there isn’t a thinner iPhone. Not sure how people get away with posing bad logic as wisdom",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Haplomega",
                    "body": "“…Here’s tom with the weather” is that a bill hicks reference in the wild?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "G35aiyan",
                    "body": "ITS GON’ RAIN!!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "humbuckaroo",
                    "body": "Yeah. Much ado about nothing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PeakBrave8235",
                    "body": "Normally I’d give someone the benefit of the doubt, thinking maybe Gurman is saying this to balance his constant hysterical coverage of Apple, but given his constant hysterical coverage of Apple, I have to be skeptical why he’s mentioning this — as much as I would love to believe he’s talking about this to calm down the panickers and support Apple",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Captaincadet",
                            "body": "It’s because Bloomberg sells access to the Bloomberg terminal for $30k a year which gives you this sort of news a few minutes beforehand so you can sell your shares and buy them back when the AI sells them on bad news",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "IcarusFlyingWings",
                                    "body": "This type of article is absolutely not why the terminal costs 30k per year.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "PeakBrave8235",
                                    "body": "Exactly. ",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SuperRob",
                    "body": "I’m calling bullshit on this story. Why? Because the iPad Pro 13” M4 exists and it is THINNER than even the planned iPhone 17 Air. You don’t get a much bigger screen than that.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "King_Sam-_-",
                            "body": "You’re not putting an iPad in your pocket lol.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PlasticPatient",
                    "body": "Pope is Catholic???? That's Islamophobic.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "oliphant428",
            "body": "I'm buying this phone. Ready for something different after having each of the Pro models the last few years.",
            "score": 71,
            "replies": [
                {
                    "author": "CommanderSlash",
                    "body": "same, if it indeed has Pro Motion then it will be an easy buy for me. I rarely use the ultra wide or telephoto lens on my iPhone Pro Max so I do not mind losing those lenses.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Tyler927",
                            "body": "This would be my thought too if they still came with the 3x cameras, but I love the 5x camera soo much. I don’t think I could get rid of it :(",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OhHowINeedChanging",
                    "body": "Ready for a phone with all the pro features except for a massive camera bump",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MadOrange64",
                    "body": "Me too as long as it has a better camera than my iPhone 15 Pro Max.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hungarianhc",
                    "body": "Yeah I might as well. I realize now that the number one thing I hate about my phones is how they create an imprint in my front jeans pocket... If I can still have good performance and get rid of this issue, I'm in",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "chrisdh79",
            "body": "From the article: Apple prototyped a larger ultra-slim iPhone 17 Air with a 6.9-inch display, but ultimately decided not to go ahead with the device because of fears that it could be susceptible to bending, according to a new report.\n\nBloomberg reporter Mark Gurman, writing in his latest Power On [newsletter](https://www.bloomberg.com/news/newsletters/2025-03-16/apple-iphone-17-air-foldable-iphone-details-ai-crisis-to-haunt-top-100-event-m8bl3a9c):\n\n*When it first started work on the phone, it prototyped a device with a 6.9-inch screen — matching the Pro Max. Apple pulled the plug on that over fears that a thin device with a giant screen would be susceptible to bending. The company suffered such a controversy in 2014 — \"Bendgate\" — when the iPhone 6 Plus would sometimes warp when in a tight pocket.*\n\nEarlier this month, we reported on a rumor out of China claiming that the iPhone 17 Air shares the same dimensions as the iPhone 17 Pro Max, with the only difference being in the thickness of the devices. It's quite possible the rumor had its origins in Apple's canned prototype.\n\nCorroborating rumors indicate that the iPhone 17 Air that Apple will launch in September will feature a 6.6-inch display with 120Hz ProMotion support, a Dynamic Island, an A19 chip, a single 48-megapixel rear camera, and Apple's custom-made C1 modem. Gurman has been told that the device may start at roughly $899 in the U.S., which is the same price point as the iPhone 16 Plus that the ultra-thin device is believed to be replacing in Apple's smartphone lineup.",
            "score": 42,
            "replies": [
                {
                    "author": "PimpTrickGangstaClik",
                    "body": "Make it with a titanium frame?  Air Max Pro",
                    "score": 11,
                    "replies": [
                        {
                            "author": "_-Kr4t0s-_",
                            "body": "Now all they need is for Michael Jordan to promote it.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PeakBrave8235",
                    "body": "This is a complete non-story lmfao (nothing against you, just against MacRumors and Gurman). ",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "gtlgdp",
                    "body": "Didn’t realize the Air isn’t going to have an ultra wide camera. That’s hella annoying",
                    "score": 7,
                    "replies": [
                        {
                            "author": "leo-g",
                            "body": "It’s ultra wide so they can crop in for a 1x and 2x.",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Stone_Field",
                    "body": "It's gonna have 120hz? Does this mean that the base iphone will too?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AppointmentNeat",
                            "body": "If Apple raises their prices this year, sure. I’ve said it a million times: The base iPhones won’t get 120hz or even 90hz until Apple raises the prices.\n\nI believe Apple will raise their prices this year if the 16e is any indication..",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "graigsm",
            "body": "I’ll. Be ignoring the thin phone.  You notice how far the cameras Stick out?   Exactly the same as the thicker version.  It looks like they could make the cameras flush on the thicker phone.",
            "score": 14,
            "replies": [
                {
                    "author": "NXCW",
                    "body": "Yup. And that to me is the single most annoying design choice in modern smartphones. \n\nThe quality of the photos is probably worth it, though.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "byjimini",
            "body": "Read that as “Apple Canned Lager” 🍺",
            "score": 6,
            "replies": []
        },
        {
            "author": "OrganicKeynesianBean",
            "body": "Alternatively: we could have had the first rubber iPhone.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Perfect-Treat-6552",
            "body": "So that's supposedly the iPhone 17 Air Plus? HAHA. Why not make a mini pleasee",
            "score": 8,
            "replies": [
                {
                    "author": "Chemical_Knowledge64",
                    "body": "The mini is dead for now. At least a mini with under a 5.7-5.8 inch screen. Because the mini had easily the worst battery life of the 2 generations it was made in. And people care about decent battery life and aren’t willing to sacrifice such battery life for a phone that small.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Blood-PawWerewolf",
            "body": "You know what, smart move since that would be more than just a bent phone in someone’s pocket, but a Li-ion battery fire as well.",
            "score": 6,
            "replies": [
                {
                    "author": "AlternativeAward",
                    "body": "iphone 6 had a battery too..",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Blood-PawWerewolf",
                            "body": "Yeah, but was it as thin as this one? No.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "ArtBW",
                                    "body": "Are thinner batteries more flammable?",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "WFlumin8",
                                    "body": "Are thicker batteries less flammable?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lancaster61",
                    "body": "There's even rumors that the battery may be a new chemistry as well. Is that better or worse for fire? Who knows.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Chemical_Knowledge64",
                            "body": "If it’s some sort of solids based composition, without any sort of liquid based material in the batteries, then it would be safer but only god knows until the thing is out and how the new battery performs and withstands such pressure.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AltoExyl",
            "body": "Fears of bendgate 2.0? Wouldn’t it be about 4.0?\n\nThose last few pro iPads are awfully foldable",
            "score": 2,
            "replies": []
        },
        {
            "author": "frockinbrock",
            "body": "Call me crazy, but considering the logistical constraints, I think introducing the Air series would have been a great cycle to bring back the iPhone Mini crowd. 2 reasons:  \n1) easier hardware, the Mini size can withstand more bend just by its proportions.  \n  \n2) the Mini idea or nameplate has been f*cked from the beginning; the SE arriving as the first “mini” created the idea that the smaller phone is a cheap  budget model. Poor battery life on the short lived 12 Mini, then the 13 Mini had its legs cut by its high price, poor marketing, and the SE2 release.  \nA new model of **17 Air Nano** (or mini) in the 5.4 inch screen size, would fix SO many issues, and give an update avenue for a large group that is on 3-5 year old phones.  \n  \nTo me it’s a no brainer easy option, but if they even try it it’s probably a fall release, which will again f*ck it over by people thinking it’s a gimped budget model at “new model” pricing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HopelessBearsFan",
            "body": "I really couldn’t care less if the new phone is marginally thinner.\n\nHow about you couple your new battery technology with the original phone body size, and increase battery life by 100% instead of just 30% (arbitrary percentages)",
            "score": 2,
            "replies": [
                {
                    "author": "proton_badger",
                    "body": "> new battery technology \n\nIf that rumor has meat on it at all it'll probably end up in the rest of the range at some point. Then they can upsell users to Pro Max for most wattage.\n\nMy 13 lasts 3 days+, so different people different use cases.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ab_90",
            "body": "Air Max? Air+ ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "titoxtian",
            "body": "Isn’t iphone air expected to be 5.5mm? Ipad pro is already at 5.1mm and larger than iphone… maybe coz we put the phones in pockets?",
            "score": 1,
            "replies": [
                {
                    "author": "Chemical_Knowledge64",
                    "body": "5.65mm\n\nHonestly the air could be as much as 6.5mm thick and still keep the name since it’s aluminum based and will be lighter than previous iPhones.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "insane_steve_ballmer",
            "body": "Is the Air supposed to be thinner than ipad pro? They’ve already proven that can go very large without bending",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eggyhead",
            "body": "They’re going to get bend gate anyway. The digital rags will make sure it happens for clicks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kinglucent",
            "body": "The headline makes it sound like they’re worried about customer backlash rather than, “Apple Canned Larger Air because they couldn’t make it structurally sound”",
            "score": 1,
            "replies": []
        },
        {
            "author": "derpycheetah",
            "body": "The wording of this article in regards to Apple axing a particular prototype that didn't meet its standards is so outrageous and over the top, it makes me want to set myself on fire!",
            "score": 1,
            "replies": []
        },
        {
            "author": "scots",
            "body": "I mean.. much of the problem with the iPhone 6 (I had *two* that bent, I'm a skinny guy, and it was almost always hand-carried, *how* it bent is baffling)  - was because Apple chose shitty 6000 series aluminum to save money.  \n\nSeries 6000 aluminum is the kind of trash that things like your grandma's 40 year old storm door are made out of. It's soft. The result was predictable.  The other problem was that the bendy iPhones didn't have much if any internal bracing.   \n\nOnce Apple moved the next phone to better aerospace grade aluminum and designed a little ribbing inside the phone chassis, the bending stopped - in a device that was almost exactly the same physical size.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DontBanMeBro988",
            "body": "One headline about a folding phone coming, and another about not making a phone because it might fold.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lencastre",
            "body": "Sure sure,… not the fact they’ll be juggling support for a 100 million form factors. Jeez,… just simplify ffs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ballsahoy72",
            "body": "Read this as Canned Lager. Going to bed",
            "score": 1,
            "replies": []
        },
        {
            "author": "eggflip1020",
            "body": "Water: Wet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "im_nob0dy",
            "body": "I'm tempted to pre-order the 17 Air if it has that Nexus 6P-esque design, but worried about buying first-gen tech.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xkvm_",
            "body": "Yet the m4 iPad Pro which is even thinner and has a way larger screen is a non issue?",
            "score": -9,
            "replies": [
                {
                    "author": "4u2nv2019",
                    "body": "You don’t put an iPad Pro in your pocket or take selfies with it out and about, or put it on your car seat by accident. I dunno . iPhone has different scenarios vs iPad I would have thought…",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Embarrassed-Back1894",
                            "body": "Yeah, I mean I have the newer thin iPad Pro, but it’s in a case has been fine going in and out of my back pack. \n\nYour phone kind of takes a beating. Just doing things like sitting and standing up, or if you have a physical labor job, generally you still have your phone on you. The phone has to endure a good amount more of stress. \n\nI think this is going to be a phone you’ll see girls pick up more than the Pro models (and guys im sure wil also). That phone will likely end up in pairs of skinny jeans and have to endure pressure on its frame. \n\nPlus I’m sure the first thing social media is going to be all over when they see the iPhone Air is “reeMemBerrr the bending phone!!”\n\nApple doesn’t want to deal with that.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bran_the_man93",
                    "body": "Yes because tablets and phones are subject to different durability requirements.... \n\nHow is that not obvious?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "DeviIOfHeIIsKitchen",
                            "body": "Some of these commenters are braindead.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AlternativeAward",
                    "body": "the m4 ipad pro is actually reinforced pretty well to prevent bending",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Neat_Street_7683",
                    "body": "It definitely is an issue. They could fix it and the mediocre battery life by making the iPad a bit thicker, but someone at Apple likes form over function, so this is what we get. Fragile thin products with bad battery life",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "fernst",
            "body": "It's not like apple cares...with bendgate the answer was \"you're using it wrong\"",
            "score": 0,
            "replies": [
                {
                    "author": "stiggg",
                    "body": "That was antennagate (iPhone4) and we got bumpers",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TBoneTheOriginal",
                    "body": "I would argue that sitting on your $1000 phone *is* using it wrong. But Apple still won’t want the bad PR no matter how stupid people are.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fritz_The_KitKat",
            "body": "I’m glad I returned my hefty 16pro after 6 days.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mysterious_County154",
            "body": "Yet they still sell thin as fuck iPads that bend easily",
            "score": -4,
            "replies": [
                {
                    "author": "Some_guy_am_i",
                    "body": "I think the difference is the expected usage. \n\nPeople put phones in their pockets and sit on them all the time. I do it sometimes too. Not on purpose, obviously.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "webcrawler89",
            "body": "I’ve noticed what I think is a deliberate attempt to make Apple’s value drop, via all these “negative” news over the last few days that isn’t all that bad really.",
            "score": -2,
            "replies": []
        },
        {
            "author": "karatekid430",
            "body": "Air is Apple's dumbest bullshit line ever. Overheating, bending, shit battery life, you name it.",
            "score": -5,
            "replies": [
                {
                    "author": "mredofcourse",
                    "body": "Yeah, here's a product Apple hasn't even announced, is rumored *not* to be an upcoming thing, and already it has bending issues!\n\n/S",
                    "score": 2,
                    "replies": [
                        {
                            "author": "karatekid430",
                            "body": "You mock but in reality you can bet it will have issues. Air is insulted even by Apple themselves who call some horrendously insultingly bad products “Pro” including stuff with 8GB RAM, stuff without socketed SSD/RAM, stuff with only two USB-C porte. The bar is way down there. The Air did not even make that bar. It is a branding that screams to people who care about vanity over functionality and will pay high prices for it.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "mredofcourse",
                                    "body": "Just addressing the branding part of your comment:\n\nHave you considered that some people use products differently than you do and perhaps 2 USB-C ports are 2 ports that some aren't ever going to use at all?\n\nMy wife fits the Air demo perfectly.  She's never going to use a USB-C port on either an iPhone or MacBook.  Likewise, she's never going to want/need to upgrade the RAM and at 16GB for the new M4 MacBook Air, that's likely to last her as long as her last MacBook did (10 years).  It's has nothing to do with vanity, and everything to do with size/weight, and ease of use for their intended use.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}