{
    "title": "iOS 18.3.2 Broke iCloud Mail Delivery",
    "author": "iMacmatician",
    "subreddit": "apple",
    "rank": 7,
    "score": 880,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 125,
    "url": "https://www.macrumors.com/2025/03/17/ios-18-3-2-icloud-mail-issue/",
    "id": "1jdq254",
    "selftext": "",
    "comments": [
        {
            "author": "DominikB26",
            "body": "Oh that’s why… \n\nI always have to open mail for it to update. Not pushing.",
            "score": 457,
            "replies": [
                {
                    "author": "Tblue",
                    "body": "For a while now, for normal IMAP, I don't get push notifications anymore. Wonder if something broke IMAP IDLE in general...\n\n//edit: Not according to the article, but who knows?",
                    "score": 66,
                    "replies": [
                        {
                            "author": "cryonuess",
                            "body": "The iPhone has never supported IMAP IDLE. Maybe you got something mixed up?",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Tblue",
                                    "body": "Huh! Seems like it!\n\nWeird, could've sworn I used to get notifications for new emails via IMAP pretty much instantly. Strange.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "cryonuess",
                                            "body": "There are two services that use IMAP and still support Push (yet not via IDLE): iCloud Mail has its own secret sauce that enables Push mail. And Fastmail implements a Push Protocol via Apple's Servers, that triggers the Mail app to Poll via IMAP whenever there's new mail (delay ~2 seconds).\n\nI think Yahoo Mail also supported Push at some point, I think it was implemented similarly.\n\nMaybe you have used one of those services?",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Tblue",
                                                    "body": "Thanks, good to know!\n\nLooks like this indeed _used_ to work, and some magic was involved: https://userforum.mailbox.org/topic/8626-ios-mail-push-benachrichtigung-nicht-mehr-moglich (in German)\n\nLooks like Apple is shutting down the infrastructure that third party providers can use to work around missing IMAP IDLE support.\n\nSigh. Thanks, Apple. Maybe I'll go back to Android when I need a new phone.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "rugbyj",
                            "body": "IMAP on Apple Mail on both macOS/iOS has always been pretty shoddy updating in a timely for me, and that's going back probably a decade at this point.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Whiskeypits",
                    "body": "I've always had this problem where I don't get notifications on my phone from the mail app, i always have to go on the app to look at my emails. I have notifications from the mail app, but never get any notifications.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "DominikB26",
                            "body": "I never have problem before the 18.3.2 update. Im using icloud mail with custom domain.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Fade_to_Blah",
                            "body": "Same.  I sometimes have gotten it to work but it’s rare.  Just sees broken",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "matttopotamus",
                    "body": "Seems to be the most common app to break",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheKyleShow",
            "body": "I was having an issue earlier with Gmail not pushing email to my Mail app for about 2-3 hours. They showed up fine in browser but wouldn’t come through to Mail.",
            "score": 135,
            "replies": [
                {
                    "author": "switch8000",
                    "body": "Gmail stopped pushing to the mail app almost 10 years ago. Even though you select “PUSH” it’s actually just checking every few minutes.\n\nThere was a loophole back in iOS 11, but that’s long gone.",
                    "score": 108,
                    "replies": [
                        {
                            "author": "PerfectlySplendid",
                            "body": "Gmail workspace can still push right? Hard to tell what are iOS bugs right now because the mail app has been awful for me since 18.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "switch8000",
                                    "body": "As far as I’m aware there’s no workaround, the xchange loophole was closed and the only way to get push notifications is to use the actual Gmail app itself. \n\nMail App + Any sort of Gmail only does fetch and there’s always a delay.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "__theoneandonly",
                                            "body": "Push via Exchange wasn’t a loophole… it was a service Google offered.\n\nThey took it away to try to force users to switch to the Gmail app so they could add more advertising.",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "PerfectlySplendid",
                                            "body": "Holy shit. I pay $100 a month for my workspace email from them, and they don’t even give me push notifications. I’m a complete idiot.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "switch8000",
                                                    "body": "Use the official Gmail app, and then you’ll get push. But yeah sucks.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "BananaStandFlamer",
                                    "body": "Gmail does push afaik",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PeppermintHoHo",
                    "body": "I wish Gmail had push email. It's insane how this still hasn't been resolved. Had it on my BlackBerry's for crying out loud. And I really don't like the iOS Gmail app.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "zikronix",
                            "body": "It’s not an Apple problem it was gmails choice",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "Veearrsix",
                                    "body": "It’s google’s way of encouraging users to use their apps.",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "TestFlightBeta",
                                            "body": "Then why do third party apps get push",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "__theoneandonly",
                                                    "body": "Third party apps don’t get push from Gmail…",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "aairricc",
                                                            "body": "Spark and outlook get updates at the same exact time as my gmail app. Apple’s is the only one that’s delayed",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "cryonuess",
                                                                    "body": "These apps take your password*, and transmit it to the server of the app developer. There it is used to access your inbox constantly using e.g. IMAP IDLE. When new mails arrive, the server sends a regular Push notification to the app.\n\nNeedless to say, this is a huge security and privacy concern. My university for example says that they forbid those apps. They detect logins via the Outlook iOS app, and lockdown the university account. You have to unlock it in person, proving your identity via physical id.\n\n*For Gmail: The OAuth token",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "aairricc",
                                                                            "body": "Gotcha. Appreciate the info. Wouldn't that apply to the Apple mail app too though (transmitting your gmail pw to the app)?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "cryonuess",
                                                                                    "body": "No, when using the Apple Mail app, all your passwords stay on your device, and your mailbox is not accessed by any third party, not even Apple.\n\nThis is because the Apple Mail app is a special app integrated into the operating system and can execute Push Notification Services on the device itself in the background. Third party apps don't have that ability (in contrast to Android).",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "aairricc",
                                                                                            "body": "Very interesting. Appreciate you taking the time the explain",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "fartingdoor",
                                                                    "body": "Outlook, from what I understand, is pulling email server side and then pushing to device.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "aairricc",
                                    "body": "Then why does it work on every other email app besides Apple’s? (Outlook, Spark, etc)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CrashyBoye",
                                            "body": "Explained above from another user:\n\n> These apps take your password*, and transmit it to the server of the app developer. There it is used to access your inbox constantly using e.g. IMAP IDLE. When new mails arrive, the server sends a regular Push notification to the app.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "switch8000",
                            "body": "We used to have it until iOS 9 or 10, then Google took it away to encourage people to download their mail app.\n\nIf you remember way back when, everyone preferred the mail app and you had pretty great integration with keeping your stuff out of Google’s hands, they didn’t like it and saw a long term vision.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nano_705",
                    "body": "How did you set up your Gmail notification to push?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Unknown_vectors",
                            "body": "You can’t anymore. That shit has been screwed for a decade.  Only when the app is opened.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "TestFlightBeta",
                                    "body": "I thought it was fetch, not push?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Unknown_vectors",
                                            "body": "It won’t push anything anymore. So only fetch new mail when you open the mail app.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "8qubit",
                                                    "body": "You don't have to open the app for it to fetch periodically",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "my-kal_uk",
            "body": "Ah, not just me then!",
            "score": 44,
            "replies": []
        },
        {
            "author": "cryonuess",
            "body": "It's been broken in 18.4 Beta 2 and Beta 3, and then in 18.3.2 public release.\nToday Apple published 18.4 Beta 4, and the issue is fixed here!",
            "score": 38,
            "replies": [
                {
                    "author": "stillsooperbored",
                    "body": "That's very encouraging. I really hope it's fixed soon.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "YeahSev",
            "body": "I was wondering why it wasn’t working. It’s broken on my iPhone and iPad.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Live_LaughToastrBath",
            "body": "What’s with these buggy updates lately? I don’t remember this happening years ago when there was much more quality control. Part of the mystique of owning an iPhone is that “it just works”. \n\nYou know you’re in trouble when Android is more stable than iOS",
            "score": 22,
            "replies": [
                {
                    "author": "TheDragonSlayingCat",
                    "body": "If you take off your proverbial rose-colored glasses, you will see that buggy updates have been part of iOS and macOS for decades now. macOS 6.0 was so badly broken that they had to patch it twice before it was usable.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Live_LaughToastrBath",
                            "body": "While that’s certainly true, I feel like this affects the average consumer much more now than in the past. Power Users will always find bugs. I feel like this is much more of an issue lately for just the average guy or gal that wants a stable device “that just works”",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheDragonSlayingCat",
                                    "body": "That’s been the case since at least 1976, not just now.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "it_fell_off_a_truck",
            "body": "This has been broken for me since iOS 18…",
            "score": 12,
            "replies": []
        },
        {
            "author": "Gullible-Ad-7186",
            "body": "Apple broke it way before that IOS 18 and they haven’t done jack shit about it.",
            "score": 38,
            "replies": []
        },
        {
            "author": "UltraSPARC",
            "body": "Apple mail has been broken for years. The fact that they got it to break iCloud email is just cherry on the top. I’m trying my hardest not to switch to Outlook app but if they don’t fix their ActiveSync/Exchange connector…",
            "score": 100,
            "replies": [
                {
                    "author": "f3th",
                    "body": "And the search function is still absolutely useless",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "umthondoomkhlulu",
                    "body": "I’ve wanted to use our so much but it’s terrible. I have no concept where attachments go or look like when attaching and trying to make your signature half decent is a nightmare.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "VisibleEvidence",
                            "body": "Signatures *are* a nightmare!",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "joebewaan",
                                    "body": "Any time a client asks me to set up an html signature for them I want to cry. You have to use tables. It’s like building a part of a website but from 1998.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "jasonefmonk",
                                            "body": "That doesn’t sound fun, but be part of the solution; plain-text only emails! Attachments are for special occasions.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "joebewaan",
                                                    "body": "I did recently find a free tool which allows you to create email templates in react and it converts them to ancient HTML suitable for emails which is pretty cool.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TestFlightBeta",
                    "body": "I stopped using outlook when it stopped giving me notifications",
                    "score": 2,
                    "replies": [
                        {
                            "author": "UltraSPARC",
                            "body": "Exactly. Damned if I do. Damned if I don’t.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "johnfromberkeley",
                    "body": "Someone who is forced to use Outlook… Good luck!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "allmightysteven",
                    "body": "Proton Mail, brother…..",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "UniversalBagelO",
            "body": "Why is literally everything broken in ios 18? They fucked up Photos app (even beyond the horrible update, it was a buggy mess), the CALCULATOR app was completely fucked for months, Mail doesn’t work, what am I missing?\n\nWhat in the hell is happening at Apple. Do they have 1 person working on iOS?",
            "score": 8,
            "replies": []
        },
        {
            "author": "SlendyTheMan",
            "body": "No QA team.",
            "score": 17,
            "replies": []
        },
        {
            "author": "lionstigersbearsomar",
            "body": "Can we set up Gmail to push? I have it as fetch.\n\nEdit: ok. I am not doing it wrong. Can’t get push using the Apple Mail app.",
            "score": 14,
            "replies": [
                {
                    "author": "switch8000",
                    "body": "Nope, google disabled it more than a decade ago to encourage users to download their app.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "Eric848448",
                    "body": "With the Gmail app, absolutely.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "exjr_",
                    "body": "You can’t set up Gmail to push on the Mail app.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Fungal-dryad",
                            "body": "Did you add the Gmail address in Apple Mail? I have both an Apple and Gmail account. Both accounts load mail. Haven’t been to my Gmail page in years.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "redstonefreak589",
                                    "body": "Google removed exchange protocol back in 2012 I think which broke push. You can still use Gmail in mail (I’ve never even downloaded the Gmail app) but you can only set it to fetch every 15 minutes at the least",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "phulton",
                                    "body": "Not what they’re talking about. Google doesn’t support the “push” data update method in Apple Mail, only Fetch. One is instantaneous, the other is at set intervals. Google intentionally hamstrings Apple Mail so you use the Gmail app.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "exjr_",
                                    "body": "Yes, I have Gmail addresses added to the mail app. It doesn’t do Push. It only does Fetch (at the schedule I chose), or Manual. \n\nEmails aren’t automatically *pushed* into the Mail app as they come in, hence the name Push.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ECHLN",
            "body": "Okay I’m not crazy",
            "score": 3,
            "replies": []
        },
        {
            "author": "jobbing885",
            "body": "This update is really bad. My reddit app is crashing, having delayed push notifications sometimes. On a different phone, Iphone 13, the background just went black.",
            "score": 4,
            "replies": []
        },
        {
            "author": "chad917",
            "body": "Mail app is a shitshow anyway. Messages don't download to view.... \"is not downloaded from server\", with no apparent way to force it to wake up and work. The whole app and iCloud mail setup in general need completely overhauled",
            "score": 5,
            "replies": []
        },
        {
            "author": "maziar37",
            "body": "Mine is so messed up.",
            "score": 3,
            "replies": []
        },
        {
            "author": "theoreticaljerk",
            "body": "Interestingly, mine was broke like this for a couple days....then magically started working again and has been fine since.  No idea why.",
            "score": 3,
            "replies": []
        },
        {
            "author": "eric9603",
            "body": "I thought I was losing my mind! Never had issues before.",
            "score": 3,
            "replies": []
        },
        {
            "author": "burd-",
            "body": "they need an OS update for this mail app?",
            "score": 2,
            "replies": [
                {
                    "author": "TheDragonSlayingCat",
                    "body": "Mail is a core OS application, so yes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ikilledtupac",
            "body": "Is that what’s happening?!?! Come on Apple. Get your shit together.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dan-in-Va",
            "body": "You’re holding it wrong…",
            "score": 4,
            "replies": []
        },
        {
            "author": "Oh-THAT-dude",
            "body": "Didn’t break it for me. Sent myself a test message, it came right back without any action on my part.",
            "score": 2,
            "replies": [
                {
                    "author": "Far_Out_6and_2",
                    "body": "Same actually",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ecto_88",
            "body": "Plus no sound for new emails either iCloud or others.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jeremydavid2",
            "body": "Use gmail, it is better",
            "score": 2,
            "replies": []
        },
        {
            "author": "stillsooperbored",
            "body": "YES. This is so frustrating. And I know it's iOS 18 because my old iPad is on 17 and it gets notifications just fine. I don't want to change to a different email app or email provider, so I reaaaaaally hope they fix this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NewEnglandPrepper3",
            "body": "Ah so that explains it",
            "score": 1,
            "replies": []
        },
        {
            "author": "benkallday",
            "body": "Shame",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blue_shifter0",
            "body": "Yeah that’s why you set up the code in your settings to forward your hidden email to an encrypted address. lol ",
            "score": 1,
            "replies": []
        },
        {
            "author": "neko_whippet",
            "body": "So that’s why I get my mail so slow now",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prof_PTokyo",
            "body": "Happened here.  Did a power off and waited ten minutes. After the restart all the issues went away.  Maybe I’m just lucky, indon’t know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kurx",
            "body": "iOS 18.3.2 breaks iCloud Mail delivery and we think you’re gonna love it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aromatic_Fail_1722",
            "body": "Happy it wasn't just me! Super annoying, about half my mails wouldn't come through until I restarted the app.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ckangnz",
            "body": "I only see my new mails when i connect my phone to charge at night. I’m freaking trying to sleep now and it isn’t the best time to receive important emails 🤬",
            "score": 1,
            "replies": []
        },
        {
            "author": "darktourist92",
            "body": "At least i’m not going mad!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot-Sock3403",
            "body": "If that what’s going on. But I think it’s happening in 18.4 also.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BigMasterDingDong",
            "body": "Ah I thought something was up with my emails!",
            "score": 1,
            "replies": []
        },
        {
            "author": "bassplayerguy",
            "body": "“iCloud Mail helps you achieve inbox zero!”",
            "score": 1,
            "replies": []
        },
        {
            "author": "boxersunset121423",
            "body": "Apple mail has never been great honestly. I gave up on it and use Gmail now. Works perfectly with the website obviously.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jackarino",
            "body": "Having the same issue!",
            "score": 1,
            "replies": []
        },
        {
            "author": "UXyes",
            "body": "Jeeeesus Christ Apple software blows. What happened?",
            "score": 1,
            "replies": [
                {
                    "author": "TheDragonSlayingCat",
                    "body": "Ninety-nine reports of bugs on the wall. Ninety-nine reports of bugs. Take one down, fix it around, 125 reports of bugs on the wall (because the fix broke multiple things that depended on the buggy behavior).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pc3600",
            "body": "Perfect time for me to try out using the apple mail app for the first time lol dammit",
            "score": 0,
            "replies": []
        },
        {
            "author": "Far_Out_6and_2",
            "body": "No worries who cares",
            "score": 0,
            "replies": []
        },
        {
            "author": "VapidRapidRabbit",
            "body": "I wouldn’t know, I only manually fetch emails.",
            "score": -7,
            "replies": [
                {
                    "author": "Dave3087",
                    "body": "Sounds awful",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Remarkable-Tale428",
                    "body": "Same",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheBaneEffect",
            "body": "But…it didn’t though.",
            "score": -14,
            "replies": [
                {
                    "author": "iwannabethecyberguy",
                    "body": "It did. I’m having the same problem as noted in the article and related Reddit post. ",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "MinFuelFullSend",
                    "body": "It 100% did",
                    "score": 10,
                    "replies": [
                        {
                            "author": "WalknOnWater",
                            "body": "Yes my mail doesn’t work at all. Have to use Gmail app now",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mediocre_sophist",
                    "body": "Counterpoint: yes it did. \n\nProof: my iCloud email stopped pushing after upgrading to iOS 18.3.2.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "stillsooperbored",
                            "body": "🙋‍♂️same here.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IWHBYD_skull",
            "body": "I’ve switched to spark mail. The free version has enough features for me on top of what I think is a better design. If Spark mail ever starts showing/pushing ads or promotions I’ll switch.",
            "score": 0,
            "replies": [
                {
                    "author": "cryonuess",
                    "body": "They constantly access your email from their server. Security/privacy nightmare!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "IWHBYD_skull",
                            "body": "Where have you read that?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "cryonuess",
                                    "body": "They openly state that e.g. on their website. To be fair, it's the only way to enable push notifications on third party mail apps. Still a nightmare however.\nAlso check out my answer the the other reply in this thread.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DontBanMeBro988",
                            "body": "> They constantly access your email from their server.\n\nIsn't that generally how email works?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cryonuess",
                                    "body": "No. Usually, you have an email provider that stores your emails for you, and have a password to access your emails from the server.\n\nWhen using an email programm, you sign in, the email program stores the password on your device, and checks for new email in the background (either poll or push).\n\nThird party apps on iOS can't run in the background however. That's why these apps send your password (!) to the server of the app manufacturer that then logs into your email account and checks for new email constantly. Upon receiving a new mail, it then sends a push notification to the installed app.\n\nTherefore, the app manufacturer has your password and can access your email account from their servers. You completely give up any control.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}