{
    "title": "Apple restricts Pebble from being awesome with iPhones",
    "author": "dingoonline",
    "subreddit": "apple",
    "rank": 2,
    "score": 419,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 331,
    "url": "https://ericmigi.com/blog/apple-restricts-pebble-from-being-awesome-with-iphones",
    "id": "1jea1k6",
    "selftext": "",
    "comments": [
        {
            "author": "jaimepapier",
            "body": "I thought I’d travelled back in time ten years for a second then. Very cool that they’re bringing Pebble back, I loved that watch.",
            "score": 350,
            "replies": [
                {
                    "author": "Ravada",
                    "body": "I didn't know it was still a thing, I completely forgot about my old Pebble watch!",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Entire_Routine_3621",
                            "body": "Because Apple Watch came out and obliterated it.\n\nEdit. Cope is real",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "Knut79",
                                    "body": "No. Because Google killed it.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "After_Dark",
                                            "body": "To be fair, it was Fitbit that killed Pebble before Google bought Fitbit. Just goes to show that was a perfect match though",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Knut79",
                                                    "body": "Yes. Fit it bought a competitor and killed it without a real replacement.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Entire_Routine_3621",
                                                            "body": "Pebble had no choice but to sell? Sounds like poor planning.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Knut79",
                                                                    "body": "They did, but the implied deal was that fit it was going to use the Pebble technology and keep the Pebble product as part of their portfolio, instead of burying, both the name# products, technology and patents and leaving the people who wanted the Pebble product with nothing. And they didn't buy fit it's either, as that wasn't the product they wanted.\n\nAnd in the end fit it had to sell off to Google as they never evolved and had nothing against garmin, polar and all the cheap Chinese smart watches that beat them on features, quality and battery time.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Entire_Routine_3621",
                                            "body": "Hahaha. Misremembering are we? Pebble dug a hole and then rug pulled a ton of people including myself.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Buy-theticket",
                                    "body": "Or because Fitbit bought pebble in 2016 and discontinued production.. \n\nAnd Pebbles never worked correctly with iPhones either way (because Apple cares about their customers so much).",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "anyavailablebane",
                                            "body": "Hate to tell you this but no trillion dollar company cares about you regardless of how much compatibility there have with other products. They are all just making business decisions.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Entire_Routine_3621",
                                                    "body": "And pebble demonstrably made terrible business decisions. Arguably a huge reason they lost. 0 foresight.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "unfortunatebastard",
                                    "body": "They’re different products with some overlap. Think of iPad va MacBook",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ToSeeAgainAgainAgain",
                    "body": "[On pre-order now!](https://ericmigi.com/blog/introducing-two-new-pebbleos-watches)",
                    "score": 24,
                    "replies": [
                        {
                            "author": "torgo3000",
                            "body": "Lol. Did they really call it a Core 2 Duo?  Intel is gonna love that.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "PeakBrave8235",
                                    "body": "https://www.reddit.com/r/pebble/comments/1jea5cc/comment/migvkif/\n\nIf this is how he approaches *naming* the product, the rest of his decisions that led to the failure of his company make a ton more sense.\n\nHoly f\n\nRelevant context:\n\nhttps://qz.com/857412/pebble-went-from-kickstarter-to-being-worth-740-million-to-being-bought-by-fitbit-fit-for-40-million",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "torgo3000",
                                            "body": "lol that’s kinda funny. Yea not a great name imo. Anything would be better than something taken from intel of all people. Nice to see some more competition though, but he’s pretty up front of what it is and what it isn’t. It’s a pretty basic smartwatch. It’s a very niche product imo, I can’t see them selling tons of these but 30 day battery life is probably the best selling point otherwise why wouldn’t you just buy a Fitbit or something similar. It will be interesting to see how well this does. I loved these back in the day, I always wanted one.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "PeakBrave8235",
                                                    "body": "I had one. Let me tell you, long battery life doesn’t mean anything compared to a health lab on your wrist. \n\nIt’s obviously a stupid name, but I was actually trying to point out something else.\n\nThe utter flippancy of him naming the product Core 2 Duo really demonstrates the lack of care in the product (which showed when I had one). It’s really just a stupid name that he didn’t think through, much like relaunching the product itself.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ThatITguy2015",
                                            "body": "WOW. That is not the answer I was expecting from the supposed founder. Did he snort coke off someone’s breasts before the AMA?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "PeakBrave8235",
                                                    "body": "LOLLLLLL\n\nNo wait, it gets better.\n\n#It has a 30 day warranty",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "ThatITguy2015",
                                                            "body": "Huh. No fucking way this dude isn’t on coke to the level of the Delorean CEO. These are 100% decisions you’d make while on a bender.",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "AncefAbuser",
                                                            "body": "LMAO\n\nLaughs in EU. \n\nNo wonder this guy captain'd this company to irrelevancy the first time around. \n\nPeak wall street coke fiend behavior",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TheVitt",
                                                            "body": ">30 day warranty\n\nI owned the original\n\nCompletely crapped out on me a few months in\n\nI get it",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TMWNN",
                                    "body": "HN commenter says Intel only copyrighted \"Core\", so Core 2 Duo is OK.\n\nCC: /u/PeakBrave8235",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "torgo3000",
                                            "body": "Actually looks like it’s “Intel Core” based on this site https://www.intel.com/content/www/us/en/legal/trademarks.html",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "TMWNN",
                                                    "body": "Thanks for the clarification. Evidence that \"Pebble Core 2 Duo\" seems to be OK.\n\n(Not a surprise. Businesspeople usually do their homework before announcing things, folks!)",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "torgo3000",
                                                            "body": "Yea it’s probably fine looking at that site but personally I wouldn’t chance it and use something else. Intel isn’t a dog I would want to fight.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "PeakBrave8235",
                                                            "body": "Uh.. he notably did *not* “do his homework” as pointed out by him replying a solitary shrug emoji in response to: “Can you use the Core 2 Duo name?”\n\nhttps://www.reddit.com/r/pebble/comments/1jea5cc/comment/migvkif\n\nFurther, his company isn’t named Pebble, from what I can tell. The dude is legitimately so awful at communication and naming I have zero clue what is happening lol. \n\nHowever, it seems his company’s name is called “Core Devices,” hence the name Core (from Core Devices) 2 Duo",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PeakBrave8235",
                            "body": "LMFAO, I’m sorry for replying twice, but I just realized this:\n\n> Yes, we warrant against manufacturing defects for 30 days after you receive your order\n\n#A THIRTY DAY WARRANTY ?!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "cptjpk",
                                    "body": "Not even enough time to get a full charge.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PeakBrave8235",
                            "body": "Nothing against you but:\n\nJoin now! Viva la resistance à Apple!\n\nDude is literally making the exact same mistakes he made back then, and now it’s even less relatable considering he’s a multi-millionaire with billionaire friends and connections, “fighting” against trillion dollar company \n\nMeanwhile most people can’t even afford food.\n\nI don’t care. ",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Knut79",
                                    "body": "What mistake is he making?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "He never adapted to what the market wanted, so his product died.\n\nHe banked of how cute it was. And it was a cute product. But it was also a poorly made one.\n\nThe product was borne of social media, and it shows: it’s superficial. It had no vision. It was a smartwatch and never evolved past that.\n\nHe banks on nostalgia. Nostalgia is the opposite of what you want in products— for concept, execution, marketing, etc — because it is looking to the past. Technology products sell ultimately because they look to the future.\n\nHe never admitted his mistakes that he made with the original Pebble and now he’s back with the same thing saying the same stuff. ",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Knut79",
                                                    "body": "Eh. His product was literally bought by a competitor and then killed to not take their sales and they never replaced it with their own paper long battery watch. \n\nCuteness wasn't a sales fsvtor. It was focused on getting information and notifications on your watch.\n\nSocial media wasn't a thing for the first watch. The new one is reborn because people still want a simple smartwatch that just does smartwatch things at an acceptable price and with a long battery time.\n\nNone of your arguments supports your claim that he's remaking the same mistakes. You merely sound like some kind of apple or samsung Stan.\n\nPebble isn't really for me, but I recognize why it exist and that it has a market that isn't filled by others.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "whoiam06",
                                                            "body": "Yep I have a friend who loved her original Pebble to death. Like the back end of it literally came out and it wasn't repairable. She just stopped wearing watches for a long time. I sent her the news that they're being resurrected and she already said, if he makes it through the first round and releases a second gen, she'll be there to purchase one. \n\nThe huge reason she loved hers was the pricing and long battery life and one app in particular worked extremely well for her needs and it wasn't replicated elsewhere as good.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "PeakBrave8235",
                                                                    "body": "I respect your friend’s wishes and wants. Be a good friend to her —  I am serious here — and tell her that it only has a 30 day warranty ",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "PeakBrave8235",
                                                            "body": "You’re mischaracterizing it. \n\nYes, Fitbit bought them out. Except they bought them out *after* their market share had eroded. Fitbit was far more popular than Pebble. \n\nWhy? Because Pebble never adapted to what the market wanted: a health lab on your wrist.\n\n>Cuteness wasn't a sales factor\n\nIt definitely was lol. It’s a talking point of the product\n\n>It was focused on getting information and notifications on your watch.\n\nOther than telling the time, yeah. And it never evolved past that, so it sold less and less and less until they were bought out for pennies on the dollar ($740 million valuation -> $23 million buy out, source: Quartz)\n\n>Social media wasn't a thing for the first watch\n\nUh…. I think you misunderstood me. The product was *borne of* social media. The whole thing was a Kick-starter campaign in 2012. It spread virally on social media.\n\nI’ve already said in other comments on here I’m a fan. Doesn’t mean my arguments are invalid. Actions and results speak louder than words from either of us: his company faded and got bought out \n\n>The new one is reborn because people still want a simple smartwatch that just does smartwatch things at an acceptable price and with a long battery time.\n\nActually, considering the product is a rehash of the same thing that led to the company’s demise, coupled with same bad product choices, and his tired tirades about Apple, I’m going to say it’s more about him trying to do it  again because he’s bitter.\n\nTo further support my point, he literally admits he’s doing it because *he* wants it.\n\nIf he came back and had an amazing product that offered a bunch of health stuff and worked better than AW, and was Android exclusive, I’d support that. Not financially, but I wouldn’t be debating this\n\nAnd considering he named the product Core 2 Duo… lmfao. He doesn’t even care about making a good product. \n\nHe literally only offers a 30 day warranty. ",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "TheBros35",
                                                                    "body": "Eric has a really interesting blog post that goes into why he failed - he tries to grow and grow, but only made a product for a niche market and “insert pikachu face” was shocked when it didn’t sell to a larger market. He lost his ass on over hiring and over ordering and decided to take his bag and run. \n\nI hope he leaves it like it is - I’m very much in the niche for this market and will happily buy one ever ~3 years. The company doesn’t need to needlessly grow, it already fits the expected fanbase very well. \n\nI feel like it’s the same market as TTRPGs or wargaming - serve the fanbase and they will keep buying your shit until (you or they) die. Grow it too much and you’ll probably run out of market.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PeakBrave8235",
                                                                            "body": "Fair response! I appreciated reading this. I’d say his failure to adapt to the market was the key factor as you mentioned. I mean he says he’s still going to make said niche product, because “he wants it” and then lists features that most smartwatches don’t do because they’ve adapted to the market’s demands",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Knut79",
                                                                    "body": "Why would he compete with garmin, polar, Huawei, xiaomi, and a bunch of others offering sports and health watches with 7-12 days of \"use\" when he can make a watch for the niche that will actually buy it and doesn't have competition and that's half the price of the cheapest of those for the best model and with 4x the battery time? This is all the Pebble users want.\n\nAlso, he's selling it in Europe, 30 day warranties doesn't exist here. He's looking at a minimum 2 years most places, realistically 5 years many places.\n\nAlso do you always down vote anyone wjo doesn't agree with you? That's not really the use of down votes",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PeakBrave8235",
                                                                            "body": "JFC it’s like you people refuse to read anything I write.\n\nThe. MARKET. Did. Not. Want. His. Product.\n\nThat’s why he went from a potential billionaire to multi-millionaire. He refused to adapt and sold it for pennies on the dollar.\n\nYou asked what mistakes he made. I said them. You just straight up aren’t even reading what I write and aren’t even recalling earlier parts of our discussion, including why you even responded to me in the first place \n\nI’m out.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Knut79",
                                                                                    "body": "His niche market wanted the product.\n\nHe never needed to sell more they where doing fine with the niche they operated in.\n\nYpure for some reason angry with Pebble because Pebble didn't want to be the same as everyone else, when they had a niche they worked and sold fine in.\n\nHis major blunder was that he assumed fit it was going to keep the Pebble niche alive when they bought it and not bury the product, tech and patents.\n\nBut keep yelling because you're irrelevant arguments aren't working even if you repeat them and don't read or understand other people as you abuse the down votes because you're irrationally angry about a company actually staying in their niche rather than dying by trying to be something else.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "PeakBrave8235",
                                                                                            "body": "> His niche market wanted the product.\n\nI literally never claimed no one wanted it. In fact, on this very post I literally commented I owned one.\n\nNotably, the user base does not equate to the market. The smart watch market, dude. Not the “Pebble market” which does not exist both literally and figuratively. There is not “iPhone market.” There is a smartphone market. There is no “iPad market.” There is a tablet market.\n\n> Ypure for some reason angry with Pebble\n\nI’m angry that the CEO and Founder literally is unable to move on from his failures, and because of how addicted politicians are to social media and ignoring actual, real world problems, I can see where this could go. And I don’t support his BS\n\nStop trying to change my products, because you don’t agree with them. Notably, **HE DOES NOT EVEN USE AN IPHONE** Literally make it Android exclusive and shut up already. No, now he needs to insert himself between me and my phone’s experience.\n\n> when they had a niche they worked and sold fine in.\n\nYou aren’t reading. This is my last reply to you. You are deliberately ignoring EVERYTHING I say. \n\nThey did NOT sell fine. That is why they went from $740 million valuation to a $23 million buy out. Had Fitbit never bought them, they would have literally gone extinct and bankrupt.\n\n> His major blunder was that he assumed fit it was going to keep the Pebble niche alive when they bought it and not bury the product, tech and patents.\n\nThen he’s a straight up idiot, but I suspect it’s rather you who has misinterpreted him. From the Quartz article I linked:\n\n> Today, Migicovsky is selling Pebble’s software and intellectual property to competitor Fitbit for less than $40 million, in a deal that’s mainly about hiring the company’s engineers, according to Bloomberg\n\nHe knew it was about a pure IP play.\n\n> But keep yelling because you're irrelevant arguments\n\nYou aren’t reading what I write, so there’s no point. This is my last reply to you. Good luck to you.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Knut79",
                                                                                                    "body": "You keep regurgitating the same bs and not actually reading what you're replying to...\n\nJust because you're angry the CEO didn't make a garmin copy that didn't sell because garmin and polar exist and if you wanted cheaper. Huawei and xiami and others do.\n\nAnd you keep abusing the down votes.\n\nWhen you're arguing with a rock who only plays on repeat. It's probably a troll... And I don't do trolls.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ToSeeAgainAgainAgain",
                                    "body": "Ad hominem, my favorite internet flavor.  \n  \nWhat a way to mix Spanish and French there lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "I can’t be accused of only speaking English, that’s for sure.\n\nAlso stop defending multi-millionaires.\n\nHe doesn’t care about you and literally this could fail and still he’d be a multi-millionaire with billionaire friends ",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "luv2hotdog",
                                                    "body": "Right… you realise people are gonna buy this watch *not* because they think the founder personally cares about them, right? Like. Knowing full well that the founder doesn’t personally care about them, they’re gonna go ahead and buy it anyway. Why would you assume “he doesn’t care about you” is breaking news to anyone lol",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PeakBrave8235",
                                                            "body": "Yeah, I’m well aware that people will eventually realize he doesn’t give a shit about his customers:\n\n> Yes, we warrant against manufacturing defects for 30 days after you receive your order",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "luv2hotdog",
                                                                    "body": "Yes. and they’ll buy it anyway. they’re not buying it because they think he cares about them.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PeakBrave8235",
                                                                            "body": "Uh… sure, I’m sure the sense of camaraderie and “community” as well as “insta-buying” it (Source: John Gruber) I’ve seen umpteen times, as well as the people on this literal thread constantly attacking me saying that I’m wrong for criticizing him because he’s “indie” is all because they care about the product, not him, and vice versa. \n\nThis situation is pure emotion, zero logic. And there’s a place for that, but let’s stop pretending he gives a shit\n\n\n30 days warranties by a multi-millionaire with billionaire friends and connections. Enough said already. I’m out ",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "jwegener",
                                    "body": "Why do you assume he’s a multi millionaire?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "Why do I assume *the CEO* of an extremely small company that was bought out for $23 million, by a larger company that itself was bought out for $2.1 billion by a $1.97 trillion company… is a multi-millionaire with billionaire friends and connections?",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BulletTrain2Iowa",
            "body": "Apple restricts [insert any third party product here] from being awesome with iPhones.",
            "score": 286,
            "replies": [
                {
                    "author": "derpycheetah",
                    "body": "\"If manufacturers can't follow our cryptic and hidden documentation as well as pay us licensing fees, a subscription fee, and provide us with exclusives, we can't be held responsible for the crappiness of their products; that is entirely on the manufacturer!\"",
                    "score": 56,
                    "replies": [
                        {
                            "author": "Pepparkakan",
                            "body": "There's literally no API for sending text messages that's accessible to Pebble.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "pirate-game-dev",
                                    "body": "Oh noes I guess you have to buy an Apple Watch.\n\n\\- Tim",
                                    "score": 26,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pirate-game-dev",
                            "body": "Just to illustrate how far Apple will go to optimize iOS rules to their own advantage:\n\n> In one model, for example, Apple worked to determine how the “less seamless experience” of using a non-IAP method would lead customers to abandon their transactions. By modeling where this tipping point was, Apple was able to determine when the links would stop being an advantage to developers, which would push them back to using IAP.\n\n> Apple also found that more restrictive rules around the placement and formatting of the links themselves could reduce the number of apps that decided to implement these outside links. The company looked into the financial impact of excluding some other partners — like those in its video and news programs — from the new program.\n\n> The company weighed different options for when to charge commissions, too. At one time, it thought to charge its 27% fee on external purchases that took place within 72 hours of when the link was clicked. When the new guidelines went live, however, that time frame had been stretched to seven days.\n\n> Lawyers suggested Cook himself was involved with how the warning to App Store customers would appear, recommending an update to the text that appears when the external links were clicked. In one version, that link warned customers they were “no longer transacting with Apple.” Later, the link was updated to subtly suggest there could be privacy or security risks with purchases made on the web.\n\nhttps://techcrunch.com/2025/02/24/apple-exec-phil-schiller-testifies-that-he-raised-concerns-over-app-store-commissions-on-web-based-sales/",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fnezio",
                    "body": "They would not be competitive without this behavior. The software is often subpar. ",
                    "score": 5,
                    "replies": [
                        {
                            "author": "crashck",
                            "body": "Apple would not be competitive or the third party?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Buy-theticket",
                                    "body": "Third parties already make competitive products, you just can't use them on Apple devices.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "cuentanueva",
                                            "body": "> Third parties already make competitive products, you just can't use them on Apple devices.\n\nSo you can't compete on the Apple Watch market.\n\nOr, the way to compete, is to not only win over the Apple Watch, but also convince the user to dump Apple and switch to Android.\n\nSo fair. That's what fair competition is all about...",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Jusby_Cause",
                    "body": "Apple restricts devices that can’t run macOS from running macOS.",
                    "score": -37,
                    "replies": [
                        {
                            "author": "cuentanueva",
                            "body": "It's not about running macOS/watchOS.\n\nIt's about doing things _with their OS_ that the Apple Watch can do.\n\nIt's absolutely anticompetitive. They restrict _basic_ features on competitors.",
                            "score": 65,
                            "replies": [
                                {
                                    "author": "EDudecomic",
                                    "body": "Eh, if Im making Apple Watch, why tf would I want other brands to be able to do what my product can do? \n\nThis argument is such nonsense and only come from people who clearly have never try to make any product.",
                                    "score": -34,
                                    "replies": [
                                        {
                                            "author": "cuentanueva",
                                            "body": "> Eh, if Im making Apple Watch, why tf would I want other brands to be able to do what my product can do?\n\nYou wouldn't want to. Of course.\n\nBut that's the point, when you have a large portion of the market of the phones that are _essential_ for the watches to work, then it becomes anticompetitive.\n\nFunny how that works, right?\n\n> This argument is such nonsense and only come from people who clearly have never try to make any product.\n\nIt's funny, because it's literally the opposite.\n\nIt seems you have never tried to make any product, or you wouldn't say this, because right now, you simply CAN'T make a competitor to the Apple Watch that's feature comparable.\n\nThe only alternative is an Android only smart watch. Or, obviously, launching a Phone, and beating the trillion dollar company in the market, and THEN launch your watch.\n\nSo easy!",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "ColonelBatshit",
                                                    "body": "It does feel like punishing Apple for being the type of company everyone wants.",
                                                    "score": -10,
                                                    "replies": [
                                                        {
                                                            "author": "cuentanueva",
                                                            "body": "It's easy, don't become a monopoly and then you can do whatever you want.\n\nOr only have your products on countries that are friendly to monopolies.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "ColonelBatshit",
                                                                    "body": "Not easy when Apple is somehow blamed for every phone manufacturer on earth becoming a google product. \n\nWe went from having Apple, Blackberry, Google, Microsoft, Nokia, Palm, LG and some others to just Apple and Google. \n\nWhich sounds more like an actual monopoly? The company that was always doing its own thing or the company that is exactly one operating system away from owning EVERYTHING. \n\nI hate that we’ve gone from an era where people were happy having Microsoft’s tile-based OS exist alongside everything else, to cheering as the last non-Google OS slowly turns into android.",
                                                                    "score": -5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Buy-theticket",
                                                                            "body": "The one behaving in consumer hostile ways is the monopoly. In this case that is unquestionably Apple. \n\nAlso both companies are one OS away from owning everything big brain..",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ColonelBatshit",
                                                                                    "body": ">consumer hostile ways\n\nThe only reason it’s seen as “consumer hostile” is because google owns everything else.\n\n>Also both companies are one OS away from owning everything\n\nWhat part of “google owns everything else” are you not getting? Apple did not create the scenario where the only options available are Apple or Google. \n\nPeople fight Apple over its walled garden and you’re seriously going to say “well BOTH companies.” No, Apple is literally the last company standing that is trying to be its own thing. It’s absolutely fine to hate Apple and its approach, but let’s not pretend that Apple is the reason you only have 1 other option.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "cuentanueva",
                                                                            "body": "> Which sounds more like an actual monopoly? The company that was always doing its own thing or the company that is exactly one operating system away from owning EVERYTHING.\n> \n> \n\nDoesn't matter what it sounds like. And monopolies (or duopolies in this case) are dependent on market.\n\nOn the PHONE market, it's Apple the biggest one. On the OS market it's iOS and Android.\n\nBut let's stick with iOS vs Android as that was your point. In the US iOS has 52% and Android 48%.\n\nMore clear impossible. \n\nSo you lose access to 52% of the smart watch market because Apple restricts basic functionality to only their devices.\n\nIt's clear as day, that's abuse of their dominant position.\n\nAnd if Google did the same with Android (somehow), even if they have less market share, it would be the same exact issue.\n\nApple could not compete on the smartwatch market, in which case they can lock it all they want, or compete on equal grounds meaning giving API access to third parties to features they have access to.\n\nCompeting, but limiting access is the problem.\n\n> to cheering as the last non-Google OS slowly turns into android.\n\nThis is ironic given what we are arguing.\n\nYou are literally complaining that there's only 2 players, and yet you are OK restricting the smartphone watch market to ONE player for 52% of the market?\n\nEither you are ok with the Google monopoly. Or you are against what Apple is doing here.\n\nOr you are a hypocrite just because you like one company over the other.\n\nI want competition. I don't care if it's Apple or Google dominating, I want neither abusing their dominant position. I want _more_ alternatives. I want opportunities for other companies.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "vbob99",
                                                    "body": "> It seems you have never tried to make any product, or you wouldn't say this, because right now, you simply CAN'T make a competitor to the Apple Watch that's feature comparable.\n\nYou can, but first you have to risk trillions of dollars building a platform.",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "TeddyAlderson",
                                                            "body": "that’s literally what the last paragraph of that comment jokes about",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "rotates-potatoes",
                                    "body": "It’s a closed ecosystem. Of course it’s anticompetitive, just like restaurants not allowing outside food is anticompetitive, or airlines not allowing passengers to fly the plane is anticompetitive.\n\nBut it or don’t, but it’s silly to act like the core value prop of the ecosystem is some shocking new development. And it’s sillier to argue that only open ecosystems, where every sort of works but not that great, are legal.",
                                    "score": -12,
                                    "replies": [
                                        {
                                            "author": "Exact_Recording4039",
                                            "body": "wtf are you talking about? People are not talking about not allowing people to wander Apple headquarters what do planes cockpits have to do with this?",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "cuentanueva",
                                            "body": "> It’s a closed ecosystem.\n\nIt's not. It's an accessory to a device.\n\n> Of course it’s anticompetitive\n\nGlad at least you see that.\n\n> just like restaurants not allowing outside food is anticompetitive,\n\nNo.\n\nIt would be closer to eating on a chain restaurant (that's almost everywhere) and after eating there once, you are forced to eat there forever.\n\nOr you can move cities.\n\n> or airlines not allowing passengers to fly the plane is anticompetitive.\n\nAgain, no. \n\nIt would be like flying on an Airline once and then not being able to fly on another on a connection.\n\n> But it or don’t, but it’s silly to act like the core value prop of the ecosystem is some shocking new development. \n\nThe value of the ecosystem is that is integrated properly, works seamlessly, you don't need any other accounts, all your data is there, it follows the same industrial design, etc.\n\nIt doesn't mean BASIC features are exclusive to it. \n\nI mean, talk about having confidence in your product if you have to close out tiny start ups...\n\nAnd no, no one is arguing is new. That doesn't mean it's right.\n\n> And it’s sillier to argue that only open ecosystems, where every sort of works but not that great, are legal.\n\nOpen doesn't mean worse than closed. And closed doesn't mean better than open. That's a massive misunderstanding. \n\nIn any case, it's not about open or closed in terms of being legal.\n\nIs about unfair advantage when you have a dominant position.\n\nIf Apple had 10% of the market, it would be irrelevant if they are open or not. \n\nAnd btw, it's obviously not legal in a huge part of the world. There's a reason why almost every major country is having antitrust investigations against Apple.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "flogman12",
                            "body": "Not the same. At all.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "Small_Editor_3693",
                                    "body": "It is though. Pebble should be able to run watchOS",
                                    "score": -33,
                                    "replies": [
                                        {
                                            "author": "Tmtrademarked",
                                            "body": "No. Apple should make an api that allows 3rd party watches to work with the phone but allowing them to load macOS on their hardware is a hard pass. Half the reason apples stuff runs as well as it does it because of the limited hardware they have to optimize for.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "Small_Editor_3693",
                                                    "body": "IMO that’s WAY worse than just letting manufacturers use the OS",
                                                    "score": -22,
                                                    "replies": [
                                                        {
                                                            "author": "Tmtrademarked",
                                                            "body": "Good thing you don’t get to make these calls",
                                                            "score": 14,
                                                            "replies": [
                                                                {
                                                                    "author": "Small_Editor_3693",
                                                                    "body": "Good thing you don’t either",
                                                                    "score": -10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Tmtrademarked",
                                                                            "body": "I mean I’m much more in line with how Apple has always done things so there is that. Your way makes things way less optimized and secure",
                                                                            "score": 8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Small_Editor_3693",
                                                                                    "body": "My opinion is no more valid than yours. Opening up an API is less optimized and secure than just using what already exists",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Tmtrademarked",
                                                                                            "body": "Tell me you don’t understand how this stuff works without telling me. Not only are you incorrect in that statement you’re also not taking into account that pebble doesn’t want to be an Apple Watch they want to be pebble. They are different devices with different goals in mind. Putting watch os on their hardware 100% defeats the purpose of pebble and stifles creativity from them.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Small_Editor_3693",
                                                                                                    "body": "Cool then they shouldn’t have access to touch an Apple device. Pretty simple",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Tmtrademarked",
                                                                                                            "body": "So what is your plan for this being better than using an api? How is loading watch os on 3rd party hardware a better solution?",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "munukutla",
                                                                                            "body": "If exposing an API makes your design less optimised and less secure, then you’re building the wrong kinds of APIs.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Small_Editor_3693",
                                                                                                    "body": "That’s the definition of an API. Exposing features for use. It’s insecure by design",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "munukutla",
                                                                                                            "body": "How does Apple Watch get access to the iPhone then? Wizardry?\n\nOh you’re saying within Apple ecosystem, they can do whatever the fuck they want and expose any “internal” APIs, but they shouldn’t do it for Pebble, because “third party bad”.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Small_Editor_3693",
                                                                                                                    "body": "Yes",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "SoCalChrisW",
                                                            "body": "Fully implementing the api is way, way less work and far more reliable (and reasonable of a request) than allowing third party devices to run the watch OS. Especially considering they almost certainly already have this api fully functional for their own watches to use.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ender89",
                            "body": "Not true, at least it wasn't true before their arm kernel, things may have changed. After apple switched from powerpc to Intel processors, you could run macos on the same hardware as windows.\n\nYou just needed to remove the roadblocks apple put in place to prevent you from running it on other hardware. We're talking graphics cards that are identical to windows graphics cards, save for a chip that is responsible for telling Mac OS that it is an apple product.",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "platypapa",
                            "body": "You're being downvoted because this doesn't have anything to do with the topic but you're actually correct. Apple restricts which computers can run MacOS, leaving out machines that would be perfectly capable of running or updating it. This is very clear when software like Opencore from third-parties can easily patch you up so you can run it. Apple is just being greedy and trying to push more sales of new Macs.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "cuentanueva",
                                    "body": "> Apple restricts which computers can run MacOS, leaving out machines that would be perfectly capable of running or updating it. \n\nIt's irrelevant to this.\n\nIt would be like Apple restricting your Macbook to use the Apple Mouse and only that.\n\nThe OS on the device either the iPhone or the Watch is irrelevant.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "platypapa",
                                            "body": "It's pretty off topic yeah. Just another bit of Apple's anti competitive behaviour.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Jusby_Cause",
                                    "body": "Yes, and few people will be surprised to learn that Apple is in business to sell more Apple products. :) I’m sure this company is in business (for the moment) to sell more Pebble products.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "platypapa",
                                            "body": "It's still really shitty and anti competitive behaviour though on all counts.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rotates-potatoes",
                    "body": "You mean like cars, bike computers, camera lenses, alarm clocks, SSDs, blood glucose monitors, and home lighting? None of those can be awesome with iPhones?",
                    "score": -7,
                    "replies": [
                        {
                            "author": "Buy-theticket",
                            "body": "They are all worse than they could be on Apple devices because of the walled garden Apple has in place yes. You're starting to get the gist..",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "PrintShinji",
                            "body": ">blood glucose monitors\n\nFor the absolute longest time it was absolutely bad with iPhones/apple ecosystem. Its only been very recently that you can see your bgl on your apple watch, and even doing that is very scuffed.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "cuentanueva",
                            "body": "Apple doesn't compete on those markets. That's what you are clearly missing.\n\nIf Apple decided to release a blood glucose monitor, and then ONLY theirs would work with Apple, and the others would be dropped. Would you still think it's so awesome?\n\nThat's what we are discussing there.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tangoshukudai",
                    "body": "not true.",
                    "score": -18,
                    "replies": [
                        {
                            "author": "Exact_Recording4039",
                            "body": "Yes true ",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "experfailist",
                            "body": "Very true.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SoCalChrisW",
            "body": "They definitely gimp the functionality of my Garmin watch vs what's available when pairing it with an Android. Simple things like specifying which notifications are sent to the watch vs what isn't. \n\nAnd no, getting an Apple Watch instead isn't the answer. The Garmin is in a completely different league in a lot of respects and does things an Apple Watch will never be able to do.",
            "score": 146,
            "replies": [
                {
                    "author": "dingoonline",
                    "body": "> And no, getting an Apple Watch instead isn't the answer.\n\nIt's funny how many of the implicit cross-platform compatibility arguments boil down to Tim Cook's \"buy your mom an iPhone\" answer.",
                    "score": 87,
                    "replies": [
                        {
                            "author": "crazysoup23",
                            "body": "I can't wait for leadership at Apple to retire. Tim Cook isn't a product guy.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TheVitt",
                                    "body": "Hey, at least he did not come up with some sort of a \"butterfly\" keyboard.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "deliciouscorn",
                                    "body": "You can’t get any more Product Guy than Steve Jobs, and I bet he would’ve done exactly the same.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cuentanueva",
                            "body": "People get brainwashed by the marketing.\n\nIt's amazing what Apple has done.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Storm-Chaser",
                    "body": "The main reason I stay with Garmin is the battery life. I only have to charge my Fenix once every two weeks.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "SoCalChrisW",
                            "body": "I've got the Instinct Solar 2X, it's 40-50 days for me with all of the smart watch functionality turned on, and it can go to infinite if I turn off the smart watch features. GPS will kill the battery much quicker, but you don't use that all the time.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cuentanueva",
                    "body": "Get ready for the \"then get an Android\" replies.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "mikew_reddit",
                            "body": "From the Pebble developer's blog post: https://ericmigi.com/blog/apple-restricts-pebble-from-being-awesome-with-iphones\n\n> I don’t want to see any tweets or blog posts or complaints or whatever later on about this. I’m publishing this now so you can make an informed decision about whether to buy a new watch or not. If you’re worried about this, the easiest solution is to **buy an Android phone.**",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "cuentanueva",
                                    "body": "Because that's the only _current_ and fastest solution _if_ you want to use a Pebble.\n\nBut what OP and I want is change, so that we have options.\n\nIf you read a little bit further you'll find this:\n\n> Are you an iPhone user who wants to use our watches? Start by posting a comment below this post. Hopefully there will be a lot - let’s show them that people actually want this to improve.\n\n> If you live in the US, tell your elected representatives to support legislation like ACCESS Act and AICO.\n\n> If you live in Europe, thank you for voting for representatives who passed the DMA. We will be petitioning Apple under DMA Article 6 to request interoperability with Apple Watch APIs.\n\nThat involves more time and effort, that's why they are saying that for now, the easy way is an Android. But what we want here is change.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MadCybertist",
                            "body": "I mean this is the answer and the article even specifically tells you to get an Android. \n\nPeople use Apple because they like Apple. If you want something different, USE something different. It’s not that hard. You don’t have a right to use an iPhone. It’s a choice. \n\nThere’s nothing wrong with using an android phone.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "cuentanueva",
                                    "body": "The article also tells you that in Europe they are gonna argue it's against the DMA.\n\nAnd to vote people in the US that would pass legislation against this.\n\nSo yes, _for now_ the alternative is Android.\n\nBut it shouldn't be. Not because it's Apple, but because they have a huge market share on the phone space. So _if_ they compete on it with accessories like the watch, then _other_ companies should have parity so they can also compete.\n\nIt's as simple as that.\n\nI use Apple because I like Apple. I also like competition. So I'm totally against Apple just stiffing competition when they would anyway annihilate it. It's just petty.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sionnach",
                    "body": "Selective notifications work fine on Withings devices. Maybe that one is on Garmin?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "conformingape",
                            "body": "I think selective notification might work but replies don't since Apple locks that API (iMessage).",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "sionnach",
                                    "body": "That makes sense - the Withings can’t reply anyway as it doesn’t really have a read / write interface per se.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PeakBrave8235",
                    "body": "Selective notifications do work lol",
                    "score": 6,
                    "replies": [
                        {
                            "author": "SoCalChrisW",
                            "body": "Admittedly I haven't checked in about a year. But the last time I checked, the only way to do it was messing around with notification settings that also affected the notifications in places other than my watch, which made it a no-go for me. Also as far as I know, even if I do that workaround, it won't silence the notifications on my watch if I mute them on the phone. It makes it super annoying if I'm in a meeting or something where I need to focus and a group chat is going nuts and I've muted the notifications but they are still pushed to the watch.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Civil-Salamander2102",
                    "body": "I have both, do you go on long camping trips or something? I’ve ran half marathons while wearing the  Apple Watch all day and never ran out of battery. Garmin does have its place, but I found it very limiting and buggy when it came to anything other than tracking runs. \n\nTheir data privacy is bad if that’s what you care about. They had a massive breach around 2019. Their workout recommendations were something I originally missed, but looking back, they were also trying to kill me by recommending I do sprints in 100 degree weather, the day after doing sprints.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AppointmentNeat",
                            "body": ">\tTheir data privacy is bad if that’s what you care about. They had a massive breach around 2019.\n\n\nApple settled a lawsuit for $95 million dollars for eavesdropping on users for 10 YEARS via Siri.\n\nhttps://www.forbes.com/sites/kateoflahertyuk/2025/01/06/apple-siri-eavesdropping-payout-heres-whos-eligible-and-how-to-claim/\n\n\nWhen you point the finger at someone, you have 5 pointing back at you.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "conformingape",
                                    "body": "Apple users don't care about this. Apple doesn't have perfect products or the perfect software. They just have an amazing marketing team. I personally find it hypocritical when people think Apple is the beacon of ethical behavior. They're a trillion dollar company...they don't care about you. They care about your money.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "ErisC",
                                    "body": "oh my god do u have 6 fingers",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mitch_medburger",
                            "body": "I was just tracking a 50 mile mountain bike ride and my Apple Watch died with 10 miles left. It was fully charged when I started the ride. It lasted a little under 6 hours. I was not pleased.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "SoCalChrisW",
                            "body": "I do long camping trips, frequently in areas with no power or cell service, and often times with multiple hikes and bike rides mixed in throughout the trip that I want to track with GPS. \n\nThe Garmin watch easily handles all of that, broadcasts my heart rate to my bike computer as a standard BTLE sensor so I don't need to use a chest strap (Apple watches might offer this functionality, I don't know to be honest), and it ties into my InReach satellite tracker so I can receive messages on that without needing to mess with the InReach, I can just leave that clipped on to something out of the way.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "derpycheetah",
                    "body": "They gimp the functionality of everything that isn't Apple and worse yet, they almost downright cripple their own devices should you try to use them outside of other Apple products.\n\nThat was cool and all back in 2002 when computers weren't so invasive, but now they are everywhere and in everything. We can no longer afford, as a society, to let companies try to carve out some a piece for themselves and no one else.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "lost_in_life_34",
                    "body": "except for the battery life and a few pieces of data you can figure out by yourself there isn't much difference between apple and Garmin",
                    "score": -3,
                    "replies": [
                        {
                            "author": "SoCalChrisW",
                            "body": "It's hard to minimize the battery life difference. An Apple Watch gets what, 1-2 days in the best of circumstances? My Garmin can go 40-50 days when used as a smart watch, and infinitely if I just use it as a watch.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "MianBray",
                                    "body": "On the other hand, an Apple Watch has a lot more power and functionality that Garmins offerings. E.g. built-in LTE and everything that this connectivity offers. I can leave my house without my iPhone and can still listen to _every_ song I want, call people and remote control and open my car. Also I think - and thats my personal opinion and not fact or universal truth - an Apple Watch with a nice bracelet or strap has a shot at looking decent in a suit or on a somewhat fancy occasion, while Garmins just scream in your face „i‘m so sporty and fit, look at me“.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Blog_Pope",
                                    "body": "I get that, but also I know my Fitbit was out of juice far more often than my Apple watch simply because I have a habit of charging the AW daily and the Fitbit was just sort of random, Oh, its dead, I should remember to charge it. Best was when I did put it on the charger but the pins didn't align so it was still dead in the morning.\n\nI'm not hiking the Appellation Trail, so having to charge daily is not a big deal for me.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheVitt",
                    "body": "My wife has been asking for one to replace her Ultra 2, and I fully support it, but I genuinely can't figure the lineup out! Like, how do I make heads and tails of it?\n\nI also can't figure out their release schedule, which is stoping me from buying one – it seems like they haven't released a new product for a few years now, is that right?\n\nEdit\n\nWait, you can't control what notifications go through? I don't think she'll like that...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SoCalChrisW",
                            "body": "Yeah Garmin's watch lineup is crazy, and not at all intuitive to me. Check out some of the reviews on YouTube, DC Rainmaker usually has great reviews of these things, and find one that aligns with what she wants to do with it.\n\nMy experience has been it's either all notifications, or none, but based on what some other people are saying here it sounds like I may be doing something wrong.\n\nDespite that, I absolutely love my Garmin. My wife does too, she always had an Apple Watch but switched over to the Garmin at one point after seeing how much I like mine, and she's been happy with it since.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "A-Hind-D",
            "body": "Man I miss pebble. They were a fantastic wearable. After they died off I caved in and bought a Apple Watch, but I still miss that battery life",
            "score": 30,
            "replies": [
                {
                    "author": "PeakBrave8235",
                    "body": "It has excellent battery life… because it literally told the time. And got notifications. And that’s it.\n\nThey failed to adapt to the market. ",
                    "score": 5,
                    "replies": [
                        {
                            "author": "beck320",
                            "body": "I used mine for voice to text, and alarms, and music control. I wanted a simple watch",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "PeakBrave8235",
                                    "body": "That’s fair. And it could do all of that. The market said though they wanted more, and Pebble didn’t give it to them",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "beck320",
                                            "body": "That is very true, I heard they invested a lot into marketing instead of bringing new features.  Also most of the designs were not great.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RazorThin55",
                            "body": "Well they were killed off by Fitbit before they even had a chance.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "PeakBrave8235",
                                    "body": "Notably because Fitbit adapted to the market and Pebble didn’t. \n\nPebble was a smartwatch and stayed a smartwatch and never adapted.\n\nLiterally $50 fitness bands from Xiaomi did more, and did the same stuff.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TWYFAN97",
            "body": "Never expected Pebble watches at least in form to ever make a return. Pretty cool since my first smartwatch was the OG pebble and Pebble Time.",
            "score": 14,
            "replies": []
        },
        {
            "author": "DMacB42",
            "body": "I bought a Pebble after they announced the Apple Watch to see if I would even get any use out of a smart watch. Loved that thing. \n\nLoved the two Apple Watches I’ve had since equally or more though. ",
            "score": 11,
            "replies": [
                {
                    "author": "AWF_Noone",
                    "body": "If I could have the fitness tracking of the Apple Watch in a pebble I would go with a pebble in a heartbeat",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Buy-theticket",
                            "body": "So would most people. That's the problem from Apple's POV.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "PeakBrave8235",
                                    "body": "Then why the hell doesn’t Pebble or RePebble or Intel or Core Devices or Core 2 Duo or whatever the hell this monstrosity is called, actually offer a health lab on your wrist?\n\nExactly. Dude has the same “vision” for the product:\n\n>You’d imagine that smartwatches have evolved considerably since 2012. I've tried every single smart watch out there, but none do it for me. No one makes a smartwatch with the core set of features I want:\n\n>Always-on e-paper screen \n\n>Long battery life\n\n>Simple and beautiful user experience around a core set of features I use regularly (telling time, notifications, music control, alarms, weather, calendar, sleep/step tracking\n\n>Buttons!\n\n>Hackable \n\nWanna tell me where it mentions anything Apple provides, from low and high heart rate notifications to fall detection to car crash detection to EKG scans to sleep apnea detection to on and on and on? \n\n\nSource:\n\nhttps://ericmigi.com/blog/why-were-bringing-pebble-back",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "chriswaco",
            "body": "I've been an Apple developer since 1984 and they're a terrible business partner. From day one we've been asking for custom watch faces. From day one we've been asking for custom AppleTV screensavers. Apple's own iOS apps can modify their icons on-the-fly (that's how Calendar shows today's date), but 3rd party apps cannot. Updating widgets works only on occassion. Push notifications get throttled. APIs necessary for the function of one of our apps got removed because some other apps abused them, even though we didn't. There's no way to turn off the system update alert, which makes vertical market apps like museum kiosks a problem. The list goes on and on. \n\nI've turned away many clients that wanted to port their Android apps to iOS but I had to tell them, \"It's not possible.\" At least the EU is getting alternative app stores.",
            "score": 30,
            "replies": [
                {
                    "author": "AppointmentNeat",
                    "body": "The “alternative App Store”  isn’t what you think it is. It’s basically AppStore 2.0 because Apple still has to approve every app before it’s allowed.\n\nIt’s an “alternative AppStore” in name only because big brother is still watching every move you make.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "chriswaco",
                            "body": "I'm hoping the EU clamps down on them a bit more.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mynameisollie",
                    "body": "I mean a lot of the reasons for limiting these are to prioritise battery life.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "chriswaco",
                            "body": "and privacy. Apple deprecated a lot of APIs to prevent device fingerprinting. The sad thing is that we didn't even show ads or connect to a server, but they wouldn't make the APIs available to us.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "riceinmybelly",
                    "body": "Tinder does it?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "PeakBrave8235",
                    "body": "So you’ve been a developer since 1984 for Apple, and you’re still complaining? You would think someone of your tenure would either have gotten the message and adapted, or stopped being a developer.\n\nYou're quite aware that Apple is a vertically integrated company. ",
                    "score": -9,
                    "replies": [
                        {
                            "author": "chriswaco",
                            "body": "As a user I love Macs and iPhones, except when I'm complaining. I worked on one DOS app after college and never wanted to touch anything written by Microsoft again. Back then you either had taste (Mac) or didn't (DOS/Windows). I used to teach Mac programming classes for Apple in the 1990s. It's what I know best, although I have written a bit of code for other platforms (Palm, Linux, etc).    \n    \nDefinitely a love/hate relationship.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "PeakBrave8235",
                                    "body": "I mean, fair enough, but the reason I love my devices as a user is because of how “limited” they are, even if that makes developers jobs more difficult",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "whosthisguythinkheis",
                                            "body": "no it is not.\n\nif you don't like what a certain app is doing you don't have use it.\n\njust like how many of the people in this sub like to say, you don't need to buy an iphone. well right, and you don't need to use an app where you feel they are being implemented incorrectly.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PeakBrave8235",
                                                    "body": "I’m sorry, what do you mean “no it is not.”\n\nWhy are you telling me why *I* value Apple products for myself lmfao?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "whosthisguythinkheis",
                                                            "body": ">Why are you telling me why I value Apple products for myself lmfao?\n\nWe rationalise things to ourselves all the time. If apple changed their policies on this I doubt you'd go and jump ship.\n\nThus you likely love your devices for other reasons.\n\nLike I said, just because a device is open does not mean it cannot be limited for people who want to to keep it that way.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "PeakBrave8235",
                                                                    "body": "Okay, let’s be ultra-clear.\n\n\nI — and I alone — determine what is of value to me. If Apple suddenly turned into Google and was the complete opposite, I wouldn’t feel as strongly about the products. I feel strongly about Apple because I care about what they care about. They make stuff I like. And it’s different from the competition, doing stuff I like.\n\nYou came on here making some weird presumption of what I care about despite me literally saying what I care about. \n\n> just because a device is open does not mean it cannot be limited for people who want to to keep it that way.\n\nMakes zero sense. If I want a device that technically and physically limits my ability to install software from third party sources, you giving me the ability to install from third party sources then simply saying “don’t use it if you don’t want it” literally violates what I want in a product\n\nBut back at you. If you want a product that lets you choose between limitations and “openness,” go buy an Android! Leave me and my products the hell alone",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Entire_Routine_3621",
                            "body": "Lying or a bot.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "PeakBrave8235",
                                    "body": "Misread your comment, never mind! lol I thought you were talking about me",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Entire_Routine_3621",
                                            "body": "Supposed Apple devs complaining about the work they choose to do is a choice for sure.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BurgerMeter",
            "body": "Doesn’t Google own Pebble now?\n\nFitbit bought Pebble, and Google bought Fitbit.",
            "score": 2,
            "replies": [
                {
                    "author": "Glebun",
                    "body": "They open sourced PebbleOS, so the original creator is launching new Pebble watches. Pre-orders started today.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "PeakBrave8235",
                            "body": "Ah, so this is just a marketing ploy. \n\n“MY PRODUCT IS BEING OPPRESSED BY APPLE!!!!!!!!!!!!!!!! BUY NOW AND JOIN THE RESISTANCE.”\n\nDude is literally a multi-millionaire with billionaire connections. ",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Glebun",
                                    "body": "Sure I guess, buts it's also true and a valid criticism",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "Framing himself and his product in this oppression angle is not a valid criticism\n\nHe doesn’t even use iOS. Majority of his customers don’t either. Android has 3.5 billion users\n\nHe can literally survive without iOS\n\nWhole thing is a marketing ploy",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "ToSeeAgainAgainAgain",
                                                    "body": "Here are the things that are harder or impossible for 3rd party smartwatches (ie non Apple Watches) to do on iPhone:\n\n* There’s no way for a smartwatch to send text messages or iMessages.\n* You can’t reply to notifications or take ‘actions’ like marking something as done.\n* It’s very difficult to enable other iOS apps to work with Pebble. Basically iOS does not have the concept of ‘interprocess communication’(IPC) like on Android. What we did before was publish an SDK that other apps (like Strava) could integrate to make their own BLE connection to Pebble. It was a clunky quasi-solution that other apps didn’t like, because it was hard to test (among other things)\n* If you (accidentally) close our iOS app, then your watch can’t talk to app or internet\n* Impossible for watch to detect if you are using your phone, so your watch will buzz and display a notification even if you are staring at your iPhone \n* You can’t easily side load apps onto an iPhone. That means we have to publish the app on the iPhone appstore. This is a gigantic pain because Apple. Every update comes with the risk that a random app reviewer could make up some BS excuse and block the update.\n* Because of iOS Appstore rules, it would be hard for us to enable 3rd party watchface/app developers to charge for their work (ie we can’t easily make an appstore within our app)\n* Getting a Javascript engine to run in PebbleOS forced us to go through many hoops due to iOS — creating a compiler inside the Pebble iPhone app that in itself needed to be written in (cross-compiled to) JS to work with Apple's restriction on downloadable code can only be JS\n* As a Pebble watch/app developer, using the iOS app as relay to the watch sucks since the \"developer mode\" terminates every few minutes",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "fiendishfork",
                                                                    "body": "Impressively long comment from someone who clearly couldn’t be bothered to read the article being discussed. If you had read it you would have quickly realized the bullet list from the article.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PeakBrave8235",
                                                                            "body": "Embarrassing. Utterly and completely embarrassing on my end. I didn’t even bother on click on it because the headline told me all I needed to know about what would be said.\n\nBut not as embarrassing as a 30 day warranty.\n\nYou go and defend that millionaire that only offers 30 day warranties on his product. You go honey. You go.",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "fiendishfork",
                                                                                    "body": "What are you even talking about ? All I did was point out you didn’t read the article.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "PeakBrave8235",
                                                                                            "body": "What do you mean, what am I talking about? Lmfao. I literally acknowledged your point, course corrected, and then pointed out a further criticism of this product",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "fiendishfork",
                                                                                                    "body": "I didn’t mean to strike such a nerve with you. Hope your day gets better.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "PeakBrave8235",
                                                                                                            "body": "I hope you have a great day!",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Glebun",
                                                    "body": "The criticism of iOS that he presents is valid.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "PeakBrave8235",
                                                            "body": "Except not really? Multiple people have pointed out here that you can do a lot of the same stuff as AW.\n\nFurther, this is irrelevant. His product failed not because he didn’t have all the intricacies of AW, but that his product didn’t adapt to the market. FitBit offered health stuff. His didn’t.\n\nHe’s blaming everyone except himself. ",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Glebun",
                                                                    "body": "And yet the criticism is still valid, everything he mentioned is true and it's apple limiting their competitors",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PeakBrave8235",
                                                                            "body": "And yet,it  isn’t.\n\nLack of first party integration is *not* why Pebble failed ultimately lol",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Glebun",
                                                                                    "body": "Who's saying that's why Pebble failed? I'm saying the criticism if valid, regardless of Pebble.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "PeakBrave8235",
                                                                                            "body": "We just went over this. It’s irrelevant. I can criticize Apple for anything. That doesn’t mean it’s valid and more importantly does not mean that it matters.\n\nThe fact that he framed this entire thing as “Apple is stopping *us* from being ‘awesome’” meanwhile literally just recreating the same product that ultimately failed in the market goes to show he learned nothing, that he doesn’t care about making good products, doesn’t take  responsibility for the product decisions he made and makes, is willing to start a forest fire (metaphorically) with zero regard who it affects simply to get attention on launch day, etc. is what I take issue with in this whole thing\n\nIf he made an entirely new, revolutionary product that completely trounced Apple Watch in health and UI, and made it Android exclusive (with zero mention of Apple or why he didn’t launch it on Apple devices), that would have made more sense, way more sense.\n\nInstead he’s literally rehashing — going as far as naming it RePebble — the same crap with the same product philosophy with the same tired arguments. All of this is marketing ploy, seriously.\n\nNo thanks dude",
                                                                                            "score": -1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Glebun",
                                                                                                    "body": "> I can criticize Apple for anything. That doesn’t mean it’s valid and more importantly does not mean that it matters.\n\nCorrect - but if the criticism is valid, I will say that it is.\n\n> The fact that he framed this entire thing as “Apple is stopping us from being ‘awesome’” meanwhile literally just recreating the same product that ultimately failed in the market goes to show he learned nothing, that he doesn’t care about making good products, taking responsibility for the product decisions he made and makes, is willing to start a forest fire (metaphorically) with zero regard who it affects simply to get attention on launch day, etc. is what I take issue with\n\nAnd yet the criticism of Apple is valid. I'm not talking about Pebble at all here.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "PeakBrave8235",
                                                                                                            "body": "> Correct - but if the criticism is valid, I will say that it is\n\n> And yet the criticism of Apple is valid. I'm not talking about Pebble at all here.\n\nRead the latter half of my sentence you first quoted lol",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Glebun",
                                                                                                                    "body": "You can say it dosn't matter for Pebble - don't say it's not a valid criticism in itself, though, because it is.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "PeakBrave8235",
                                                                                                                            "body": "Lmfao good god you just want to hear that you’re right at the expense of everything else\n\nYou’re right.\n\nHave a great day.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "freezingtub",
                                    "body": "That's a ridiculous ad hominem.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "What is?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "franklindstallone",
            "body": "Thing is even if it had all that stuff, I don't think I'd bother. It feels like a toy hence its key features include being 'hackable' but no health features.\n\nOddly enough most complaints I hear from normal people is getting notifications on their Apple Watch because I guess they don't know how to turn it off for the watch.\n\nBut fair enough, he should be free to try whatever he wants. But if Android is so much better why not focus on that and make it the best experience?\n\nIf they made the Android experience more attractive and people moved for that then that will get Apple's attention.\n\nBut in reality, the market for a hackable e-ink watch is probably pretty small.",
            "score": 4,
            "replies": [
                {
                    "author": "TheBros35",
                    "body": "Well, he is making Android a better UX. This post is mostly working as the disclaimer for when you buy the product (it literally has a “I accept that I am on iOS and will have a worse UX than if I have an android” button when you buy the product). \n\nBut totally yes, it is a small market and I hope he runs the company with that in mind.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PeakBrave8235",
                    "body": ">But fair enough, he should be free to try whatever he wants. But if Android is so much better why not focus on that and make it the best experience?\n\n>If they made the Android experience more attractive and people moved for that then that will get Apple's attention.\n\n\n\nThank goodness someone gets it’",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fun-Ratio1081",
            "body": "Because only Apple can be trusted to provide us privacy and no other company can /s",
            "score": 4,
            "replies": [
                {
                    "author": "Ok_Pineapple_5700",
                    "body": "You're joking but that's their core argument",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Civil-Salamander2102",
                    "body": "You mean like this?https://www.cshub.com/attacks/articles/incident-of-the-week-garmin-pays-10-million-to-ransomware-hackers-who-rendered-systems-useless",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Fun-Ratio1081",
                            "body": "Or this [https://firewalltimes.com/apple-data-breach-timeline/](https://firewalltimes.com/apple-data-breach-timeline/)",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "PeakBrave8235",
                            "body": "Poignant! Thanks for sharing this",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pleasant_Start9544",
            "body": "I can see why people can defend Apple with their 30% tax on devs. But there is no defense for all of these darn restrictions. A smartwatch shouldn't have these many restrictions.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PeakBrave8235",
            "body": "Here’s my pet theory (which I don’t have evidence for):\n\n\nHe originally launched Pebble, and obviously because his product isn’t first party with iPhone, it didn’t work 100% the same as something like Apple Watch would. Also, I’ve owned one, and it sucked (in my view). After Apple launched Apple Watch — more well made, better functioning, and it has actually saved people’s lives — Pebble floundered into irrelevancy and buyout. \n\nNow he sees certain governments ignoring important world events and placing utmost priority on third party app marketplaces on iOS, so he relaunches Pebble despite knowing the situation with smart watches is still largely the same, and he’s going to opine about how Apple is “anti-competitive,” and “evil,”  and how “it’s not fair” that something they made for their own platform is more reliable and higher quality than a third party device. \n\nSo basically the whole thing is just him trying to get back at Apple (and yeah, I disagree with him) and relive his glory days.\n\nI’ve moved on dude. It was a cute device, but you need to make something else worthwhile. I don’t care for this.\n\nEdit: Lmfao the Pebble brigade is here. -7 dislikes in a single minute \n\nEdit 2: LOL, he literally named the watch “Core 2 Duo”\n\nEdit 3: LITERALLY A 30 DAY WARRANTY. WTF?\n\nThe Pebble CEO needs to be more concerned about getting sued by Intel, not about Apple. ",
            "score": -9,
            "replies": [
                {
                    "author": "mredofcourse",
                    "body": "I also had (and loved at the time) an OG Pebble.  It wasn't just that the Pebble was 3rd party that made the Apple Watch so much better, the AW was really Next Gen (or two) and far more premium in quality.\n\nI'm not so sure I agree with your theory at least in terms of his intentions, but I do agree with it in terms of how it's playing out.\n\nReading through the points on the post, almost all of it isn't Apple blocking, but rather not building, and that has implications for the consumers who want the choice of having a closed platform, when there are plenty of other phones and watches from other manufacturers that are more open.\n\nA closed platform has advantages and disadvantages compared to an open one like Android.  According to Pebble, 40% of their interested customers have iPhones.  That means \\~60% have phones from any number of vendors that are more open.\n\nI get that others may want Apple to build and open up for 3rd parties and may want the Pebble to work as fully as the Apple Watch with the iPhone, but wanting this as a consumer shouldn't be how governments determine laws, especially when they'd be taking away the consumer choice for pretty much the only closed phone platform on the market.\n\nOn the other hand, **anything that is Apple blocking for the sake of anti-competitiveness as opposed to not building out, providing security, etc... those points should be made independently with legal action**, but the reality is, iOS wasn't built such that a 3rd party watch would have the same level of functionality as an Apple Watch.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "PeakBrave8235",
                            "body": "Pebble’s base isn’t even a iOS majority, as you said.\n\nEven the CEO doesn’t use iOS. So… uh… with Android at over 3.5 billion active users and devices, I can’t say exactly he has a point that his company can’t survive if he doesn’t get his way.\n\nFurther, it’s unclear what he’s crying about. He will never be able to vertically integrate like Apple does. It’s impossible, technically. You cannot vertically integrate a third party product (horizontal integration).\n\nWhole thing is just “pay attention to me, I’m a multi-millionaire being oppressed by a trillion dollar company. Buy my product now. Join the resistance.”",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mynameisollie",
                    "body": "I love my pebble at the time. Their reliability was shit though. I went through about 4 of them. They replaced them for free as they were in warranty but it probably didn’t help their cash flow situation. I found the Apple Watch a better device but I do miss that week long battery life.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "PeakBrave8235",
                            "body": "I thought it was cute, but ultimately it never adapted and didn’t provide enough value.\n\nIt was a product borne of social media. Very superficial, honestly. And Pebble never adapted, so they failed. And the CEO never got over that, and so he’s now back. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Gogobrasil8",
                    "body": "It's not about just reliability, Apple simply doesn't allow any other smartwatch to do things like dismiss notifications.\n \nAlso no, no one releases a whole product just to get back at Apple, specially not an indie developer putting his personal savings on the line.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "PeakBrave8235",
                            "body": "That’s notably untrue, as pointed out by other commenters.\n\n>no one releases a whole product just to get back at Apple\n\nActions speak louder than words here my dude. I articulated my position, and I suppose you’re entitled to disagree with it only on the merit of disagreeing with it, but you haven’t actually provided any reasoning as to why this isn’t as I described it as \n\n>indie developer putting his personal savings on the line.\n\nOh, that’s what we’re calling a multi-millionaire who got his company bought out? An *indie developer* LMFAO?\n\nHe has more resources — both financial and social — than you or I ever will ever in our entire lives, and the next 10 lives after. ",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Gogobrasil8",
                                    "body": "Yes I did, the reasoning is that this is ONE guy putting his life savings into a product. Your theory that it's to spite Apple is extremely unlikely - and extraordinary claims require extraordinary evidence. \n \nIndie means \"independent\", buddy. By definition, he's indie.\n \nI'm sorry but just pause for a second and realize that what you're saying just makes no sense and you really don't have any base to make these outlandish claims.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "LOL oh God.\n\nYes, let me pity the multi-millionaire with billionaire friends and connections (including those at a trillion dollar company a la Google)! *NOTHING* about him is indie anymore, at all.\n\nMeanwhile I literally can’t even buy more than 1 pack of eggs because of bird flu.\n\nNot a compelling argument, especially considering he can solely survive on Android with its 3 and half BILLION ACTIVE users and devices.\n\nNo pity, I don’t care",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Gogobrasil8",
                                                    "body": "Man have some self awareness \n \nI wasn't gonna go there but you're here trying so hard to divert attention away from a multi-trillion dollar company hurting us\n \nAnd you wanna play the millionaire card? C'mon. \n \nLike I said, calm down and just understand Apple could've fixed it if they cared as much as you seem to do about all the criticism they get.\n \nAlso you're still wrong because you don't know the definition of indie",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "PeakBrave8235",
                                                            "body": "Have some self-awareness yourself lol? You clearly don’t understand my position.\n\nThe starting argument here was, you want me to defend a multi-millionaire with billionaire friends and connections, because a trillion dollar company doesn’t let them ‘have it all.’\n\nSo I defend the trillion dollar company in response. \n\nYou’re straight up falling for his marketing ploy. \n\n>Also you're still wrong because you don't know the definition of indie\n\nLol",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Gogobrasil8",
                                                                    "body": "I'm unclear what the ploy would be, in your fantasy about a guy launching a product just to spite Apple\n\nIs it marketing for the idea of caring about consumer rights, marketing for his blog and he launched a product just so he could get views on his blog, or is it just marketing for the product itself?\n \nAlthough, you are right about you defending the trillion dollar company, which is hilarious given your last comment",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PeakBrave8235",
                                                                            "body": "The dude literally could have retired for the rest of his life and lived in complete luxury. But no, getting bought out and having millions of dollars isn’t good enough for him, having billiaokire friends isn’t good enough for him.\n\nSo now he’s back to offer the same crap and offer the same arguments, and I’m supposed to pretend this is a natural progression of events. The dude has opined multiple times about how “unfair” Apple is. He was always bitter and it showed.\n\nSo now what does he do on launch day — in the context of a few governments trying to mandate third party app marketplaces in the name of “competition”? He straight up launches this whole tirade, offering the same tired arguments, despite the fact that he doesn’t even use iOS, and 3.5 billion users use Android. \n\nExactly what is the oppression here? Nintendo doesn’t let people interfere with their platform either. Companies are entitled to do that, or not do that. It’s literally the free market, and if customers want it, then they buy it.\n\nIf Pebble is *so* compelling, then 3.5 billion people get access to it. If it is *so* compelling*, people will switch from iOS to Android simply to use it. \n\nBut it isn’t. It’s the same tired has-been product from a has-been millionaire who rants about being oppressed who never got over his products’ mistakes\n\n>Although, you are right about you defending the trillion dollar company, which is hilarious given your last comment\n\nYou aren’t even reading what I’m writing.\n\nBest wishes to you.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "readeral",
                                                                                    "body": "Given your astroturfing of this post with the repetition of your arguments and constantly saying “millionaire with billionaire friends” I wonder if this is somehow personal to you in a way you haven’t yet articulated…",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "PeakBrave8235",
                                                                                            "body": "I’m dedicated to fully articulating my argument, but in no way am I an “astroturfer” (might want look up what that means, because in your usage, I could call all the people who disliked my comments astroturfers as well).\n\n> I wonder if this is somehow personal to you in a way you haven’t yet articulated\n\n\nIf people can describe Apple as a trillion dollar corporation, I can call out millionaires for being millionaires and billionaires for being billionaires. Fair is fair. Just pointing out the rank hypocrisy. But hey, you go off on your conspiracy. ",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "readeral",
                                                                                                    "body": "Uh huh..",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "PeakBrave8235",
                                                                                                            "body": "I’m Tim Cook, obviously. Wasn’t it obvious? Just curious. \n\nThis website is utterly hilarious, actually. I actually laughed. God forbid the other side of a debate push back on a topic and not give up simply because people are disliking and brigading!\n\nHave a great day though. I wish you well if you want RePebble — no, Core Devices — no, Intel — no, Core 2 Duo? \n\nAnd it’s 30 day warranty.\n\nBut hey, keep on pumping up that millionaire CEO and his 30 day warranty. I’m sure *no customer ever* will get screwed over by that!\n\n(Sarcasm)",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "readeral",
                                                                                                                    "body": "Mmm",
                                                                                                                    "score": 2,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sluuuudge",
                                            "body": "I’m betting you’re one of those people who thinks the EU were right to be so harsh on Apple in the DMA.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Gogobrasil8",
                                                    "body": "No, I'm not.\n \nI actually am critical of some of the things the EU did. I don't just jump into assuming everything they do is good\n \nBut Apple limiting things to 3rd party watches is pretty clear cut. It's just bad for us. Less choice for us. If I wanted to use a different watch I should be able to.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BulletTrain2Iowa",
                    "body": "Tim stop rage posting on your lunch breaks and find a way to make your devices competitive without artificially gimping your competitors.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "PeakBrave8235",
                            "body": "Edit: they blocked me, unfortunate because I can no longer reply to him or anyone else on this comment thread\n\nImagine defending what was and is literally an e-Ink basic watch. That’s literally what Pebble was.\n\nPebble died because it had zero vision and failed to adapt, not because it didn’t have first party integration. Again, I owned one. It was cumbersome to use (side buttons), it only told the time (even though stuff like FitBit could do health tracking like Apple Watch), and they couldn’t keep up with what people actually wanted — a health lab on your wrist, not a simple e-Ink watch. \n\nI got notifications from my iPhone on the Pebble too. It functioned as a “smart watch,” but people don’t simply want a “smart watch.” They want something that tells the time, lets them disconnect from their phone, AND inform them about their health. \n\nPebble failed to pivot to what the market became.\n\nCute device, but it’s time to move on. ",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "dingoonline",
                                    "body": "You seem quite mad about a hobbyist project that doesn't seek any of your money or much of your attention.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "Nah, I just see through what he’s trying to pull here and I disagree with all of it. ",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "dingoonline",
                                                    "body": "Nobody's pulling anything over you unless the blog author is currently shaking you down by the ankles for money to buy a Pebble.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "PeakBrave8235",
                                                            "body": "Nah, he’s trying to market hysteria and oppression by the Big Bad Apple.\n\nThe dude failed to adapt to the market’s needs. His product got bought out. Seriously, move on, respectfully lol",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "K0il",
                                    "body": "As somebody who used a pebble for years, and currently uses an Apple Watch, my primary reason for having a smartwatch is to tell time and give me notifications. The health tracking is useless for me, and most other actions you can do with an Apple Watch are cumbersome because of the tiny touchscreen interface, and usually only useful if your phone is within range of it. \n\nAll that to say, there’s a market for pebble-like devices. It’s just a tight niche that clearly doesn’t fit your wants. ",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "BulletTrain2Iowa",
                                    "body": "Imagine being so short sighted that you literally can’t see the issue over your bad experience with a single device. This isn’t just about the pebble. This is about all third party devices being handicapped on iOS due to artificial limitations placed by Apple. What they’re experiencing directly translates to every other device on the market.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "You’re deliberately misstating the situation, dude.\n\nThird party devices work fine. How do I know? *I use them*\n\n\nYou’re getting all in an upset because God forbid Apple utilize vertical integration to make two products they make function better than what they could by themselves.\n\nExample: iPod\n\nZune worked better on Windows than Mac. iPod worked better on Mac than Windows. Pebble worked fine on my iPhone, gave the same “smart watch” sort of stuff. \n\nThe issue for Pebble is they had zero vision. They banked on social media notoriety. It had cute animations, etc \n\nThe market saw what Apple Watch was and wanted that instead. What did Pebble do? Nothing. They sat still and got lapped by every competitor in the world, including basic smart band companies like Xiaomi. \n\nPebble died because they made fatal product decisions like not to pursue health. ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "BulletTrain2Iowa",
                                                    "body": "You didn’t even read the article.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Jusby_Cause",
                            "body": "Apple’s not gimping Pebble. Just like Nokia wasn’t gimping Apple. Apple didn’t ask the EU to change the laws to allow Apple some control over how Nokia did business. Apple took a risk, built their own thing, and, after a number of years, it was successful and growing. Running a business better than the competition (which had a huuuuuuuuuuuuuuuuuge head start) shouldn’t be seen as anti-competitive, but it is.\n\nPebble literally failed at business.",
                            "score": -4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "_sfhk",
                    "body": ">Edit: Lmfao the Pebble brigade is here. -7 dislikes in a single minute \n\nNot everything against you is a brigade.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "PeakBrave8235",
                            "body": "Hey, sure, that’s true! Nevertheless, it still happened, and I don’t describe everything as a brigade against me ",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nj_tech_guy",
                    "body": "Have you considered you may just be completely incorrect? \n\nHe hasn't been quiet about why he's doing this, he felt the pebble was the best watch on the market and nothign has come up like it since, so he's remaking it. \n\nHe uses Android as his main OS. So the watch works perfect for his use case. He wants to share the watch with the world.\n\nHe gives a disclaimer on [repebble.com/](http://repebble.com/) his blog that you shouldn't buy the watch if you want an apple watch replacement, he's explicit about what functionality won't be there, and he puts the blame (correctly) on Apple for limiting their OS to non-Apple products. \n\nHis goals *have literally fucking nothing to do with Apple*. He even states in his announcement blog post that the only reason he's supporting iOS is because 40% of the people who took the pebble survey still use iPhone.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "PeakBrave8235",
                            "body": "> He hasn't been quiet about why he's doing this, he felt the pebble was the best watch\n\nTwo things:\n\n1: Feelings do not equate to fact. He can feel that all he wants. It doesn’t make it true, respectfully\n\n2: Whether Pebble was or was not “the best watch” is up for personal debate. However, if it *was* the best watch, then the past tense is appropriate. It *was.* Then it wasn’t. Why? Because Pebble sat still while even basic $50 smart bands lapped them into what the wearable market would want and become ultimately. \n\n> nothign has come up like it since\n\nYeah… that’s because the market said “we don’t want that.” Pebble was a cute, animated watch that had smartphone notifications. Useful! But the market moved on and had vision, and Pebble failed to adapt, so people didn’t care. By the time they realized, they got bought out shortly after\n\nPebble will fail again because it continues to bank on social media notoriety, and not actual product function. Go ahead and make a non-invasive Blood Glucose sensor and put it into Pebble. Then you might have something people will want. \n\n> He uses Android as his main OS. So the watch works perfect for his use case. He wants to share the watch with the world.\n\nOkay? lol\n\n> that you shouldn't buy the watch if you want an apple watch replacement, he's explicit about what functionality won't be there\n\nGiven its rehash of a failed product, yeah, good on him for saying that. Wouldn’t want to mislead people. \n\nAnd chill out, it’s a watch. ",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "dingoonline",
                                    "body": "> And chill out, it’s a watch. \n\nlmao read your own replies",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "PM_ME_GOODDOGS",
                                            "body": "Dude has lost it over Pebble for some reason. Trends change, holy shit imagine that. Same reasons I want a small, or even eink phone. Yes the market wanted larger flashier phones but there's now a growing market for smaller less obtrusive devices. I am in that market. I have AW but I *want* my other watch options to work just as well. Apple absolutely handicaps other watches. It's not just about getting a text notification.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "PeakBrave8235",
                                                    "body": "> Trends change, holy shit imagine that.\n\nLmfao indeed",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "I thoroughly and clearly articulate my opinion, but notice I wasn’t fucking using the word fucking to describe how I feel about this situation. ",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TMWNN",
                    "body": "> he’s going to opine about how Apple is “anti-competitive,” and “evil,”\n\nComplete with obligatory Trump mention.\n\nI haven't owned a Pebble but have long heard how nice they are. That said, this is wrong:\n\n>It’s impossible for a 3rd party smartwatch to send text messages, or perform actions on notifications (like dismissing, muting, replying) and many, many other things.\n\nMy Amazfit Balance lets me dismiss iOS notifications. I don't know how Amazfit's Zepp app enables this functionality; all I know is that it works.\n\nIts integration with iOS is not ideal or complete; for example, although I can take and make phone calls with its mic and speaker, I can't talk to Siri through it despite my ancient $20 running headset being able to do so. But Balance's other advantages are more than enough for me to go with it over an Apple Watch.\n\nCC: /u/Gogobrasil8, /u/dingoonline",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Gogobrasil8",
                            "body": "Yes, it seems you can dismiss notifications, just not every other interaction with them, among all the things Apple blocks from 3rd party watches \n \nBut yes, it is anti-competitive when they deliberately make other watches worse by blocking these functionalities.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MajorJakePennington",
                    "body": "> Also, I’ve owned one, and it sucked (in my view).\n\nI had to get 3 replacement units for my original Pebble watch. It's not just you that thinks it sucked.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PeakBrave8235",
                            "body": "I also experienced QA issues lol. However, the product philosophy sucked too, and that’s my main problem. Wasn’t worth the money. ",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cpuguy83",
            "body": "Seems like it should be able to do what MS does with their \"Phone Link\" app on Windows.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MawsonAntarctica",
            "body": "Well Apple won I guess, I’m less enthused to replace my series 7 with a pebble if it won’t talk to my iPhone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nn2597713",
            "body": "Wasn’t the EU investigating/fighting this?\n\nOr were we still in the phase where Gruber and other US commentators felt the need to morally support the multi billion dollar company (that donated to fascist dictator Trump) in their fight against the “tyrannical EU”?",
            "score": 1,
            "replies": [
                {
                    "author": "cuentanueva",
                    "body": "According to the article, yes, but they may need more:\n\n> If you live in Europe, thank you for voting for representatives who passed the DMA. We will be petitioning Apple under DMA Article 6 to request interoperability with Apple Watch APIs.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "PeakBrave8235",
                    "body": "Uh… you realize Pebble was bought out for $23 million, and that was *after* their market share has eroded to nothing. Had FitBit bought them out earlier, they would’ve been valued far higher. \n\nMy point? Who the hell cares about million, billion, etc. Straight up doing the same thing you’re arguing against",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Jusby_Cause",
                    "body": "No, the EU NEEDS the iPhone in the region, it’s a critical part of their technology future, so they needed to be able to make more money from it. They don’t need the Apple Watch, so they don’t care.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "OperatorJo_",
            "body": "Apple strikes again. Every single time they gimp anything that isn't an Apple watch.",
            "score": 1,
            "replies": [
                {
                    "author": "Entire_Routine_3621",
                    "body": "Bro the dude is complaining for the sake of complaining. I was pre ordering one for old times sake and after getting about half way through the whine fest I stopped and canceled.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "OperatorJo_",
                                    "body": "Bud if you've used any other smartwatch with an android, you'll see just HOW much Apple gimps anything that isn't an Apple Watch. \n\nAsk my old Diesel On, Mibands, and Xiaomi smartwatch how I know. \n\nDiesel and Fossil were gimped on iOS to the point you couldn't even have Whatsapp notifications or replies. The Diesel On app in android had full access like a regular smartwatch. \n\nYes, Apple does have a history of gimping the competition.\n\nIf ANY company does this, I'll criticize it. Fuck \"brand loyalty\". I've used a myriad of devices and Apple were the only ones that did this until Samsung decided to do it as well with the Galaxy watch 4 (fuck em' too for that).",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "PeakBrave8235",
                                    "body": "So then that’s a point in Android’s favor for why you should buy Android, not some made up conspiracy. \n\nApple is entitled to completely close off their platform a la Nintendo. That is their right. And it is *YOUR* right not to buy an iPhone ",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "OperatorJo_",
                                            "body": "For phones I use iphone. \n\nFor everything else I buy android. It's just preference. I find android better on a larger screen. \n\nDoesn't mean I can't call out a company doing bullshit like gimping devices. Samsung did the same apple does with their watches with the GW4, not allowing them to be used on iOS. Still hate em' for that too.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PeakBrave8235",
                                                    "body": "How far do you expect Apple to go to accommodate Pebble, exactly?\n\nPebble failed because it sucked and it never adapted to the market, not because it was “gimped” on iOS. Lmfao",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "OperatorJo_",
                                                            "body": "Pebble failed because smartwatches at the time were even more niche than now. That has expanded and there's still a market for notification-centric watches. \n\nThe \"accomodation\" is just giving other smartwatches the same capability as an apple watch: full usable controls and notifications from all apps and permissions, not select to just base permisssions. That's it. The same capability android gives any other smartwatch. \n\nThat's not even a \"far accomodation\", that's the standard with apple being the outlier.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "PeakBrave8235",
                                                                    "body": "> Pebble failed because smartwatches at the time were even more niche than now\n\nUh, no.\n\nPebble got bought out in 2016, years after the market shifted to health technology. \n\nPebble had nothing, and refused to adapt. $50 fitness bands from Xiaomi did more.\n\nhttps://qz.com/857412/pebble-went-from-kickstarter-to-being-worth-740-million-to-being-bought-by-fitbit-fit-for-40-million\n\n> Migicovsky later dismissed the potential threat posed by the Apple Watch, at least publicly. “They are very focused on being the Rolex or the (Tag Heuer) of smartwatches,” he said. “On the other hand I think we are trying to be the Swatch of smartwatches.” After the inevitable decline in Pebble’s sales once Apple’s own very polished wearable launched in 2014,  he reportedly turned down a second buyout offer, this time for $70 million from chipmaker Intel.\n\n>Pebble’s fast rise and hard fall reads like a textbook case of Silicon Valley hubris, and the cost of over confidence. But few decisions are as fraught for entrepreneurs as knowing when to sell a company In the end, it’s where a founder’s confidence can be most dangerous\n\nAW has repeatedly save umpteen lives — from young people all the way to the very most elderly of the population.\n\nPebble doesn’t do that, and people wanted that. So they bought stuff that did that, and Pebble wasn’t one of those products that did that, at all, ever.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jusby_Cause",
            "body": "Translation: Open source projects often times lack a robust cross device ecosystem. Yes?",
            "score": -4,
            "replies": [
                {
                    "author": "Gogobrasil8",
                    "body": "No. Apple restricts it. Doesn't matter if you are open sourced or not, Apple just doesn't allow any other smartwatch to do things like dismissing notifications.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "molepersonadvocate",
                            "body": "I can dismiss notifications from my Garmin, but overall it doesn’t integrate nearly as well as my Apple Watch did. I don’t mind this that much since having a “dumber” watch is kind of appealing to me now, but otherwise Apple’s stance here is extremely frustrating. Personally I don’t see much of a distinction between “anti-competitive” and “user-hostile”.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Gogobrasil8",
                                    "body": "Does it dismiss them on the iPhone as well?\n \nYeah, there's no justification, this is straight up just anti-competitive AND user-hostile.\n \nThe apple watch is not a bad product, at least I don't think. There's no reason for them to sabotage the competition like that",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "molepersonadvocate",
                                            "body": "Yeah, the notifications are synchronized between my watch and my phone so if I dismiss it on my watch it disappears from my phone and vice-versa. It also seems to be aware of when my phone is in Do Not Disturb since it disables vibration, but I’ve disabled that 24/7 anyway due to the other issues mentioned in the blog post.\n\nI 100% agree, though. There are challenges involved with building a stable, open API for managing some of the things Apple reserves for their own watch but it’s not like they don’t have the resources to handle that and they’re definitely not acting in good faith here.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PeakBrave8235",
                            "body": "This is untrue lol",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Jusby_Cause",
                            "body": "No, I mean, open source projects don’t have the capital to create a robust cross device ecosystem of products that all work together well. The concerns of the blogger would not be concerns if he was planning on releasing his own ePaper phone to piggy back off the success of the watch (probably because he knows the watch isn’t going to be “successful” even though he stands to make good money from the effort while people are feeding their nostalgia and/or finding the allure of the future Pebble influencers too much to withstand!).\n\nI mean, and this is the primary problem of always trying to piggyback on someone else’s system. If Apple had piggybacked on Nokia instead of making their own thing, we wouldn’t have the iPhone now. What technology is held from coming into existence today because the entrepreneur in charge of it is instead thinking “Well I’ll just piggyback on someone else’s success”?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Gogobrasil8",
                                    "body": "Thats just not how it works, at all\n \nPebble isn't a smartphone brand and expecting them to create one so you could have something to use their watch with is ridiculous\n \nThat's like saying a mouse company should start making their own PCs, or a headphone company their own iPod\n \nAlso, Apple used a LOT of things from other people, that's how tech works.\n \nMac used Xerox's GUI, Intel and Motorola's chips. The iPhone used Qualcomm modems.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Jusby_Cause",
                                            "body": "At one time, Apple wasn’t a smartphone brand. :) I didn’t say Apple didn’t use anything from anyone else. BUT, it must be said, the WAY that they used things from other folks was far more successful than Pebble’s attempt.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cac2573",
                    "body": "No",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "charliesbot",
                    "body": "Was this translation made using Apple intelligence? Because it makes no sense",
                    "score": 13,
                    "replies": [
                        {
                            "author": "cuentanueva",
                            "body": "There was no intelligence used for that translation.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "BulletTrain2Iowa",
                            "body": "Apple intelligence summaries at work",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Jusby_Cause",
                            "body": "LOL and this is being asked by “charlesbot”? Just gave me a lil’ giggle there. :)\n\nCreating an ecosystem of hardware devices is hard and takes money. The blogger doesn’t have the money and, likely, doesn’t have the engineers required to do the hard thing. Using someone else’s ecosystem is hard, but not AS hard as building your own.\n\nThey’re basically saying that they don’t have a robust cross device ecosystem, but we still want you to buy our devices. Nothing wrong with that, and I wish him well. BUT isn’t it just complaining that they have to go through hoops primarily because they were unable to parlay past success into a wider profitable business?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "K0il",
                                    "body": "Er, not really, hes pointing out that apple straight up does not provide a way to do a ton of things that the Apple Watch does via the phone, like dismissing notifications or replying to texts",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "That is completely untrue. I replied to texts on my Pebble lol",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "K0il",
                                                    "body": "that was achieved by directly integrating against the carrier’s apis and bypassing the phone entirely. iOS doesn’t allow peripheral creators to send text messages via the phone itself, and afaik never have. ",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "PeakBrave8235",
                                                            "body": "Uh… I think you’re wrong on this. You can send texts, dismiss notifications, take action via Pebble on iOS, or could. It was discontinued. \n\nPebble has no cellular functionality. I can’t make claims one way or another. If you have definitive proof Pebble somehow integrated “carrier APIs” (whatever that actually means) when they didn’t even have a cellular modem, nor access to the cellular modem, then I want to read that!",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "K0il",
                                                                    "body": "https://www.reddit.com/r/pebble/comments/kekf9k/comment/gg3925x\n\nhttps://pebble-help-legacy.rebble.io/help.getpebble.com/customer/portal/articles/2166170-sms-messaging2d1a.html?b_id=8308\n\nApple does not provide the necessary apis for third party wearables to take action on notifications. This is true with all wearables other than the Apple Watch, and isn’t unique to pebble. \n\nPebble partnered with major carriers to communicate with them (via the Pebble app) directly because iOS doesn’t provide the necessary APIs to third parties. ",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PeakBrave8235",
                                                                            "body": "So what you’re saying is it’s possible to provide similar functionality while bypassing Apple entirely, and Apple allows that.\n\nGot it.\n\nNo pity for him. Marketing ploy.\n\nAndroid has 3.5 billion users. CEO uses Android. He doesn’t care about iOS. He just wants the marketing because he knows  tech tabloids eat that crap up",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "K0il",
                                                                                    "body": "I wouldn’t say Apple allows it, and I wouldn’t really call it similar functionality. It was only available for a small handful of carriers, your texts sent via that method wouldn’t appear in your messages app, and any iMessage users you replied to would receive your reply as an sms. \n\nIt’s a significantly degraded experience *after* jumping through the hoops to talk directly to carriers. ",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PeakBrave8235",
                    "body": "Agreed",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Jusby_Cause",
                            "body": "It wouldn’t have to work with ANYONE else’s OS if the Pebble had been successful then used that success to build on the business. It’s a fluke that a failed business gets a second chance at all.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "lexd0g",
                                    "body": "are you saying pebble should've made a phone? i think it's kind of insane to expect small companies to make as many products as apple or google do, and it'd also be really limiting to be forced into only buying products from a single company",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Jusby_Cause",
                                            "body": "I’m saying that, perhaps, just an e-ink watch wasn’t enough the first time and as a result, they don’t expect it to be enough this time. Though, they HAVE factored in how many they’ll be able to sell to people who may have bought Pebble watches before… which I only just found out was 2 million people over 4 years. Wow, that’s a run rate that, currently, looks like the Apple Vision Pro.\n\nAnd, it’s not an updated, current, new tech watch, it’s the same old tech that didn’t catch on by 2016.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "lexd0g",
                                                    "body": "it's a niche product, they admit it's not a replacement for an apple watch or a garmin, just an alternative for people who want something simpler and hackable. i'm not sure why they'd have to build their own complete ecosystem when they just want to make a simple accessory to work with existing phones, it would've been even less successful if they said \"okay you can buy our watch but you'll have to change phones too\"",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Jusby_Cause",
                                                            "body": "That market tone makes sense. Thing is, people that actually WANT a Pebble probably won’t care that it doesn’t work with modern phones (in fact, that’s likely a huge benefit!). People with iPhones won’t be surprised that the interaction is different from Android, iPhone Pebble owners already know the interaction would be different. These people know what they’re signing up for with a “new” Pebble watch, so it doesn’t make sense to even go there.\n\nUntil you realize that, in the end, if you’re in a position where you want folks AROUND the world know that you’re releasing a new product, one sure fire way of doing that is to make sure you bag on Apple as you do so. I guarantee that without that blurb, fewer people would know Pebble is still around (I’m sure a couple in this thread found out about it because of his well timed Apple attack :)",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "He’s saying Android is there for the picking — the OS that the CEO himself uses — and has 3.5 billion users/devices.\n\nThere is nothing here except marketing ploys",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xxplosiveWCshit",
            "body": "Apple purposely gimps all smart watches, that aren’t Apple Watches, this is not news.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TWYFAN97",
            "body": "Never expected Pebble watches at least in form to ever make a return. Pretty cool since my first smartwatch was the OG pebble and Pebble Time.",
            "score": 1,
            "replies": [
                {
                    "author": "Entire_Routine_3621",
                    "body": "Same!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "sluuuudge",
            "body": "I find it comical that the piece is titled in such a way that they assume you automatically already know who or what Pebble is. \n\nAfter skimming the article/post I have some idea but I’m struggling to care about the issue.",
            "score": 1,
            "replies": [
                {
                    "author": "PeakBrave8235",
                    "body": "10000%",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "blacksoxing",
            "body": "I'm not getting an android just to use a pebble watch to its fullest capabilities. I'd prefer for them to continue their uphill fight to get the capabilities into the Apple garden and would support them in that fashion than going \"WELL, I'll just get an android and upend my life...\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "dingoonline",
            "body": "I think the only reason why this isn't a bigger issue is because smartwatches as a category are still *relatively* small, as evident by Google's hilariously poorly-prioritised attempts to pull together a smartwatch platform over the past ten years. There's a market, but it's still a niche, mostly successful when oriented to sports.\n\nIf smartwatches themselves were a huge scale market, then I'd imagine this would stick out like a sore thumb to antitrust regulators.",
            "score": -4,
            "replies": [
                {
                    "author": "BulletTrain2Iowa",
                    "body": "I think part of that could be because of the limitations they have on iOS and the demographics of the Android platform. The Apple Watch is a huge success, largely due to the “just works” factor. Third party device manufacturers then have to make the decision of allowing iOS users to use their product with limited functionality as compared to the Apple Watch or not release it for them entirely. On the flip side, they are more than free to release for Android users but only the enthusiasts really go for those as they’re generally the ones who would care or are willing to pay the premium versus the large majority who buy less expensive models to begin with. I think that’s why you only generally see fitness trackers popping off over there due to their lower price points. Could be off base though.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "pholan",
                            "body": "The Apple Watch feels like just another control surface for your phone as well as a discreet way to get notifications and that’s pretty great. Third party devs have access to the minimum to produce a viable smartwatch via bluetooth(notifications, phone calls, messaging, media controls, and address book) with the companion app providing additional services but the available APIs don’t expose everything a developer would need to duplicate the Apple Watch experience. I tried a Fitbit Sense for a while a few years ago with my iphone and it was a competent enough smartwatch but it wasn’t nearly as cleanly integrated as an Apple Watch. Also, Apple‘s restrictions on downloaded code make hosting the phone side portion of a watch app on an iPhone significantly more difficult.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "PeakBrave8235",
                            "body": "It’s a huge success because it’s a reliable, well made device that has saved people’s lives.\n\nAs a former Pebble owner, it’s cute but functionally dumb. And no, I don’t want another one. I’ve moved on with my life lmfao. ",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "Gogobrasil8",
                                    "body": "That's the whole point, to add functionality. And Apple doesn't allow things like dismissing notifications.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "Yeah, as a former Pebble owner, that didn’t matter in the slightest\n\nI got notifications, and I was very happy with that. Same as Apple Watch.\n\nThe difference being that Apple Watch’s vision was a health lab on your wrist. The market saw and wanted that. Pebble failed to adapt, so they faded into irrelevancy and got bought out",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Gogobrasil8",
                                                    "body": "And now it's back. So?\n \nThis isn't about the worth of pebble watches, it's about Apple trying to sabotage the competition and giving us users less choice.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "PeakBrave8235",
                                                            "body": "No, it’s actually about a CEO who made a product and never adapted to what the market wanted, choosing instead to blame third parties for his product failing to meet customer desires (that even a $50 smart band did), and he never got over the bitterness. \n\nNow he’s back as a multi-millionaire with billionaire friends and connections “fighting” against a trillion dollar company. \n\n\nNo pity, and I don’t care. ",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Gogobrasil8",
                                                                    "body": "Only to you, who's really of a mind to antagonize him for some reason \n \nNote that you're the only one who's trying to veer the conversation off-topic.\n \nLook, can I be honest? You clearly don't like criticism against Apple, it seems.\n \nBut my guy, we're only here discussing this because they do it. They block features from their competitors. We'd all be doing something else if they didn't, or if the issue wasn't real.\n \nSo if Apple doesn't care enough to fix these, why should you?",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Jusby_Cause",
                                    "body": "Pebble realizes that, since they don’t have to pay for the OS AND it ran on hardware from YEARS ago, they can put together a working device that runs it for next to nothing and bank on the nostalgia (until people realize that there was a reason they were no longer being made). He’ll probably make decent money from this, which is, of course, the goal.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "PeakBrave8235",
                                            "body": "1000% agreed. I’m tired of people constantly opining nostalgia",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Picollini",
                    "body": "184 million smartwatches sold in 2023 is a niche market?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Wizzer10",
                            "body": "How many of those ran a mainstream smartwatch OS like watchOS, GarminOS or Wear OS? I’m sure there are a bunch of $20 Temu “smartwatches” out there but does that mean the market we’re talking about is that big.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "dingoonline",
                            "body": "Niche when you're talking about the bottom lines of companies like Apple or Google. \n\nThat figure you're citing would include fitness bands and activity trackers. As an accessory market, it is a *relatively* niche market as compared to markets for cars, smartphones or PCs. That doesn't mean it still can't be a big market.\n\nBut there's zero big companies whose bread and butter is selling accessory smartwatches, without it being a sideshow to a much larger business in selling other hardware/software -- or in the case of a brand like Garmin, their main watch and devices businesses.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Internal-Agent4865",
                    "body": "lol niche market. When? 2015?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MajorJakePennington",
            "body": "Pebble v1 was an atrocious product. I had one and it was marred with software issues, hardware quality problems, etc. \n\nBased on that and Eric's latest escapades attempting to skirt around Apple's rules, I wouldn't put any trust in anything he has to say.",
            "score": -1,
            "replies": [
                {
                    "author": "PeakBrave8235",
                    "body": "Agreed ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Entire_Routine_3621",
                    "body": "Yea I made it about half way through the blog post and decided it wasn’t something I’m supporting. I loved my OG pebble but this seems like a downgrade.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "zarafff69",
            "body": "They might be able to do a lot in the EU… I hope so. EU come on!!",
            "score": 0,
            "replies": [
                {
                    "author": "MixAway",
                    "body": "EU too scared to take any more action now 😂",
                    "score": -4,
                    "replies": [
                        {
                            "author": "zarafff69",
                            "body": "Why? What are you talking about? It’s going pretty great with the DMA. Epic’s store is also gaining traction. They just had a free giveaway of KOTOR 1 and 2 on mobile, pretty sick, LOVE those games!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lxe",
            "body": "Apple could take these liberties 15 years ago when their software was objectively better and of higher quality. Consumers didn’t mind and expected Apple software to be superior. \n\nNowadays they have a buggy and incomplete disaster of an OS, years behind in features, being held together by few redeeming core functions. Eventually the consumers will realize this.",
            "score": 0,
            "replies": []
        },
        {
            "author": "shivaswrath",
            "body": "Who? 😝",
            "score": -3,
            "replies": [
                {
                    "author": "iwillletuknow",
                    "body": "🤡",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProfessorFunky",
            "body": "What about using an alternative App Store for the pebble app? At least some issues get solved that way.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Tman11S",
            "body": "Apple restricts basically everything. \n\nImagine allowing the person sold a kidney to buy your phone to actually use that phone the way they wish. Couldn’t be Apple.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Trickycoolj",
            "body": "I mean we knew that 10 years ago.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Wizzer10",
            "body": "Could this be solved through additions to the Bluetooth spec? Bluetooth 7 could require host devices to make standard functions available to generic smartwatches, in the same way any Bluetooth audio device can transmit basic playback controls.",
            "score": 0,
            "replies": []
        },
        {
            "author": "lovefist1",
            "body": "I hope Pebble figures it out because I really liked my Pebble back in the day. That said, I don’t understand one of their criticisms. The one about not being able to sideload apps on iOS. I understand that you can’t and I agree that it sucks, but if I buy a smartwatch I don’t want to have to sideload an app. It should be in the App Store.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Methuen",
            "body": "“Pebble hobbled in iPhones”. Honestly, how hard it is to do a good headline.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Internet_Eye",
            "body": "No surprise to me. It's known that Android offers the most advanced capability apps in comparison to locked down archaic junk iOS :D",
            "score": 0,
            "replies": []
        },
        {
            "author": "devgeniu",
            "body": "I loved my Pebble back in the day. I would never swap my Apple Watch for a Pebble now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SGT_Crunch",
            "body": "I wonder how the new pebble will work! To be delivered in July.",
            "score": -4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -9,
            "replies": [
                {
                    "author": "dblach18",
                    "body": "Congrats, that’s the absolute dumbest false equivalency I’ve ever read in my life.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "cuentanueva",
                    "body": "No. It would be like Ford not allowing to turn left or right if you change the steering wheel.\n\nOr the car won't accelerate if you use Pirelli tyres instead of Michelin ones, or whatever.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "SwiftCEO",
                    "body": "This is more akin to Ford not allowing aftermarket parts to work on their cars…",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "apple-ModTeam",
                    "body": "This comment has been removed for spreading (intentionally or unintentionally) misinformation or incorrect information.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MixAway",
            "body": "Wow they are some ugly ass watches. Wonder how long they’ll last before vanishing again.",
            "score": -3,
            "replies": []
        }
    ]
}