{
    "title": "Apple loses German antitrust fight, faces greater scrutiny",
    "author": "ControlCAD",
    "subreddit": "apple",
    "rank": 5,
    "score": 34,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 8,
    "url": "https://uk.finance.yahoo.com/news/apple-loses-german-antitrust-appeal-101116932.html",
    "id": "1jegvdn",
    "selftext": "",
    "comments": [
        {
            "author": "pirate-game-dev",
            "body": "What they lost was being designated a \"significant market power\".  I mean, pretty obviously they are.  If *the most profitable company in the world with over 2 billion active devices* is not a \"significant market power\" than the phrase has no meaning lol.\n\n> Apple lost its challenge at Germany's top civil court on Tuesday against its classification as a significant market power, a label which gives antitrust regulators more scope and flexibility to scrutinise its business practices.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Maleficent-Cry2869",
            "body": "If apple loses the fight with the EU and they remove ADP, then I will stop using the phone altogether, because that will prove that smartphones are mainly for surveillance. I will use a GSM modem and Signal. I will not receive or make phone calls ever again (I don't do it anyway).",
            "score": 1,
            "replies": [
                {
                    "author": "nicuramar",
                    "body": "> If apple loses the fight with the EU and they remove ADP, then I will stop using the phone altogether, because that will prove that smartphones are mainly for surveillance\n\nThat’s pretty dramatic. It won’t prove anything like that; that remains your opinion. Anyway, this case isn’t even about they.\n\n(Also, Signal would work exactly the same with or without ADP.)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Maleficent-Cry2869",
                            "body": "This will prove that the data I collect does not serve me, but the government.\n\nMy data, photos, notes are part of my brain and are mine alone. No one has the right (yet) to control them. \n\nRemoving ADP's encryption is the same as catching me and trying to medically extract information from my head.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "pirate-game-dev",
                                    "body": "What it proves is that the companies storing this data on your behalf should be empowering you to encrypt it *before they see it*.  That means they *never know* what your files are.\n\nThe only reason this is a problem is Apple doesn't allow anyone to be a complete substitute for their iCloud service.\n\nThis danger only exists because Apple has, at their insistence, become a singular, centralized repository of everyone's backups in a manner they can unencrypt.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "woalk",
                    "body": "Who said anything about Apple removing ADP in the EU?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheVitt",
                    "body": "The beauty of it is that *if* that were to happen, us – weirdo nerds – will come up with another internet-like solution, that'll take a while to regulate, once again.\n\nMaybe ham radios will come back again? Either way, we'll be fine. None of this will stop the people it is meant for, it'll just make life worse for the regular folk, that only wants to watch cat videos on TikTok and share memes.\n\nI have very mixed feeling about the EU right now, and I absolutely hate it. As stereotypical as it sounds, they really should stick to regulating cheese names and and stopping wine bootleggers.\n\nSacré-fucking-bleu",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ControlCAD",
            "body": ">Apple lost its challenge at Germany's top civil court on Tuesday against its classification as a significant market power, a label which gives antitrust regulators more scope and flexibility to scrutinise its business practices.\n\n>Judges at the Federal Court of Justice backed the German cartel office's 2023 designation of Apple as a \"company of paramount cross-market significance for competition\".\n\n>With that, Apple joins Google parent Alphabet and Facebook owner Meta on Germany's growing list of tech giants subject to possible measures curbing their dominance.\n\n>Regulators worldwide have in recent years cracked down on Big Tech in an effort to open up markets to rival start-ups and give consumers more choice. The European Commission's Digital Markets Act (DMA) which became law in 2023 is seen as the benchmark.\n\n>Apple said it faced tough competition in Germany and that it disagreed with the court's decision.\n\n>\"It neglects the value of a business model that places the privacy and security of users at its centre,\" a spokesperson for the company said in an emailed statement to Reuters.\n\n>While the court ruling is a win for the German antitrust watchdog, the crackdown by powerful EU regulators is more of a threat to Big Tech, said Assimakis Komninos, a partner at White & Case.\n\n>\"The Court is saying that German legislation can stand. But the Digital Markets Act's scope is not affected and in real life it basically remains the primary standard for Big Tech,\" he said.\n\n>A judge had indicated in January that the German court would side with the regulator.\n\n>The court also declined to consult with the European Court of Justice in Luxembourg on the case, as requested by Apple's legal team.\n\n>Apple's App Store has faced particular scrutiny in Europe, where regulators have flagged concerns over the wealth of data it gathers on user behaviour.\n\n>Cartel office president Andreas Mundt welcomed the court ruling in a statement.\n\n>\"This means that the highest court has confirmed that Apple is subject to stricter abuse control,\" Mundt said.\n\n>\"Our ongoing review of Apple's tracking regulation for third-party apps is therefore on a solid footing, and we are working flat out on this case and other cases against the major internet companies,\" he added.",
            "score": 1,
            "replies": []
        }
    ]
}