{
    "title": "Apple has revealed a Passwords app vulnerability that lasted for months. Passwords users were exposed to potential phishing attacks for three months until an iOS 18.2 patch.",
    "author": "Knightbear49",
    "subreddit": "apple",
    "rank": 1,
    "score": 381,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 97,
    "url": "https://www.theverge.com/news/632108/apple-ios-passwords-app-bug-vulnerability-phishing-attacks",
    "id": "1jegvk1",
    "selftext": "",
    "comments": [
        {
            "author": "santaschesthairs",
            "body": ">This issue was addressed by using HTTPS when sending information over the network.\n\nThey weren’t already? Huh?",
            "score": 1,
            "replies": [
                {
                    "author": "nicuramar",
                    "body": "If you read the article,\n\n> the Passwords app was sending unencrypted requests for the logos and icons it shows next to the sites your stored passwords are associated with.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pirate-game-dev",
                            "body": "It sounds like the issue is Apple's servers don't necessarily require HTTPS.  Requests like that should be throwing errors because they cannot resolve.  HTTP should not have made it past the first developer that pasted the URL in when they were making their Passwords app.  Using HTTP to access web domains should be an automatic red flag during app review.\n\nOnce-popular browser extension [HTTPS Everywhere](https://en.wikipedia.org/wiki/HTTPS_Everywhere) (2014 - 2023) *retired* because virtually everywhere *does* use HTTPS now.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "mrRobertman",
                            "body": "The Verge misses out some key details from the original [9to5Mac article](https://9to5mac.com/2025/03/18/apples-passwords-app-was-vulnerable-to-phishing-attacks-for-nearly-three-months-after-launch/) (and the original source, Mysk):\n\n> This prompted the duo to investigate further, finding that not only was the app fetching account logos and icons over HTTP—it also defaulted to opening password reset pages using the unencrypted protocol. “This left the user vulnerable: an attacker with privileged network access could intercept the HTTP request and redirect the user to a phishing website,\n\nThe Mysk video linked in both articles show that the app using HTTP and having the live.com link intercepted and displaying a different page on the phone.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RoughAttention742",
                            "body": "The article confirms they weren’t using HTTPS lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheSammy58",
                    "body": "oops! just a silly little mistake haha not a big deal! 😋💖",
                    "score": 1,
                    "replies": [
                        {
                            "author": "hauzs",
                            "body": "Privacy first!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BurdensomeCumbersome",
                                    "body": "*Not available in China",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "nicuramar",
                            "body": "Read. The. Article. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "radikalkarrot",
                                    "body": "I did read it and states they weren’t",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "--dick",
                    "body": "This is insane. I noticed this a long time ago with Little Snitch that the passwords app would send requests over port 80. I thought that was odd so I blocked them",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrRobertman",
            "body": "Some terrible reporting by the Verge here as they miss a key detail from the original article. The original [9to5Mac article](https://9to5mac.com/2025/03/18/apples-passwords-app-was-vulnerable-to-phishing-attacks-for-nearly-three-months-after-launch/) says this:\n\n> This prompted the duo to investigate further, finding that not only was the app fetching account logos and icons over HTTP—it also defaulted to opening password reset pages using the unencrypted protocol. “This left the user vulnerable: an attacker with privileged network access could intercept the HTTP request and redirect the user to a phishing website,\n\n\nBut the Verge says this:\n\n> As 9to5Mac writes, the Passwords app was sending unencrypted requests for the logos and icons it shows next to the sites your stored passwords are associated with. The lack of encryption meant an attacker on the same Wi-Fi network as you, like at an airport or coffee shop, could redirect your browser to a look-a-like phishing site to steal your login credentials. It was first discovered by security researchers at app developer Mysk.\n\nThe Verge neglects to mention that the app was using HTTP to open the password reset pages. The article makes it seem like no big deal because they only mention the HTTP requests for icons/logos rather than the actual issue.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LogMeln",
            "body": "been recommending bitwarden for years now. been a user for over 7 years now and the last 6months has been transformative for the brand. seems very ios-like now",
            "score": 1,
            "replies": [
                {
                    "author": "c010rb1indusa",
                    "body": "The biggest problem with bitwarden and other third party password managers on iOS is they aren't allowed to prompt you to save new passwords or update them even if you set them as the default. They are allowed to autofill but if a user creates a new account or changes a password on their phone, that change doesn't get reflected in bitwarden unless you are doing it from the bitwarden app itself or an app that supports bitwarden directly. But Safari or a random app's login? Your SOL.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "manolox70",
                    "body": "How is it more iOS friendly now? I have it and would love for Bitwarden to prompt me whenever i get a password check as opposed to manually going into the app myself.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RudeInvestigatorNo3",
                            "body": "In the BitWarden app go to Settings -> Autofill and click on both Password Autofill and App Extension.   It’ll guide you to set up.  \n\nThen you can go into Account Security and enable “Unlock with Touch ID/Face ID” and/or a Pin instead of having to type your full password out.  ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LogMeln",
                                    "body": "this. \n\ni set bitwarden as my default password, 2fa, and passkey app",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "moch1",
                                            "body": "Having 2fa and passwords in the same app just seems like a bad idea to me.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LogMeln",
                                                    "body": "like 1password? i use sms 99% of the time tho",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "neodude237",
                                                            "body": "SMS is just as bad if not worse",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "LogMeln",
                                                                    "body": "so u have an app for your passwords and a separate app for 2fa? at a certain point i feel safe enough to optimize for good UX :)",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "neodude237",
                                                                            "body": "Yes I do. I use a combo of a password manager and a dedicated 2FA code generation app to try and minimize the risk of catastrophe if one got compromised. It’s not perfect and having them both in one app would be more convenient, but at least for me the compromise in UX is worth the safety bump, however marginal.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LogMeln",
                                                                                    "body": "gotcha -- i know it only takes one time for me to learn my lesson but i feel ok with the way i have things set up with bitwarden as my sole app. i use okta for work related things but for the most part i feel as though i do follow some best practices, like having backup accounts for access, and regularly swapping out my passwords and doing checks for my info on the darkweb, etc. either way, i endorse bitwarden all the way. great app.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "neodude237",
                                                                                            "body": "Yep - BitWarden is fantastic and is overall the best in the game IMO",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "sergiotkaczek",
                                                            "body": "SMS is not a good 2fa either. 2fa auto generated code apps are much better.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "the_bighi",
                                                    "body": "Why? If your password leaks from a website somehow or you reuse passwords, hackers won’t have an easier time finding your 2FA code just because in your computer they’re in the same app.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "moch1",
                                                            "body": "The passwords apps themselves can become compromised and then your second factor is useless. \n\nPassword managers have been compromised before and will be again. ",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "neodude237",
                                                            "body": "If your master password ever gets compromised, you’re done if you have both factors of auth in one place. If you use a separate app to keep your codes, you have a chance of protecting those accounts, still. Now if your whole device with both those apps is compromised, you’re still potentially screwed.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jdotmassacre",
                    "body": "Does it cost?  The app (on iOS at least) is free and doesn't mention in-app purchases.  How do they make money?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LogMeln",
                            "body": "its free. they make money from premium users who want to use it for family members or higher levels of security. \n\nbitwarden also saves credit card and other sensitive information which i like. also works across all devices and OSs not just apple",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hm9408",
                                    "body": "I pay for the same stuff from the free tier, but I just want to support it. It's 10 bucks a *year*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "staleferrari",
                            "body": "They offer paid plans for regular users and businesses like every other 3rd party password managers.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "toycoa",
                            "body": "There is a $10 a year premium subscription, or 83 cents a month. I’ve paid for 4 years so far and feel like premium is a great value",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cuentanueva",
                    "body": "> been recommending bitwarden for years now\n\nI know I am in a small minority (although not the only one), but the lack of offline editing is a deal breaker for me.\n\nNo, I don't want just read access offline. I want editing offline as well.\n\nYes, sometimes I need to update a password (or note, or a card PIN, or whatever) when I don't have internet access (like maybe updating your router/networks password) or my internet is failing or it's spotty (subway, trains with through tunnels, poor reception areas, etc) or I don't want to connect the current device to the network (e.g. laptop on a dodgy public wifi) or the server is having issues (mine if self hosted or bitwarden's) or if I self host but only want LAN syncing for security reasons, and many other reasons.\n\nBut I know it's a lost cause. I've seen it being requested for over 7 years, and it was even on the roadmap at one point saying it would be implemented that year even... and then nothing.\n\nIt's a shame to be honest, but oh well...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LogMeln",
                            "body": "ahh interesting. ive never needed that use case so i guess i never experienced that frictionpoint before. what do you use now that does this?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cuentanueva",
                                    "body": "Until I find a better alternative, KeePass because it's offline, free and open source. And has clients on each platform you want (windows, linux, mac, android, iOS) that all work with the same database.\n\nThen you can put the database wherever you want (Dropbox/Drive/etc, your home server) or use something like syncthing to synchronize them and that's it.\n\nIt's obviously more not as simple as cloud password manager, but it's not too bad either.\n\nIf you put a _very_ strong password on your database, and then create a free Drive/Dropbox/etc account with a different _very_ strong password, then it should be seamless. Just make sure to backup your database somewhere else as well. Just in case. \n\nYou can back it up very easily as well, if you have a any type of home server (NAS, Pi, etc), you can sync that cloud account to your home server, and then from there back it up to some _other_ free cloud server provider. And you would end up with 3 copies + the local cache on each of your devices. \n\nFrom there it can be more secure adding a keyfile, hardware keys, whatever you want.\n\nSo basically it can get from relatively simple to as complex as you want. But as I said, it's not so user friendly compared to other services out there.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "colemaker360",
                    "body": "Bitwarden is great, but you can only share with one person on the free tier. For sharing family passwords (garage codes, streaming services, pizza delivery logins), Passwords.app is better, and easier for the kids to use.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LogMeln",
                            "body": "gotcha -- good to know for the future :) for now its just the wife and I",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MikeyMike01",
                    "body": "Can I sync it across my devices? I couldn’t last time I tried.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LogMeln",
                            "body": "sync works for me. my wife and i both use it and have shared folders for things we share. it syncs properly across my mac mini, macbook air, macbook pro, ipad pro, ipad mini, iphone 14pro, iphone 12pro. when i go over my parents to help them with their computer i will log into my vault via the web to access anything i need there too.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aussiedeveloper",
                    "body": "The open source self hostable Vaultwarden is a better option imo.\n\nCompatible with all Bitwarden clients.\n\n100% free.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shoddy_Ad7511",
            "body": "This is why I never use public wifi",
            "score": 1,
            "replies": []
        },
        {
            "author": "gAWEhCaj",
            "body": "This doesn't shock me since Apple has always adopted the approach of security through obscurity which opens the door for things like this to occur and go unfixed for months leaving users vulnerable",
            "score": 1,
            "replies": []
        },
        {
            "author": "radiantai2001",
            "body": "I <3 1Password",
            "score": 1,
            "replies": [
                {
                    "author": "aussiedeveloper",
                    "body": "If you’re not self hosting a password manager, you’re blindly trusting someone else. 1Password isn’t special.\n\nLol @ the vote downs. Voting down doesn’t change facts 🤡",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mbhwookie",
                            "body": "99.99% of the people are not going to go about self hosting. Password managers are far better than people using the same password or simple variations of the same password. Password managers are solution to appeal to the masses and provide protection from the most common type of vulnerability. I wouldn’t call it blindly trusting, it’s more taking a small risk for convenience \n\nI don’t think you’re being downvoted for not being correct or having a point; you’re being downvoted for being annoying about it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "aussiedeveloper",
                                    "body": "If you don’t have the technical knowledge to self host you can still just use a KeepPass file and use Dropbox/iCloud to sync the file across all devices. The file is then encrypted so even if the third party is compromised your passwords aren’t. \n\nHow am I being annoying about it? Pointing out a valid risk and suggesting alternatives isn’t annoying in my opinion. Some people just like being ignorant about their risks and lash out when the risks are pointed out to them.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mbhwookie",
                                            "body": "You’re thinking of solutions that are about 2 steps too complicated for the every day user.  Not complicated out of ignorance (sometimes that), but complicated by means of friction in the process. \n\nIf I recall, 1Password does or can do exactly what you just suggested. \n\nLocal or cloud stored encrypted file.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "aussiedeveloper",
                                                    "body": "When it comes to protecting passwords I care about the solution not the friction.\n\nBut you (and others) do you.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ikilledtupac",
            "body": "Remember when you could just hit \"enter\" a few times and it would let you unlock a Macbook lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "IsThisKismet",
            "body": "It doesn’t really matter much since every website we go to have *also* been exploited or hacked at some point or another.",
            "score": 1,
            "replies": [
                {
                    "author": "DaringDomino3s",
                    "body": "This. All our passwords and information is out there it’s just a matter of when we get chosen to be hacked lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jrsmith6661",
            "body": "WTH let me delete them all. I’ve been using it as a backup to 1Password and thinking about ending my subscription if I liked it  eventually…",
            "score": 1,
            "replies": []
        },
        {
            "author": "RyomaNagare",
            "body": "been using 1password for years, would never trust apple, google, microsoft or any of the free ones",
            "score": 1,
            "replies": [
                {
                    "author": "Admiral_Ackbar_1325",
                    "body": "Just you wait for 1password to get breached, just like LastPass.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RyomaNagare",
                            "body": "1Password is Encrypted and password protected,  there’s a huge string  of text used to decrypt and then you enter your “ One password”  even if breached they cant see your data\n\nHonestly if someone hacks your 1Password it would be via a breaking into your computer, and sniffing your clipboard or something like that",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Voidfang_Investments",
                            "body": "Doesn’t matter if it gets breached. It was designed to protect even with a breach.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WholeMilkElitist",
                                    "body": "Yeah, plus this guy is weird praying on the downfall of 1password, some people are such brand zealots lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Admiral_Ackbar_1325",
                                            "body": "I am not praying on the downfall of 1password lol, I'm just saying that every time someone says I use \"X\" because I don't trust \"y and z,\" that password manager inevitably gets breached too.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WholeMilkElitist",
                                                    "body": "Fair, either way 1Password's secret key keeps your data safe even in the event of a breach",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "paribas",
                            "body": "1password is more secure ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "theflintseeker",
                                    "body": "It’s more secure with the vault concept for sure, we shall see how much more secure ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Disastrous_Student8",
                    "body": "Nah i prefer different passwords with some logic only I can understand. I only remember the logic.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dramatic-Okra1895",
                            "body": "I like the idea, but too lazy to change all of the passwords. \nSometimes I use something like SmellyCunt123Reddit\nSmellyCunt123Google",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Disastrous_Student8",
                                    "body": "Haha nah thats way too similar on different sites.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RyomaNagare",
                            "body": "I dont know my passwords they are all 32 letter random strings with numbers and symbols.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Disastrous_Student8",
                                    "body": "You probably autogenerate them while registering. I've never autogenerated a password in my life. Roo much work at start bit godsend in the long run.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cuentanueva",
                            "body": "You can do that and also save it on a password manager. I do something similar, and it differs in complexity depending on how much I care about the site. Reddit? Low priority. Bank Account maximum complexity allowed.\n\nBut if I forget which algorithm I used (or tweaked it for whatever reason), I'm covered.\n\nI hate the thought of not knowing my passwords, but love the reassurance that if I forget it I can check it up again.\n\nAnd can use autocomplete and that sort of thing as well.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Disastrous_Student8",
                                    "body": "I dont trust these services. Not that I think they're shady, but if they blow up they blow up in bulk.\n\nI actually just use library of babel site and remember the page of the book where my passwords are written for the backup.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Og-Morrow",
            "body": "Lol this is funny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aggressive_Yellow373",
            "body": "Password managers are amazing, but no one should be using google or apple as a password manager",
            "score": 1,
            "replies": [
                {
                    "author": "trollied",
                    "body": "Why?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CivilProfessor",
                            "body": "One reason would be if your Apple ID is lost or stolen then you are screwed. All your passwords are gone with it. You should have a standalone password manager not tied to any of your other accounts.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Reach-for-the-sky_15",
                    "body": "I like the part where you explained why",
                    "score": 1,
                    "replies": [
                        {
                            "author": "redrumyliad",
                            "body": "You’re locked into a billion dollar companies instead of an open source one. They could out it behind a paywall or anything else if they want to.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheUndertows",
                                    "body": "I could win powerball before that happens ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "redrumyliad",
                                            "body": "Probably but I’m not using a password manager provided by either of these players. :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TurnoverAdditional65",
                                    "body": "Then just switch to another one like everybody did with LastPass -> BitWarden.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "redrumyliad",
                                            "body": "I did.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deepcookiz",
                    "body": "Google is the best in the world at finding exploits. They find iOS zero day exploits all damn time",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Happy-Lynx-918",
                    "body": "Becaus every other password managers except lastpass are better",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "succulent_samurai",
            "body": "Everyone should set up a personal vpn to their home network, it’s not super expensive (like $50 for a raspberry pi and an sd card) and super easy to do following a tutorial",
            "score": 1,
            "replies": [
                {
                    "author": "dick_for_rent",
                    "body": "Why?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "glizzygravy",
                    "body": "Works until it doesn’t. I’ve tirelessly tried to use my server as an exit node but it always has slow days for no reason at all",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "goblinrum",
                    "body": "If you have an existing android tv or apple tv, you can use that as an exit node. Or anything you already keep on that runs android/Linux/windows/iOS/macOS etc\n\nInstall tailscale and press maybe two buttons total. \n\nFor those that need this information, an exit tunnel is basically a VPN to your home network.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ChangeQuick",
                            "body": "What does this enable? If I have tailscale on my phone and a home server, what can I do with that?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "goblinrum",
                                    "body": "As long as your home network is secured, it will look like you are accessing whatever resource from your home network like any other full tunnel VPN.\n\nif you are on an unsecured network without individual client encryption, someone else on the network could potentially redirect your page or read all of the data you are sending in plain text. A VPN here would give you a secure connection (to another hopefully secure location). For example, a tailnet is end to end encrypted, so anything that you send on it, including your VPN connection to your home server, is encrypted. \n\nHowever, this doesn't stop attacks once it leaves the tailnet. If you were accessing things using http on the web, you are still exposed to the same threats. It's just so much easier when the attacker is on the same exposed network as you and can read everything you send in plaintext",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cuentanueva",
                    "body": "Tailscale or ZeroTier are a much simpler solution, which may more friendly to the typical Apple user to access your home network.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}