{
    "title": "Why doesn't Musk's self-proclaimed, regular use of a controlled substance get more attention?",
    "author": "Meh-_-_-",
    "subreddit": "LateStageCapitalism",
    "rank": 457,
    "score": 865,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 54,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1ii2q90/why_doesnt_musks_selfproclaimed_regular_use_of_a/",
    "id": "1ii2q90",
    "selftext": "Elon likes ketamine. Adolph liked cocaine and amphetamines. They share delusions of grandeur and philosophy, and like the same salute. Often headlines of criminals under the influence reference such facts, but nowhere have I seen something to the effect of \"Ketamine-fueled Musk\".",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "AntiquarianThe",
            "body": "It has the same lack of weight as remembering Hitler (or Trump for that matter) as convicted criminals. Those particular crimes, bad and disgusting as they are, are absolutely nothing in comparison to the gross inhumanity and evil that they have done to the rest of the world but were never charged for.\n\n  \nElon is not a fascist piece of trash because he does ketamine, he's a fascist piece of trash because of the policies he endorses and the reactionary warfare he supports and shelters on all fronts.",
            "score": 360,
            "replies": [
                {
                    "author": "DirtySouthProgress",
                    "body": "I completely agree, but I do think his drug use is relevant because the right is real anal about drug use in general. Your point still ultimately stands though. His ketamine use is nothing compared to throwing up Nazi salutes, and that should be true even for most of the Republican base.",
                    "score": 65,
                    "replies": [
                        {
                            "author": "thispartyrules",
                            "body": ">the right is real anal about drug use in general\n\nNot if they're the ones doing it",
                            "score": 60,
                            "replies": [
                                {
                                    "author": "droyster",
                                    "body": "The right is only consistent insofar as their unwavering belief that rules apply to you, but don't apply to them.\n\nThey can be drug addicts or adulterers or pedophiles and that's a-okay, but if a leftist even looks at marijuana then thats a sign of moral degeneracy and and they need to be locked up forever.\n\nHypocrisy and conservativism are the same thing.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "thispartyrules",
                                            "body": "Rush Limbaugh called for the death penalty for drug dealers while being addicted to OxyContin",
                                            "score": 14,
                                            "replies": []
                                        },
                                        {
                                            "author": "imalusr",
                                            "body": "They believe it’s ok because they see themselves as being on a righteous and godly path but succumbing to temptation from the devil and those who reject god.  It didn’t matter that Brett Kavanaugh raped someone as long as he said he was born again and chose Jesus. \n\nAnd some, like Trump, like Musk, and like every evangelical pastor have learned that it is very easy to manipulate people who see the world this way for their own gain.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Stewth",
                    "body": "he's rapidly catching up to Rupert Murdoch in the \"let's see who can be the biggest pile of shit individual who does the most damage to society\" race",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Meh-_-_-",
                    "body": "I believe he is a \"fascist piece of trash\" regardless, but perhaps we can agree that ketamine can cause manic-like behavior in some individuals which may just exacerbate such tendencies?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "AntiquarianThe",
                            "body": "If we wanted to make excuses for Musk then we could, but nobody needs to or should make excuses for Nazis.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "glumbum2",
                    "body": "People on the right seem to get a mega huge pass. People aren't rude enough to them.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AntiquarianThe",
                            "body": "Elon deserves a outcome far more terminal than simply being rude to him. \n\nAs do many reactionaries, fascists and fascist apologists and fascist collaborators.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Odd-Youth-452",
            "body": "Because he's a wealthy white man.",
            "score": 80,
            "replies": [
                {
                    "author": "thedreadcandiru",
                    "body": "Remember how they pushed the lie that Obama was all coked up?\n\nSh*t, I wish that b*tch *had* been coked up...\n\nEdited, cause the \"b\" word was too strong for LSC, apparently. Eyeroll.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "_thetommy",
            "body": "laws don't apply to the wealthy.",
            "score": 25,
            "replies": []
        },
        {
            "author": "Anxious_Katz",
            "body": ">“The Nixon campaign in 1968, and the Nixon White House after that, had two enemies: the antiwar left and black people. You understand what I’m saying? We knew we couldn’t make it illegal to be either against the war or black, but by getting the public to associate the hippies with marijuana and blacks with heroin, and then criminalizing both heavily, we could disrupt those communities. We could arrest their leaders, raid their homes, break up their meetings, and vilify them night after night on the evening news. Did we know we were lying about the drugs? Of course we did.” \n\n\nRecreational drug use has absolutely nothing to do with the moral value of a person's character. And as leftists who value true personal liberty we should work to remove this stigma that has been drilled into our brains after years of \"war on drugs\" propaganda. \n\n\nKetamine by itself is just an anesthetic that can cause disassociation depending on the dosage. Many people take it and the experience enriches their lives and helps them move past certain mental blockages because it simply offers them a different mental perspective. \n\n\nThe fact that it's being abused by a person devoid of any introspection is just another testament of how shitty Musk is, because he can't even get there with the extra help of psychodelics. The drugs themselves aren't inherently bad or evil. We should work on ourselves to become more accepting of untypical ways of life in order to attract more people on the fringes to our cause, trust me there are so many people in these underground scenes that feel the oppression of capitalism every day but they think leftists are sticks in the mud who would judge them for dropping acid every once in awhile. I recommend everyone to search for acid communism and try to keep an open mind. This type of shit is just as infuriating as red scare propaganda to me!",
            "score": 43,
            "replies": [
                {
                    "author": "AntiquarianThe",
                    "body": "Completely agree with every word, 100%. Your post should be at the very very top.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fearless_Anywhere344",
            "body": "because they are *all* on drugs",
            "score": 21,
            "replies": []
        },
        {
            "author": "Hawmanyounohurtdeazz",
            "body": "he has a tame doctor who prescribes it for him, not sure how that works as I don’t know of any jurisdiction where it’s approved as a treatment, but money achieves lots of things.",
            "score": 12,
            "replies": [
                {
                    "author": "practical_lem",
                    "body": "Ketamine actually is approved treatment for depression (when other treatments have failed).\n\nSource: I use therapeutic ketamine.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Hawmanyounohurtdeazz",
                            "body": "Thanks, didn’t realise it had been approved 🙏 I’m just waiting for MDMA 😂",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "Also for PTSD.\n\nSource: I have PTSD and treatment resistant depression + did intravenous ketamine therapy at a doctor’s office.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Meh-_-_-",
                    "body": "\"tame\" doctor sounds like speculation to me. Probably about as tame as Michael Jackson's doctor.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Hawmanyounohurtdeazz",
                            "body": "Michael Jackson had a tame doctor, that’s the point 🤷‍♂️ you think rich people are waiting in line for an appointment?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cindymartin67",
            "body": "Wait til you hear how adderall “flowed” through the White House his last term…. Wayyyy too close for comfort. I’m pretty sure they are literally having paranoid delusions and that’s why they are rooting through everything like methheads through carpet",
            "score": 9,
            "replies": []
        },
        {
            "author": "CrashCulture",
            "body": "Why? Drugs are only harshly punished if you are poor or black, preferably both. Rich white guys can do cocaine all the time and nothing ever happens to them.",
            "score": 6,
            "replies": []
        },
        {
            "author": "alexdgrate",
            "body": "We're going to see fElon, in a near future on prime time tv, excusing himself from all the shit he's been pulling, blaming it on it's substance abuse. Again deflecting blame on anything, other than himself, as costumery.",
            "score": 6,
            "replies": []
        },
        {
            "author": "mm902",
            "body": "It's called White Privilege.\n\nAlso being on the side of MAGA, he has a rabid vociferous mob gatekeeping his ego.\n\nIt doesn't hurt that he's a celebrity faux inventor billionaire. That (falsely - but when had that ever mattered) purports to the american myth of pulling yourself up by your bootstraps. This can cause a dissonance in the other half of the population to sirta give him a free ride.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Maj3stade",
            "body": "Because it would be counterproductive for the left to do so.\n\nThe left believes that drug users should not suffer stigma and should be resocialized.\n\nThe right does not necessarily believe otherwise, but it uses this to incarcerate minorities, so using this argument will only make the right point out a contradiction in the left.\n\nYou are making the mistake of thinking that they really care about drug use when in fact they care about those who are using drugs.",
            "score": 16,
            "replies": [
                {
                    "author": "fat-froggy",
                    "body": "Then you counter with “Elon should be under medical watch - not in a position of power.” That’s a reasonable thing to say about a drug addict that also points out someone in our government should not be openly using a controlled substance. I feel like the left needs to start getting better at framing this shit bc the right is constantly leading us around in the rhetoric with the hypocrisy accusation and it’s embarrassing and stupid lmao",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Maj3stade",
                            "body": "“The only position of power he is right now is being the CEO of his own business. Do you want everyone to do drug tests and lose their job if they don’t pass it? Because that’s something we agree on” - a conservative who is more than happy to sacrifice Elon if it means incarcerating minorities",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "fat-froggy",
                                    "body": "Sure except that argument starts with “the only position of power he is in right now is ceo of his own business” which is patently false. It is very well known his very young employees are infiltrating the different departments, with Elon himself having access to the treasury payment system. Your argument assumes the law actually holds the wealthy accountable which it very well does not. Otherwise I agree with ya though.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "uguu777",
            "body": "DC is full of gerontocrats in their 70s+ they all popping some pills to stay alive lol \n\nthey need great healthcare so they can stay alive and deny it for others a bit longer",
            "score": 4,
            "replies": []
        },
        {
            "author": "deathdefyingrob1344",
            "body": "I’ve had ketamine and found it A) utterly bizarre and B) Really not that big of a deal. For me anyway. I think he is probably just a fucking asshole and ketamine is the least problematic thing about him at present",
            "score": 8,
            "replies": []
        },
        {
            "author": "joewoody88",
            "body": "He has money.",
            "score": 3,
            "replies": [
                {
                    "author": "grimandbearer",
                    "body": "Underrated answer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jammerheimerschmidt",
            "body": "Probably has something to do with the fact that he's a white billionaire",
            "score": 2,
            "replies": []
        },
        {
            "author": "Civil-Psychology-281",
            "body": "Is this a shitpost? You're saying you want to see trivial, dramatic headlines about him using prescribed ketamine for mental health issues? \n\nHe's doing actual bad shit, let's talk about that.",
            "score": 8,
            "replies": [
                {
                    "author": "Meh-_-_-",
                    "body": "I appreciate the sentiment and, no, I did not mean it as such. While everyone's physiology is different, ketamine is known to drive some into manic behavior. My post evidently lacked clarity and nuance and I did not intend to suggest \"why are there not more articles about his substance use specifically\", but rather why is there never mention of the fact he is using a substance known to cause some aberrant behavior in some users (prescribed or not)... hardly EVER, in any of the many articles that are flooding us from so many sources (perhaps parenthetically, between commas, maybe an em dash here or there). I happen to find it relevant. He wants to colonize Mars and be the leader of the Fourth Reich, for Christ's sake.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "DirtySouthProgress",
                            "body": "He was definitely geeking when he hit the sieg heil. He's still a Nazi regardless, but I do think its a fair point that maybe he wouldn't be doing as much crazy shit if he wasn't an addict.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Celestial_Cowboy",
                                    "body": "It was so obvious him and the other tech bros were flying high throughout the inauguration.  So obvious in fact, I agree with OP that it is odd no one mentions these things.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Correlation is not causation.\n\nDo you know how many regular people’s lives have been saved by IV ketamine therapy? People with PTSD, treatment resistant depression, etc? Do you know how many people with ADHD genuinely benefit from prescription amphetamines? Who don’t engage in the wild and unfathomable behavior you’re blaming these on these drugs? \n\nYou essentially went on some diatribe in a leftist / communist sub about how we should be judging and criticizing Elon‘s drug use *which definitely caused his recent behaviors* (I’m being sardonic here) and how we should be cracking down on that  (how?) as if it will make a difference and without any real research into the other uses of ketamine, ketamine therapy, adhd medications, etc. \n\nThis is an ableist and ignorant post. Elon is a piece of s h i t and a Nazi with or without the drugs. Who the fuck cares what kind of drugs he’s using? Weed is legal in many states now. Saw your comment below about Biden hypothetically lighting a blunt - who gives a fuck. We hate them all. I don’t care what drugs someone is using or doing, legally or illegally, as long as they’re not hurting anyone else.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Meh-_-_-",
            "body": "Legal. Right. So if Biden (or insert token democratic here) lit up a fat blunt on their balcony no one would throw a fit?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "As a leftist young woman with PTSD and treatment resistant depression who has benefitted greatly from intravenous ketamine therapy (unrelated to mindbloom, unrelated to Elon) I would appreciate it if people didn’t demonize lifesaving pharmaceutical drugs that aren’t SSRIs (which also can have their purpose and serve people well!) because an unfavorable, egregious character “likes” them. \n\nAs someone with adhd and dyscalculia who takes a nonstimulant adhd med in addition to a stimulant and who doesn’t use recreational drugs, I’d appreciate it my prescriptions weren’t demonized because a sociopathic serial killer liked to abuse them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "russa111",
            "body": "Because prescription Ketamine is legal",
            "score": 1,
            "replies": [
                {
                    "author": "CMarieDalliance",
                    "body": "I mean, I'm pretty sure amphetamines were at the time too.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "russa111",
                            "body": "Yeah absolutely. Look, I fucking hate Elon and the shit that he is doing, but I have a prescription for Ketamine and it has saved my life and has helped so many people in my life. We should not support the idea that Ketamine is what is causing Elon to perform a coup d’état.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "CMarieDalliance",
                                    "body": "Oh definitely not. He'd be a capitalist with or without the drugs.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Prescription amphetamines are still legal. I know because I have adhd and am legally prescribed a very low dose (which I haven’t even been able to get because it has been back ordered everywhere.)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Theblackjamesbrown",
            "body": "Not sure pal but interesting you're on first name terms with Hitler",
            "score": 0,
            "replies": [
                {
                    "author": "Meh-_-_-",
                    "body": "😂 🔥",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "grifola",
            "body": "What kind of left ideology allows you to judge people for their personal decisions.  An adult can do what they like with their own body. I bet you are also in favor of COVID vaccine mandates",
            "score": -5,
            "replies": [
                {
                    "author": "CMarieDalliance",
                    "body": "You are most likely absolutely right. But consider, the understanding that psychoactive substances may impair decision making may be held without moral judgment. I wonder why you didn't extend that generosity to this post.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "grifola",
                            "body": "I'm tired of these so and so is like Hitler posts. It is over the top bs that cannot be taken seriously.  The reactionaries are on all sides of politics these days it seems.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}