{
    "title": "The Reddit experience in a nutshell.",
    "author": "5upralapsarian",
    "subreddit": "LateStageCapitalism",
    "rank": 443,
    "score": 1222,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 58,
    "url": "https://i.redd.it/5iublko01che1.jpeg",
    "id": "1iibew3",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jeansg",
            "body": "US propaganda through the years did a hell of damage to the World. Lots of brainwashed folks in the US and Europe",
            "score": 261,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -1,
                    "replies": [
                        {
                            "author": "A-CAB",
                            "body": "This is a leftist subreddit, right wing comments will be removed and the user banned.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "thehourglasses",
                                    "body": "Fuck yeah mods, sic ‘em!",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Loud-Ad-2280",
            "body": "But didn’t you know communism killed a bazillion people?!?",
            "score": 163,
            "replies": [
                {
                    "author": "maghau",
                    "body": "Oh, you’re behind on the latest numbers - it's actually been revised to 2 gazillion people.",
                    "score": 107,
                    "replies": [
                        {
                            "author": "Loud-Ad-2280",
                            "body": "Makes sense, it would kill all life on earth if it wasn’t for the CIA protecting us",
                            "score": 58,
                            "replies": [
                                {
                                    "author": "maghau",
                                    "body": "Yes, praise be to the defenders of freedom and champions of democracy around the world!",
                                    "score": 30,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "dyingofdysentery",
                            "body": "2 whole gazebos?",
                            "score": 18,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Specific-Level-4541",
                    "body": "One hundred gazillion, actually. \n\nInsert quote about tragedies and statistics, attribute to Stalin.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "MedicineBottle-",
                            "body": "100 million people die per minute due to communism, didn't you know? we're already an extinct species thanks to the commies!",
                            "score": 21,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sans_Moritz",
                    "body": "Everything that has ever died ever, in the history of life on earth, was killed by communism. It's common knowledge!",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Loud-Ad-2280",
                            "body": "If a tree falls in the woods and nobody is around to blame communism it was still communisms fault",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Kaymish_",
                            "body": "Also everything that will die or was never born was communism too, so just precount all those deaths and non births.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "maghau",
                            "body": "The meteor that 'supposedly' killed the dinosaurs was actually a big spoon with the name 'Joseph' engraved on it.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Edge-master",
                    "body": "200 gorillion actually",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fby54",
            "body": "iPhone Venezuela 100 billion dead",
            "score": 30,
            "replies": [
                {
                    "author": "LuisMataPop",
                    "body": "iPhone 30 cuba trillions death incarcerated",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShiningRayde",
            "body": "I wonder how close the average Chinese citizen is to a US base, vs the average US citizen to a Chinese base.",
            "score": 89,
            "replies": [
                {
                    "author": "Rafael_Luisi",
                    "body": "Just go to rednote to get the experience.",
                    "score": 35,
                    "replies": []
                }
            ]
        },
        {
            "author": "bigboiwitthescuace",
            "body": "Missed the social credit +100 shit",
            "score": 29,
            "replies": []
        },
        {
            "author": "EndAllHierarchy",
            "body": "Couldn’t resist fitting in a jab against anarchists",
            "score": 79,
            "replies": [
                {
                    "author": "phaedrus910",
                    "body": "As is tradition",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "alexo888",
                    "body": "Deserved tbh",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "cheezpuffy",
            "body": "Find post interesting, social commentary good, meme template potential",
            "score": 13,
            "replies": []
        },
        {
            "author": "DeepNorthIdiot",
            "body": "Like at least half the people in the US are stuck in a world of make-believe. None of them want to accept the age of American domination is at an end and they'll slurp up as much shitty propaganda as they need to keep living in imagination land.\n\nThey talk endlessly about ethnic cleansing in China, or Tiananmen Square, but then shrug their shoulders at our genocide of native populations or how American police blew up half a city block in Philadelphia.",
            "score": 24,
            "replies": [
                {
                    "author": "Send_me_duck-pics",
                    "body": "They are also clueless about most of these events. Their \"history\" amounts to historical fiction.\n\n\nI've told many American liberals that I welcome a discussion of historical flaws or errors of AES but they need to start from a foundation of *truth* so we're discussing things that *actually happened* the way they *actually did*. This is a bridge too far for many. It invites too much reflection upon the sins of their empire.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "woody630",
            "body": "Reddit is such a weird platform because it's fairly progressive, compared to other social media site, but Holy shit, the foreign policy takes here suck. Especially with popular \"China bad\" sentiment is.",
            "score": 14,
            "replies": [
                {
                    "author": "TotakekeSlider",
                    "body": "As is usually the case with liberals.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "therustyworm",
            "body": "Lol what website is this from? 😂",
            "score": 19,
            "replies": [
                {
                    "author": "suckit2023",
                    "body": "Reddit.com",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Juggernaut-Strange",
                            "body": "Never heard of it.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Tzepish",
                                    "body": "You lucky bastard.",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "suckit2023",
                                    "body": "Good.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Scholar_2927",
            "body": "Should see some of the local Florida subs…it’s scary down here y’all.",
            "score": 9,
            "replies": []
        },
        {
            "author": "RecentMemeMaster",
            "body": "Make me understand... What do you think about the Uyghur ?",
            "score": 9,
            "replies": [
                {
                    "author": "None",
                    "body": "They are cool ethnic group that lives in western China in their autonomous province of Xinjang",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "Accomplished_Day7222",
                    "body": "[Terrorism in China - Wikipedia](https://en.wikipedia.org/wiki/Terrorism_in_China)\n\nYou can check even the wiki page on terrorism in China which is a western source and most likely underreports how bad terrorism got in China. Most of them were conducted by radical Islamists based in the Xinjiang region, Terrorism peaked in the mid 2010s with the rise of ISIS with even ISIS declaring Xinjiang part of their Caliphate.\n\nWith the surge of terrorism in that Area in the 2010s, there is no doubt ISIS was radicalizing parts of the Xinjiang population. After China's deradicalization efforts, the number or ISIS based terrorist mass casualty events from 2017 to now dropped from many times a year to zero, as in none in a nearly 8 year period.\n\nAs for genocide accusations, it's pretty unfounded if you consider the laws in china. For instance it's well known China engaged in active population control with the one child policy to curb their unsustainable population growth, breaking the policy could mean heavy fines and even sterilizations. However less well known is that minority groups like the Uygurs were pretty much exempt and had a much much more lenient version and can have up to 3 children with no penalty. Laws against having more than 3 children were rarely enforced among minority groups in China so it was common for minority families to have even more than 3 kids.\n\nWhat happened was during the terrorism crackdown, the government started to strictly enforcing their existing population control laws which was still more lenient than the laws they had for the Han majority group. So if enforcing their existing fairly lenient laws for Uygurs is genocide, then the even more strict one child policy that the majority Han population is subjected to is Ultra genocide?\n\nIt's only recently that china has rolled back their national one child policy and have given the majority Han the same policy as the Uygurs of being able to have 3 kids with no penalty during the so called \"genocide\"",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Tzepish",
                    "body": "They are a minority group that are unfortunately being used by the capitalist west to try to separate Xinjang from the rest of China. Thanks to China's de-radicalizing policies, they are flourishing, but the U.S. continues to promote rightwing terrorism in the region.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "John_Lives",
                    "body": "You won't get a straight answer on 99% of the time. When it comes to China, people either regurgitate Western propaganda or believe that every criticism is Western propaganda. Just look at the record and make your own determination",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Edge-master",
                                    "body": "This sub has been Marxist Leninist for a long time. That said - anarchists are certainly preferable to liberals.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LuisMataPop",
            "body": "You can see is not real because there's no Tiananmen square comment",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kaiyora",
            "body": "Redditor: China bad USA good / USA good China bad\nReality: China good and bad, USA good and bad",
            "score": 4,
            "replies": [
                {
                    "author": "NewTangClanOfficial",
                    "body": "Reality: USA worst, and it's not even remotely close",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "LateStageCapitalism-ModTeam",
                    "body": "Troll posts will be deleted. Many troll posts also include violations of other rules such as rules 4, 5, 6, and 7.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Your post was removed because it contained an ableist term. You should receive a message from the automoderator telling you the exact term the post was removed for. For more information, see [this link](http://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html). **Avoiding slurs takes little effort, and asking us to get rid of the filter rather than making that minimum effort is a good way to get banned. Do not attempt to circumvent the filter with creative spelling; circumventing the filter will result in a permaban.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThePolishAstronaut",
            "body": "wild take: no country is good or bad, and every country has things worth praising and things that need criticizing. It is therefore best to look at geopolitics from the perspective of all involved parties and automatically disconnect the people who live in a country from the policies that country’s government implements",
            "score": 1,
            "replies": []
        }
    ]
}