{
    "title": "How would you approach making anti-fascist indie game?",
    "author": "_Zealant_",
    "subreddit": "LateStageCapitalism",
    "rank": 479,
    "score": 3,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iigb7d/how_would_you_approach_making_antifascist_indie/",
    "id": "1iigb7d",
    "selftext": "I believe that video games is an important medium that should be used in the struggle against spreading fascism, probably even more important than books or movies nowadays.\n\nSome examples of games that carry anti-fascist message:  \nSpec Ops: The Line;  \nHalf-Life 2;  \nDeus Ex;  \nThis War of Mine;  \nPapers, please;  \nHelldivers 1 & 2;  \nDisco Elysium;  \nFallout series;  \nUnderrail\n\nGiven limited resources (most likely enough for a relatively short 2d pixel game, but not for something more complicated) - how would you approach this, comrades?  \nI have a bunch of ideas, one of them is a stealth roguelike where the player needs to smuggle prohibited books out of city under police lockdown, a la Fahrenheit 451.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "behindtheash",
            "body": "If you include tabletop, Stillfleet is pretty banging.",
            "score": 4,
            "replies": []
        },
        {
            "author": "timetickingrose",
            "body": "Monopoly is a good one because of how frustrating it is.\n\n  \nyou could make a poverty simulator with different levels of difficulty. the intro “tutorial“ is where you’re a 1950s white working class father. you come home from your office job and your fun and tired meter are a little low but you're able to sit, watch tv and have your wife feeds you and cleans the home.\n\nafter the tutorial you’re living in destitute. Your job is physically taxing so your exhaustion meter goes down a lot faster, you eat poor quality food because you’re too tired to properly cook, you can become unhealthy and sick. You can buy things like cars but the top of the line ones are just for show and your character can never afford them. Cheep cars that guzzle gas and break down are what you can afford. Maybe your partner is abusive but you have to make the choice of breaking your lease or staying so you have a place to live. Etc etc",
            "score": 3,
            "replies": []
        }
    ]
}