{
    "title": "Westoid Propaganda has no shame",
    "author": "Hacksaw6412",
    "subreddit": "LateStageCapitalism",
    "rank": 419,
    "score": 8159,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 41,
    "url": "https://i.redd.it/8wr0dwfugfhe1.jpeg",
    "id": "1iirp0t",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "A-CAB",
            "body": "Ah yes but we must remember that the amerikan imperialists only did regional* drone warfare. \n\n*that region being planet earth.\n\n/s",
            "score": 565,
            "replies": [
                {
                    "author": "spaceman757",
                    "body": "If only the US is doing it, then it isn't \"global\" drone warfare.\n\n/taps head meme",
                    "score": 75,
                    "replies": []
                },
                {
                    "author": "rfsh26",
                    "body": "It’s our jurisdiction, of course",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "howdybeachboy",
            "body": "“China made us do it! They’re just standing there, menacingly”\n\n\n“Those drone strikes were different! They were asking for it”",
            "score": 287,
            "replies": [
                {
                    "author": "MyOtherCarIsACdr",
                    "body": "\"They made the drones!\"",
                    "score": 55,
                    "replies": []
                },
                {
                    "author": "Few_Jaguar3286",
                    "body": "\"You saw what they were wearing! Clearly, they wanted it!\" FML, this place sucks!",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Vermicelli4916",
            "body": "The worst part is that so many people in the West are believing those headlines without looking for evidence. And then they become smug or mad when presented with proof that Western news are straight out lying or they simply ignore your evidence like a child closing their eyes when they see something \"scary\" but with the difference that China's reality is the opposite of scary and should actually give people hope for humanity.",
            "score": 129,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Ok_Vermicelli4916",
                            "body": "The headline is obviously heavily misleading on purpose to give an image about China that is not true.   \n  \nChina has NOT made drone warfare global. China sells drones to countries. Some of those countries decide to use the drones as flying hand grenades. Same as when China sells basic chemicals and some idiot-countries (USA) don't do anything against their drug lords who use it to produce drugs. Other countries buy stuff from China but don't use it in bad ways. It's not China who strikes poor nations with military drones. It's NATO and its puppies. The headline shifts the focus and blame onto China. \n\nYes, US expansion of drone warfare is a bad thing. But I'd disagree here: If China would provide some military drones to countries who defend themselves against NATO and other terror organizations, then I'd fully agree with China's support. Palestinians, Houthis, Cubans, DPRK, People in Donbass, Burkina Faso and all anti-imperialist nations should have all of the best military drones. I fully support their side in fighting the US, Saudi Arabia, Israel and all the other imperialist puppies.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "24-Hour-Hate",
                                    "body": "While an important distinction, if you know that the guy down the street is a serial murderer who goes around shooting people in the head and you keep selling him guns, then you’re guilty too.  You don’t get to say: “well, I only sold him the guns, he’s responsible for what he chooses to do with them”.  When you have knowledge, you also bear responsibility both morally and legally.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "drkitalian",
                                            "body": "Yeah but you’re never going to get a Revolution isn’t he us without the contradictions of capital increasing and intensifying.\n\nI didn’t vote at all this year. Didn’t matter. Trump won. But without trump destabilizing the system there is no opportunity to revolt. Likewise, China has becomes the worlds personal merchant. If China doesn’t sell commercial drones to other countries they’ll just get them second hand or elsewhere anyway. Even if you can trace the use of commercial and civilian drones back to China directly that doesn’t matter bc the contradictions will give birth to revolution",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Icy-Scarcity",
                                            "body": "US people know they can't control random people from going psycho and shoot their neighbors, but they still sell them guns.  Now suddenly people would say it's \"guns don't kill people, people kill people\".  Double standard much?\n\nDrones can be used for defense.  Everyone looks like a serial killer to the US unless US sells the weapon, right? \n\nActually if you ask people in Middle East, they may tell you that US is the serial killer.  So, who exactly is the serial killer?  It depends on who you ask and which perspective you are looking from.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "24-Hour-Hate",
                                                    "body": "No, not double standard.  In my country you have to get a proper license, which requires firearms training and a background check.  People who commit serious violent crimes can be prohibited from owning any firearms.  With just cause.\n\nYeah, ok, I don’t know if a random person will commit a murder, but if someone has a history of murdering, that is a pretty good basis for concluding that they may well do so again and shouldn’t be allowed guns.  And I certainly wouldn’t sell them one even if the law said it was fine.\n\nChina could say at the beginning they thought the US would use them for defence, maybe (and I say maybe because the US has a long history of war crimes), but that excuse ended quickly.  The world knows the US uses the drones to kill.  And they do it without regard for civilians.  Anyone who sells the US government (or defence contractors) drones at this point is complicit because they *know* or they *ought to know* (on the reasonable person standard).\n\nIt’s fucking weird you would defend China in this.  I mean, is it cool when countries supply Israel with weapons for their genocide?  How about Russia for their invasion of Ukraine?  Would that be cool to sell them weapons?  No?  Then why is it okay for the US to outright murder civilians (including some of their own citizens and children, btw) with drones bought from China?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ElliotNess",
                                            "body": "The reason China has a private market is because it knows it can't stop the imperialist empire peacefully, and must fight it on its own terms: the \"free market.\"",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "Remarkable-Gate922",
                                            "body": "By that logic, anyone who trades anything with the US (or trading with any other country trading with the US) is guilty.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sommern",
            "body": "Every fear of China you see from the Western elites and their journo lapdogs is 100% projection. They fear the Chinese are going to treat them just as shitty as the Western imperialists have treated the world for the past 500 years. ",
            "score": 71,
            "replies": []
        },
        {
            "author": "VINCE_C_",
            "body": "Publishing that headline requires a full blown mental illness. You can't post that and live in reality. There is no credibility to any MSM. It's all just rot, either moral or mental. In most cases both.",
            "score": 45,
            "replies": []
        },
        {
            "author": "occasionawsme",
            "body": "https://preview.redd.it/az3t8ix6akhe1.jpeg?width=1080&format=pjpg&auto=webp&s=ba0edda96037af0b2143aa85ac20df76c78121fd",
            "score": 12,
            "replies": []
        },
        {
            "author": "Maudius_Aurelius",
            "body": "Well yea, it wasn't global when just we did it.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Raichu76",
            "body": "In a way the title is making some sense. \n(I don’t intend to read it) \n\nI assume they are referring to the fact that the Chinese drone company DJI is wiping the floor with the rest of the world in drone manufacturing (specifically smaller to medium sized).\n\nThe war in Ukraine is essentially one of our first big drone wars and China has something like 80-90% of the global market. They build drones that are cheap, easy to use, but also very high quality and they build them fast. \n\nI’ve been studying this for a class project this semester and it’s actually insane how profit seeking and lack of government investment has led the US into dropping the ball on something as important as drone manufacturing.",
            "score": 4,
            "replies": []
        },
        {
            "author": "JFCGoOutside",
            "body": "Them there are freedom democracy drones",
            "score": 4,
            "replies": []
        },
        {
            "author": "darkwingduck9",
            "body": "Not something totally related but people are going to need to be able to coherently explain both Chinese loans and the Belt and Road Initiative.  It is expected that liberals would deem these things exploitive but I've also seen anarchists do the same and they should know better if they are genuine anarchists and not covert liberals.",
            "score": 13,
            "replies": [
                {
                    "author": "ilir_kycb",
                    "body": "[In COINTELPRO, FBI used anarchism to 'disrupt left', attack Vietnam & USSR - Geopolitical Economy Report](https://geopoliticaleconomy.com/2021/10/15/cointelpro-fbi-anarchism-disrupt-left/)\n\n> “The anarchists point of view is the most disruptive element in the New Left and should be capitalized on in the most confusing ways,” the FBI wrote.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "darkwingduck9",
                            "body": "Wasn't aware of this.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "ElliotNess",
                            "body": "Oh, and on that **AN**archism they surely did **CAP**italize",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "beiroet",
                    "body": "Would u mind explaining why it would be a good thing for anarchists? Thanks 🙏🏼",
                    "score": 1,
                    "replies": [
                        {
                            "author": "darkwingduck9",
                            "body": "I don't know what you mean by this.  \n\nMy experience with anarchists is that some are the dumbest empire baby brained people you will ever encounter and then others are intelligent and have a coherent political ideology like Aaron Bushnell.\n\nI wrote my original comment because the US might go to war with China and anything and everything is being used against China to justify war.  Where anarchists come in is that I've seen them saying stuff along the lines of Chinese loans being imperialism as if Chinese loans are the same as IMF loans.\n\nThere is of course soft power and hard power and basically I've seen anarchists not use the term soft power but they were saying that loans and the BRI are soft power.\n\nAt the end of the day this is all so fucking stupid because let's assume for the sake of argument that loans and the BRI are soft power.  That's fuel for the US war machine to manufacture consent and justify war with China.\n\nIt was similar with Assad and obvious that he isn't a perfect leader but that Syria was better off with him.  This was clear without even suspecting or knowing about CIA involvement in Syria.  US involvement in Syria, China, wherever is never going to do any good but some anarchists I see will say China and the US are imperialists and therefore they will take no sides in a war between imperial powers.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ShamanLady",
            "body": "I think this is one of the recipient of USAID money",
            "score": 2,
            "replies": []
        },
        {
            "author": "Icy-Scarcity",
            "body": "In China, people use drones daily for delivery and during festival night shows.  While the US uses drones to kill people.  But sure, it's China's fault that the US can't put any tool given to them to good use.  It's always someone else's fault.  The sense of entitlement.  \n\nIf the US can make better drones, sell them, or dominate the market, then there won't be trust issues now, won't it?  They can't compete, so let's just use propaganda because it's easier?  Instead of contributing to innovation, let's just keep everyone backwards by talking, seriously?",
            "score": 2,
            "replies": []
        },
        {
            "author": "rd--",
            "body": "is this article some kind of ship of theseus argument for the drones/drone components china sells to the US which the US then uses to launch drone strikes?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electrox7",
            "body": "Sure China made them but like, who tf created the market xD",
            "score": 1,
            "replies": []
        },
        {
            "author": "Trevonasaurusrex",
            "body": "Are we just acting like selling drones the world over, and deciding they should be less safe isn’t problematic? Like when the US sells guns the world over, that cause wars and internal strife, that isn’t bad?",
            "score": -13,
            "replies": []
        },
        {
            "author": "djr84",
            "body": "aren't you tired of this?",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -55,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 15,
                    "replies": [
                        {
                            "author": "LateStageCapitalism-ModTeam",
                            "body": "Reddit site wide rules - We had to remove this to keep the subreddit from being nuked",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Few_Jaguar3286",
                    "body": "Only if you have a conscious, or at least a soul.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Toiun",
                    "body": "Nice  NPC account.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Fapp0",
                    "body": "Is everything ok at home?",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}