{
    "title": "Based Ibrahim Traoré has transformed Burkina Faso into a communist dictatorship.",
    "author": "Ok-Musician3580",
    "subreddit": "LateStageCapitalism",
    "rank": 413,
    "score": 534,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/gallery/1ijirxi",
    "id": "1ijirxi",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DescriptionOne3835",
            "body": "A worthy heir to Sankara, finally.",
            "score": 183,
            "replies": []
        },
        {
            "author": "rutherfraud1876",
            "body": "Doubt this is an accurate telling of the situation but LFG",
            "score": 81,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "The video itself is accurate: \n\n\"Dr. Aboubakar NACANABO. \" Through this bill, it is planned that the land will now belong to the State ,\" he maintains\"\n\nSource: https://burkina24.com/2025/02/05/reorganisation-agraire-et-fonciere-vers-une-reprise-en-main-par-letat/",
                    "score": 70,
                    "replies": []
                }
            ]
        },
        {
            "author": "dyingwill20",
            "body": "Good for them.",
            "score": 90,
            "replies": []
        },
        {
            "author": "None",
            "body": "wtf Traore is the fucking GOAT",
            "score": 88,
            "replies": []
        },
        {
            "author": "Imanoldtaco",
            "body": "I hope they succeed and also move to less reactionary, rightists positions on social issues.",
            "score": 87,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "Social issues evolve as a nation develops. \n\nUnfortunately, most people in BF are socially conservative. \n\nHowever, with development, people generally become more progressive. \n\nFor example, compare Cuba after their revolution to now.",
                    "score": 162,
                    "replies": [
                        {
                            "author": "suddenly_lobsters",
                            "body": "And that, friends, is perfect dialectical material analysis.",
                            "score": 108,
                            "replies": []
                        },
                        {
                            "author": "Imanoldtaco",
                            "body": "true",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "It’s normal for social conservatism to be the norm right now, but it’s never static, you have to allow society to develop and advance first. The more important thing right now is sovereignty for the people of Burkina Faso above all.",
                    "score": 54,
                    "replies": [
                        {
                            "author": "Imanoldtaco",
                            "body": "100% agreed",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aztaga",
            "body": "HE JUST KEEPS FUCKING WINNING",
            "score": 12,
            "replies": []
        },
        {
            "author": "_xXkillerXx_",
            "body": "I'm sorry but may i ask question a bit related to this subject is this sub communist or socialist? or just left",
            "score": 12,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "It is a socialist and anti-capitalist sub.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "_xXkillerXx_",
                            "body": "Thanks i know it says that in the rules but i meant/wanted to ask towards which way is it more leaning? (the sub base mainly not the subreddit)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ok-Musician3580",
                                    "body": "From what I have seen, definitely ML",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Socialist, communist, anti-capitalist doesn’t matter. The general rule is no liberalism, no reactionaries. We’re anti-capitalists and come in different flavors.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "HamManBad",
                    "body": "Did you read the auto mod message at the top of every thread?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "saurion1",
                    "body": "The auto message on literally every post in this sub:\n\n> Welcome to r/LateStageCapitalism\n> This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n> \n> **LSC is run by communists.** This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n> \n> We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lostandfound24",
            "body": "The USA is already trying to attempt a coup indirectly by publishing environmental related studies and highlighting the importance of conserving the land in Burkina Faso, but we know that they are after the natural resources like gold, zinc, copper, magnetism.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Snoo_65717",
            "body": "This should be the standard in every country, why tf should you be born in a country but, oh no, sorry all the land and resources are already sold, you’ll have to just work for someone else and they’ll give you almost enough to survive in thanks for working harder than they do. Get fucked, workers of the world unite ✊",
            "score": 5,
            "replies": []
        },
        {
            "author": "la7orre",
            "body": "I wish to live in right wingers ideas about how easy a revolution is. If only things were that simple.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GymSocks84",
            "body": "My GOAT 🐐",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ecstatic-Audience-52",
            "body": "Amazing!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Full-Contest1281",
            "body": "True leader 😍",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -38,
            "replies": [
                {
                    "author": "ElliotNess",
                    "body": "A dictatorship of the proletariat is the aim, friend.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "I do not think that the news is about USA",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "Ok-Musician3580",
                    "body": "Firstly, I was making fun of the YouTube commenter. \n\nSecondly, every nation is a dictatorship of some sort. \n\nYou are either a dictatorship of the bourgeoisie or a dictatorship of the proletariat. \n\nThe government of BF has finally pushed to free itself and push for a Sankarist line of development. \n\nThe government is very popular even as a \"dictatorship.\"\n\nIn reality, liberal \"democracies\" across the world, including in Africa, just lead to the sale of every politician, such as Ruto in Kenya.\n\nIdeally, the BF government would push for a one-party-led DOTP, but even Sankara didn’t do that, so I hope the BF government is looking out for potential coup plotters and potential compradors of Western imperialism.\n\nEdit: Apparently, the person who replied to me, \"MightBeMyst,\" does not know anything about Marxism or Leninism. \n\nThe formerly existing DOTPs could not transition to communism until worldwide capitalism was defeated. \n\nAdditionally, their socialist systems were/are popular, and people from former socialist nations, such as Russia, miss the USSR by wide margins.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "TheJunKyard147",
                            "body": "they will try to attack on all front, media to smear on the government, stir up dissent in society & chaos but never to achieve a better goal, only to break everything down like a kid who didn't get his toy. The people needs to be more aware of color revolution, all the lies & promise may sound sweet at first only to serve their own agenda.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "TheJunKyard147",
                                    "body": "what do you suggest us do then? Erase all country border & government & go back to live in the wild, sorry but the formation of government body is an inevitable outcome when you have a certain group of people who share lots of thing together that they wants to protect. Get rid of all that regulations & control you have a bunch of monkey in fancy cotton. Before traffic rule get stricter & apply heavy fine, people drink & drive, kills families because there's next to no consequences, but after a while people become more & more reluctant to violate the laws & form pattern of civilized behaviour. Enforcing those laws is dictatorship & if you think every single human being is a saint & require no control to act civil, you're a fool.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "A-CAB",
                                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "TheJunKyard147",
                                            "body": "can we leave some of it as an example for how idiotic their arguement are?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "A-CAB",
                                                    "body": "Tempting as that may be, no. \n\nReddit has a thriving ecosystem of liberal nonsense where people can find that garbage.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "You should read some Engels. Authoritarian is a meaningless liberal word frankly. The Working class is going to force its will and it’s going to forcibly seize the means of production, it’s going to forcibly break the bourgeoise state apparatus.\nYou can’t have revolution without authority, and you have have authority without a workers dictatorship",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "What do you call workers rule? It’s a dictatorship of the proletariat. Dictatorship is good, it depends on who it’s serving and who’s imposing the rule. Drop the liberal framing on the issue, and open up a little bit. Seems like we have liberals in here for some reason",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "SLCPDLeBaronDivison",
                    "body": "What has he done wrong?",
                    "score": 16,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -28,
                            "replies": [
                                {
                                    "author": "LifesPinata",
                                    "body": "So maybe start educating yourself? Ibrahim Traore and his cabinet have been doing amazing things for Burkina Faso lately, despite the islamic insurgency in the Northern regions of the country",
                                    "score": 18,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mydicksmellsgood",
                    "body": "I think this is a fair question, despite the downvotes. My answer is, maybe! I think if you offered me a choice between a democracy run by the wealthy for the wealthy or a dictatorship run for the people, that provides material benefits for the working class, there's a good chance I'd be willing to sacrifice my vote. I do want to be clear, it's iffy!",
                    "score": 12,
                    "replies": [
                        {
                            "author": "TheJunKyard147",
                            "body": "The more freedom & rights human have tilting us back to the stone age, where we can go naked without any have a say in it. What we need is more restrictions & regulations of personal freedom if it means to improve our society as a whole.\n\nIn Vietnam lately, the 168 decree was dropped including heavy fines & regulation, facing backlash from reactionary voices & those so called \"human rights\" ngo funded by US' intelligence to weaken the government's reputation in the people's eyes. But an indisputable fact remains, the amount of traffic incidents has dropped significantly, less people are dead because of this, drivers actually stand in line to wait for the redlight instead of driving recklessly like a Discovery's channel stampede (seriously, for the longest time VN has been known for chaotic traffic). If less personal freedom = improvement as a whole, then it's a fair sacrifice, after all, a country can only stands if it's served its people, as a whole.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Ok-Musician3580",
                            "body": "A democracy is the rule of the majority. \n\nBefore, when BF was a \"democracy,\" the country was actually just run by Compaoré and his capitalist cronies. \n\nWhen he was removed, other capitalist cronies took his place. \n\nThe rule of the majority didn't exist after Sankara died and until Traoré came to power. \n\nNow, it does, and the existing government is incredibly popular with the people. \n\nWhen Traoré’s term was expiring, lots of Burkinabé youth, in fact, came out to demand that he stay in power for another 5-10 years because of his popularity\n\nI would, and most of the people of BF, would much rather take the current \"dictatorship\" over the prior \"democracy.\"",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "Every country is a dictatorship. \n\nRead anything from Marx or Lenin. \n\nYou people are an embarrassment.\n\nAdditionally, this \"dictatorship\" is immensely popular with most of the Burkinabé people. \n\nGet lost with your Western exceptionalism, Western chauvinism, and Western imperialism/neocolonialism.",
                    "score": 18,
                    "replies": []
                }
            ]
        }
    ]
}