{
    "title": "The Drug Industry Is Having Its Own DeepSeek Moment. It isn’t just artificial intelligence—Chinese biotechs are now developing drugs faster and cheaper than their U.S. counterparts - WSJ",
    "author": "kwamac",
    "subreddit": "LateStageCapitalism",
    "rank": 400,
    "score": 295,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 21,
    "url": "https://archive.is/LEiBf",
    "id": "1ik69cj",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "kwamac",
            "body": "The entire way this article is written and framed is just hilarious and LSC-worthy. \"Sure, the patient doesn't care. But this is terrible for the 'biotech ecosystem'\".\n\nCherry on top, umpteenth example of \"China invents thing, BUT AT WHAT COST?\"\n\n\nWe all know what side of the class war the WSJ is on.",
            "score": 78,
            "replies": []
        },
        {
            "author": "Spain_iS_pain",
            "body": "The best way from China to achieve global communism is to purchase free or cheap items for the entire world. OpenSource AI, cheap and effective medicines, cheap EV, OpenSource everything. Free the people from Capital and money.",
            "score": 56,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -3,
                    "replies": [
                        {
                            "author": "PlayerHeadcase",
                            "body": "They do **some things** better, and its becoming really apparent the mainstream media has been - and still does- use really heavy propaganda techniques against China. \n\nAnd as Reddit is full of propaganda bots, along with the establisments rhetoric,  now its almost seen as treason to say they did something well- which is another huge red flag, pun unintended, when considering which information we \"know\" is actually accurate.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "diecorporations",
                                    "body": "At this point China is doing most things better. Its time for a trip to China to see how amazing things are there.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Rafael_Luisi",
                            "body": "Tell me you dont know ANYTHING about China internal politics without telling me that.\n\nJust seeing half an hour of the CCP last reunion will show you what they really want. Xi jimping wrote an whole book just straight up saying what he believes is the proper course for China TOWARDS COMMUNISM!\n\nStop having this strawman of China in your head and see them for what they are. Yes they are socialists, yes they are fighting to achieve communism, and no, they are not the same as the US. \n\nStop projecting capitalist failures on China. And stop taking your biased and minimal knowledge of the country as fact.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "A-CAB",
                                            "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AutoModerator",
                                    "body": "Your post was removed because it contained a homophobic term. You should receive a message from the automoderator telling you the exact term the post was removed for. For more information, see [this link](https://weeklysift.com/2015/06/29/slurs-who-can-say-them-when-and-why/). **Avoiding slurs takes little effort, and asking us to get rid of the filter rather than making that minimum effort is a good way to get banned. Do not attempt to circumvent the filter with creative spelling; circumventing the filter will result in a permaban.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "cretintroglodyte",
            "body": "President Xi my country yearns for freedom",
            "score": 42,
            "replies": [
                {
                    "author": "Forgotlogin_0624",
                    "body": "I mean how hilarious would it be if the US invades Canada, Greenland, Panama, kicks off WW3, gets a global alliance formed with China at the helm to fight back against it, gets fucking wrecked, and we’ve got Chinese soldiers telling their grandchildren about how they liberated GITMO and other concentration camps, and the US essentially becomes Japan after the war.\n\n\nLike it would suck to experience that but it’s quickly becoming a best case scenario over here, from and objective view point",
                    "score": 29,
                    "replies": [
                        {
                            "author": "ShittyInternetAdvice",
                            "body": "https://preview.redd.it/n5g50vvtx1ie1.jpeg?width=1280&format=pjpg&auto=webp&s=f8ae4ee10e1765e40ef2003cf720e5ece79a901c\n\nNYC after the Second Anti-Fascist War and the Liberation of the American Proletariat",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aglobalvillageidiot",
            "body": "Guys I'm worried planned economies aren't evil and without USAID there's not enough people telling me how bad they are. Please help.",
            "score": 14,
            "replies": []
        },
        {
            "author": "No_Mercy_4_Potatoes",
            "body": "Doesn't really matter. You guys aren't getting any cheap medicine in the US. India has been making generic versions of medicines that cost a fraction. But they aren't allowed in the US to protect your pharmaceutical industry. So this won't be any different.",
            "score": 25,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 15,
                    "replies": [
                        {
                            "author": "youngpilgrim90",
                            "body": "Oh, that's already happening. Cancer vaccine innovated and developed in Cuba, which is highly effective against lung cancer, is banned for the US, and it is illegal for US citizens to seek it out for themselves.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Irdogain",
            "body": "If your lobby works too good, you pamper yourself that much till you lose.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bastet2800bce",
            "body": "I hope something that actually works for ulcerative colitis comes out of China. American companies charge $6000 per month for treatment that may work.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "David Wainer at the WSJ is a real wiener",
            "score": 3,
            "replies": []
        },
        {
            "author": "geraltofrivia783",
            "body": "Nice?",
            "score": 1,
            "replies": []
        }
    ]
}