{
    "title": "Coffee bean price all time high",
    "author": "chupachups90",
    "subreddit": "LateStageCapitalism",
    "rank": 408,
    "score": 68,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1ik8npx/coffee_bean_price_all_time_high/",
    "id": "1ik8npx",
    "selftext": "The working class was hooked on this liquid booster for wellbeing/feelgood/productivity. Then this consumerism behaviour serves well for the purpose of the capitalism, which contributes the global warming that caused the crop loss globally that pushed price higher. Not to even mention the labor exploitation in producing this agricultural commodities. Perfect perpetual mechanism.\nNext time your coffee tastes bitter is not because the bean is burnt, it’s because our planet is BURNING.\n\n*wrote this down when I was having the bowel movement thanks to the first sip of the day*",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I’ve been taking a low dose of prescribed adderall since I was 19 and it has been on back order for over a month now. \n\nWhen I get bored, I fall asleep, unless I take my medication. I can be sitting at a computer working on something and start falling asleep out of boredom no matter how well I slept the night before. So not coffee, but kinda similar situation. Idk what I’m going to do! Coffee is too expensive (but I love it.)",
            "score": 20,
            "replies": [
                {
                    "author": "fffffffffffffuuu",
                    "body": "bruh ive been taking a pretty high dose of adderall for about 8 years now and the uncertainty regarding if i’m going to be able to obtain my meds every month makes me feel like i live in a third world country",
                    "score": 10,
                    "replies": [
                        {
                            "author": "None",
                            "body": "When I had health insurance (UHC 🤡) they covered name brand adderall, which at the time wasn’t back ordered (generic was though) so I was able to get my name brand adderall for like $24 while everyone who needed generic couldn’t (which I felt like a huge b!tch for, none of my friends could get theirs but I had no problem.) \n\nNow they’re just totally out of it everywhere, name brand and generic. I’ve called so many pharmacies. There are so many pharmacies in NYC, you would think one would have some in stock but I can’t dial every single pharmacy in New York lol. I only take 10mg, I’m a fairly petite woman. I need it though. Irritating AF. It regulates my sleep, keeps my emotional dysregulation in check for the most part, etc. I take strattera too, which helps with some of it, but I am struggling. It is so crazy that they can’t make sure it’s available.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "fffffffffffffuuu",
                                    "body": "yeah i take 30mg XR in the morning, 20mg XR in the afternoons, and 1 -2 blue 10mg pills “as needed” depending on how late i have to be functional. And yes - i feel like the adderall is a miracle mood stabilizer for me more than a “get things done” thing. Off the meds the absolute smallest thing will make me furious to the point i’m sputtering and can’t even describe my anger to then just slumping into a deep despair and wanting to take a ride on the ol’ sewer slide. I was able to fill the 20’s and 10’s last week, but my pharmacy didn’t have any 30’s and said they didn’t know when they were going to get more. My doctor wrote another prescription and sent it to someplace called “Pharmacy Advantage” (i think) and apparently not only do they have the 30’s but i guess they’re going to fedex them to my door???? We’ll see. They’re supposed to arrive sometime Tuesday. \n\nWhat does the strattera do for you that the adderall doesn’t?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "The strattera helps keep my hyperactivity at a baseline 24/7 so that when I don’t have adderall in my system I’m still more relaxed than I would be without it lol. I used to be super physically hyperactive and impulsive and the strattera has been such an excellent block for that (the way I drove and was constantly getting injured in my teens / injured as a kid when I was undiagnosed was insane)  - I would say it’s one of the few medications I’ve taken where I don’t even feel like I’m on a medication, it’s so subtle but makes such a huge difference. The adderall helps a lot in the way you described, with emotional regulation, also just makes me feel more calm and focused which is obviously ideal. \n\nI’ve been taking both for about 11 years now (though I took a break from adderall when I was depressed my senior year of college. I remember my doctor called my parents concerned bc I stopped picking up my prescriptions lol.) \n\nI get the same furiousness you’re describing! It helps so much with that. It sucks that we have to live like this. It’s so hard when something that in the grand scheme of things shouldn’t cause a meltdown but it does because… we’re adhd. That sounds promising, I hope you get them.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AngryCrab",
            "body": "Yaupon Holly (Ilex Vomitoria) is an evergreen shrub native to the Southeastern United States that contains caffeine. Tea can be made from the leaves. It's generally non-invasive and can handle cold temps. Makes a good privacy hedge. Just throwing that out there for anyone who would like a backyard caffeine source.",
            "score": 7,
            "replies": [
                {
                    "author": "Dependent-Pickle-634",
                    "body": "Of course you know there's a reason it's called \"Vomitoria\". 🤮",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}