{
    "title": "Of course he did, because BOTH PARTIES serve the oligarchy",
    "author": "haloarh",
    "subreddit": "LateStageCapitalism",
    "rank": 378,
    "score": 2072,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 56,
    "url": "https://i.redd.it/z60lo71r1yhe1.jpeg",
    "id": "1ikrfwm",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "4spooky6you",
            "body": "Yes, they have even stopped trying to maintain the illusion of a duopoly. It's never been more clear that there is just one ruling party in this country, the Capital owners.",
            "score": 253,
            "replies": [
                {
                    "author": "eu_sou_ninguem",
                    "body": ">It's never been more clear that there is just one ruling party in this country, the Capital owners.\n\nAnd yet most are still blind to it.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "abraxas1",
                            "body": "I've mentioned this to some friends and I can see a light bulb going on \nIt's the only way to make sense of things.\nReality is not as slippery as they would like to think.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JustaBearEnthusiast",
                    "body": "Not entirely true. The oligarchs have their own internal battles as well. There are technically differences between the parties just none that should matter much to us.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Strange_Music",
                    "body": ">In the US, there is basically one party - the business party. It has two factions, called Democrats and Republicans, which are somewhat different but carry out variations on the same policies. By and large, I am opposed to those policies. As is most of the population.\n\nNoam Chomsky, 2008",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "So much for \"fighting them in the streets\". ",
            "score": 92,
            "replies": [
                {
                    "author": "Slumunistmanifisto",
                    "body": "He was talking about us doing the fights not him, he's important.... ",
                    "score": 50,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 7,
                    "replies": [
                        {
                            "author": "A-CAB",
                            "body": "Content removed. Reddit wide rules apply and we are obligated to remove anything that can be perceived as a call to violence.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 49,
            "replies": [
                {
                    "author": "EBoundNdwn",
                    "body": "I'll have you know he managed to not only get them to promise to use lube when they DVDA us but it's going to be sour patch flavored!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AntiquarianThe",
            "body": "When Elon Musk was helping himself to the Treasury database and information on millions of Americans on the 2nd of February, what was Hakeem Jeffries doing in \"resistance\"?\n\nTalking to the JCRC and AIPAC.\n\n\"Sinwar is gone. Sinwar is gone. And Hamas is on the run... and Iran is at one of its weakest points in decades. We can't take our foot off the gas pedal until Iran is brought to its knees — for the good of the world.\"\n\nDemocrat Minority Leader endorsing the views and policies of fascist republicans and fascist zionists at the same time while fascist republicans cheerfully trample all over the rights of Americans. \n\nAnd uninvited guests will insist that this is \"opposition\" \n\nWhat a disgusting joke.",
            "score": 72,
            "replies": [
                {
                    "author": "abraxas1",
                    "body": "\"democratic minority leader\" who is himself a minority.\nGuess he's all the diversity they will need.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "namdonith",
            "body": "This man went on Jon Stewart’s podcast this past week and it’s an hour of him saying absolutely nothing. HE TALKS FOR AN HOUR AND SAYS NOTHING. An absolute masterpiece of a politician who will do nothing to help solve the problems we’re facing",
            "score": 31,
            "replies": [
                {
                    "author": "daeglo",
                    "body": "I noticed that too. He repeats the same phrases over and over again - wouldn't want to go off-script and say what he really thinks...",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "BunkySpewster",
            "body": "The owners need to bow to us, not the other way around. ",
            "score": 21,
            "replies": [
                {
                    "author": "toeknee88125",
                    "body": "Too bad the Democratic party has taken the strategy of trying to convince capital owners they can suck dick better",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Straight-Razor666",
            "body": "Protip:  THEY ALWAYS HAVE.",
            "score": 20,
            "replies": []
        },
        {
            "author": "bpaps",
            "body": "What happened with not negotiating with terrorists?",
            "score": 11,
            "replies": []
        },
        {
            "author": "bringmethesampo",
            "body": "Also this:\n\nhttps://preview.redd.it/71p2kxigtyhe1.png?width=1440&format=png&auto=webp&s=9d0f08f907c8dfdf2eb66d0b765083d8ebfee8b8\n\nEveryone trying to save themselves from the upcoming Night of the Long Knives, huh?",
            "score": 12,
            "replies": [
                {
                    "author": "A-CAB",
                    "body": "And yet when they had the trifecta, they did *checks notes* fuck all with it?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "bringmethesampo",
                            "body": "Hey - why rock the boat when you're benefitting from the system?",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "daeglo",
            "body": "Hakeem Jeffries actually said, \"What leverage do we have?!\" in a press conference yesterday when asked about getting legislation passed. He blamed the GOP for \"having control\" of everything yet not bringing forth any legislation that Trump promised the people.\n\nIt's an excuse for the Dems not to do anything, either. It's absolute bullshit. \n\nThis on top of the DNC chair saying they'll only accept money from \"good billionaires\" like there even is such a thing.\n\nThe liberal Dems, especially, represent the status quo. They want to keep their jobs cushy and safe forever and ever, and that's all they care about. We can't trust them to represent our interests or to bring about any meaningful change.",
            "score": 11,
            "replies": []
        },
        {
            "author": "haloarh",
            "body": "[SOURCE](https://www.politico.com/news/2025/02/07/hakeem-jeffries-silicon-valley-donors-00203076)",
            "score": 9,
            "replies": []
        },
        {
            "author": "cobaltsteel5900",
            "body": "What a piece of garbage",
            "score": 11,
            "replies": []
        },
        {
            "author": "WowUSuckOg",
            "body": "If you want honesty, check their donors.\n\n(Undisclosed is just as bad)",
            "score": 7,
            "replies": []
        },
        {
            "author": "Emperormike1st",
            "body": "To mend fences (holding us rabble at bay?)",
            "score": 11,
            "replies": []
        },
        {
            "author": "Nervous-Patience-310",
            "body": "The right or the right",
            "score": 10,
            "replies": []
        },
        {
            "author": "DuckDouble2690",
            "body": "The left will never win with these purity tests /s",
            "score": 8,
            "replies": []
        },
        {
            "author": "CherryDaBomb",
            "body": "Hakeem Jeffries was chosen because he's white enough to be appealing. This country has a racism problem.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Impressive-Past-3614",
            "body": "disgusting",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "Hakim is friend to nobody but himself",
            "score": 8,
            "replies": []
        },
        {
            "author": "rrunawad",
            "body": "Anyone still voting for this garbage ass party while fear mongering about fascism can fuck off.",
            "score": 5,
            "replies": []
        },
        {
            "author": "bloodmonarch",
            "body": "Keep losing, democrats.",
            "score": 7,
            "replies": []
        },
        {
            "author": "cretintroglodyte",
            "body": "\\* bend knee(s)",
            "score": 5,
            "replies": []
        },
        {
            "author": "salamandereere",
            "body": "What a joke.",
            "score": 5,
            "replies": []
        },
        {
            "author": "baconblackhole",
            "body": "They should be meeting us out in the protests",
            "score": 4,
            "replies": []
        },
        {
            "author": "humanity_go_boom",
            "body": "One at least has the sense to do it quietly.... If the bread a circus supply gets interrupted, they know whats next.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Lostlilegg",
            "body": "Tech companies are all in on Trump to usher in their digital kingdoms, this is a weak move",
            "score": 4,
            "replies": []
        },
        {
            "author": "big__cheddar",
            "body": "And like all Democrats, the meeting went like this: \"Hey, what right wing shit do you want us to do when it's our turn?\"",
            "score": 4,
            "replies": []
        },
        {
            "author": "critterheist",
            "body": "It doesn’t help that he looks like two face from Batman",
            "score": 3,
            "replies": []
        },
        {
            "author": "Megadum",
            "body": "Our politicians meet with capital holders not constituents. Keep praying for that benevolent billionaire you bootlickers.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 5,
            "replies": [
                {
                    "author": "A-CAB",
                    "body": "Canada is an imperialist regime no different than amerika except in the scale of its imperialism and Mexico’s government is a colonial holdover. What exactly is decent about that?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "A-CAB",
                                    "body": "Western imperialist states have the same goals. I made a clear distinction that the scale is different.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "A-CAB",
                                                    "body": "What part of the imperial core is unclear to you?\n\nInter imperialist conflict, like that between amerika and Canada is immaterial.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IguessIliveinaCHAIR",
                    "body": "Probably. Anything to prevent AOC and other progressives from leading.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "wenger_plz",
            "body": "\"Mend fences\" here meaning \"what goodies can Democrats give you to also give us money,\" and \"we promise not to enforce anti-trust laws anymore\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "KPKamen",
            "body": "My capital is better than your capital is the message I'm getting",
            "score": 2,
            "replies": []
        },
        {
            "author": "mrdaemonfc",
            "body": "Trump shut down the Consumer Financial Protection Bureau recently and is now trying to sack everyone who works there and delete their entire archive of research into the financial industry and records of its patterns of abuse.\n\nThe Democrats created the CFPB, and its job is simply to curtail some of the worst practices in banking, and to return money to cheated customers. It's funded by the banks and part of the Federal Reserve.\n\nIts major accomplishments were making banks tell you what you are agreeing to when you sign up for a banking product, and to go after them and fine them and return money to consumers when the banks still manage to cheat you, within the framework of what they said they would do to you.\n\nSome of the worst and most predatory banks, like Credit One, not only survived, but thrived, during the time the CFPB was operational, and yet the Republicans still want to shut it down.\n\nOne reason I can think of is that they know Trump's policies are going to lead to a Second Great Depression, and they want to bury the market research into things like how many people can no longer afford to pay their credit cards, and what percentage of people are having the car that they need to get to work and medical appointments and stuff towed away, and how many people are losing their house, and so on.\n\nWith Trump suing the news and making them \"donate\" to him every time they report the facts and a Republican \"catch and kill\" team censoring PBS and NPR, you will not hear about the pain and suffering.\n\nThis morning in my car, I heard NPR saying that retail sales in January were the worst they've been in years, then they blamed \"the weather\", not record consumer debts and minimum credit card payments and defaults, and record amounts owed on underwater car loans, and mass layoffs. It will get worse.\n\nIn Russia, Putin's explanation for everything that goes wrong is to have scientists killed and he says they \"walk out of windows\" or a Russian ammo dump explodes and that was the sixth one this week, and \"it was all careless people with cigarettes\". Well, with Trump, the Putinification of the media has already happened.\n\nHe threw out all the actual news companies and NPR out of the Pentagon, then blamed the passenger jet collision with the army helicopter on \"DEI\". Then the far-right blamed the crash on a transgender pilot, who is still alive. Then they continued to blame DEI. Then weeks later, they go \"Oh yeah, and the altimeter wasn't working.\"\n\nTrump hates the media. So he brings in Newsmax, OANN, and others that will never ever fact check him or put him on the spot. He kills the agencies that compile data that will show how horrible the economy gets.\n\nEverything around us will stop and we will have no actual information at all.\n\nThe Democrats aren't interested in slowing him down, in many cases they've actually joined forces with him in an all out frontal assault on Immigrants, like the Laken Riley bill which expands deportation and destroys due process.\n\nThey don't plan to save us from Trump. They plan to give him exactly what he wants, like they did last time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Solomon_Grungy",
            "body": "Gotta get their storylines straight for their next “conflict”. Its alllll kayfabe baby.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Pinkbunny432",
            "body": "Modern crittendon compromise bs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Erdeem",
            "body": "Make sure you vote for your AIPAC approved representatives, don't be antisemitic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Megadum",
            "body": "Our politicians meet with capital holders not constituents. Keep praying for that benevolent billionaire you bootlickers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Superb-Set-5092",
            "body": "https://preview.redd.it/o8keu7wyvcie1.jpeg?width=391&format=pjpg&auto=webp&s=9b669f9ba88440c930d6735acc437be85c9d3f44",
            "score": 1,
            "replies": []
        },
        {
            "author": "dannyd604",
            "body": "Although it is true, it is important to remember that Donald Trump entrusted Elon Musk with access to the White House.",
            "score": -1,
            "replies": []
        }
    ]
}