{
    "title": "Democratic resistance ramps up to unprecedented heights; dem senator considers *not* voting in support of republicans, as he continually has thus far. Maybe. Well, hes open to considering it...",
    "author": "fazedncrazed",
    "subreddit": "LateStageCapitalism",
    "rank": 372,
    "score": 52,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.nbcnews.com/politics/congress/andy-kim-open-to-government-shutdown-trump-rcna191371",
    "id": "1ilrx3k",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "md5md5md5",
            "body": "It is hard for me to wrap my head around. I know the socialist response is essentially we don't have 2 parties we have one party that represents the oligarchy but it still amazes me that the Dems will get screwed so hard by the republicans and then go ahead and vote for grossly unqualified presidential nominations.",
            "score": 9,
            "replies": []
        },
        {
            "author": "ardent_wolf",
            "body": "He did an ama in the nj subreddit. He answered 7 questions. One was about whether he, as a Democrat, supported abortion rights. The other 6 were about pork roll vs Taylor ham and if central jersey exists or not. Everyone lauded him for being a man of the people for it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "rutherfraud1876",
            "body": "\"reshaping\" fuck off",
            "score": 2,
            "replies": []
        },
        {
            "author": "yaosio",
            "body": "Democratic resistance means increasing font size from 12 to 14.",
            "score": 1,
            "replies": []
        }
    ]
}