{
    "title": "Proof that voting and protesting aren't always enough. Another 40 years passed before apartheid ended.",
    "author": "lightiggy",
    "subreddit": "LateStageCapitalism",
    "rank": 361,
    "score": 472,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 12,
    "url": "https://i.redd.it/4qsx1rbw57ie1.png",
    "id": "1ilsa3r",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "lightiggy",
            "body": "Me going back to 1948 to reveal to [Jacobus Strauss](https://en.wikipedia.org/wiki/Jacobus_Gideon_Nel_Strauss) that the National Party had ties to German intelligence and how [their more radical followers](https://en.wikipedia.org/wiki/Ossewabrandwag) even plotted a pro-Nazi rebellion against Jan Smuts in the early 1940s, have him convince fellow hardline liberals that the National Party cannot be trusted to determine South Africa's future, and then launch a coup against D.F. Malan after telling Smuts to stand aside:\n\nhttps://i.redd.it/qnl2g69a87ie1.gif\n\n* \"I'm not a soldier.\"\n   * \"The army is a bastion of pro-British sentiment. Locate the [officers who are sympathetic to your cause](https://en.wikipedia.org/wiki/George_Brink) and they will be able to convince a decent chunk of the military to support the coup. You have the element of surprise. The Afrikaner nationalists will put up an extremely tough fight, but you can beat them.\"\n* \"Are you sure this will work?\"\n   * \"I know the odds seem stacked against you, but history says otherwise. Afrikaner nationalists have twice launched proto-fascist rebellions against the pro-British Afrikaners, [once in 1914](https://en.wikipedia.org/wiki/Maritz_rebellion) and [then again in 1922](https://en.wikipedia.org/wiki/Rand_Rebellion). Both times, they were defeated. Of course, this battle will be much harder since the roles are reversed. That said, have faith. The pro-British Afrikaners are many things, but they are not weak. Many of your followers have extensive experience in killing white supremacists, whereas the Afrikaner nationalists are all racist farmers and Nazi collaborators.\"",
            "score": 14,
            "replies": []
        },
        {
            "author": "LordTravesty",
            "body": "If you ask me its all about the boycotting, some worship money some worship power, but in capitalist society if you hit their money youre hitting their power. Spend wisely.",
            "score": 14,
            "replies": [
                {
                    "author": "anticomet",
                    "body": "Hard to boycott arms companies when they take money directly out of your taxes. While I'm all for never buying shit like mcdonalds or starbucks again in my lifetime, that isn't how we're going to end capitalism",
                    "score": 11,
                    "replies": [
                        {
                            "author": "LordTravesty",
                            "body": "It isnt to end capitalism, it is to make business owners have more consideration/effort to the quality of life. Ending capitalism is a much harder task if we expect to stay intact anyway. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "anticomet",
                                    "body": "All business owners care about is profits no matter the human suffering to produce said profits. To fix this we need to end capitalism",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "LordTravesty",
                                            "body": "And become what instead though? If the governement doesnt help now will they be anymore sympathetic under socialism or communism, or will people just then have less security and control over their lives. Capitalism certainly has its flaws, but the alternatives all have problems too. I dont think people are willing enough for such drastic change either. ",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "anticomet",
                                                    "body": "This is a Communist sub... it's a place for people that want to end capitalism to share memes and news",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "LordTravesty",
                                                            "body": "Oh, well i suppose that is understandable then. I was unaware of that, but i will keep it in mind in the future.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "puertorique_o",
            "body": "Change won’t happen overnight the current events in the started in the reagan era if not before they fixed their sights on a goal and took it to completion if the left in the us wants to achieve similar results would have to first stop infighting and get behind working class issues recognize that both parties are the enemy and leave the culture war behind because division is their greatest asset",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "Ngl given the present age, civil disobedience and bringing the society to a standstill is more important. Violence is idiotic you will only loose. Read some research on this",
            "score": -5,
            "replies": [
                {
                    "author": "None",
                    "body": "Good luck on using guns against a professional army with technology without buying out corrupt politicians. Most of you aren’t fit enough to run a mile just saying",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}