{
    "title": "“We’re the Democratic Party”",
    "author": "macylilly",
    "subreddit": "LateStageCapitalism",
    "rank": 286,
    "score": 1821,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 86,
    "url": "https://v.redd.it/ey573ehkptie1",
    "id": "1io9mm7",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yuval_Levi",
            "body": "\"We're the democratic party....we're like corporate republicans but with pride parades\"",
            "score": 240,
            "replies": []
        },
        {
            "author": "akaWhisp",
            "body": "I hate this so much, but I think that just means she nailed the caricature.",
            "score": 349,
            "replies": [
                {
                    "author": "brandonjslippingaway",
                    "body": "Definitely nailed the aloof condescension of Harris when a protester dared to interrupt her to stop the butchery the sitting government could have stopped at literally any point but didn't.",
                    "score": 218,
                    "replies": [
                        {
                            "author": "CaptinACAB",
                            "body": "Remember when libs were wearing “I’m speaking” shirts during a genocide? \nYea.",
                            "score": 95,
                            "replies": []
                        },
                        {
                            "author": "Old-Form-9634",
                            "body": "Dem insiders are pissed at their own support groups like move and indivisible because they dared to ask them to do something. \n\nThey keep repeating to people asking them to do things “those are good ideas and people with good ideas should run for office”. It blows my mind\n\nThat meeting yesterday schumer does the condescending “you should run” to someone who did run, and won, which was why she was there. \n\nThen after the groups get into arguments the Dem insiders tell the activist groups “all this is off the record” but then immediately they run to Center right News axios and they leak how angry they are about their own supporters to them. \n\nThey just want to kick back and use all the bad things trump is doing to send fundraiser emails, which they will then utilize on the same media and strategists that ran their campaigns last time, which in many cases happen to be their close friends and family members\n\nThey’re better than the Republican Party by a mile, and the level of corruption we are seeing now is unprecedented, but their decades of “civility”, working across the aisle, neoliberal policies and slowly moving left on social issues while tacking hard to the right on economic issues is what led to this mess, and the public being pissed off enough to burn it down. \n\nThe house oversight committee voted on subpoenaing Elon musk to testify before Congress. They failed the vote 19-20. Several dems did not vote or were not in attendance. Ro Khanna was off to Silicon Valley having closed door meeting with the “good” tech oligarchs and the ones still in the dem camp, and ensuring them they’ll have access in a future dem administration. \n\nDems are refusing to vocalize to the public how the things that are taking place will hurt them. Instead of combatting misinformation on things like the consumer protection bureau, they’re just saying “we will fight, we hear you, we need unity, PrEsIdEnT MuSK!?”. \n\nIt’s tone deaf. And after the meeting yesterday I’m convinced they’re controlled opposition to be honest. \n\nRepublicans won’t be able to pass a budget by themselves, but Schumer has already stated Dems aren’t going to obstruct their budget and demand concessions, they’re just going to let them pass it. \n\nWhen the freeze happened, Schumer instructed Dem senators to “downplay the freeze and any potential policy responses, and instead choose one cabinet pick to do a protest vote in”. If the show were on the other foot, Republicans would be voting no on every single one of our picks. They even vote no on our appointments when we “work across the aisle” and make “big tent” moves by putting Republicans in cabinet positions, which we should stop fucking doing. \n\nThey act like the hate what’s taking place but they refuse to condemn and explain how many of the actions will hurt voters because it would upset their corporate donors. We need to oust all these ghouls in the primaries. \n\nIt was blowing my mind that it appeared to only be lefties that were mad while Dem party loyalists were blaming minorities and Palestinians, but even the neo-lib dem party worshippers seem to be getting angry now. \n\nHonestly, I’d say we need an entire new political party and to just burn the Dems down since they’re in the way and actively helping republicans in many instances, but I’m not sure how feasible or what the process for something like that would be.",
                            "score": 86,
                            "replies": [
                                {
                                    "author": "82kill",
                                    "body": "What's the point of voting for the Democratic Party if they go ahead and appoint Republicans to their cabinet and act like half-off Republicans in the end?? 100%",
                                    "score": 28,
                                    "replies": []
                                },
                                {
                                    "author": "Inner-Mechanic",
                                    "body": "The party has no use to anyone not a billionaire or their minion. The party isn't there to protect us from Republican overreach or a authoritarian demagogue, it's there to protect the status quo from us, the average American, angry our democracy turned out to be a complete lie. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ryanmaple",
            "body": "Controlled opposition- once you see it, it’s plain as day.",
            "score": 169,
            "replies": [
                {
                    "author": "Fatticusss",
                    "body": "This is where I am too. Certainly less surprising to see Dems constantly rake stepping when you realize that’s their whole purpose.",
                    "score": 54,
                    "replies": [
                        {
                            "author": "SaintHuck",
                            "body": "Big Rake is their top corporate donor.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tengutie",
            "body": "The DNC has the same bosses as the RNC, billionaires.  The DNCs job is to take everyone who fights for change and equality and ensure they don't accomplish anything. The RNCs job is to push the agenda of the Nobility, aka billionaires.",
            "score": 84,
            "replies": []
        },
        {
            "author": "WastelandHumungus",
            "body": "Did you see that video of Diane Feinstein getting in an argument with that sixteen year old during a school visit? That is the Democratic Party",
            "score": 58,
            "replies": [
                {
                    "author": "MassivePsychology862",
                    "body": "Lmfao. I can’t find it? Think she had it scrubbed?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "ryan4069",
                            "body": "[https://www.cnn.com/2019/02/22/politics/feinstein-video-sunrise-movement-kids/index.html](https://www.cnn.com/2019/02/22/politics/feinstein-video-sunrise-movement-kids/index.html)",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "DeeHolliday",
                                    "body": "This is so depressing to watch. Absolutely heinous behavior",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "Gryehound",
                                            "body": "And the still-living monsters that run the party today are exactly like her. Even the annointed that failed to keep the offices they once occupied are still running the party.\n\nHer career epitomizes the problems with our entire political system.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Inner-Mechanic",
                    "body": "She was flying a _Confederate flag_ outside the court house as mayor of SAN FRANCISCO!!! She was always a useless shit bag and proof how complicit our media always has been to the pro corporate narrative the Dems have embraced since Johnson (who at least passed the great society govt programs, even as he was going full hog on the Vietnam war). It's been neoliberal austerity ever since. Can't even appreciate feinstein lack of pulse as she was able to stay in power until the very end. We need a party whose only message is fck the GOP, fuck the Dems and eat-the-rich.  ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "uncen5ored",
            "body": "Nailed it. It saddens me that this isn’t even just the leadership anymore, but the condescending attitude of many people I know that vote blue no matter who.",
            "score": 36,
            "replies": []
        },
        {
            "author": "None",
            "body": "[we’re liberals](https://www.tiktok.com/t/ZT2ANsUs3/)",
            "score": 23,
            "replies": []
        },
        {
            "author": "Straight-Razor666",
            "body": "America is a PLUTOCRACY.  The democratic party runs cover for the fascists since they are ALL PLUTOCRATS and serve capital AND NO ONE ELSE.",
            "score": 24,
            "replies": []
        },
        {
            "author": "240Nordey",
            "body": "I hate her, because she sounds like a democrat. Well done.",
            "score": 65,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 53,
            "replies": [
                {
                    "author": "manchu_pitchu",
                    "body": "\"If you're not at the table, you're on the menu\" is a pretty killer line.",
                    "score": 68,
                    "replies": [
                        {
                            "author": "8Splendiferous8",
                            "body": "I've seen that for Union organizing. It sounds badass in that context.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LeatherOpening9751",
            "body": "Pah, two evil entities and one with better marketing than the other lmao",
            "score": 25,
            "replies": []
        },
        {
            "author": "EarlHot",
            "body": "Yeah, I think I'm in love...",
            "score": 35,
            "replies": [
                {
                    "author": "Here-Is-TheEnd",
                    "body": "Me too, what was she saying, my speakers aren’t working",
                    "score": -15,
                    "replies": [
                        {
                            "author": "EarlHot",
                            "body": "Subtitles bruh",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NormieSpecialist",
            "body": "And the libs blame everyone else. As is tradition.",
            "score": 22,
            "replies": []
        },
        {
            "author": "digital",
            "body": "We’re the Democratic Party, we don’t have a plan or any leadership whatsoever",
            "score": 5,
            "replies": []
        },
        {
            "author": "TannerCreeden",
            "body": "Oh so this is why they wanted to ban it",
            "score": 6,
            "replies": []
        },
        {
            "author": "kev11n",
            "body": "blaming the people who didn't vote for them and never the dems for not getting more people to vote is the absolute worst. oh and NOW they want to talk about Gaza. Good grief",
            "score": 5,
            "replies": []
        },
        {
            "author": "boozewald",
            "body": "It's wild how with the right they will say a bunch of shit but they will tell the truth about their harm. They are already very clear in their messaging. They will go into how, when where and why exactly they will kick you in the balls. \n\nThe Democrats act like they are here to help you and then they kick you in the back. They will shame you for not towing the line, and they will sell you out just as fast while having a veneer of decency. \n\nBut anytime something comes along that will actually help that they can't dangle in front of you a couple of them play turn coat and act for the monied interests. And just like a wrestling show they will play the heel of the party, before collecting that check and either becoming a media advisor or consultant.  \n\nThe right is using a select few companies to push a new era of authoritarianism and consolidate power further, and the Dems are a right wing capitalist party trying to maintain the hegemony of the old status quo, which is a global empire that has economically subjugated the global south for over a century. That's the global legacy of the United States. \n\nThere is no real leftist movement in the United States, prolonged direct action by the masses that hits then in their wallets is the only way they might notice. A single day strike isn't going to cut it. \n\nAs long as there is enough entertainment plenty of folks will keep tuning out and I'm not sure that momentum of any kind can be sustained until enough people are impacted personally.",
            "score": 6,
            "replies": [
                {
                    "author": "Key_Captain3739",
                    "body": "well explained, right click saved\n\nbeen most mad about USAID and the federal agencies ... that one i couldnt fathom at all tbh\n\nAs bad as all this is, im putting more and more blame on US cultural and our constant need for endless entertainment streams. While I find this hard to believe its clear as day when you see all these people at basketball or football games for weeks on end happily cheering for their teams",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Inner-Mechanic",
                            "body": "That's literally a common argument the Nazis used to justify their actions during their ascent to power. The former govt was weak and it was making the people sick and they needed a powerful daddy to rid them of the evil influences on their culture from \"outsiders\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Inner-Mechanic",
                    "body": "All the old ways for regular people to channel power have been taken over by corporate interests, or eradicated. Don't blame regular people for not knowing what to do at this moment. The robber barons have been spending trillions of dollars over the last 9 decades to kill the new deal and end all govt spending going to anyone who must work for a living to survive and its only bc tump and musk are so brazen in their attacks that it's impossible to ignore anymore ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kevin9O7",
            "body": "there's a class war and only one side is fighting",
            "score": 2,
            "replies": []
        },
        {
            "author": "Erudeka7",
            "body": "Can we burn the whole thing down and make a new party",
            "score": 2,
            "replies": [
                {
                    "author": "Inner-Mechanic",
                    "body": "🤞 ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "QuadrilateralShape",
            "body": "This feels maga tho",
            "score": 0,
            "replies": [
                {
                    "author": "Vedicgnostic",
                    "body": "She is pro Palestine on her TikTok’s and describes herself as a feminist and ex Christian so I doubt maga",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Inner-Mechanic",
                    "body": "That's bc they are the same thing. Liberal ideology is still pro corporate and anti people. I know if you're new here it's a very upsetting thought bc it means there's no one in charge that can save us but it's the truth. Breaking thru that cognitive dissonance is extremely hard and also very painful. Good luck 👍",
                    "score": 1,
                    "replies": [
                        {
                            "author": "QuadrilateralShape",
                            "body": "In your passionate response you mention breaking through cognitive dissonance. Are you able to explain where you found that in my statement? Do you know what cognitive dissonance is?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "A-CAB",
                    "body": "Lesser-evil rhetoric in relation to elections or current policies is prohibited. Dismissing voting third party because they are “useless” or because you are “throwing your vote away” also violates this rule. It also encompasses saying Trump is “worse” for Gaza, as that place is already completely destroyed. Trump is merely carrying out what the american ruling class started under Biden. Resorts being built and mass relocation were already happening under Biden and Kamala would’ve continued it.",
                    "score": 21,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -21,
            "replies": [
                {
                    "author": "ikaiyoo",
                    "body": "We don't have to do the Republican party. The Republican party tells you who they are They are very upfront about it. They don't mince words. They have always said they're going after education Medicare social security abortion and they want a smaller government so that they can keep tax cuts for the rich. So they're completely on brand there's no reason to do a video about that. What confusion is there They will say anything in order to get an office so that they can continue to cut taxes for the rich and do that by deleting services and instilling a theocracy. So what what do you want the video to be Just campaign speeches?",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "CaptinACAB",
                    "body": "Why? We don’t vote for them and can’t change them.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "There isn't much to say there. They're just ontologically evil. At least they have the decency to stab us in the front.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -20,
                    "replies": [
                        {
                            "author": "rrunawad",
                            "body": ">Criticizing Democrats make you a Russian agent!\n\nExample #28054 of liberals being in a Blue MAGA cult.",
                            "score": 31,
                            "replies": []
                        },
                        {
                            "author": "CaptinACAB",
                            "body": "BlueAnon is getting out of control. \nIs Putin in the room with us right now?",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "Rafael_Luisi",
                                    "body": "This is getting out of hand, now there are two Magas!",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LateStageCapitalism-ModTeam",
                            "body": "Rather than lazily accusing anyone and everyone who holds a different viewpoint of being a bot/troll or being paid by Russia/China/Republicans, actually engage with the point being made. There are plenty of spaces where you can dismiss people for being a bot and not engage with their point. This is not one of them.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aggravating-Run1182",
            "body": "Does she?",
            "score": -1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -4,
            "replies": [
                {
                    "author": "macylilly",
                    "body": "Dems are for the corporations too, they all serve the same donors, which is why liberals will always side with the right at the end of the day and usher in fascism",
                    "score": 5,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Irrespond",
                                    "body": "Except the Democrats aren't opposition at all. They're controlled opposition and true leftists don't allow themselves to be blackmailed into voting for capitalist parties.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "macylilly",
                                    "body": "Democrats are right not center and it’s not because they’ve been infiltrated, liberalism is a right wing ideology by definition. You really need to reevaluate your idea of the left, because you don’t seem to understand what actually qualifies as left wing",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "ejanely",
                                            "body": "Then how do you propose we fix this mess we’re in as a country?",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "macylilly",
                                                    "body": "This is a leftist sub, we’re socialists, communists, anarchists, maoists, etc here, what do you think? The baseline is the end of capitalism entirely, not “progressively” reforming an inherently exploitative and oppressive system.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "ejanely",
                                                            "body": "I agree, but how do you propose we end capitalism?",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "macylilly",
                                                                    "body": "Dude there’s decades of theory and history debating that question far better than I can do in a Reddit comment, but I’d at least stop defending democrats. They’re not our allies, they’re the opposition just like republicans",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ejanely",
                                                                            "body": "To unite for a better future, we have to unite with a plan. We both want a better future, now there needs to be collective agreement on how to make that future a reality. Just saying “dems bad” alienates people who want the same thing you do. The division is the point in this current political climate. Don’t let the oligarchs win.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "macylilly",
                                                                                    "body": "Divesting from the democrats and no longer allowing them to drain energy and effort into their weaponized incompetence within a failed system is an important part of building that unity. The democrats are the oligarchs puppets, so they’re never going to be useful against them.",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "You should read some essential socialist / communist theory / educate yourself and then maybe come back here. You’re in a communist sub trying to argue against the basic principles of communism. Just stop.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "A-CAB",
                                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "A-CAB",
                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "macylilly",
                    "body": "Idk it sounds like your idea of organizing is limited to the electoral system and campaigning for progressive candidates, so not sure you should be the one judging praxis or critical analysis. It’s not possible to vote away fascism",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Gryehound",
                    "body": "I think that what you have failed to grasp is an understanding that these people, regardless of what jersey or hat they wear, have spent well over a century ensuring that you cannot and never will be allowed to vote your way out of the corruption that they prosper under.\n\n3rd parties were neutered over a century ago, and unions were crippled before even that, and then were effectively outlawed right after WWII. Who jailed Eugene V. Debs? How did the party of Lincoln become the party of the ruling class?\n\nAs this young lady said, \"If you're not at the table, you're on the menu\". Figure it out.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "A-CAB",
                            "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "A-CAB",
                                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Gryehound",
                                            "body": "You should educate yourself on the USPS itself, since it directly effects you. There were only two specific federal duties enumerated in the Bill of Rights. Conduct a census every ten years and establish post offices and post roads.\n\nThe USPS used to be a cabinet level federal department. Now it's a combination of denigrated beggar and source of infinite subsidies to the parasite class. UPS, FedEx, Amazon, etc., could not even exist without this unaccountable and permanent subsidy.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}