{
    "title": "Will we ever get single payer healthcare?",
    "author": "Yuval_Levi",
    "subreddit": "LateStageCapitalism",
    "rank": 297,
    "score": 125,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 74,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iocent/will_we_ever_get_single_payer_healthcare/",
    "id": "1iocent",
    "selftext": "My Obamacare premiums keep going up and I can barely stay afloat working as a substitute teacher.  What is the point of even existing?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DingleberriesMcgee",
            "body": "Not without physical revolution, methinks. \n\nWould love to be wrong about this, but I’d gamble we’re more likely to see systemic collapse in the next couple decades than sensible healthcare policy.",
            "score": 251,
            "replies": [
                {
                    "author": "ekbowler",
                    "body": "Climate is going to cause a systems collapse for us.\n\n\nI've stopped expecting better things in the future.",
                    "score": 98,
                    "replies": [
                        {
                            "author": "GlassFooting",
                            "body": "Hey im also hoping for climate to bring down capitalism but give Ceasar whatever belongs to Ceasar, having exclusively two far-right lobbist parties running a country that funds coups on the the whole ocidental world is the flour on this bread",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "executivejeff",
                    "body": "unless we can basically socialize health care small scale then form federations of collectives and expand, we will need an actual revolution the old fashioned way. \n\nthere's no way the insurance industry is going to let themselves become obsolete.",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Solomon_Grungy",
                    "body": "How soon until Americans aren't allowed to freely leave and/or expatriate?",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Luna259",
                            "body": "They currently still have to pay tax to the US when they leave and are no longer citizens",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Solomon_Grungy",
                                    "body": "You can renounce your citizenship its just a single payment.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NervousBreakdown",
                    "body": "Do the rest of the world a favour and get this done before Trump tried sending troops into Canada or Greenland.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "memecrusader_",
                            "body": "Don’t you mean Red, White, and Blue Land?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chadlerk",
                    "body": "I'm Luigi!",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "irishitaliancroat",
                    "body": "It seems more likely to me balkanization and the Regional roll out in some parts than even reforms putting the us on par with European social democracy. \n\nThe us decline seems terminal.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "dawn913",
                    "body": "I hate to agree but I'm with you. I've been a passive leftist a majority of my life. Thinking about purchasing a gun. Stay safe out there!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Temporary_Ad_6673",
                            "body": "A gun is 100% necessary with the way things are going. Get a carbine!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "diecorporations",
                    "body": "You might be right. I rate the chance of revolution at minus 100%. Chance of collapse much higher.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sniperking-187",
            "body": "Not until all the insurance CEOs are fertilizing the plants",
            "score": 64,
            "replies": [
                {
                    "author": "mikony123",
                    "body": "So never.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "BloodhoundGang",
                            "body": "Never say never.\n\nThere are only so many things that get worse for the average person before a dam breaks.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "4spooky6you",
            "body": "Not under capitalism, since this would upset the profits of the massive healthcare industry. If you want change you'll need a working class revolution.\n\nFor a revolution to work, you must first build a revolutionary movement; following these general steps:\n\n1) Raise class consciousness and awareness (through discussion and education)\n\n2) Organize locally with other socialists/communists, helping to build foundations for mutual aid/dual power structures \n\n3) Unionize your workplace\n\n4) General strike\n\n\nAs for #1, my recommended intro reading list:\n\nThe principles of communism - Engels (https://www.marxists.org/archive/marx/works/1847/11/prin-com.htm)\n\nSocialism utopian and scientific - Engels (https://www.marxists.org/archive/marx/works/1880/soc-utop/)\n\nThe state and revolution - Lenin (https://www.marxists.org/archive/lenin/works/1917/staterev/)\n\nThere's also a ton of good YouTube content if that's more your thing ( but you really should read the foundations of theory as well), highly recommend these channels as a good starting point:\n\nhttps://www.youtube.com/@SecondThought/videos\n\nhttps://www.youtube.com/@YaBoiHakim/videos",
            "score": 42,
            "replies": [
                {
                    "author": "48679",
                    "body": "You don’t need a general strike. Shutting down key industries such as railroads and ports alone will shut the economy down as long as the working class supports the strike as a whole.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Gunner_Bat",
                    "body": "Depends on your definition of capitalism I guess. Canada has single payer healthcare and is a capitalist nation.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "cobaltsteel5900",
                            "body": "They’re saying it won’t happen in the current state of the US, while it is capitalist, not that it can’t happen in a capitalist country.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "diecorporations",
                            "body": "True, but parties are now working on taking the present system down.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "meatsmoothie82",
            "body": "The good news is the poorly designed Obamacare model is going away. \n\nThe bad news is it’s not getting replaced by anything and Medicaid is as well- so medicine will soon be for only the filthy rich. ",
            "score": 24,
            "replies": [
                {
                    "author": "leeny13red",
                    "body": "That will solve the nursing shortage.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crimsonkayak",
            "body": "Americans believe a constitution written by slavers is freedom so don’t get your hopes up.",
            "score": 18,
            "replies": []
        },
        {
            "author": "TheEPGFiles",
            "body": "Lol No, a healthcare CEO got shot and they're still complaining about people complaining about them denying claims. \n\nLike the threat of death isn't enough for them to change.",
            "score": 19,
            "replies": []
        },
        {
            "author": "joeprogressv",
            "body": "NY STATE has the NY Health Act which is single payer for all NYers. They just need to pass it and have the Governor sign it into law. \nCheck out campaign for ny health [https://www.nyhcampaign.org/](https://www.nyhcampaign.org/)",
            "score": 16,
            "replies": [
                {
                    "author": "Forgotlogin_0624",
                    "body": "I like those state acts, but it would only work if it automatically puts everyone into it regardless of any private insurance they may already have, changing that private insurance to co-insurance.\n\nBecause otherwise the public option will go insolvent quick.  \n\nAt the end of the day a federal version is maybe the only viable one, from a finding perspective ",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sc4rl3tPumpern1ck3l",
            "body": "never... unless something something guillotines ",
            "score": 32,
            "replies": []
        },
        {
            "author": "LexeComplexe",
            "body": "Not under America, which i don't think will exist as we know it in another 10 years",
            "score": 11,
            "replies": []
        },
        {
            "author": "k_rocker",
            "body": "Speaking from the UK I think you’ve got no chance (without revolution). \n\nTo many people (and I don’t mean the healthcare workers etc) genuinely believe that your insurance model is the best - fed lies about Canada, the UK etc. \n\nIt all collapses when someone in your family can’t afford an inhaler because it has been artificially gouged.",
            "score": 8,
            "replies": []
        },
        {
            "author": "RaazMataaz",
            "body": "Medicare for All is a perfectly reasonable and plausible policy expansion considering it would save money…but the insurance lobby needs to be stopped",
            "score": 8,
            "replies": []
        },
        {
            "author": "Consistent_Cat3451",
            "body": "Unless there's a whole mushroom kingdom thing, if you know what I mean, pew pew 🥰",
            "score": 4,
            "replies": []
        },
        {
            "author": "cjalas",
            "body": "No, and since you asked, we're doubling down on privatized healthcare. Be glad there's any healthcare at all!",
            "score": 6,
            "replies": []
        },
        {
            "author": "CarousersCorner",
            "body": "You're about to not have medicaid or medicare.... you'll be lucky if they come pick up your body for sanitary reasons, soon",
            "score": 5,
            "replies": []
        },
        {
            "author": "diecorporations",
            "body": "US corporate culture and complete control by the oligarchs will never allow a single payer system. Its not about you, its about them.",
            "score": 5,
            "replies": []
        },
        {
            "author": "abbumm",
            "body": "Not until democrats exist as a left (\"left\") party",
            "score": 9,
            "replies": []
        },
        {
            "author": "Straight-Razor666",
            "body": "The bouge only understand one language.  Until we learn to speak it effectively to them, we will not have nice things.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Grandmas_Cozy",
            "body": "Not unless we rise up and take it",
            "score": 5,
            "replies": []
        },
        {
            "author": "SalviaDroid96",
            "body": "No. Not unless more of the insurance executives die or a full scale revolution happens. \n\nUnfortunately even if more ceos die I don't think they'll do anything. One of their own was gunned down and they still proceeded with business as usual. These people have been socialized into psychopathy, they don't even care if one of their own dies it seems.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Big-B-In612",
            "body": "No. This country is done for.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Low_Wear_1966",
            "body": "The wealthy whites of America will never allow it. They'd rather watch us burn",
            "score": 6,
            "replies": []
        },
        {
            "author": "Several_Importance74",
            "body": "No. No will not",
            "score": 3,
            "replies": []
        },
        {
            "author": "tjwacky",
            "body": "No",
            "score": 3,
            "replies": []
        },
        {
            "author": "rnatx",
            "body": "I don’t see a path to it within the current system. At all. (RN for 18 years, if that matters.)",
            "score": 3,
            "replies": []
        },
        {
            "author": "thornyRabbt",
            "body": "Look up Sustinet, which was a valiant years long attempt to create a single payer system in Connecticut. It was killed at the last minute by the health insurance lobby. \n\nI'm actually hopeful that this presidency, plus the ridiculous rise in costs lately, might bring single payer closer to reality than if Harris has won tbqh. When the fascists are back out of power I seriously will start campaigning again with national nurses united.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Remote-Patient-1214",
            "body": "No",
            "score": 3,
            "replies": []
        },
        {
            "author": "spacegamer2000",
            "body": "Absolutely not. The democrats made it clear that the aca is all we would be getting for generations.",
            "score": 3,
            "replies": [
                {
                    "author": "leeny13red",
                    "body": "My biggest disappointment from Obama. He promised us health care, and he gave us health insurance instead.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "spacegamer2000",
                            "body": "He promised \"an open and transparent debate on healthcare reform\" and that was the biggest lie of his presidency.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "leeny13red",
                                    "body": "I did see a post-Presidency interview where Obama indicated that he considered healthcare to be his biggest failure while in office. He realized too late that what he gave us was not what we needed.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "spacegamer2000",
                                            "body": "Everything he ever said about it was a lie. \"We'll do a transparent debate,\" \"It will lower prices,\" \"you can keep your doctor,\" \"this is just the beginning of more reforms,\" all of those statements are false but people love it",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pho_Khieu",
            "body": "No.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ocsurf74",
            "body": "HELL NO! Every other developed country in the world has figured out healthcare and people don't die in debt and have a way better quality of life. Republicans don't care. When people figure this out maybe we can move forward. No other country deals with healthcare lobbyists and Big Pharma like the US does. It's one big fucking scam. They could give two-shits about the lives of people.",
            "score": 3,
            "replies": []
        },
        {
            "author": "godoftwine",
            "body": "LOL\n\nno.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AllThings970",
            "body": "No. Too many people profit from our current system. Even though patients to doctors hate the current “system.”",
            "score": 3,
            "replies": []
        },
        {
            "author": "NorcalGGMU",
            "body": " In America - Ever? Yes. Soon? Noooooope.",
            "score": 2,
            "replies": []
        },
        {
            "author": "hat3cker",
            "body": "Apply for a job in Canada, prepare for cold!",
            "score": 2,
            "replies": []
        },
        {
            "author": "NapoleonDonutHeart",
            "body": "Nope. Things are going to get worse, not better. If he cuts Obamacare we are either going to have to move to Canada or my wife will die.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dorrbrook",
            "body": "Not in the United States, but probably in what comes after, region depending",
            "score": 2,
            "replies": []
        },
        {
            "author": "th3Fonz",
            "body": "not unless we cut down the american ruling class by force",
            "score": 2,
            "replies": []
        },
        {
            "author": "justletmelivedawg",
            "body": "No. Next question.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hour-Locksmith-1371",
            "body": "lol no. I live in Canada and as imperfect as our system is its miles ahead of the USA",
            "score": 2,
            "replies": []
        },
        {
            "author": "GeekShallInherit",
            "body": "I think so, but it's going to take far too much suffering to get there, and things are already bad. \n\n36% of US households with insurance put off needed care  [due to the cost](https://www.commonwealthfund.org/publications/surveys/2023/oct/paying-for-it-costs-debt-americans-sicker-poorer-2023-affordability-survey); 64% of households without insurance. One in four have [trouble paying a medical bill.](https://www.kff.org/health-costs/issue-brief/data-note-americans-challenges-health-care-costs/) Of [those with insurance one in five have trouble paying a medical bill](https://www.kff.org/wp-content/uploads/2016/01/8806-the-burden-of-medical-debt-results-from-the-kaiser-family-foundation-new-york-times-medical-bills-survey.pdf), and even for those with income above $100,000 14% have trouble. One in six Americans has [unpaid medical debt on their credit report.](https://www.healthaffairs.org/doi/full/10.1377/hlthaff.2018.0349) [50% of all Americans](https://news.gallup.com/poll/317948/fear-bankruptcy-due-major-health-event.aspx) fear bankruptcy due to a major health event. [Tens of thousands](https://pnhp.org/news/lack-of-insurance-to-blame-for-almost-45000-deaths-study/) of Americans [die every year](https://www.sanders.senate.gov/wp-content/uploads/Fact-Sheet_Medicare-for-All-2023.pdf) for [lack of affordable  healthcare](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2323087/). \n\nWith healthcare spending [expected to increase](https://www.cms.gov/files/document/nhe-projections-forecast-summary.pdf) from an already unsustainable $15,705 in 2025, to an absolutely catastrophic $21,927 by 2032 (with no signs of slowing down), things are only going to get much worse. \n\nSo the way I kind of see it playing out is healthcare as a political issue starting to reach critical mass for the 2032 election. Unfortunately the healthcare industry is the most powerful lobbying force in the country, and incredibly adept at propaganda. This will lead to politicians paying lip service to healthcare and blowing smoke up our asses; making trivial changes that won't have any significant impact. There is only so much you can do to make people work against their own interests as they increasingly see friends and loved ones suffering and dying in ever growing numbers.\n\nIt will take another 8-12 years for it to become obvious to even the most desperate of those among us to deep throat the propaganda that those actions don't work, and then another 4-8 years to actually get something implemented. \n\nSo.... somewhere between 2044 and 2052 we'll finally have hopefully meaningful reform implemented. I'm 52 now, and it's one of my life goals to see universal healthcare before I die. But we'll see.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bozobot",
            "body": "We already do. Oh wait! You must be American",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dxmndxnie1",
            "body": "Yes, once it’s apart of the democrats platform and they advocate for it but the democrats won’t cause they suck.",
            "score": 1,
            "replies": [
                {
                    "author": "Gryehound",
                    "body": "The Party has thrown 2 Presidential elections and given up 2/3 of the states to prevent it, so I'm not very hopeful",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProfessionalEqual731",
            "body": "For capitalist society we lack competition in health insurance. Which doesn't make a whole lot of sense. Google says we 900 health insurance companies. But most health insurance companies own about 16 or more smaller health insurance companies. While others are state selective or job selective. For example one federal insurance plan called GEHA has a biweekly premium of $80 biweekly deductible with $ 350 annual in network deductible for individual health insurance with 6.5k out of pocket which less than 2.5 million have. While i got priority health owned BHSH and what's this back the card CIGNA. I pay $275 premium per paystub, with $1,300 deductible  in network , 6.5k out of pocket on family plan.(Single plan is half). My plan from last year was priority health  was i think $100 biweekly premium with $3200 deductible and 10 k out pocket in network family plan. When i had united healthcare i shit not exact same plan amounts. So Cigna owns Anetem thats now Elevated healthcare, that also owns alot Bluecross. And all these plan were the exact same prices when i had UnitedHealth care through work. \n\nSo really if want play numbers game. I figured out no-matter you get HMO or PPO  or POS its all shit. Because the f price difference between all them is $75. Because the annual premium plus deductible are all close same amount. I pay 8-10k a year on health cost with insurance i never reach my deductible because im an employee for nonprofit Hosptial group (beaumont not saying CH) that own for profit priority health. And all our hostpital group faccilties and doctors are supposed be inetwork. That what they are listed on Health insurance site . But they don't operate at Beaumont facility, even though they have a Beaumont office.they go to different private hostpial for surgery, that all ANES are outsourced and Tier 1. And you want look at how many people have close same health insurance optiion as i did. Thats  100M for Anetem, 115M for sister company. 45M for United healthcare (that still have the cards there same options).  That 250 million covered out the 300 million covered by health insurance. Which includes other plans like medicaid/ medicare in these plans, that gov helps pay for the cost. But it's still insane that  83 percent the health insurance is controlled by  2 extremely similar parent companies.\n\nWhen comes down to it . Insurances make their own rules, like 1 year deductibles rather than long term service. They don't have compete with 100s of very small field health insurances because most people don't qualify for health insurance outside the Top 5 parent companies. Which are $100-200 total different from each other but non are affordable. State insurance/assisted insurance plans are pretty b.s too because its got limit of support too many people, so you end up in hole, as if you had no insurance. Then the insurance penalties was bullshit. \n\nWe' re fed to believe it  is a market but just oligopoly with subsidized health insurance that takes advantage of us, we pay for to try lower the cost of healthcare that also takes advantage of us, and pay our government that also takes advantage of us, in effort to pay for said health insurance that we also couldn't afford.",
            "score": 1,
            "replies": [
                {
                    "author": "mm902",
                    "body": "The paradoxical fallacy of choice. Competition always leads to conglomerates @ Late Stage Capitalism inflection point. ☝️ Winners eat their competitors, while presenting it as a viable valid choice. Even when it's really owned by a parent company that owns them all.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "jmads13",
            "body": "We already have it. (Who is your we?)",
            "score": -1,
            "replies": []
        },
        {
            "author": "Beingforthetimebeing",
            "body": "Dear Yuval_Levi, what's the point of existing? Your life is valuable bc you can resist when so many won't. What does resistance look like?  The Universal Declaration of Human Rights covers not only a full range of civil and political rights, but also social and cultural rights. Keep teaching those kids, dancing those dances, cooking that ethnic food. If it's Rx prices, get a coupon on the internet for best price, or you can mail your Rx to Canada. We Be Resilient!",
            "score": 0,
            "replies": []
        },
        {
            "author": "mtdebco",
            "body": "Maybe in the reconstituted America that is formed after President Musk and Felon Trump are done pillaging.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Administrated",
            "body": "So long as we have a republican party, not a chance!",
            "score": 0,
            "replies": []
        }
    ]
}