{
    "title": "Liberal \"resistance\" and revolution",
    "author": "malk500",
    "subreddit": "LateStageCapitalism",
    "rank": 281,
    "score": 1542,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 58,
    "url": "https://i.redd.it/9xghx2hoyuie1.jpeg",
    "id": "1iodqn2",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "thevaultguy",
            "body": "The original rename was going to be *BP Oil Autonomous Drill Field*",
            "score": 229,
            "replies": []
        },
        {
            "author": "ConfederancyOfDunces",
            "body": "Let’s be upfront and honest here.  I only have so much energy and attention available to me.  This is a red herring in the middle of the class wars of our life time.  \n\nIs the name change super dumb and shouldn’t happen?  Yes, but choose your battles.",
            "score": 84,
            "replies": [
                {
                    "author": "SwordKneeMe",
                    "body": "From how it looks most people are choosing to do nothing instead of choosing a more important battle",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "malk500",
            "body": "So meaningless and weak. Whats the best possible outcome - after receiving a handful of these complaints, a low level Google employee adds a filter to automatically ignore them?",
            "score": 161,
            "replies": []
        },
        {
            "author": "CaptinACAB",
            "body": "Libs are like cats when you break out the laser pointer if the laser was dumb shit like this. \n\nThen when a democrat takes office and the republican policies stay in place they scream at you for bringing it up.",
            "score": 317,
            "replies": [
                {
                    "author": "Iguman",
                    "body": "This translates to real-world US protests as well. The handful I've been to have been toothless, embarrassing photo-ops that were OK'd by the very entity being protested against.",
                    "score": 50,
                    "replies": []
                },
                {
                    "author": "clubmedschool",
                    "body": "Don't compare cats with libs, at least cats serve a purpose",
                    "score": 35,
                    "replies": [
                        {
                            "author": "DarthMikus",
                            "body": "Is to vomit in my shoe?  My cat has that down to a science",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "leroy2007",
            "body": "If this is what liberals define as “resistance” we’re totally fucked.",
            "score": 71,
            "replies": [
                {
                    "author": "NormieSpecialist",
                    "body": "Unfortunately It is. Just petty and meaningless action in the face of a fascist take over.",
                    "score": 26,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheThirdDumpling",
            "body": "Exactly, all gaslighting, no real weight.\n\nStop using Google Map, in fact, start de-Google.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Distantmole",
            "body": "Algorithm immediately deletes the report lol",
            "score": 14,
            "replies": []
        },
        {
            "author": "None",
            "body": "\"Don't forget to write your representative.\" ",
            "score": 38,
            "replies": []
        },
        {
            "author": "TuckHolladay",
            "body": "Deleting Google maps off of your phone is the better option",
            "score": 51,
            "replies": [
                {
                    "author": "Extension_Body835",
                    "body": "Its also on Apple maps",
                    "score": 14,
                    "replies": [
                        {
                            "author": "TuckHolladay",
                            "body": "What the fuck is happening",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "fazedncrazed",
                                    "body": "Open street maps ftw, its way better than either, has a ton more info, and works offline.\n\n\nAll other map services serve the bourgeoise.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "TuckHolladay",
                                            "body": "I’ll check it out",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "fazedncrazed",
                                                    "body": "Its a lifesaver, esp if you travel in the back country a lot.\n\nProtip: If you dont want to futz around with directly installing apks, and dont want something with spyware added to it from the google play market, its also available on the fdroid (free and open) app repo.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "thetacticalpicachu",
            "body": "You could call it the Ted light district. I do not care about this",
            "score": 13,
            "replies": []
        },
        {
            "author": "Maeng_Doom",
            "body": "Liberal resistance is just political theater. Most of their victories are.",
            "score": 12,
            "replies": []
        },
        {
            "author": "VINCE_C_",
            "body": "They fight over the most meaningless issue because it's the only one Dem donors disagree with.",
            "score": 12,
            "replies": []
        },
        {
            "author": "frootcock",
            "body": "Yeah I'm sure that'll work. Google will see all that feedback and say \"omg they're right! It's not called gulf of America! Well that was silly of us 😅🤦\" Surely",
            "score": 12,
            "replies": []
        },
        {
            "author": "yaosio",
            "body": "Oh no a ticket marked closed will continue getting comments. Trump will be so mad! Got him! Now let's go tell all those people protesting without our permission why they are owned by Russia.\n\nThat's supposed to be a Democrat saying that not me. I've gotten comments before from people who don't realize I'm being sarcastic other times. Sorry.",
            "score": 10,
            "replies": []
        },
        {
            "author": "ZipMonk",
            "body": "All of that was Mexico before the US stole it.",
            "score": 54,
            "replies": [
                {
                    "author": "yaosio",
                    "body": "The US and Mexico stole from native people. I have to wonder what things would have been like without the plagues. There were thriving civilizations across north and south America wiped out by sickness.",
                    "score": 43,
                    "replies": [
                        {
                            "author": "ZipMonk",
                            "body": "These are separate periods in history.",
                            "score": -18,
                            "replies": [
                                {
                                    "author": "ryzwart",
                                    "body": "So when US beats shit out of Mexico it's bad, but when Mexico beats natives it's not relevant? Elaborate please.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "ZipMonk",
                                            "body": "Ever heard of Spain or Portugal?\n\nWhat language do they speak in Mexico?\n\nLots of apologists for Western Imperialism here clearly.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "slicehyperfunk",
                    "body": "What?",
                    "score": -9,
                    "replies": [
                        {
                            "author": "ZipMonk",
                            "body": "Mexico - it's all Mexico.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "slicehyperfunk",
                                    "body": "I don't believe that everything pictured was once Mexico. Texas is what the US stole from Mexico, beyond that on our side we purchased from France.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "ZipMonk",
                                            "body": "Yes probably right but doesn't make much difference.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "teleskopez",
                    "body": "Very little of this was Mexico prior to US acquisition besides the parts that are still Mexico",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "onomatodingdong",
            "body": "[Ya can't post yr way outta fascism](https://www.404media.co/you-cant-post-your-way-out-of-fascism/)\n\n\nThis change was registered with the [department of the interior](https://www.doi.gov/pressreleases/interior-department-advances-restoration-historic-names-honoring-american-greatness)... Alphabet will ignore the complaints until DOI rescinds \n\n\nUsing a form to drop a comment in a dead letter box isn't gonna help anyone",
            "score": 9,
            "replies": [
                {
                    "author": "thornyRabbt",
                    "body": "And here is [Google's blog post](https://blog.google/products/maps/united-states-geographic-name-change-feb-2025/) explaining their policy is to follow national info systems:\n\n> In the U.S., the [Geographic Names Information System](https://www.usgs.gov/tools/geographic-names-information-system-gnis) (GNIS) has officially updated “Gulf of Mexico” to “Gulf of America.” As we announced two weeks ago and consistent with our longstanding practices, we’ve begun rolling out changes to reflect this update. People using Maps in the U.S. will see “Gulf of America,” and people in Mexico will see “Gulf of Mexico.” Everyone else will see both names.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChrisCrossX",
            "body": "These people are just the embodiment of weakness. Just pure weakness.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Heldane616",
            "body": "That’ll show em!",
            "score": 17,
            "replies": []
        },
        {
            "author": "xMYTHIKx",
            "body": "Google literally set out a trash can and labeled it \"suggestions\" and libs are straight up excited to fill it up.",
            "score": 17,
            "replies": []
        },
        {
            "author": "dj_mackeeper",
            "body": "it's time to fight fire with fire, we need a lib to campaign on a platform of changing the name to 'Gulf of Mēxihco', we must restore its Nahuatl roots, this should be the key policy issue in 2029.",
            "score": 28,
            "replies": []
        },
        {
            "author": "tarzven",
            "body": "Come to think of it, has he already discussed renaming New Mexico to New America too?",
            "score": 6,
            "replies": []
        },
        {
            "author": "wget_thread",
            "body": "Liberals doing something performative and pointless valuing aesthetics over struggle? Nahhhh",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mcskrully",
            "body": "Resistance just means outrage to them.",
            "score": 6,
            "replies": []
        },
        {
            "author": "None",
            "body": "cow brave simplistic pet wakeful bike money plate bear pocket\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
            "score": 10,
            "replies": []
        },
        {
            "author": "Karanpmc",
            "body": "Damn, google is desperate for traffic...",
            "score": 5,
            "replies": []
        },
        {
            "author": "uppers36",
            "body": "that'll show 'em",
            "score": 6,
            "replies": []
        },
        {
            "author": "commifeminist",
            "body": "They did this shit for palestine, obviously it worked guys",
            "score": 5,
            "replies": []
        },
        {
            "author": "DasSapphire",
            "body": "so epic resistance core wholesome chungus 100!!!! erm give reddit gold please, it would make kamala and Joe proud xddddddd",
            "score": 1,
            "replies": []
        },
        {
            "author": "capsandnumbers",
            "body": "I hope it's not where a person's resistance starts and ends, but I do think resisting on every single thing can't be bad. There's some value in not letting something pass unopposed, even if it's a relatively unconsequential thing.",
            "score": 0,
            "replies": [
                {
                    "author": "malk500",
                    "body": "Yes, but this isn't resistance.\nSending suggestions via the companies own suggestion function? I'm not saying the issue is meaningless, just the tactics.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zacravity",
            "body": "Done.",
            "score": -7,
            "replies": []
        },
        {
            "author": "AccessZealousideal40",
            "body": "Done",
            "score": -3,
            "replies": []
        },
        {
            "author": "jpattie_g",
            "body": "Whatever. I’m sure everyone here is doing so much more than posting comments to this sub /s",
            "score": -11,
            "replies": [
                {
                    "author": "Viztiz006",
                    "body": "This is the most useless thing you can get distracted by",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "JangoFetlife",
            "body": "Google has already shut this feature down",
            "score": -5,
            "replies": [
                {
                    "author": "roominatingthoughts",
                    "body": "No they didn't, it just let me do it now",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tickedoffllama",
            "body": "I know we are mocking this. But jt is funny that what they are referring to is Google generated text, the first actual result is good old Wikipedia which is titled Gulf of Mexico",
            "score": -2,
            "replies": []
        }
    ]
}