{
    "title": "Checkmate, fascists.",
    "author": "lightiggy",
    "subreddit": "LateStageCapitalism",
    "rank": 259,
    "score": 875,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 23,
    "url": "https://i.redd.it/p837lhgg17je1.png",
    "id": "1iporul",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SchizoidRainbow",
            "body": "Czechmate",
            "score": 154,
            "replies": [
                {
                    "author": "lightiggy",
                    "body": "https://preview.redd.it/pdu3y8jk58je1.png?width=320&format=png&auto=webp&s=30fb4108eab0574122520948e76059da4cf3bf42",
                    "score": 56,
                    "replies": []
                },
                {
                    "author": "nefastvs",
                    "body": "Right? OP missed this layup.",
                    "score": 41,
                    "replies": []
                }
            ]
        },
        {
            "author": "Robbers_Daughter",
            "body": "Why does the article specify that they were unarmed? Has anyone in human history been given a weapon before they're executed?",
            "score": 49,
            "replies": []
        },
        {
            "author": "ThePolishBayard",
            "body": "Lmao that’s some satisfying justice",
            "score": 34,
            "replies": []
        },
        {
            "author": "CheeseDaver",
            "body": "can someone explain this meme for those of us who don’t know what it’s in response to?",
            "score": 26,
            "replies": [
                {
                    "author": "Anastrace",
                    "body": "It's a reference to the stories of people who say their grandpa was a soldier killed by the Soviets in ww2.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "CronoDroid",
                            "body": "Ma poor grandpappy was just an electrician, look at those two lightning bolts on his uniform collar.",
                            "score": 39,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "blackbartimus",
            "body": "Victims of communism memorial dorks are weeping crocodile tears.",
            "score": 29,
            "replies": []
        },
        {
            "author": "OpT1mUs",
            "body": "Not bad not bad, but have you considered:\n\nhttps://en.m.wikipedia.org/wiki/Barbara_Pit_massacre",
            "score": 23,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -33,
            "replies": [
                {
                    "author": "DrBubonik",
                    "body": "They weren't conscripts they were a volunteer militant wing of the Nazi party that was fiercely loyal to Hitler ya know like most SS divisions, let's not do clean Waffen-SS now. You can prevent this mistake pretty easy by looking up the division before saying something like this or you know not offering sympathy to some of the worst the Nazi party...",
                    "score": 52,
                    "replies": [
                        {
                            "author": "BadCompany22",
                            "body": "Don't forget that the Czechs and Slovaks finally got their independence in 1918, only to get sold out by the Allies and occupied again. \n\nThe last President of the Second Czechoslovak Republic and nominal president of the German Protectorate of Bohemia and Moravia died in prison. All three Prime Ministers that survived the war spent time in prison. The President and Prime Minister of the puppet Slovak Republic were both executed after the war. Post-war Czechoslovakia had little love for Nazi collaborators.",
                            "score": 21,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "maghau",
                    "body": "It most certainly does seem like something to celebrate. \n\nLol, look through this guy’s comment history. Clearly, he’s an ‘anti-communist.’",
                    "score": 21,
                    "replies": [
                        {
                            "author": "NewTangClanOfficial",
                            "body": "They're gone now, washed away like piss in the rain.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rafael_Luisi",
                    "body": "SS arent conscripts, they are all volunteers, since they where a armed arm of the nazi party. They where handling nazis by CHOICE, and they got what was coming for them.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "ThePolishBayard",
                            "body": "For real I cannot believe so many people still don’t understand that. I can have basic empathy for a teenager conscripted into the Wehrmacht at 16. Especially towards the end of the war, German Conscripts were almost exclusively teenagers, senior citizens or men already crippled from birth or from battle from battle, forced to go back as long as they can hold a rifle up long enough to fire a round…. so I’m not going to hold that against them as I view them as also being victims of the Reich and I say this as someone whose relatives survived the camps, so I hope no one thinks I’m spouting the “clean Wehrmacht” myth, I’m certainly not, *but* it is very important for people to know the difference because otherwise NeoNazis will lump the SS psychopath volunteers in the same group as the *Volkssturm* made up of elementary aged boys and men in their 60s who were told “Either fight, or be shot right here where you stand”and try to use that as a way to whitewash and revise the role of the SS. I feel that due to most people not knowing the distinction between the SS as 100% volunteer entity and the Wehrmacht being a mix of forced conscripts and also Nazi fanatics, is why the “just following orders” argument is still breathing. Because neonazis still spread the lie that SS members were simply soldiers doing their job. Nah, fuck that noise. It’s not only volunteer but you also had to beat dozens of other candidates all trying to prove that they’re the most loyal Nazi. These evil fucks *grinded* for their place in the SS….\n\nTL,DR *anyone* who joined the SS quite literally volunteered for a place reserved in hell. Rest in stale two week old piss to all SS.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "MisterRenewable",
                                    "body": "Just started \"All Clear on the Western Front\", and summarily stopped it about 5 minutes in because I simply couldn't watch it knowing what's coming...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dOGbon32",
                    "body": "“It’s unethical to kill surrendered Nazis” my ass.",
                    "score": 70,
                    "replies": []
                },
                {
                    "author": "RumoCrytuf",
                    "body": "Only good Nazi is a dead Nazi.",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "riku32191",
                    "body": "I'll type it out plainly so you get it. \n\nFuck the Nazis.",
                    "score": 45,
                    "replies": []
                }
            ]
        }
    ]
}