{
    "title": "“Headed toward”",
    "author": "haloarh",
    "subreddit": "LateStageCapitalism",
    "rank": 247,
    "score": 2783,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 45,
    "url": "https://i.redd.it/x5bnpoufobje1.jpeg",
    "id": "1iq3xcq",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "kerodon",
            "body": "They mean more friendly.",
            "score": 443,
            "replies": [
                {
                    "author": "haloarh",
                    "body": "Chandler Bing voice: \"Could it get any MORE friendly?\"",
                    "score": 178,
                    "replies": [
                        {
                            "author": "kerodon",
                            "body": "Well I guess there were all those pesky consumer protections and regulations and silly tenants rights that were getting in the way 😤😒",
                            "score": 68,
                            "replies": []
                        },
                        {
                            "author": "MowieWauii",
                            "body": "Sorry but 🤓 Actually \"Could it GET anymore friendly?\"",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Inconspicuouswriter",
                                    "body": "This person Bings.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mattstorm360",
                            "body": "Tenants have rights. It's just hard to fight as not everyone is aware of what their rights are.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "kerodon",
                                    "body": "Tentants in some places have some rights *for now*",
                                    "score": 19,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Taenurri",
                            "body": "Chandler always put the emphasis on the word “get”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 356,
            "replies": [
                {
                    "author": "fazedncrazed",
                    "body": "Wait until you realize thats the entire point of the whole MSM.",
                    "score": 152,
                    "replies": []
                },
                {
                    "author": "Achrus",
                    "body": "Yes.  There are even bots on Reddit that try to amplify some of these articles.  If you sort by new in some of the more politicized subs you’ll sometimes catch 5-10 new accounts each posting new articles from different sources that all contain the same message.  \n\nLike when the layoffs for fed workers came it was all articles saying “whelp, bunch of people got laid off but we kinda saw that coming *shrugs*”.",
                    "score": 55,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Doombait",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "pumpkin3-14",
                    "body": "Manufacturing consent",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "The-Cursed-Gardener",
                    "body": "Corporate news media broadly exists to do this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheNewportBridge",
                    "body": "Called manufacturing consent",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrdaemonfc",
            "body": "My rent has gone up 11% on average every year since the current landlord bought this place.\n\nOne time I had to use a camping toilet for 9 days because the toilets in the entire building all broke down at once and wouldn't flush, and he threatened me later because I had to give up and call the code enforcement on him, which at least got the toilets fixed.\n\nYou'd think with him giving himself an 11% raise every year, which is at least more than triple what anyone else tends to get, we could have a toilet that flushes. \n\nHow much more landlord friendly can you get?",
            "score": 158,
            "replies": []
        },
        {
            "author": "Plankisalive",
            "body": "When are we headed toward guillotine era?",
            "score": 112,
            "replies": [
                {
                    "author": "Eirevlary",
                    "body": "Hopefully soon.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "Bigeasy600",
                    "body": "Once the majority of the working poor can't feed or house their children it is going to get weird.\n\nJust remember everyone, the Reign of Terror was not that scary if you were poor.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Kcirrot",
                            "body": "Respectfully, that is not true.  Many of the Sans-culottes movement, who were advocating for policies that could be seen as a form of proto-communism, were poor but were brutalized and killed during the Terror.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "enjoythesilence93",
            "body": "spoiler alert: we’ve been in one.",
            "score": 48,
            "replies": []
        },
        {
            "author": "therallystache",
            "body": "Landlords provide housing in the same way that scalpers provide concert tickets.",
            "score": 49,
            "replies": []
        },
        {
            "author": "Moebius808",
            "body": "“The shit that’s been getting progressively worse year after year for a long time now is going to accelerate and get worse even faster than before now”\n\nCool, great, wonderful headline. Just a “grab your ass and pray” kind of story, thanks for throwing that out there, WSJ.",
            "score": 35,
            "replies": []
        },
        {
            "author": "YakEnvironmental3811",
            "body": "The real estate parasites are colluding.  They work together and use algorithms to calculate the maximum rent they can charge. They have huge teams with advanced degrees working tirelessly to squeeze every last penny out of you. This is why nobody is having kids.",
            "score": 18,
            "replies": [
                {
                    "author": "anonymalias",
                    "body": "A couple important steps further are 1. not only do they work together but they form massive lobby groups. Realtors make up a significant amount of lobbying each year. 2. they've codified the corruption surrounding housing and finance related to it and its development way beyond anything we can really conceptualize and definitely write out in a post on reddit",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "GoatzR4Me",
            "body": "These people unironically think the covid era was tenant friendly free for all where nobody paid their rent and you couldn't evict anybody. \n\nThey're stuck in their lil bubble of petit bourgeois life surrounded by other middle managers, marketing consultants, and op-ed authors. They truly have no earthly idea of working class conditions.\n\nEdit: oh yea and they are all landlords.",
            "score": 14,
            "replies": []
        },
        {
            "author": "haloarh",
            "body": "[SOURCE with paywall removed](https://archive.is/GUxOS)",
            "score": 29,
            "replies": []
        },
        {
            "author": "Mission-Two-1371",
            "body": "Finally some good news for the propertied class",
            "score": 10,
            "replies": [
                {
                    "author": "Unfounddoor6584",
                    "body": "Won't someone think of the poor landlords?",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "bobbirossbetrans",
            "body": "Fucking paywall",
            "score": 6,
            "replies": [
                {
                    "author": "haloarh",
                    "body": "I removed it.\n\nAlso, you can use https://archive.is/ to remove paywalls.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "bobbirossbetrans",
                            "body": "Thank you!",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Prize-Ad596",
                            "body": "https://paywallreader.com/",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Joe_Hillbilly_816",
            "body": "I survived the Republican Revolution when the cut Rx that cost 5 cents per pill. The dude I was trying to help jumped off a cliff because he ran out of lithium.1  If you're having trouble making ends meet scale down, let things go in default, bail out and hit the ground running. You can survive with a couple duffel bags of belongings.  If you're in a stable situation do mutual aid. Find a city hospital that will take homeless and transient people and find someone who is willing to provide a mail drop. Find a tribe the cooperates with other tribes, hopefully socially conscious tribes. 2 *I'll *apest",
            "score": 3,
            "replies": []
        },
        {
            "author": "StickyTackHead",
            "body": "The era that comes immediately after is the one I’m gearing up for.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kkfluff",
            "body": "My rent is already at the top of what I can safely budget for, if it goes up I’m going to have to move. My place is pretty small…",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tsobe_RK",
            "body": "when are the landlords heading towards guillotines",
            "score": 3,
            "replies": []
        },
        {
            "author": "kitt_aunne",
            "body": "they should expect destroyed cameras and broken windows then.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tuershen67",
            "body": "Aren’t those laws a state by state issue?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rubiks_Click874",
            "body": "let's build the favela",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mad_Shitter83",
            "body": "Eat the landlords!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snoo_65717",
            "body": "Mao",
            "score": 1,
            "replies": []
        }
    ]
}