{
    "title": "Daily Telegraph's 'undercover' fake manufactured antisemitism stunt at Sydney Egyptian coffee shop",
    "author": "Beginning_Ground9472",
    "subreddit": "LateStageCapitalism",
    "rank": 252,
    "score": 1204,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 29,
    "url": "https://i.redd.it/mlorjtllzbje1.png",
    "id": "1iq5ajo",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beginning_Ground9472",
            "body": "According to a chef at the cafe, Birenbaum allegedly made a comment.\n\nhe reached the door, it is alleged he asked a staff member if his presence was upsetting them because he was Jewish. It's alleged the exchange then led to a verbal altercation between cafe staff, onlookers, Birenbaum and the newspaper's crew, who soon made an exit.\n\nOne woman began filming the newspaper team and Birenbaum, at one point saying: \"You picked the wrong restaurant to f------ try this shit in.\"\n\n\"We are a small community restaurant,\" El Masry said.\"We accept everyone into our restaurant and respect all walks of life.\" says the restaurant owner.\n\n[The incident was captured on Camera](https://www.youtube.com/watch?v=Nm4DZWMW9d4&ab_channel=9NewsAustralia)",
            "score": 275,
            "replies": []
        },
        {
            "author": "JakobVirgil",
            "body": "The thing is it is not hard to find open and virulent antisemitism but not from the people the Harbarists need it to be from.",
            "score": 367,
            "replies": [
                {
                    "author": "Beginning_Ground9472",
                    "body": "Australia has been too quiet and not enough antisemitism. \n\nThe irony of it is most if not all these groups are Europeans and not sematics ",
                    "score": 74,
                    "replies": [
                        {
                            "author": "JakobVirgil",
                            "body": "It is the MAGA crowd who hate jews but support Israel.",
                            "score": 93,
                            "replies": [
                                {
                                    "author": "Beginning_Ground9472",
                                    "body": "Exactly, it’s unfortunate how the Zionsts are using Jews as their Trojan horse for imperialist capitalism ",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "author": "TaoGroovewitch",
                                            "body": "...And the \"validity\" of ethnostates.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MrTubalcain",
                    "body": "I’m curious can you provide some recent examples of open and virulent antisemitism?",
                    "score": -46,
                    "replies": [
                        {
                            "author": "Beginning_Ground9472",
                            "body": "synagogues get attacked yearly by Natzis but Zionsts are big supporters of them so it’s basically rarely covered.\n\n It’s only if an incident involves Arabs or POC when they come out of the wood works.",
                            "score": 91,
                            "replies": []
                        },
                        {
                            "author": "The_Anxious_Chihuaha",
                            "body": "It's been like five days since Kanye West flooded Twitter discussing how much he loves Hitler before only selling a literal swastika T-shirt on his website. It's also been about two weeks since Elon was doing a Nazi salute in public.\n\nI'm not defending Israel's actions in Gaza. But to say antisemitism isn't out there is shortsighted.",
                            "score": 86,
                            "replies": [
                                {
                                    "author": "JakobVirgil",
                                    "body": "You don't have to defend Israel in Gaza the Antisemites will do it for you.   \nBlood and Soil types love Israel's blood and soil projects",
                                    "score": 50,
                                    "replies": []
                                },
                                {
                                    "author": "rainofshambala",
                                    "body": "ADL said that Elon didn't do a Hitler salute while complaining about college protests. Zionists get to decide what is antisemitism",
                                    "score": 37,
                                    "replies": []
                                },
                                {
                                    "author": "MrTubalcain",
                                    "body": "I’m not suggesting that you’re pro-genocide or anything like that. I’m curious as to what is considered antisemitism because if you recall the ADL defended Musk’s obvious Nazi salute but condemned Kanye’s tweets so the charges of antisemitism are hollow and extremely selective. Not to mention, Musk’s history in South Africa has revealed that he’s always been pro-fascist and pro-Nazi, it runs in his family and the salute was common among them in South Africa. Jewish people today are not in any imminent danger from some dictator or group and yet the Zionists still align themselves with people who would otherwise want to eliminate them, make it make sense.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "The_Anxious_Chihuaha",
                                            "body": "\nI guess that would be up to each individual. I completely agree with you that the ADL and their application of the label has been highly selective and politically expedient.\n\n      For the moment, Musk is essentially the co-president of the most powerful nation in the world. He also is doing so as part of a coalition that is composed of a significant number of evangelicals who believe Israel's resurrection as a state and the rebuilding of a second temple is essential to bringing about the end times.\n\n     There are a lot of reasons it's easier politically to sidestep that indiscretion and the political influence that may bring over the current administration. With Kanye, it's easier to point and apply the label because it highlights the problem of antisemitism continuing to exist and costs nothing politically.\n\n    Again every single part of that is bad. But politically it's a short term gain for a long term loss in credibility.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "TaoGroovewitch",
                                            "body": "1.) Kanye is.... Black. And mentally ill. \n\n2.) The Venn diagram between Zionists and white nationalists is The Ethnostate.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JakobVirgil",
                            "body": "I could give you a facebook link if you want",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "throwawayfem77",
            "body": "This man is not only a paid provocateur, he is a known infiltrator of Pro-Palestine protests in Sydney.\nHe cos-plays as a protestor and wears anti-Israel clothing.",
            "score": 49,
            "replies": []
        },
        {
            "author": "murray_mints",
            "body": "How on earth did they think that was a good idea?",
            "score": 44,
            "replies": [
                {
                    "author": "Habaree",
                    "body": "Daily Telegraph is one of our top 3 trashiest “news” companies. This is exactly the kind of shit they’d pull. It’s right up Murdoch’s ass",
                    "score": 68,
                    "replies": []
                },
                {
                    "author": "senzare",
                    "body": "Fabricating stories is their default, so not sure what you mean by that.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beginning_Ground9472",
            "body": "[https://www.9news.com.au/national/daily-telegraphs-undercover-stunt-at-sydney-cafe-causes-stir/fbc61790-9f45-47bf-86c2-01368126df2e](https://www.9news.com.au/national/daily-telegraphs-undercover-stunt-at-sydney-cafe-causes-stir/fbc61790-9f45-47bf-86c2-01368126df2e)",
            "score": 21,
            "replies": []
        },
        {
            "author": "YakEnvironmental3811",
            "body": "Israel uses false flags to stir up support. This is not antisemitic- it is a fact. The Amsterdam soccer incident was preplanned. Mossed agents stirred up trouble and local politicians were ready to denounce a \"pogrom\". The mysterious drones on the east coast of the US were \"iranian\". And then there's the USS Liberty.",
            "score": 18,
            "replies": []
        },
        {
            "author": "A-CAB",
            "body": "Rule 14 requires article submission me to include a written summary or abstract. Please add that to the post and we can consider putting it up.",
            "score": 15,
            "replies": [
                {
                    "author": "Beginning_Ground9472",
                    "body": "Not sure how since it was deleted but I add a comment with a summary",
                    "score": 11,
                    "replies": [
                        {
                            "author": "A-CAB",
                            "body": "Ok it’s approved.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fermentedbolivian",
            "body": "Imagine walking with a free palestine shirt into a synagogue, they'd arrest you.",
            "score": 5,
            "replies": []
        },
        {
            "author": "One_Brush6446",
            "body": "I cant wait for Wasreal",
            "score": 2,
            "replies": []
        },
        {
            "author": "dj_mackeeper",
            "body": "just quietly, I go to that place sometimes and the food is so fuckn good, i hope they get more business just to spite the telegraph",
            "score": 2,
            "replies": []
        },
        {
            "author": "Far-9947",
            "body": "This is how they try to justify all the fucked up shit they do to others.\n\n\nOppressive regimes have been doing it since the beginning of time.",
            "score": 1,
            "replies": []
        }
    ]
}