{
    "title": "TFW you exterminate a whole island to secure a monopoly on nutmeg:",
    "author": "lightiggy",
    "subreddit": "LateStageCapitalism",
    "rank": 245,
    "score": 1469,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 69,
    "url": "https://i.redd.it/n15sxuau0dje1.png",
    "id": "1iqa256",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "The Dutch history is protected because they invented unbridled capitalism. We are not ready to look at them and realize the Dutch East India Company is what we are currently doing.",
            "score": 475,
            "replies": [
                {
                    "author": "lightiggy",
                    "body": "Britain applying the lessons of capitalism against the children of their own teachers after vast gold mines are discovered in the Boer Republics:\n\nhttps://preview.redd.it/nv62hzbkgdje1.png?width=640&format=png&auto=webp&s=6ba4511b9bcefc993871275a2851e0366516672a",
                    "score": 152,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Does it always have to be a pepe meme? Woof. Though I suppose it supports my point that we are not ready to take it seriously.",
                            "score": 37,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "beanofdoom001",
            "body": "Growing up in the US contributed to me internalizing a lot of self-hatred.\n\nThe culture and implicit notions I grew up with included this assumption of criminality or stupidity that went along with this skin color. People for example would always remark on well I expressed myself-- but I didn't do so any better than anyone else around me-- it's just that I happened to be black.\n\n*You express yourself well \\[for a black guy\\]* That was the implicit notion... when it wasn't said explicitly.\n\nMy first girlfriend, whose dad didn't like me because of my skin color, said:\n\n\"Well I don't get it anyway, I mean you're so well spoken I've never even thought of you as being black.\" I realized that this was supposed to have been a compliment.\n\n\"one of the good ones\" I guess.\n\nGrowing up black in white spaces there was weird looks, odd questions, being constantly singled out, being asked constantly why I was in places, who I was with; it was endless harmless jokes-- even on the part of well-meaning people.\n\nFor a good while there I hated my skin. I didn't want to be bothered with it. I saw it as this whole extra thing I had to endure and to situate myself toward. There's a lot of baggage that comes along with being black in the US. And I didn't wanna be a \"black\" guy, I just wanted to be a guy.\n\nThe bit people don't seem to get is that it's not just the odd notions, implicit or otherwise, people hold about you, it's the headspace it puts you in, constantly wondering how much-- or whether or not-- your skin is playing a role in the interactions you have there.\n\nThis is all why I had to leave. Racism exists everywhere, it's true; I like to think of it coming in \"flavors\", but 'murican has to be my least favorite flavor. Here-- I live in a medium-sized western EU country-- it just doesn't hit the same way.",
            "score": 235,
            "replies": [
                {
                    "author": "SweetHomeChiraq",
                    "body": "It's difficult, I've tried. But I can't forget the face of the women who screamed racial slurs at me.",
                    "score": 67,
                    "replies": []
                },
                {
                    "author": "saposmak",
                    "body": "Commiserations from a Black (among others!) guy who didn't grow up in America, but live here and nonetheless remain astonished at the degree to which Americans have embraced the systemic racism permeating their entire sociopolitical apparatus. I'm 40 years old, \"successful\",  white collar job, etc. And still. \n\nI was at a work party in Vegas last week. The last night of the work conference, a small group of us decided to go to a karaoke bar.   \n  \nThe lady who organized it asked me on 3 separate occasions, \"who I was with?\" \n\nWat. Lady, \"I work here, have for almost 5 years.\"\n\n\"Wait, who do you report to?\" \n\n\"\\*\\*\\*\\* \\*\\*\\*\\*\\*\\*\".\n\n\"Oh, yeah \\*\\*\\*\\*. \"  \n\"You're so cute.\"  \n  \nTime passes by.\n\n\"Tell me again who you report to?\"",
                    "score": 34,
                    "replies": []
                }
            ]
        },
        {
            "author": "Toshero_Reborn",
            "body": "The fact that \"a group of Dutch people split off from the Dutch to be more racist\" has happened multiple times is absolutely mind boggling",
            "score": 65,
            "replies": [
                {
                    "author": "Jemerius_Jacoby",
                    "body": "This is basically what America did too. The British, after the Seven Years War, announced the Proclamation of 1763 that prohibited settlement past the Appalachians. This wasn’t benevolence towards Native Americans, but an effort to stop conflict between settlers and Indians that Britain would have to expend money and troops on. This was of course a major catalyst for the Revolution. \n\nAnother comparison is the reaction of Zionist groups in Palestine to the British White Paper of 1939. This restricted immigration after the 1936 Arab Revolt and rising tensions in Europe.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Soviet-pirate",
                            "body": "Goddamn,Britain of all countries tried to do the nice thing and fuckers had to ruin it TWICE",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Jemerius_Jacoby",
                                    "body": "Lol yeah that’s what settlers do, they need constant expansion. Britain simply didn’t want to over extend themselves, it was completely pragmatic not moral.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Soviet-pirate",
                                            "body": "Broken clock still right",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Jemerius_Jacoby",
                                                    "body": "Tru",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "RoninTarget",
                                    "body": "Well, at least they freed George Washington's slaves...",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lightiggy",
            "body": ">In 1815, a farmer from the eastern border of the Cape Colony, [Frederik Bezuidenhout](https://en.wikipedia.org/wiki/CF_Bezuidenhout) was summoned before a court after being accused of abusing one of his Khoi labourers and refusing to pay him. After refusing to show up, he was sentenced to a month in jail for contempt of court and an order for his arrest was issued. Upon being confronted, Bezuidenhout resisted arrest and fled to a cave near his home, where he fought the Coloured soldiers sent to capture him. After refusing to surrender, Bezuidenhout was shot and killed by one of the soldiers.\n\n\"Ladies and gentlemen, we got hi-\" (reads about [the rebellion](https://en.wikipedia.org/wiki/Slachter%27s_Nek_Rebellion) that followed this incident):\n\nhttps://preview.redd.it/xmlicx8e1dje1.png?width=577&format=png&auto=webp&s=0a86ba4fa987eea42592154ac512ecc887ef08c2",
            "score": 81,
            "replies": []
        },
        {
            "author": "Zrakoplovvliegtuig",
            "body": "The Dutch similarly feel like victims of WW2, even though some of the highest proportions of Jews were exterminated in the Netherlands, and the Dutch decided to invade Indonesia with 150.000 men to commit war crimes right after the war (having learnt absolutely nothing).\n\nDon't look at Belgium in Congo though. That is truly horrifying.",
            "score": 72,
            "replies": [
                {
                    "author": "None",
                    "body": "Give us a hand and teach us. \n\nOh.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Jemerius_Jacoby",
                    "body": "Yeah all the European powers that lost their colonies in WWII immediately sent out forces to reconquer them. The same armies that liberated their own country went to re-subjugate someone else’s country on the other side of the world. They would have never had the ability to do this either without American weapons that replaced their destroyed military industry.\n\nThe British, French and Dutch even used Japanese soldiers as auxiliaries to hold ground until they came back in enough force. The bloody nose that anti-colonial forces gave them is really what proved to them that imperialism is untenable, not WWII as you point out.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 14,
                    "replies": [
                        {
                            "author": "ThunderPreacha",
                            "body": "For those who want a better perspective: https://www.annefrank.org/en/anne-frank/go-in-depth/netherlands-greatest-number-jewish-victims-western-europe/",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Zrakoplovvliegtuig",
                            "body": "The focus in teaching lies heavily towards being a victim. Collaboration and consequent invasions of colonies are definitely not covered to an equal extent, or were not in my time. It can be said that many Dutch people were victims, but the extent to which the Dutch state was a victim is debatable. Especially in relative terms compared to Slavic states under occupation.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Moochingaround",
                                    "body": "Heck, I remember my primary school teacher telling us Hitler saw the Dutch as almost as Arien as the Germans, he sounded proud.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "palf_070",
                    "body": "The reason for this is that the administration in the Netherlands was immaculate.\nThe Germans swooped in, found the registers where every one lived and what religion people had. Was very easy to round them up.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChickenNugget267",
            "body": "Which island?",
            "score": 23,
            "replies": [
                {
                    "author": "lightiggy",
                    "body": "https://en.wikipedia.org/wiki/Dutch_conquest_of_the_Banda_Islands",
                    "score": 27,
                    "replies": [
                        {
                            "author": "mvonballmo",
                            "body": "[The Nutmeg's Curse by Amitav Ghosh](https://en.wikipedia.org/wiki/The_Nutmeg%27s_Curse) is a great book that starts off on this subject (in ruthless detail), then continues with the thesis that capitalism and empire are all about terraforming.",
                            "score": 21,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Numerous-Ad-8743",
            "body": "People forget where the Belgians originally learned their well known modern national pastime (brutally mutilating and amputating infants and toddlers en masse) from. The scum of humanity.\n\nDutch East Indies occupation was so horrid that the locals saw their one chance to escape the torment (post WW2) and declared independence rather than be handed back to those losers",
            "score": 20,
            "replies": [
                {
                    "author": "RoninTarget",
                    "body": "> People forget where the Belgians originally learned their well known modern national pastime (brutally mutilating and amputating infants and toddlers en masse) from. The scum of humanity.\n\nLeopold II cast a wide net. He was the type to spend weeks in archives of Portugese and Spanish colonial expeditions as a teenager. A life-long enthusiast of colonialism, determined to combine it all.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "DutchingFlyman",
                    "body": "Also Indonesians from the Moluccas had to flee to the Netherlands because they were about to be genocided by the local Muslim majority but that doesn’t fit the narrative so this sub wouldn’t mention it",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Inner-Mechanic",
                            "body": "Oh look, European imperialism destabilized a region that led to power vacuums other groups seeked to capitalize on, how can I blame this on the outgroups I personally dislike? \n\n\nThanks for illustrating why it's so easy for fascists to win. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DutchingFlyman",
                                    "body": "Why would I dislike them? Also, if European imperialism is to blame, why would the overwhelming majority of the post-colonization Indonesia be muslim?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Expensive_Poop",
            "body": "There's a tribe called Polahi in indonesia \n\nIt was normal seafaring tribe like another indonesian, but all of their culture changed when dutch came \n\nDutch came and they escape from their island (probably around moluccas because they share same body characteristic), flee to forest in other island (Sulawesi) to avoid whatever dutch doing (it was written as \"dutch want to collect tax\" but indonesian history often softening words) \n\nThey still in forest until today. Still scared and avoid contact to outsiders. And worst part of it because sometimes they cant even meet another member of their tribes, they do inbreeding\n\nNot to mention unwritten genocide (if you go to eastern islands, you often find story about how this island have population but now empty because of dutch) and removal culture (papuan islamic sultanate almost lost and indonesian naval culture already nonexistent. Even nobody think that madagascar is from indonedia until scientist rediscover that by checking their dna)\n\nWell... Tldr: dutch is racist genocidal maniacs",
            "score": 35,
            "replies": []
        },
        {
            "author": "simonxvx",
            "body": "I don't really understand the meme, what is Danny DeVito \"getting\" ? The Europeans understand the American racism towards black people, while Americans understand the racism suffered by the Romani people in Europe, is that what it means ?",
            "score": 7,
            "replies": [
                {
                    "author": "Holubice",
                    "body": "Roughly.  The meme is supposed to be each side waking up to the *justified* racism of the other side.  It's gross.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "TuvixWillNotBeMissed",
                            "body": "Oh. So through travel and new experiences they have learned to be more racist. That's... quite something.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WuQianNian",
                    "body": "The opposite probably, expect it’s a conservative pov being quoted",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "hugz4jesus",
            "body": "The dutch are like the only ones still proud of their colonial history, too. Truly a nation of assholes.",
            "score": 80,
            "replies": [
                {
                    "author": "Dave-the-Flamingo",
                    "body": "In a night out in Amsterdam, I (a Brit) was told by a proud drunk Dutch banker - “you may have had an empire. But WE invented the apartheid” \nNo shame.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "PantojaLover69",
                    "body": "Not true at all lmao. Ask any brit or fr**ch about their colonizing, they'll happily justify it",
                    "score": 35,
                    "replies": [
                        {
                            "author": "hugz4jesus",
                            "body": "https://www.statista.com/statistics/1103087/people-s-pride-in-former-empires-2019/ ",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fostara",
                    "body": "Thank you for het complimentje, but it's not true.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "cenesontquedesgueux",
                    "body": "Ah, yes, all the Dutch of course. I don't remember being asked but alright.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "hugz4jesus",
                            "body": "You have a national holiday that centers around dressing up in blackface. ",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "error_98",
                                    "body": "Which turns into a \"national discussion\" each year as by now the majority of people recognizes how fucked it is, thats why these days all nationally organized festivities use either a variety of colors, or just apply smudges of chimney sut. \n\nThese days If you see someone if full black pete blackface that's them self-reporting as a far-right weirdo.\n\nOverall our relationship with our national history is a complicated one, for what its worth (which clearly isn't much) one book criticizing the dutch empire from the POV of the native victims is mandatory literature for all dutch highschool kids. Statues to the worst offenders of that time are being torn down, and monuments to victims are built in each of the historic ports.\n\nNow the biggest party, the USA-funded PVV is against all that of course. Thank fuck they don't quite have the majority they need to get anything done.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "cenesontquedesgueux",
                                    "body": "Again, not something everyone celebrates.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "Arsacides",
                                            "body": "no but clearly indicative of local culture if it’s a widespread holiday",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "DutchingFlyman",
                                                    "body": "The blackface is very frowned upon nowadays but I guess ignorance is bliss so congrats",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Arsacides",
                                                            "body": "gast ik ben zelf nederlands, wil je nu doen alsof er niet genoeg mensen zijn die alles rondom zwarte piet maar onzin vinden? als je een paar kilometer buiten de randstad komt zal je gewoon weer de oude karikatuur met gouden oorbellen, rode lippen en kroeshaar vinden. bovendien hebben we nu een fascistische regering die pro-zwarte piet is, dus het valt wel mee het hoe 'frowned upon' het is.\n\nen daarbuiten is het in eerste instantie al fucking insane dat de activisten achter kick-out zwarte piet een decennium van bedreiging, fysiek geweld en ridiculisering hebben moeten meemaken voordat we op het punt zijn gekomen dat het überhaupt serieus werd genomen om zwarte piet af te schaffen.\n\nnederland is gewoon een diep racistisch en conversatief land\n\n  \nedit:\n\ncase from 2024 about activists being physically attacked demonstrating against the racist caricature of zwarte piet\n\n[https://www.rechtspraak.nl/Organisatie-en-contact/Organisatie/Rechtbanken/Rechtbank-Overijssel/Nieuws/Paginas/Taakstraffen-voor-openlijk-geweld-bij-sinterklaasintocht-Staphorst-.aspx](https://www.rechtspraak.nl/Organisatie-en-contact/Organisatie/Rechtbanken/Rechtbank-Overijssel/Nieuws/Paginas/Taakstraffen-voor-openlijk-geweld-bij-sinterklaasintocht-Staphorst-.aspx)",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "justamoroseman",
                                                            "body": "No it’s not. Yall are still so racist",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Inner-Mechanic",
                            "body": "You're right, the dutch shouldn't be judged by their worst individuals. Still, you shouldn't let how functional your infrastructure and govt bureaucracy is, at least in comparison to the rest of the world, excuse your leadership. They are just as evil as the ones in America or Britain or Germany or anywhere else. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cenesontquedesgueux",
                                    "body": "Where am I excusing our leadership, though? I fucking hate the rightwing dumbasses who are in government now. But I disagree with then declaring the whole population to be assholes. No war but class war, right?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Inner-Mechanic",
                                            "body": "I mean a lot of the Dutch seem to think their govt isn't as evil and duplicitous as other countries bc they aren't experiencing the kind of collapse in quality of life like the English who are stuck drinking  poo water from the Thames bc their water system was privatized or *points to the flooded dumpster fire that is America* \nSo it's good to keep that in mind \nBut yeah, no war but the class war ✊",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fant92",
            "body": "Yeah, our history is horrendously shameful. But they don't teach a lot of it properly in schools and the Dutch people tend to be very dismissive about it. We've had a year long debate on if our government (should've been our damn king as he's still sitting on colonial profits) should apologize for our colonial crimes against humanity. People get extremely defensive when this comes up, like they have to defend their country no matter what. \n\nI fucking hate the Netherlands. It's not a bad place to live but I hate what it stands for and I hate how it's been regressing in terms of progressivism and I've hated our dismissive right wing politicians for as long as I can remember. This country is still a capitalist-dicksucking shithole. It just has good PR and tourists claim to love it because they spend at most 2 days getting stoned in Amsterdam.",
            "score": 13,
            "replies": [
                {
                    "author": "Arsacides",
                    "body": "i can tell you as someone from Dutch and Moroccan heritage: it was never progressive",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Fant92",
                            "body": "Depends, it used to be pretty progressive in terms of gay rights and drug laws but especially in the latter category we're being overtaken.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Inner-Mechanic",
                                    "body": "That's faux progress neoliberals point to to paper over the ocean of blood money they used to build their current regime. In the end it only applies to rich gays, and bc they love to profit from drug users more than they hate/ fear drug use. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "magnetronpoffertje",
                    "body": "I am natively Dutch and HARD AGREE.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "WalterJozney",
            "body": "LPOTL?",
            "score": 5,
            "replies": [
                {
                    "author": "None",
                    "body": "If the people in this sub haven't listened to the LPOTL or the Dollop or the Behind The Bastards episodes on the Dutch. They probably could. Perhaps even, should.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "magnetronpoffertje",
            "body": "The Dutch have historically been a cancer on the planet and will continue to be. I'm saying this as a Dutch person.",
            "score": 2,
            "replies": [
                {
                    "author": "prem_killa11",
                    "body": "Well any nation that adopted the manifest destiny ideology is a cancer to society. Let’s not pull punches.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "magnetronpoffertje",
                            "body": "Yeah and a lot of those nations get the deserved hate for it, meanwhile the Dutch practically got away with it, in turn causing the Dutch society to stay oblivious to their past and to have a stronger tendency for crappy ideologies",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Inner-Mechanic",
                                    "body": "It's bc they haven't squeezed their people as brutally as the English, Americans and Germans did. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Your post was removed because it contained a racist term. You should receive a message from the automoderator telling you the exact term the post was removed for. For more information, see [this link](https://weeklysift.com/2015/06/29/slurs-who-can-say-them-when-and-why/). **Avoiding slurs takes little effort, and asking us to get rid of the filter rather than making that minimum effort is a good way to get banned. Do not attempt to circumvent the filter with creative spelling; circumventing the filter will result in a permaban.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kazeshio",
                            "body": "That was one of the best argued articles I've ever read, thanks automod. I wasn't even the one with the removed comment.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}