{
    "title": "Anyone got any good reads thats explain what exactly socialism is?",
    "author": "CheeseReaper77",
    "subreddit": "LateStageCapitalism",
    "rank": 262,
    "score": 9,
    "upvote_ratio": 0.6,
    "num_comments (reported by reddit)": 25,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iqe2be/anyone_got_any_good_reads_thats_explain_what/",
    "id": "1iqe2be",
    "selftext": "Ngl, kinda being lazy here since this is technically for a college essay. I figured this is a pretty good place to start before I start digging through hundreds of sources looking for something thats actually decent enough to include in my essay.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Solidarity_Forever",
            "body": "G.A.Cohen's WHY NOT SOCIALISM? is basically an essay published as a little standalone book\n\n\nCohen was raised by working class Jewish Communists in Montreal and ended up working as a philosopher out of Oxford, retained his socialist beliefs lifelong. the professional philosopher training really makes him good at explaining his points, and he's also a charming writer. the book is well-argued but totally accessible to nonspecialists ",
            "score": 19,
            "replies": []
        },
        {
            "author": "mcphearsom1",
            "body": "Alright, how about this: first, apply supply and demand to the labor market.\n\nSecond, look at the curve of labor supply, people actually working to make things or provide services. 2a, what does the curve of labor demand look like compared to labor supply. 2b, what material resources do they use to make stuff or do things.\n\nThird, look at who owns the shit workers use to do stuff. What do they do with their ownership? (Hint: skim literally as much as they can while still maintaining the basic functionality of society.)\n\nCommunists and socialists want the resources capitalists own to instead be collectively owned, so that no one can skim off labor and society for their own enrichment.\n\nBonus thoughts: society is changing. If the resources that capitalists own can now do all the menial work through robots and thinking work through AI, and we still exist in a capitalist society in which we either work or die, what the fuck do we do for work?\n\nYou’ll hear a lot about “diametrically opposed goals” from Marx and Engles, it boils down to labor wanting a larger proportion of the benefits resulting from the work they did, and capitalists also wanting more of it. Communism just sides with labor. Needs of the many and all that.",
            "score": 8,
            "replies": []
        },
        {
            "author": "faiek",
            "body": "Understanding Socialism by Dr Richard Wolff. ",
            "score": 8,
            "replies": []
        },
        {
            "author": "Randal_the_Bard",
            "body": "The communist manifesto immediately comes to mind if you haven't read it. It's not even very long",
            "score": 30,
            "replies": [
                {
                    "author": "Randal_the_Bard",
                    "body": "Some other valuable reads;\n\n\n•Unionism and socialism: a Plea for Both by Eugene Debs\n•Socialism: utopian and scientific by Engels\n• Imperialism by Lenin \n• Blackshirts and Reds by Parenti \n• Quatiations from chairman Mao \n• Kapital by Marx (this one is more of a challenge)",
                    "score": 14,
                    "replies": [
                        {
                            "author": "zychicmoi",
                            "body": "this is a solid list. I would say What Is to Be Done and Imperialism by Lenin and just read the wiki on the grundrisse and kapital as both are tedious reads.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "CheeseReaper77",
                            "body": "Wow thanks, thats a lot of stuff. I’m definitely going to take a look at all this",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Randal_the_Bard",
                                    "body": "Glad to hear it! If time or attention are factors, check out some summaries or video essays about them before deciding which one to pick up first. There's no substitute for directly reading the book, but that doesn't mean other resources aren't also valuable. Happy learning !",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "4spooky6you",
            "body": "The principles of communism - Engels (https://www.marxists.org/archive/marx/works/1847/11/prin-com.htm)\n\nSocialism utopian and scientific - Engels (https://www.marxists.org/archive/marx/works/1880/soc-utop/)\n\nBonus reading:\n\nThe state and revolution - Lenin (https://www.marxists.org/archive/lenin/works/1917/staterev/)",
            "score": 10,
            "replies": []
        },
        {
            "author": "Straight-Razor666",
            "body": "Principles of Communism, Engels.",
            "score": 4,
            "replies": []
        },
        {
            "author": "eyeh8nazis",
            "body": "Das Kapital",
            "score": 3,
            "replies": []
        },
        {
            "author": "not_GBPirate",
            "body": "Not a good answer for explicitly answering your question but this interview explains some things about economics so succinctly and clearly it was an amazing experience. https://youtu.be/r6Ovguv1BSA?si=l8LWiNKM-hQ1t9b_",
            "score": 2,
            "replies": []
        },
        {
            "author": "KazooTycoon",
            "body": "Anything by Karl Marx (especially Communist Manifesto or Capital) and Friedrich Engels would be great historical starting points.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Repulsive_Painting15",
            "body": "[EVERYTHING FOR EVERYONE: AN ORAL HISTORY OF THE NEW YORK COMMUNE, 2052- 2072](https://www.commonnotions.org/everything-for-everyone)\n\n>Every socialist needs to read this book. Every abolitionist, every Marxist, every anarchist, every revolutionary needs to read this book. Every person who has ever wondered how the world will function after the final retirement of the market, the commodity form, money, wages, rent, coercive gender roles, prisons, police, class, nation states, borders, profit, and in general the dominating power of any humans over any others.\"-Spectre Journal",
            "score": 1,
            "replies": []
        },
        {
            "author": "Living-Direction9222",
            "body": "Capitalist Realism by Mark Fisher, and Blackshirts and Reds: rational fascism and the overthrow of communism. By Michael Parenti.  These are not specifically about what socialism is, but I think they provide a lot of insight into why capitalism is no good, and how capitalism works to destroy any form of 'socialized' society.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Article_Used",
            "body": "why not wikipedia?\n\nhttps://en.wikipedia.org/wiki/Socialism",
            "score": -3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -7,
            "replies": [
                {
                    "author": "ElectricEntity",
                    "body": "Capitalist propaganda designed to herd people into the reformist ideology of social democracy.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "logonbump",
            "body": "Read Great Basin Kingdom by Leonard Arrington; An expansive masterpiece from a renowned historian, Leonard Arrington, who died in 1999, is considered by most, if not all, serious scholars of Mormon and western history as the single most important figure to write on LDS history. Great Basin Kingdom is perhaps his greatest work.\nA classic in Mormon studies and western history, Great Basin Kingdom offers insights into the ‘underdeveloped' American economy, a comprehensive treatment of one of the few native American religious movements, and detailed, exciting stories from little-known phases of Mormon and American history.",
            "score": -9,
            "replies": [
                {
                    "author": "opsecpanda",
                    "body": "You might want to reread the question",
                    "score": 9,
                    "replies": []
                }
            ]
        }
    ]
}