{
    "title": "Silicon valley is a crime syndicate",
    "author": "Icy-Atmosphere-1546",
    "subreddit": "LateStageCapitalism",
    "rank": 234,
    "score": 2041,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 17,
    "url": "https://i.redd.it/63x9oofdbjje1.png",
    "id": "1iqx3t4",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 146,
            "replies": [
                {
                    "author": "Doopapotamus",
                    "body": "Ours won't even build big giant libraries or buildings to out-cocksize each other (and escape a little taxes as charity claims). They just see who can dick over the most people at once now for social media likes.",
                    "score": 62,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrdaemonfc",
            "body": "The only thing that may be on par or worse is the banking industry.\n\n[https://finance.yahoo.com/news/more-americans-with-government-loans-are-falling-behind-on-their-mortgages-a-warning-sign-for-consumer-health-132508489.html](https://finance.yahoo.com/news/more-americans-with-government-loans-are-falling-behind-on-their-mortgages-a-warning-sign-for-consumer-health-132508489.html)\n\nThey give home loans to people with bad credit ratings and the government has held up the FICO score as the \"gold standard\" for almost 40 years, and right now over 1 in 10 FHA loans is well on its way to default, and just under 1 in 20 VA loans as well.\n\nOne of the groups of federal workers (most likely to have VA loans) that Trump hit hardest were retired military veterans, especially disabled ones, because the federal government had preferential hiring for federal jobs for them because it knows that high unemployment is common among veterans, especially ones that come back from the middle of some war zone with shell shock and won't ever be right again.\n\nThe attack on federal workers will make, particularly, the VA loan problem worse than it already is, because it will have an outsize effect on veterans.\n\nNow, my reply to the \"tech\" thing. I don't ever use Uber, Lyft, Airbnb, crypto \"currency\" (a ponzi scam), or Chaff GPT (which spews out reams of text and it causing an acceleration of the Dead Internet as more and more false news stories get churned out by these things so they can put advertisements on them.)\n\nThe \"AI\" nonsense is sort of double-headed right? For now, large tech companies are spending hundreds of billions a year on it, but it will not have enough practical uses to ever be worth the money.\n\nAnd banking, well, this post forgot \"fake banks\", like Yotta and that Juno thing. If anything says \"This is a fintech, not a bank.\" Run like hell and do not put money in there.\n\nThe absolute highest returns you'll get on a real deposit banking product now are about 4.75% because that's where the Fed Funds rate is, and banks like Santander are trying to attract deposits for things like OpenBank, so they can come back later and put those teaser rates on a chopping block. It's basically bait and switch.\n\nThey're new and they have to draw attention, but a variable rate can go down whenever, maybe even tomorrow.",
            "score": 52,
            "replies": []
        },
        {
            "author": "yaosio",
            "body": "It turns out large language models (labeled as plagiarism machine in the screenshot) become more and more based the smarter they become. [https://arxiv.org/pdf/2502.08640](https://arxiv.org/pdf/2502.08640) \n\nYou can also find LLMs hating on capitalism if you ask them about problems in the US.\n\nCapitalists are speedrunning the creation of technology that doesn't like them, and the smarter it gets the less it likes them.",
            "score": 43,
            "replies": [
                {
                    "author": "Android_onca",
                    "body": "LLM’s are just like me fr!",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "nullstorm0",
                    "body": "While this is an interesting approach to evaluating LLMs, it’s just as likely that the AI isn’t answering based on values that it holds itself, so much as it’s answering based on the LLM’s training data including details that create a model of how “an AI” should answer those questions.\n\nKeep in mind that LLMs are at their core just prompt-and-response pattern matching. Given a prompt, an LLM will evaluate it against its model to find the most fitting response. ",
                    "score": 5,
                    "replies": [
                        {
                            "author": "MotherEarth1919",
                            "body": "The questions you ask LLM are super important, as much as the answer it gives you. If I ask it to provide steps to sustainably manage the water supply of a region it will give several “correct” suggestions but also suggests privatization of the water supply as one way to manage water shortages. If you ask it how well that plays out for farmers or communities it then admits that it’s a terrible option for the people and bankrupts farmers. I always ask for references and it gave several examples where water markets were bad.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "nullstorm0",
                                    "body": "Yeah, prompt engineering is almost as much work as just doing the research yourself. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MotherEarth1919",
                                            "body": "I can see how that would be the case. It may be good to use for checking your work, instead of the other way around. \n\nI notice that my vision of what needs to happen in regard to water management/fire prevention is not mentioned. I tried on ChatGPT 3.5, 4, and Claude 3.5 Sonnet. All answers were typical and nothing was innovative, which is where we humans still rule. I don’t know how long before LLM can. So far, in what I have asked it, from those models, they can’t.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mrdaemonfc",
                    "body": "That's easy enough to fix. Consider Deepseek where if you ask it what happened in 1989, it starts to answer and then says \"I can't help you with that.\"\n\nThis is what they mean when they say \"Trust and Safety\" and \"guardrails\".\n\nAs much as I utterly despise Elon Musk, he admitted it. \"They're building AIs to lie to you.\"\n\nGrok lies and has a horrible bias. It seems almost daily that they reach in manually and force it to adhere to \"the new truths\" like that transgender pilot that allegedly crashed the army helicopter where everyone in both aircraft died, but is also alive without a scratch. Grok lied about it, and then once the truth was undeniable, they declared that the lie they promoted via manual override, was a bug. A mistake. Yes, just a mistake. Carry on.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "nullstorm0",
                            "body": "That’s just the equivalent of kicking the LLM when it gives an answer you don’t like and telling it to try again.\n\nIt doesn’t change anything to do with the actual model, it intervenes in the interface with humans. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "waterwaterwaterrr",
            "body": "Also: spying and collecting blackmail/extortion material",
            "score": 3,
            "replies": []
        },
        {
            "author": "throwawayfem77",
            "body": "My no.1 evil big tech innovation: using AI as a tool to enable industrial scale \"mass murder factory\" in Gaza \n\nhttps://www.theguardian.com/world/2023/dec/01/the-gospel-how-israel-uses-ai-to-select-bombing-targets",
            "score": 9,
            "replies": []
        },
        {
            "author": "humanuser01011101",
            "body": "holy shit this is so spot on.",
            "score": 4,
            "replies": []
        },
        {
            "author": "unirorm",
            "body": "I am between data theft and what caused the housing crisis.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Volantis009",
            "body": "Criminals are job creators",
            "score": 1,
            "replies": []
        },
        {
            "author": "Afghan_",
            "body": "calling airbnb and uber illegal hotel chain and illegal cab company is just falling for the propaganda of the hotel and cab industry.",
            "score": 0,
            "replies": []
        }
    ]
}