{
    "title": "Israeli occupation forces storm a wedding in Hebron and detain the groom.",
    "author": "Hacksaw6412",
    "subreddit": "LateStageCapitalism",
    "rank": 237,
    "score": 685,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 12,
    "url": "https://v.redd.it/scvgnxiabjje1",
    "id": "1iqx3g6",
    "selftext": "\nIsraeli occupation forces storm a wedding in Hebron and detain the groom\n\nIn a new escalation of its aggressions in the West Bank, Israeli occupation forces stormed a wedding in the city of Hebron, southern West Bank, on the evening of Friday, February 1, 2025.\n\nAccording to the official Palestinian news agency \"Wafa,\" Israeli forces raided the wedding hall, causing panic among attendees, especially women and children.\n\nDuring the raid, the forces detained the groom, a member of the Abu Turki family, along with several other participants for nearly an hour before releasing them.\n\nVideos circulating on social media show Israeli soldiers vandalizing several cars parked near the wedding hall.\n\nThe reasons behind this raid and the detentions remain unknown.\n\nThis incident comes amid an ongoing Israeli military siege on the city and refugee camp of Tulkarm for the sixth consecutive day, leading to widespread destruction of property and infrastructure and the forced displacement of dozens of families.\n\nAdditionally, Israeli forces have continued their military operations in Jenin and its refugee camp for the twelfth consecutive day.\n\nSince October 7, 2023, Israel has escalated its military operations in the West Bank, including occupied Jerusalem, resulting in the martyrdom of 894 Palestinians, the injury of approximately 6,700 others, and the arrest of 14,300, according to official Palestinian sources.\n\nThis ongoing Israeli escalation continues to worsen the humanitarian and security situation in the occupied Palestinian territories, raising growing international concerns over human rights",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "analgerianabroad",
            "body": "Thanks for using the right word for them, Israeli occupation forces, and not defense forces.\n\nIt’s important.",
            "score": 139,
            "replies": [
                {
                    "author": "NormalEntrepreneur",
                    "body": "Wehrmacht also means defence force. It’s like those “defence force” are not defence force at all",
                    "score": 25,
                    "replies": [
                        {
                            "author": "bento_the_tofu_boy",
                            "body": "[https://en.wikipedia.org/wiki/Ministry\\_of\\_defence](https://en.wikipedia.org/wiki/Ministry_of_defence)",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MackDaddy1861",
            "body": "The IDF are clearly the victims here.",
            "score": 16,
            "replies": []
        },
        {
            "author": "ExerciseSpecial3028",
            "body": "Hippity hoppity IDF cronies,\nI cast testicular torsion on thee",
            "score": 8,
            "replies": []
        },
        {
            "author": "MidwestCrusader",
            "body": "More anti semitism on full display",
            "score": 6,
            "replies": [
                {
                    "author": "goatintestines",
                    "body": "do you believe objecting with the military actions of an ethnostate to be antisemitic?\n\nEdit: I missed the pretty obvious sarcasm :/",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MidwestCrusader",
                            "body": "#woosh. Late stage capitalism might not be your problem.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "goatintestines",
                                    "body": "damn, my bad g, I’m too used to tt",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dependent-Play-7970",
            "body": "I can’t see kkkhhamass in this video so what’s there excuse for doing this",
            "score": 1,
            "replies": []
        }
    ]
}