{
    "title": "Socialism with Chinese characteristics?",
    "author": "dahellisudoin",
    "subreddit": "LateStageCapitalism",
    "rank": 231,
    "score": 21,
    "upvote_ratio": 0.68,
    "num_comments (reported by reddit)": 42,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1irspc1/socialism_with_chinese_characteristics/",
    "id": "1irspc1",
    "selftext": "Are you guys against China’s socialism model? \n\nGiven that they have an extremely low homeless population given their overall population.\n\nA comprehensive social safety net including universal healthcare, cheap to free higher Ed, social housing programs etc \n\nFrom my understanding, they also don’t let their rich run amok and meddle in politics, no lobbying or financial gifts from corporations. \n\nChina claims to be fully socialist around 2030 and completely centrally planned by 2050. ",
    "comments": [
        {
            "author": "A-CAB",
            "body": "This is a socialist sub. We support China and other AESC here.",
            "score": 1,
            "replies": [
                {
                    "author": "No_Cheetah_7249",
                    "body": "Based mod",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "dahellisudoin",
                    "body": "Ok cool lol. I was worried about getting banned since ya know, China does have some capitalist elements to it’s economy. What they achieved in such a short amount of time is simply mind boggling. So much more efficient than the US.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Zed_Midnight150",
                    "body": "AESC?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Aggressive-Isopod-68",
                    "body": "Actually existing socialism or actually existing socialist country/countries",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "thatisus",
            "body": "Hey! Not being critical, but most of what I have seen/read of China’s healthcare is that it is inexpensive but still paid for as a service. Can I get any articles/videos that better outline China’s healthcare system? I would like to know more but am tired of wading through unproductive/agenda filled sources.",
            "score": 17,
            "replies": [
                {
                    "author": "Zed_Midnight150",
                    "body": "Thats what I hear as well. I would recommend you try to browse on RedNote. You can either search up Healthcare in the search bar or kindly ask the folk there. I've been noticing many foreigners especially Americans doing their research about China there lately.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "thatisus",
                            "body": "Good tip, I’ll have to try that!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dahellisudoin",
                    "body": "I can’t link exact sources but I did some deep diving last week. Apparently it’s not free for everybody, it’s income based but it does encapsulate 95% of their population and is 100x more cost effective than any social health program here in the US. Also, the quality of care for it’s price is nothing short of amazing and they have no problems with staffing shortages (you know….because they actually prioritize a skilled and educated working class)",
                    "score": 10,
                    "replies": [
                        {
                            "author": "RezFoo",
                            "body": "A datapoint I see quoted often: the cost of an MRI is about USD $68.  Surgery can be quite a bit more expensive, in the thousands of dollars, but still much cheaper than in the US.  But preventative medicine seems to be heavily subsidized.  Another datapoint - a trip in an ambulance is zero cost - in the US it is $800.  The Chinese were astounded that we have to pay for an ambulance.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "dahellisudoin",
                                    "body": "Time for me to learn Mandarin.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Neoliberal_Nightmare",
                            "body": "If you were to fully pay yourself its like £50 for an MRI scan (maybe it's a bit more now, I did one in 2018 as a tourist rather than wait 1 year in the UK or pay £1200). If you have a job then about 80% of that is going to be covered by your social insurance.\n\nI had to pay for an ambulance before in China, probably as a foreigner, anyway it was £2.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Samfucius",
                    "body": "I can answer this, I live in China.\n\nYes, it costs money.\n\nYes, it is still very cheap. My colleagues were horrified that I went to the fancy, expensive public hospital. They said it cost too much. It cost $15 to see a doctor. I pay for insulin at about $30 a month for a volume that would cost $900 in America.\n\nThere are also totally private hospitals run by companies like Raffles. They are less expensive than American hospitals, but not by much. They are also more like spa/hospital hybrids, they give you things like fancy robes and 4* hotel quality private rooms.\n\nMy biggest criticism for Chinese healthcare is that everything is paid up front. The whole system relies on you having someone with you to go stand in that line to pay, because if you're terribly ill and on your own, good luck. And as far as anecdotes from my colleagues go, yes, this applies to emergencies too. They'll stabilize you but if you want real treatment you have to pay first, hope you can work your WeChat account with a shattered spine.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "ColdPlayer1002",
                            "body": "I don't really see this as a problem because hospital payment systems are now highly electronic. Also, it is possible to be discharged from the hospital and settle the charges again if you have enough credit score on your account. I don't know about other provinces, but this is possible in hospitals in Kunming, Yunnan Province.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Samfucius",
                                    "body": "Kunming is great, just visited a few weeks ago. \"If you have enough credit score\" is doing some heavy lifting; I'm not worried about myself, but in tragic circumstances not everyone will be lucky enough to have those means. Electronic payment doesn't change how much you have in the bank.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "thatisus",
                            "body": "Nice! Thanks for your reply. Sad to hear about needing to pay up front even for ER, but generally sounds reasonable otherwise.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Samfucius",
                                    "body": "No problem. If you're interested in the care, the techniques are on par with the West but there is zero expectation of privacy. Everyone including other patients will know who you are, why you're there, and what medications they are giving you. I don't really mind it, as a foreigner you get used to your business being public knowledge, but coming from a society with HIPAA and the like it catches your attention.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Excellent_Pain_5799",
            "body": "Okay, I think we’re good with the socialism part, but what about the Chinese characteristics part?  While it’s true they are doing “what works for China and the Chinese people”, that doesn’t tell you what is particularly Chinese about it, and in the end why it’s not even exclusively Chinese at all (hear me out), and hence dangerous to the western neoliberal elite. \n\nThe first characteristic is an emphasis on pragmatism vs. dogma, perhaps best captured in Deng’s white cat vs. black cat analogy. In China, out-of-the-box problem solvers are given a prominent place in history (Yu the Great, Zhuge Liang, etc. )\n\nIn this light, markets and central planning are just tools - a means to an end, each with their inherent pros and cons and tradeoffs. The problem they are each employed to solve is the optimal allocation of resources in a society. What is meant by “optimal”, is a political decision that will differ between capitalist and socialist societies (notice I didn’t say democratic, because late stage capitalism IS a political system).  \n\nSo, in the dogmatism of the west, we can’t have any other way because markets were created by God and by virtue of that fact capitalism is the natural state. This has now finally brought us to the logical endpoint of extreme and pervasive rent and surplus value extraction in every facet of life, and at the helm of the “free world” now sits the world’s richest capitalist. \n\nIn China, by contrast, they told Jack Ma to go away when he was being kind of a nuisance, but then recently Xi called him back to have a meeting along with all the other big private tech companies, because now they are deemed useful again. This is pragmatism - when we’re done using the hammer, and the next part needs a screwdriver, we’re not going to keep on using the hammer. \n\nThe second characteristic is best summarized by an ancient saying: “The water that bears the boat can also overturn it” (水能载舟，亦能覆舟）attributed to the philosopher Xunzi during the Warring States Period ca. 300 BCE. \n\nIn other words, rulers must value public opinion and care for the people’s livelihood. Otherwise, they risk losing support and destabilizing their rule. This idea has had a profound influence in Chinese history, serving as a reminder to rulers to prioritize the well-being of the people (full disclosure: a little help from DeepSeek here).   As others have commented, their track record is looking better and better on this front as time goes on.\n\nAnd this brings me back to what I said before - pragmatism and the emphasis on the well-being of the people are not exclusively Chinese characteristics!  Yes, they have found instances that root these qualities very, very deeply into their own culture, but all cultures can look to their own history for instances where pragmatism won the day for the benefit of the people. \n\nThus, socialism with [country x] characteristics is wholly replicable, and that’s why the oligarchic ruling class has to now work double time to keep the rest of the world from realizing this (eg, the US $1.6 billion anti-CCP propaganda fund).",
            "score": 13,
            "replies": []
        },
        {
            "author": "acesymbolic",
            "body": "https://chuangcn.org/resources/faq/ \n\nFrom actual Chinese scholars, in English and accessible to the world.",
            "score": 14,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "acesymbolic",
                            "body": "Yeah because god forbid scholars and activists do their own research and reporting instead of citing existing theory.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RezFoo",
            "body": "Get onto xiaohongshu and you can see all of this.  There is a lot of interchange going on between ordinary Chinese people and Westerners.  A lot of questions are asked and answered in both directions.",
            "score": 11,
            "replies": [
                {
                    "author": "Aggressive-Isopod-68",
                    "body": "It's so refreshing too because the average political minded person on XHS has a deeper and more nuanced understanding of socialism than most self proclaimed \"socialists\" in the west \n\nNo wonder our government doesn't want us talking to Chinese people, they're a bunch of principaled Marxists!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "RezFoo",
                            "body": "XHS is not a place for \"political\" discussions but yes, the philosophy comes through.  The people in China learn Marxist economics from an early age, so it is not surprising.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Aggressive-Isopod-68",
                                    "body": "I've been having plenty of political discussions with Chinese people and political posts are dime a dozen, even from Western leftists though",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 4,
            "replies": [
                {
                    "author": "Blastmaster29",
                    "body": "Yeah Chinese culture is just different and that works for them. We need our own version of government not a 1 to 1 of what works somewhere else. We could definitely learn a lot from what they’re doing though",
                    "score": 8,
                    "replies": [
                        {
                            "author": "dahellisudoin",
                            "body": "Exactly. If our leaders were smart and wanted what’s best for everyone, they would be looking at China as an inspiration instead of making them out to be our mortal enemy.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Blastmaster29",
                                    "body": "Chinese style of government/economics removes the need of the billionaire class so they can’t profit from it.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aggressive-Art-9899",
            "body": "I've been to China several times. I know a Chinese person who works in the bureaucracy in China. I know the government treats their people better over there.\n\nWhen I was there I saw housing which was built for free in cities for rural people.\n\nI'm also aware that China does not have a massive number of military bases all over the world like the US does.  \n  \nWhen I've highlighted things like this in other Reddit groups, people's brainwashed minds get very very angry when they hear stuff like this. They want to believe America is a beacon of Free-Dumb and practically every other nation state that doesn't bend to America is aggressive.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GianfrancoZoey",
            "body": "China is doing everything right to further communism In today’s hyper-capitalist world. They are not perfect by communism’s standards but they’re not meant to be, that’s the end goal, socialism is a stage on the way to that goal. Who am I to criticise what they’re doing when it’s *working*. The proof is in the pudding, they’re winning and are advancing the cause of communism in this world, an extremely difficult role especially after the fall of the USSR.",
            "score": 12,
            "replies": [
                {
                    "author": "dahellisudoin",
                    "body": "Agreed. I’m really excited to see the progress China will make across all fields in the coming decades. I live in the US but I really do hope that they surpass us as the world’s leading hegemony/superpower. Maybe that will wake up the rest of the world up to consider adopting their own social market systems. I’d even argue technologically, socially, happiness of citizens and leading the climate change effort, they have already surpassed the US significantly. It’s only a matter of time.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sc4rl3tPumpern1ck3l",
            "body": "Housing for citizens, ✅ \nAffordable Healthcare for citizens, ✅ \n\n\nChina Good, ✅",
            "score": 9,
            "replies": [
                {
                    "author": "dahellisudoin",
                    "body": "China indeed good. ✅ \n\nI’m seriously going to do whatever takes to move there on a visa that hopefully turns permanent. The US is such a garbage country.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Zed_Midnight150",
                            "body": "Take me with you 😭🙏",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "A-CAB",
                            "body": "It’s hard to get permanent residency or citizenship but not impossible. I lived there for 10 years and pretty much everything about my experience was lovely. \n\nIf you’re a native English speaker, learning a tonal language is going to be a challenge. Focus on the sounds and inflection first - even understanding pinyin first (learning the characters can come later). Try and get an irl mandarin tutor before you go. It will take years before you’re fully comfortable.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "dahellisudoin",
                                    "body": "Thanks, I’m really glad to hear you had a positive experience. I actually practiced a lil bit on Duolingo and I quickly realized that my tonal inflection and the pronunciation would be my biggest obstacles. Also, the speed at which I speak. \n\nQuestion: what field was your work visa held in?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "A-CAB",
                                            "body": "I’m an economist and this was back in the 80’s so there are probably major differences versus today. \n\nYes. Tonal languages are difficult too because sometimes you feel silly over pronouncing them - English stays pretty neutral so it doesn’t come naturally if you don’t do it. The good news is that if you’re traveling and speaking any language even in a very thick American accent, most people will appreciate that you aren’t yelling at them in English and be quite helpful.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Born-Requirement2128",
            "body": "\"The rich\" in China is synonymous with CCP members. \n\n\nIn Chinese society, all business is based on Guanxi, or personal connections with powerful people. CCP members are the only ones with connections to powerful people, so they monopolize political as well as economic power. Imagine if only people with over $10M wealth were allowed to vote in the USA - that's the situation in China, adjusting for the fact that China is a much poorer country (apart from the CCP members).",
            "score": 1,
            "replies": []
        },
        {
            "author": "AromanianSepartist",
            "body": "My problem is that chinese people dint really care about community politics and seem kinda distant from the goverment and knowing what exactly is going on it looks way more like western states rather then fellow socialist cuba where even the most educated man has a voice in his local workplace that then goes to higher bodies \nAlso chinese people seem to have huge consumer issue like they buy expensive or multiple clothes without actually having a need for them same as the rest of the world \nWhere actually is the socialism just because they control their capitalists \nMaybe it's not pure capitalism \nBut in no way or form this is ideal socialism",
            "score": 1,
            "replies": []
        },
        {
            "author": "TrotScoper",
            "body": "Save us, Xi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thisishowicomment",
            "body": "China killed more of its own people through the cultural revolution and purges than died in all of WW2\n\nThe Chinese model is about corrupt capitalism, suppression of rights, and the fact that this is even discussed shows how effective propaganda is. \n\nThe US has a shit ton of problems, but let's not pretend that the Chinese or Russians rather than the Scandinavians are the ones to follow.",
            "score": 1,
            "replies": []
        }
    ]
}