{
    "title": "Commercial and Ads are so cringe to me now.",
    "author": "dahellisudoin",
    "subreddit": "LateStageCapitalism",
    "rank": 209,
    "score": 975,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 74,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iruzj1/commercial_and_ads_are_so_cringe_to_me_now/",
    "id": "1iruzj1",
    "selftext": "Ever since I learned marxist theory and discovered the inherent contradictions in the extreme capitalist hellscape that is called America, I can’t help but view any ads/commercial I see in a class conscious lens. \n\nThey are constantly bombarding us with propaganda compelling us into mass consumption of things that we don’t need or even want. \n\nEvery ad/commercial just reeks of desperation and manipulation tactics; full of misleading claims and sometimes outright lies telling us that their specific product will improve our lives and solve our problems. \n\nEveryone everywhere is just trying to make a sale,turn a profit. It disgusts me so much. None of these people actually give a damn or genuinely care about helping people. Even seemingly innocuous things like childrens hospitals, for profit online colleges, drug commercials, accident lawyers etc are just emotionally targeted ploys used to exploit your very real fears into larger numbers on some rich asshole’s spreadsheet. \n\nLiving in a capitalist world really feels like a game of thrones survival realm where those able to lie, manipulate, convince, persuade, compel, extract, exploit, cheat, and defraud are the winners and actually reaps all the rewards for this behavior. \n\nI hate it here.\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beingforthetimebeing",
            "body": "It's getting worse, the ads are insufferable. They use spiritual symbols (a rainbow ending on a Honda!); the wretched excess gets wretcheder (give a new car for Christmas! Heck, get 2, His and Hers!); if you take our pharmaceutical, you'll be young, beautiful, athletic, have diverse friends and a loving family, and a million dollar house. The most egregious was GE \"Bringing good things to life.\" Every ad featured crystal clear bodies of water, 2-page spreads of the ocean and waterfalls... starting after it was revealed GE had destroyed the Hudson River with their PCBs.",
            "score": 293,
            "replies": [
                {
                    "author": "dahellisudoin",
                    "body": "Yes, you get it. Sometimes, I wonder do these CEOs and execs ever feel bad or guilty about the downright hypocritical and manipulative business practices they employ on unsuspecting people.",
                    "score": 61,
                    "replies": [
                        {
                            "author": "ninemountaintops",
                            "body": "They don't, no. \n\nThey rise to these positions BECAUSE of their lack of empathy, or conscience and consideration of others. \n\nIts a fact that more sociopaths wear suits and inhabit boardrooms than wander the streets among us. These are the people that with the stroke of a pen, a week before Xmas, can take away jobs for 10,000 people because it improves their bottom line.",
                            "score": 98,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Skoldeen",
                    "body": "Those drug ads with happy people doing everyday things that end with “side effects could result in death” are so prevalent it drives me nuts",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Beingforthetimebeing",
                            "body": "Ikr? I'm like, NEVER take THAT drug, it's too dangerous! And they're not even doing everyday things. Elite things, and (like the GE ads) the opposite of the disease. Skin lesions? Go in the chlorinated pool or the ocean. The God Realm, where one has transcended all suffering. Where one has all control over all parts of one's existence! \n\nAurrgggg! I'm yelling, MUTE! MUTE! MUTE!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SpiceyKoala",
                    "body": "That reminds me of BP pumping money into ads about being part of the Gulf communities (that they harmed with their oil spill) while the rest of us picked up the tab for the cleanup.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TronNeutrino",
            "body": "It's especially sick when I watch sports from other countries like Japan and they're not centered around commercials. Every aspect of capitalism is meant for infinite consumption and no reflection,",
            "score": 174,
            "replies": [
                {
                    "author": "dahellisudoin",
                    "body": "Like why is the US like this??? Why do we value money and infinite growth above all else? Are Americans just naturally greedy and less empathetic?",
                    "score": 69,
                    "replies": [
                        {
                            "author": "VersaceSamurai",
                            "body": "American exceptionalism and American toxic individualism.",
                            "score": 79,
                            "replies": [
                                {
                                    "author": "StupidandAsking",
                                    "body": "Did you misspell “American dream”? Cuz we are all so special.\n\nI’m glad my government teacher in highschool was the one who started the holocaust class. For Idaho, I feel like he saw ahead.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NormieSpecialist",
                            "body": "I think it’s just the nature of capitalism, in that it’s like an abusive relationship but the abuse is nuanced. You don’t know any other way so in the end you just mimic the thing that hurt you.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "dahellisudoin",
                                    "body": "Deep",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SpiceyKoala",
                            "body": "The United States was founded by capitalists for capitalists. The nationalism is to foster buy-in.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ibeatreddit",
            "body": "Agree 💯, and everyone has to walk around with a smile on their face and pretend they do their job for the reasons they said in the interview. Which is also ridiculous because employers KNOW why you want/need the job but still make sure you lick the boot hard enough to get a chance at slaving away your existence to them. ",
            "score": 73,
            "replies": [
                {
                    "author": "dahellisudoin",
                    "body": "The whole entire system is fake and performative bullshit!!! What really pisses me off is all the upstanding and friendly sounding politically correct jargon coming from politicians and CEOs portraying themselves as righteous saints that will always look out in the best interest of the people and how much they want to help bring value to the world. It’s all bullshit.",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Or you can wear an N95 to protect you and your comrades from the ongoing Covid-19 pandemic and then *you don’t have to fucking smile at anyone*.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "Moirawr",
            "body": "I do everything possible to avoid them. Ad blockers. Don’t watch twitch. Something starts with an ad I just turn it off. Billboards still enrage me. I visited Quebec recently and was shocked, miles and miles of beautiful countryside. Uninterrupted by ugly ass ads. I’m fucking moving lol. (For several other reasons, but that’s one of em)",
            "score": 46,
            "replies": [
                {
                    "author": "UnlimitedAdvice",
                    "body": "Im with you man, wish i can see Quebec. I stopped watching TV with ads like 10+ years ago. Everything i visit is ad free. I can't possibly go back. It annoys the hell out of me now. Especially emails.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Moirawr",
                            "body": "Right lol I get mad like instantly, get your brainwashing garbage out of my eyes. But my QC bf is like noooo I wanna see the cool American ads! Haha. Its such an amazing place. If you can vacation I highly recommend! Everyone will greet you in French, but pretty much everyone knows English and are happy to practice on you. I only know a couple phrases and had an amazing time.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "okrahh",
                    "body": "I have a habit physically turning my head or shutting my eyes and muting when an ad plays just because i'm spiteful and don't even want a little bit of shitty advertisement in my subconscious lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Forward_Bullfrog_441",
            "body": "Also, when your emotional response when getting the product is lesser than your response with the commercial it inevitably leads to that empty feeling that pushes people to then buy more. That’s why so many commercials are over the top, because we as a society are growing numb.  It’s truly a vicious cycle of dehumanization and profit.",
            "score": 28,
            "replies": []
        },
        {
            "author": "Errenfaxy",
            "body": "Sporting events are impossible to watch these days because of excessive commercials. In the US the major sports have more advertising than content. YouTube has already had that benchmark at and surpassed. \n\n\n\n\nEven pay per view like mma or subscription services have unrelenting advertising. Corporations have make selling out synonymous with success and it is disgusting.",
            "score": 27,
            "replies": [
                {
                    "author": "okrahh",
                    "body": "I legit just don't watch shows or tv anymore. The streaming services I PAID FOR decided that they can milk me even more and make me pay more for a no ad version of the thing I already paid for. It's rediculous. Shittier products for a higher price",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ExistentDavid1138",
            "body": "Your eyes are opened and you caught on to the gimmick of the commercialized society. We don't need a new this or that. What people need is contenment. It's good to turn off ads that stuff is garbage. I laugh at all the fear mongering they do on ads to get you to buy their products.",
            "score": 19,
            "replies": [
                {
                    "author": "CartographerEvery268",
                    "body": "🫡",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "okrahh",
                    "body": "Life is so much more calm when you shut out the noise and fear mongering omg. So much of what we do is influenced by outside forces it's exhausting. I'm trying to escape it but it's everywhere even if I do everything I can",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fuzzy_Dunlop24",
            "body": "I’m with you.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Radiant_Witness_316",
            "body": "I share this sentiment. Two things have bothered me more than even the ones you mentioned. The first is the trend for the last ~40 years, but that has really picked up speed in the last decade or so, of corporations telling us (this started with women and things like douche and feminine wash) that the natural human body is gross and needs what are often harmful chemicals to be acceptable to society. It's so toxic and now they've really looped men in, which the feminist in me is like, \"About time\", but the Anthropologist in me is saying, this is bs pheromones are actually a thing. What if being drawn to a particular perfume causes us to choose mates with very poor qualities just because their perfume is attractive to us? The second thing goes hand in hand w the other actually. I'll preface with the fact that I think celebrity worship is extremely problematic. Not just the worship of actors and musicians, but all people that attain fame including politicians, people who are on reality shows, social media influencers, etc. US citizens put too much stock in these people, whether that is assuming because they are aesthetically pleasing, or wealthy then they must also be kind, generous, intelligent, etc. Then advertising companies hire these people to sell you all kinds of sh*t that they likely wouldn't be caught dead using, and we go out and spend so much money that we make it profitable for the corporations to do this. It's really gross to me. I wish I could get all of my loved ones to see what I see.",
            "score": 14,
            "replies": [
                {
                    "author": "Mediator_Murk",
                    "body": "That pheromone bit makes a lot of sense, never really thought about that; have read somewhere that scent is the most powerful sense tied memory.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Radiant_Witness_316",
                            "body": "Exactly, so when you are wearing a chemical recipe formed by a corp, you're a walking advertisement. Just like branding, it's just corps having you advertise for them for free and you thinking you're the shit. So many people are very trusting and as someone that has never, from birth, been given good reason to trust, I envy the ignorant.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "darkfire621",
            "body": "They would put bill boards in our dreams if they could.",
            "score": 12,
            "replies": []
        },
        {
            "author": "softestfern",
            "body": "it's so frustrating because despite making every effort to avoid advertisement it's entirely unavoidable no matter what, especially in more urban areas. ads on screens strapped to the back seat in cabs/ubers, on public transport, flyers and postcards on doormats, every other post on social media, the omnipresent pressure to consume and collect useless plastic garbage or luxury items we all pretend we can afford is so disgusting. it feels predatory!",
            "score": 11,
            "replies": []
        },
        {
            "author": "NormieSpecialist",
            "body": "I feel the same. Ever since I quit watching cable TV I’ve becoming really disgusted with ads. Like you said it reeks of desperation. I even sense this desperation with mainstream media. Look at Disney and how badly they want to be seen as progressive or Netflix with their recent screw up “Emilia Pérez.” I love politics in my art, but this isn’t politics, it’s an ad selling virtual signaling to the good little neolibs.",
            "score": 9,
            "replies": [
                {
                    "author": "CartographerEvery268",
                    "body": "💯",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Robertroo",
            "body": "I've never seen an ad and thought to myself \"Wow, gotta go buy that!\"\n\nIn fact, I make a mental note of advertisors that interrupt my YouTube videos, especially songs, and go out of my way to never buy that product.",
            "score": 9,
            "replies": []
        },
        {
            "author": "AntiqueAd9648",
            "body": "I feel this way about tv and movies. I can’t not see the copaganda and constant forced American exceptionalism.",
            "score": 8,
            "replies": [
                {
                    "author": "starktor",
                    "body": "The pentagon will let you use real military hardware for your movie and even fund it if you let them have editorial power over the script to ensure that the US military is portrayed in a positive light",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beingforthetimebeing",
            "body": "I can't even avoid the culture by not watching TV. If I just walk through the living room while my husband is flipping through the channels, I'll see several people assaulted or shot. How is this entertainment?",
            "score": 14,
            "replies": [
                {
                    "author": "dahellisudoin",
                    "body": "Yep. Billboards, radio stations, grocery stores, YouTube, hospital waiting rooms etc the brainwashing is inescapable.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "anonymalias",
            "body": "feel like the super emotional healthcare ones are especially vile. There's a weighloss drug one that comes to mind during the sportsballbowl",
            "score": 6,
            "replies": [
                {
                    "author": "Skoldeen",
                    "body": "Right? The weight loss one made me laugh at the irony. It talks about how other drug companies are selling their products to you in predatory ways as if it’s some PSA only to turn around and sell their product. The cognitive dissonance is crazy",
                    "score": 3,
                    "replies": [
                        {
                            "author": "anonymalias",
                            "body": "hypocrisy",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hairyjackassin526",
            "body": "Anarchist Book Library. Check it out. Crimethinc for a good manifesto and validation. Lots of good stuff out there that helped me figure out how to process all of this.",
            "score": 6,
            "replies": [
                {
                    "author": "dahellisudoin",
                    "body": "Thanks for the recommendation!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wob_Nobbler",
            "body": "It's similar to the feeling that Piper had in \"They Live\" when he puts on the glasses and sees society for what it",
            "score": 5,
            "replies": []
        },
        {
            "author": "Green_and_Silver",
            "body": "Don't watch any media on a device you can't install an adblocker on and any service you can't view with an adblocker on cancel. It's got to be a decade since I saw an ad or commercial and the feeling of being shielded from all that is incredible. If you're going to be plugged in then you need to block those out, otherwise you're better off unplugging.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Wuellig",
            "body": "\"They're not selling us the product. They're selling us the fear of our life without the product.\" \n\n\nSomething like this was told to an author by an ad exec, and it's stuck in my head ever since.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Kudos2Yousguys",
            "body": "Yup. For the past decade or so I've done my best to cut out/limit as much advertising from crossing my eyes or filling my ears and it's been a positive for my mental health. I use ad blockers, I skip, I fast forward, I look away, I ignore as much as possible so I never get their dumb earworms in me. I feel like advertising already took SO MUCH of my life as a kid.  I used to just happily enjoy all the commercials, I'd talk about them with my friends, sing the songs, and believe that these were all friendly funny companies that did good for the world. Lucky for me I'm not into watching sports because that shit is just full of nothing but advertising.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Wob_Nobbler",
            "body": "Exactly, anytime an ad pops up on the given screen I'm using, I go do something else. Don't need to be gaslit today no thank you.",
            "score": 3,
            "replies": []
        },
        {
            "author": "CripplingdepressionP",
            "body": "They’re maddening. They are constantly shoved in our faces and it sometimes feels like they’re mocking us with them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Greekgreekcookies",
            "body": "Aggressive ads and gross and blatant manipulation in them guarantee I will not buy that product. I don’t want to see an ad for anything until I research that type of product.",
            "score": 3,
            "replies": []
        },
        {
            "author": "motophiliac",
            "body": "This is why I have adblocker on my PC.\n\nThis is why I get to the cinema just a little bit late.\n\nThis is why I have the mute control within easy reach.\n\n[Bill Hicks had probably the best take on advertising.](https://www.youtube.com/watch?v=tHEOGrkhDp0)",
            "score": 3,
            "replies": []
        },
        {
            "author": "keepthelastlighton",
            "body": "Advertising has always been cringe/cheesy, but they feel yanked right out of dystopian sci-fi these days.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LOST_GEIST",
            "body": "I can't even enjoy movies set in modern settings anymore because of the blatant product placement. I first noticed it in the Iron Man movie with the scene where the Zoom icon is a quarter of the screen Tony Stark is holding, that turned me off to all the Marvel movies following it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ProfessorHexxx",
            "body": "I used to work in advertising as a vfx artist nearly 20 years ago. I did a few commercials for a major credit card company. I won't name which one, but I'm sure most of you might guess. Its the one that has all the different colored cards based on spending limit, blue for normal people, gold for slightly wealthier people, black for very wealthy people.\n\nAfter doing a couple commercials that aired on TV, I got hired to work on a pitch for them, a product that hadn't been released yet. Sticking to their colors theme, this was a credit card they planned to call \"\"mint\". \n\nIt was intended to be marketed toward high school and college kids 18-22. Now, this was around 2007-2008, and I'm sure there are some of you who are old enough to remember that \"mint\" was what the cool kids were calling all the cool things about 10 years prior to this.\n\nSo, not only was this company attempting to prey on young kids and their inexperience with credit, they were doing so with a campaign that was a decade out of touch with kids at the time.\n\nAnd the content of the commercial was equally infuriating. I had to model and animate this young \"urban\" kid (from the illustrations I was given as reference, it was hard to tell if he was black or hispanic, so the producers just kept calling him \"urban\") walking through this giant apartment, looking around and nodding his head like he was gonna pay for it with his mint card.\n\nThankfully, this was never actually released as a product. I have no idea if someone at this company called out how fucked up the entire thing was, or it was some other, nameless reason why it died as a pitch. But I was really happy it didn't get released.\n\nI still got paid for the work I did, but it was the one moment that really made me feel disgusted working in advertising. A few years later I switched to working on kids cartoons and I've never felt bad about my work since.",
            "score": 3,
            "replies": []
        },
        {
            "author": "farmerdog69",
            "body": "It’s ok to enjoy a piece of it if you can. I always remember Edward Abby liked to joy ride a convertible and smoke cigars. Just for the absurdity of it all.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pottsnpans",
            "body": "I started streaming most media years and hardly every watch anything with ads. I was complete generation gapped. It was like \"what the hell did I just see?\" I was completely confused.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Watt_Knot",
            "body": "All ads are scams",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unxcused",
            "body": "Virtue signaling in advertisements is a large reason I stream and game",
            "score": 2,
            "replies": []
        },
        {
            "author": "AntiauthoritarianSin",
            "body": "The worst are the ones that talk to you like you are a child or they try to be funny with child-like humor.\n\n\nMoney may have started as a tool but now it's a fetish. It's all one big grift.",
            "score": 2,
            "replies": []
        },
        {
            "author": "commie_1983",
            "body": "This is just the beginning of your journey. Wait till you start viewing all your relationships through this scope.",
            "score": 2,
            "replies": []
        },
        {
            "author": "monty747",
            "body": "My awakening happened as a teen watching \"They Live\" \n\nScene was a POV of a person living in a shantytown watching a commercial for a middle class woman staying pretty while doing dishes or whatever. \n\nThe message received was all that shit doesn't matter",
            "score": 1,
            "replies": []
        },
        {
            "author": "medve_onmaga",
            "body": "my hate is pure and natural, not based on marxist ideologies",
            "score": 1,
            "replies": []
        },
        {
            "author": "historysciencelover",
            "body": "I wouldn’t mind ads so much if they were like they were 70-100 years ago. Catchy tunes, memorable lyrics, descriptive of the product.",
            "score": 1,
            "replies": []
        },
        {
            "author": "irishish2024",
            "body": "Agreed",
            "score": 1,
            "replies": []
        },
        {
            "author": "GiantImminentSqueeze",
            "body": "Yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "riiil",
            "body": "Pls read some marketing books and discover what are called \"dark patterns\", you'll see there even is another world of propaganda and addiction to it beyond ads.",
            "score": 1,
            "replies": [
                {
                    "author": "Beingforthetimebeing",
                    "body": "Please! Tell us,  What are dark patterns? We. Need. To. Know. NOW!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "riiil",
                            "body": "https://fr.m.wikipedia.org/wiki/Dark_pattern\nU r welcome",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gunner_Bat",
            "body": "My favorite are the ads saying \"without oil and natural gas, hospitals would stop working, and everyone would die!\" \n\nAs though there aren't renewable resources that can provide that power.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BabyTacoGirl",
            "body": "Ah, I pay for YouTube premium and never ever see an ad. Go ahead, spend millions. I never see them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kochga",
            "body": "Ad Blockers.\n\nWhy isn't everyone using them?",
            "score": 1,
            "replies": []
        }
    ]
}