{
    "title": "USAID: Imperialist Trojan Horse Goes in the Woodchipper",
    "author": "Potential_Cycle_8223",
    "subreddit": "LateStageCapitalism",
    "rank": 226,
    "score": 33,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 2,
    "url": "https://communistusa.org/usaid-imperialist-trojan-horse-goes-in-the-woodchipper/",
    "id": "1irwz3t",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Basic-Strain-6922",
            "body": "**TL;DR:**\n\n• Elon Musk’s Department Of Government Efficiency (DOGE) has fed the US Agency for International Development (USAID) The Democrats and the liberal establishment are up in arms. But what his funding freeze has exposed is the real nature of this “humanitarian” CIA front.\n\n• The sudden funding crisis faced by “independent media” outlets and “civil society” groups in many countries is exposing this fact, writes Julian Zelizer. He and other Democrats are defending a tool of US imperialist meddling, Zelizer says, and are defending the “oligarchy at its worst.’“We spent the weekend feeding USAID into the wood chipper.\n\n• Could gone to some great parties. Did that instead.” — Elon Musk (@elonmusk) February 3, 2025 purposefully misrepresents the real purpose of USAID.\n\n• “Gutting it means gutting our ability to compete and keep America safe [our emphasis].” – Senator Bernie Sanders.\n\n---\n\n💡 [TipJar](https://paypal.me/paulfox360?country.x=IN&locale.x=en_GB) \n\n---\n\n*I am a bot, and this action was performed automatically.*",
            "score": 1,
            "replies": []
        }
    ]
}