{
    "title": "Why do socialists advocate for unions?",
    "author": "BoJackHorseMan53",
    "subreddit": "LateStageCapitalism",
    "rank": 225,
    "score": 0,
    "upvote_ratio": 0.23,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1it37h7/why_do_socialists_advocate_for_unions/",
    "id": "1it37h7",
    "selftext": "It's like advocating for social democracy. You're still operating within capitalism.\n\nI don't see any efforts to organise and spread the knowledge of socialism or try to turn our government into socialism.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConsumeTheBaby",
            "body": "Because it’s the first step to building real, organised, working-class power",
            "score": 43,
            "replies": []
        },
        {
            "author": "SMcQ9",
            "body": "“I don’t see any efforts to organise…” \n\nUnions are the result of workers organising.",
            "score": 36,
            "replies": []
        },
        {
            "author": "NormieLesbian",
            "body": "Organizing is the first step towards revolution.",
            "score": 23,
            "replies": []
        },
        {
            "author": "Optimal-Teaching7527",
            "body": "Unions are a win.  They push the needle and show that the owning class isn't all powerful.  It shifts the overton window left for a change.",
            "score": 20,
            "replies": []
        },
        {
            "author": "You_Paid_For_This",
            "body": "> You're still operating within capitalism.\n\nWe exist within capitalism, we must operate with the tools and conditions we have available.\n\n\n> I don't see any efforts to organise and spread the knowledge of socialism or try to turn our government into socialism.\n\nYou don't see it because these ideas are suppressed by the billionaire owned media. \nAnd nobody is willing to boost the voice of some nobody who has achieved nothing. \n\nBut if you form a union first, and improve people's material conditions they will be willing to listen to you when you tell them how they can improve further.",
            "score": 15,
            "replies": [
                {
                    "author": "BoJackHorseMan53",
                    "body": "Makes sense, thank you",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hydramy",
            "body": "How do you propose people stop \"operating within capitalism\"?\n\nAre you going to provide the resources necessary for people to do that?",
            "score": 12,
            "replies": [
                {
                    "author": "BoJackHorseMan53",
                    "body": "Organizing a large population through unions or social media and voting for a political party which supports socialism which will nationalise all the big companies.\n\nA change this big can only come from a revolution tho.\n\nI'm just a noob, trying to learn",
                    "score": -8,
                    "replies": [
                        {
                            "author": "VillainWorldCards",
                            "body": "> Organizing a large population through unions or social media and voting for a political party which supports socialism which will nationalise all the big companies.\n\nDude, that's more or less the entire point of this subreddit. Everyone here is trying to accomplish exactly what you're trying to accomplish. But instead of trying to come up with new tools for folks to mobilize and organize against the oligarchy you're sitting here trying to talk people out of using the tools they have available.\n\n\nYou're hustling backwards. We're about working together and using every tool we can get our hands on.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aJrenalin",
            "body": "Unions are spaces where workers can become organised, not just into unions but into something grander. They are centres for collecting the forces of workers out of competition with one another and into joint ranks. \n\nThe victories of unions aren’t even whatever meagre victories the unions win, which can be taken away at any time. Their utility lies in their capacity to radicalise and centralise the workers’ forces into a whole.",
            "score": 9,
            "replies": []
        },
        {
            "author": "WAR_T0RN1226",
            "body": "You seem to think the goal of unionizing is to perpetually have a union under capitalism.\n\nUnionizing organizes the \"potatoes in a sack\" that are individual wage laborers and provides a means for them to build class consciousness.\n\nYou can't have socialism without class consciousness amongst the working class, so how are you gonna do that without unionizing?",
            "score": 8,
            "replies": [
                {
                    "author": "BoJackHorseMan53",
                    "body": "Yes, I thought the goal of unions is to have a union perpetually. Because there are a lot of unions, but I don't see anyone taking the next step. Also, I'm not sure what the next step is.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WAR_T0RN1226",
                            "body": "It's because unionism in America, in particular, got bought off and knee-capped in the post-war prosperity.\n\nPeople getting their house in the suburbs and long cars and providing for their families independently atomized them and dispersed the class consciousness at the same time that legislation effectively defanged labor unionizing.\n\nSo now you have some unionized industries but they're really only fighting their own ownership to keep as much of what they still have as they can.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Grmmff",
            "body": "Organizing is a skill that depends on building trust and relationships.  Unions are a way to practice those skills while directly building worker power.  Mutual aid,  cooperative forming, tenants unions can also develop these skills.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Cake_is_Great",
            "body": "Unfortunately most socialists lack telepathy or some kind of shadow clone jutsu to be everywhere at once. You gotta have a venue, an organization, and a common cause to build up class power towards more revolutionary action. Since socialism is based on working class power, unions are a good starting point. Other types of social organizations, such as tenant advocacy, student groups, prisoner advocacy, food kitchens, disaster relief, etc. are also good places for socialist political parties to serve the masses.\n\n\nOf course it's important to guard against opportunist unionist types who just want a bigger cut of the imperial booty. The sad reality in the imperial core is that more often than not these opportunists will infiltrate key positions in labor organisations because they will likely receive less persecution from law enforcement, and might even get bribes and kickbacks.",
            "score": 4,
            "replies": [
                {
                    "author": "BoJackHorseMan53",
                    "body": "What about social media influencing? 🤔",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "A-CAB",
            "body": "Unions are a tool. If they are not lead by the vanguard, they’re a tool of capitalism (look at any amerikan union and you’ll see what I mean). But if directed and influenced by the vanguard they become a powerful revolutionary tool to build class consciousness and post revolution exist as useful infrastructure in organizing the workplace under socialism. \n\nAre they strictly necessary to form a socialist society? No, but why not use all the tools at our disposal?",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "Because advocating only for a revolution is putting all your eggs in one basket. Unions work within capitalism because, you know, we're currently in a capitalist system. We don't want to be, but we are.\n\n  \nIf you don't see any grassroots socialist efforts, you're not looking very hard.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ok-Musician3580",
            "body": "It depends on the union. \n\nFor example, when Sankara was in power, unions in Burkina Faso were actively counter-revolutionary and had ties to the West/France.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fradtheimpaler",
            "body": "Hmm, bodies of working class people democratically organized to struggle against the owning class in the workplace.  Compared to bodies of working class people democratically organized to struggle against the owning class in the government.  Sounds like the same struggle to me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "VillainWorldCards",
            "body": "You're taking people's actions out of their context in an effort to smear union participation. Folks are trapped in capitalism by the housing, healthcare and grocery cartels. We need those things to survive and we need to work to get those things.\n\nUnionizing is a strategy that exists entirely within capitalism because it's a strategy that's used by people stuck in capitalism. You're apparently living outside of capitalism and wondering why everyone else isn't acting like you are. But unions are locked into a very simply conflict. Management represents the interests of owners and Unions represent the interests of labor. That's it. That is a very simple conflict involving 3 groups of people. Unions, Management and The Ownership-class. If you can't look at the conflict and identify the unions as the good guy and find some way to support them rhetorically, then you're simply not interested in helping labor gain ground.\n\nDo you have a family to support? Personally, I'm a single 41 year old dude in a big city. My life is real simple. If I can pay the rent and save a little money each month then I'm doing alright. I don't have to compromise anything I believe in to support this life style. But if I had a to house, cloth and feed a child then I would have to make very different decisions, I would have to double or triple my income. I would have to exist more fully within capitalism in order to generate the resources required to shield my child from capitalism's destructive grasp.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Anti_colonialist",
            "body": "Unions in the US are a tool to help create equal work environment for all labor. Unfortunately they were severely neutered by the NLRB and the Taft Harley Act which required unions to [sign anti communist](https://socialistworker.org/2011/07/29/labor-and-the-cold-war) oaths to become recognized by the NLRB.",
            "score": 1,
            "replies": []
        }
    ]
}