{
    "title": "Capitalism is just feudalism with extra steps",
    "author": "MrFenric",
    "subreddit": "LateStageCapitalism",
    "rank": 172,
    "score": 3074,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 49,
    "url": "https://i.redd.it/fvgqn4qj6hke1.jpeg",
    "id": "1iuogz5",
    "selftext": "The modern 1% live like kings, and the bottom 50% will starve within weeks if they stop serving them. We have come full circle to where we have lords and ladies of leisure in charge, and the working people owning nothing of consequence \n\nhttps://prospect.org/economy/rise-of-neo-feudalism/",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ancarrillo964",
            "body": "Ran across this old gem. 😖\n\nhttps://preview.redd.it/o77gkjkh2ike1.jpeg?width=1080&format=pjpg&auto=webp&s=8a6d39616b2c6a3414a0141da7f595d1fbacb9dd",
            "score": 170,
            "replies": [
                {
                    "author": "MrFenric",
                    "body": "Solid gold that",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "gingerbeardman79",
                    "body": "Just stole this old gem.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "vankirk",
            "body": "It was set up like that from the beginning. The Founding Fathers weren't regular Joes, they were wealthy landowners and businessmen. They wanted feudalism without the king. They did NOT want regular people voting. Look at how difficult it has been to get universal suffrage. And, at every turn, the ruling class try to strip those rights away.",
            "score": 47,
            "replies": [
                {
                    "author": "Explorer_Entity",
                    "body": "Thank you!\n\nI came here just to say \"NEW aristocracy?! Bruh, it's nothing new.\"",
                    "score": 11,
                    "replies": [
                        {
                            "author": "vankirk",
                            "body": "Nothing new",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "seanwdragon1983",
            "body": "Fascism is just Capitalism in distress.",
            "score": 62,
            "replies": []
        },
        {
            "author": "JFCGoOutside",
            "body": "It resembles feudalism because it is the following stage, and there will be another stage after capitalism and possibly another stage after that. Capitalism is constantly moving and shifting in its search for profits. This [guy](https://www.marxists.org/archive/marx/works/1848/communist-manifesto/ch01.htm) wrote from the 1800s wrote a lot about it. \n\nThe bourgeoisie cannot exist without constantly revolutionising the instruments of production, and thereby the relations of production, and with them the whole relations of society. Conservation of the old modes of production in unaltered form, was, on the contrary, the first condition of existence for all earlier industrial classes. Constant revolutionising of production, uninterrupted disturbance of all social conditions, everlasting uncertainty and agitation distinguish the bourgeois epoch from all earlier ones. All fixed, fast-frozen relations, with their train of ancient and venerable prejudices and opinions, are swept away, all new-formed ones become antiquated before they can ossify. All that is solid melts into air, all that is holy is profaned, and man is at last compelled to face with sober senses his real conditions of life, and his relations with his kind.\n\nThe need of a constantly expanding market for its products chases the bourgeoisie over the entire surface of the globe. It must nestle everywhere, settle everywhere, establish connexions everywhere.",
            "score": 24,
            "replies": []
        },
        {
            "author": "thomstevens420",
            "body": "Robber Barons are back",
            "score": 5,
            "replies": []
        },
        {
            "author": "boopbopnotarobot",
            "body": "New?",
            "score": 5,
            "replies": [
                {
                    "author": "MrFenric",
                    "body": "Yip, not appointed by God nor King, but by the power of money alone",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dancing_Cthulhu",
            "body": "I feel like they've been the aristocracy for a long time, they're just been a tad more shadowy about it before, and not quite so blatent about disregarding the social contract in their own back yards.",
            "score": 4,
            "replies": []
        },
        {
            "author": "HillZone",
            "body": "Born on 3rd base rich kids that go on to become even wealthier with their seed money really think they deserve their position in life. Probably close to 100% of them believe in free will and think they personally deserve the riches they get even if it means others wont have enough for basics. The problem is partly a belief in free will, which is a religious concept. And humans are just computers wired for genetic survival to have as many offspring as possible and live as long as possible, we're just at the mercy of selfish genes. I think competition for a billion years for survival is gonna have a catastrophic breakdown ending one day.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Zachbutastonernow",
            "body": "It's not a new aristocracy, it's the same one that has always existed.\n\nThose who are rich today trace their lineage back to generations and generations of wealthy people.\n\nThey are silver spoons and we need to end their bloodline",
            "score": 4,
            "replies": [
                {
                    "author": "marrow_monkey",
                    "body": "Exactly. They didn’t even get rid of the kings and queens for the most part, just neutered them. The aristocracy never disappeared, they just took over control.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Powerful_Reward_8567",
            "body": "Update to 0.01% and plutocracy of the multi billionaires.",
            "score": 3,
            "replies": []
        },
        {
            "author": "CurlyFatAngry",
            "body": "2025 and the rise of tech bors makes Varoufakis' book \"Techno Feudalism\" an even more relevant read.",
            "score": 3,
            "replies": []
        },
        {
            "author": "luigisphilbin",
            "body": "It’s possible that capitalism died in 2008 and we’ve been in transition to a new paradigm best described as technofeudalism. Big tech oligarchs own all of our data and transactions (financial, communication, etc) and we’re basically just paying them a subscription fee to be alive and participate in society.",
            "score": 22,
            "replies": [
                {
                    "author": "-zybor-",
                    "body": "Call it whatever you want but it's still capitalism, using different words won't change the fact that it's the same mode and means of production being owned by the same industrial capitalist class. Capital is still the same god that controls your material life.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "Buttock",
                            "body": "I have to agree. Efforts to change the name seem to only obfuscate this fact, and try to pull the focus away from how bad capitalism truly is.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Cthulusuppe",
                                    "body": "As someone that is careful who he tells that he's an anti-capitalist: I get the impulse. Americans look at you like you're an alien if you tell them capitalism is evil. I can tell close friends that \"capitalism does X, it is the cause of Y, it kills Z, etc etc\" They'll agree with me every step of the way. I can even suggest that humans are capable of organizing and cooperating without capitalism and they'll understand. But then I conclude with capitalism is evil and must be abolished and they'll instinctively reject the idea, so strong is propaganda. So invested are American's identity in the concept of capitalism.\n\nHonestly, it'd be easier if we could just swap labels and get people to reject capitalism by another name.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Vikkio92",
                                            "body": "Yeah Americans are unbelievably brainwashed to believe that capitalism is the root of all good and communism is the root of all evil. I can completely understand needing to find alternative words to get people to agree to dismantle capitalism without actually saying it out loud.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "great_account",
                    "body": "Capitalism is the religion of capital. Call it what you want, but this is the end result of capitalism.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "MrFenric",
                    "body": "I have no argument against that. The shear power of the capital in so few hands means that a group of people around a table can manipulate world governments and entire economies if they are the right people",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "roadrunner83",
                    "body": "Still capitalism, as you said the owner class is using property rights to exploit the working class.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "luigisphilbin",
                            "body": "The argument is from Greek economist Yanis Varoufakis. He says that big tech doesn’t actually produce capital. They just charge rent. Which is feudalism. Their tech effectively owns the marketplace and producers of capital are subjects. Still just a theory but I think he makes some really interesting connections.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nadie_AZ",
            "body": "There is a fantastic series on the Great Depression that is on YouTube. The first episode- A Job at Ford's opens with Henry Ford ice skating and the voice over gave a brief characterization of him and added that he was seen as the 3rd most important human being ever, after Jesus and Napoleon, according to a poll. This was the tail end of the Robber Baron era.\n\nThis isn't new. It was only forgotten even while it was always true.",
            "score": 2,
            "replies": []
        },
        {
            "author": "at_mo",
            "body": "Capitalism is just feudalism with the chance that a handful of poor people could become rich while 95% of their former class stay poor",
            "score": 2,
            "replies": []
        },
        {
            "author": "twilsonco",
            "body": "Sure, but for excusing the wealth and power of the elite we've replaced the Mandate of Heaven with just not needing an excuse. Surely that's a meaningful upgrade!",
            "score": 2,
            "replies": [
                {
                    "author": "MrFenric",
                    "body": "Best comment thus far!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Otrada",
            "body": "capitalism from it's inception was a project to preserve the feudal society in some form, and eventually produce the conditions to recreate it. This is by design.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ochoa_lira",
            "body": "China is the new world power. I wouldn’t be surprised if more countries begin to follow their system.",
            "score": 2,
            "replies": [
                {
                    "author": "MrFenric",
                    "body": "It certainly has improved the general standard of living in China a lot over the last two decades, but also had a lot of hard downfalls before that. I agree 100% that there must be a better system than unchecked capitalism.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gingerbeardman79",
            "body": "https://imgflip.com/i/9lc8xp",
            "score": 2,
            "replies": [
                {
                    "author": "MrFenric",
                    "body": "If it's important to you, I made this in memegenerator - you could have just asked...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "gingerbeardman79",
                            "body": "That's what I did too. Must've just copy/pasted the wrong part. [was trying to embed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MrFenric",
                                    "body": "My bad, I thought it was one of those bot sniffer tools",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Frosty_TSM",
            "body": "Time for us all to be Charles-Henri Sanson's!",
            "score": 1,
            "replies": []
        },
        {
            "author": "karatekid430",
            "body": "A scary number of people are willing to be trodden on if minorities are trodden on slightly harder.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JstnJ",
            "body": "At least in feudalism peasants had access to eat or use the products of their labor. Current capitalism makes everyone a slave to the machine for fear of starvation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PhenomeNarc",
            "body": "**DOWN WITH THE MONARCHY**",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -8,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 4,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}