{
    "title": "Elon Musk playing with an art-piece chainsaw gifted to him, by the president of the Republic of Argentina",
    "author": "BaseNice3520",
    "subreddit": "LateStageCapitalism",
    "rank": 175,
    "score": 524,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 78,
    "url": "https://i.redd.it/k328mmjfqhke1.jpeg",
    "id": "1iuqe13",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Matty321",
            "body": "one of the most (if not the most) embarrassing men alive right now.",
            "score": 370,
            "replies": [
                {
                    "author": "Citruss404",
                    "body": "It’s ironic. He cares so deeply about what people think that he spends lots of time & energy portraying himself as a genius, and then he also does the most cringe shit ever. \n\nCome to think of it… he cares deeply about what *he* thinks of himself. He thinks he’s so cool. He thinks he’s cultivating m@@@d aura. He’s delusional. \n\nLike most billionaire parasites.",
                    "score": 130,
                    "replies": [
                        {
                            "author": "Artemistical",
                            "body": "we used to think of him as Tony Stark....now he's just Hitler 2.0",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "b0bx13",
                                    "body": "Under no circumstances do you have to hand it to Hitler, but this almost feels a little harsh towards Hitler",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Citruss404",
                                            "body": "Lmfao",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "b0bx13",
                                                    "body": "At least he knew how to dress himself. And to his credit, he *did* kill Hitler",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Citruss404",
                                    "body": "Low-key proud of how many people have realized this. Not enough but still",
                                    "score": 40,
                                    "replies": [
                                        {
                                            "author": "murray_mints",
                                            "body": "I'm absolutely ashamed of humanity for allowing things to get this bad. It's been blindingly obvious what a deranged villain this piece of shit is for the best part of a decade. Stop giving morons credit when they deserve none.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AutoModerator",
                                                    "body": "Your post was removed because it contained a sexist term. You should receive a message from the automoderator telling you the exact term the post was removed for. For more information, see [this link](https://weeklysift.com/2015/06/29/slurs-who-can-say-them-when-and-why/). **Avoiding slurs takes little effort, and asking us to get rid of the filter rather than making that minimum effort is a good way to get banned. Do not attempt to circumvent the filter with creative spelling; circumventing the filter will result in a permaban.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "pridejoker",
                                    "body": "He's more like general aladeen",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "metamorphosis",
                            "body": "\nDude was out here flexing about being a top 20 player in some MMORP, either Path of Exile or Diablo , which he actually is. That’s a pretty big feat  getting to that position as takes serious time and skill, not something casual players can do \n\nThen he live-streamed himself playing… and it was immediately obvious to anyone who knows the game that he wasn’t nearly as good as he claimed. His moves didn’t line up with what you’d expect from a high-level player.\n\nTurns out, he straight-up paid other people to grind for him.\n\nLike, imagine being a multi-billionaire celebrity in your 50s and pulling something like that. That’s the kind of thing you’d expect from insecure teenagers trying to impress their friends.\n\nDude just radiates a superiority complex, desperate for people to think how good he is.\n\nIt doesn't help that he has an army of fans  that also  think this",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Citruss404",
                                    "body": "It’s hilarious because I watched an old clip of him claiming to be top player on Diablo before the POE2 stream happened. I immediately clocked it as “this is impossible for someone who supposedly does what he says for work.” \n\nIt takes tremendous amounts of time. Comment section didn’t suspect anything. Then a few weeks later it came out that he’s an obvious fraud. What a weird ass thing to do.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Nephroidofdoom",
                    "body": "I want the timeline where we don’t have Temu Lex Luthor",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "MackDaddy1861",
                    "body": "Which one?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "castroski7",
                            "body": "Men",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tumericschmumeric",
                    "body": "Definitely the most cringe person on earth. 10 year old boys can’t hold a candle to him",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "electricmaster23",
                    "body": "And he will think it’s the coolest thing ever. Lol.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Artemistical",
            "body": "why is Elon meeting with leaders of other countries at all????? what does that have to do with government efficiency?? This is so fckin ridiculous",
            "score": 52,
            "replies": [
                {
                    "author": "atomicfuthum",
                    "body": "Hey, he bought the US, he has saying in its decisions!",
                    "score": 17,
                    "replies": [
                        {
                            "author": "SlyHolmes",
                            "body": "He’s just getting ready to buy the rest. Gotta catch em all",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "atomicfuthum",
                                    "body": "Hey, I don't want this guy buying my country! I live here!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mschonaker",
                    "body": "Milei is obviously paying to be there.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DifferentPirate69",
            "body": "Why is the crypto rugpuller not in prison",
            "score": 91,
            "replies": [
                {
                    "author": "Suttrees",
                    "body": "It was going to be investigated, but the same people who created the project to investigate him, voted against the project when it was time to approve it. Yeah, we are dealing with that level of corruption.",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "Zero-meia",
                    "body": "Crypto rugpullers* if I may",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "nhnsn",
                    "body": "Same reason trump isn't either.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "BaseNice3520",
                    "body": "why should anyone feel bad for scammed crypto investors? they're rich and greedy",
                    "score": -25,
                    "replies": [
                        {
                            "author": "BloodlustROFLNIFE",
                            "body": "You don’t need to feel bad for every crime victim to recognize that the law failed them and they deserve justice just like anyone else?\n\nNot a crypto person at all, just saying. It’s not the time to be saying laws don’t matter.",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "cockerspanielhere",
                            "body": "Milei scammed lots of poor people with this particular scam. Argentina is the south american county with more crypto users.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "abyde",
            "body": "Is that the chainsaw of poverty?",
            "score": 69,
            "replies": [
                {
                    "author": "MrsConclusion",
                    "body": "Wake up babe, new verse to \"If I had a Hammer\" just dropped.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -32,
                    "replies": [
                        {
                            "author": "Communist1917",
                            "body": "You are going to be a billionaire, one day, for sure!",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "Wolf_Wilma",
                            "body": "Oh I smell leather on your breath, you need more than Listerine to clear it up",
                            "score": 15,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cockerspanielhere",
            "body": "How many pathologies can fit in a single picture?",
            "score": 15,
            "replies": []
        },
        {
            "author": "Suttrees",
            "body": "When I thought that Milei couldn't embarrass us more than he already did, this happens. I hate this so much.",
            "score": 13,
            "replies": [
                {
                    "author": "NoodTheNoob19",
                    "body": "So, he’s not getting  an impeachment after the $LIBRA scandal? \nWhy there’s no argentinian burning the front of the pink house?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BaseNice3520",
            "body": "![gif](giphy|W7HHIoUwXvarA3axfF)",
            "score": 24,
            "replies": []
        },
        {
            "author": "sh_tluck",
            "body": "He wants to be perceived as cool and \"manly\" so bad, but he's such a try-hard loser and always will be.",
            "score": 28,
            "replies": []
        },
        {
            "author": "Sufficient-Read3609",
            "body": "No dystopia ever prepared me for how fucking embarrassing its leaders would be.",
            "score": 10,
            "replies": []
        },
        {
            "author": "mad_moose12",
            "body": "Someone noticed my son was smart at the grocery store last week, the neck beard clerk said he would be the next Musk. I said I’d rather he be a good person",
            "score": 8,
            "replies": []
        },
        {
            "author": "Historical-Edge-9332",
            "body": "So this is the guy all the “alpha males” are rooting for?",
            "score": 14,
            "replies": [
                {
                    "author": "40days40nights",
                    "body": "Real men mail ropes to their chosen brood mothers",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Fictional dystopian scenarios are starting to sound more appealing than this.",
            "score": 8,
            "replies": []
        },
        {
            "author": "mockjogger",
            "body": "I tried to watch the 30 minute version of this on Youtube and I had to stop as soon as the saw came out just because of the intense second hand cringe I was soaking in. Like the whole production is cringe. Was this on regular TV? Are there people who actually make time in their day to watch this shit? Do they say “Not now honey, the cpac show is on.” I just can’t imagine being so void of thought that you would eat this up for entertainment. Its hurting my brain.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Sc4rl3tPumpern1ck3l",
            "body": "Fire cleanses all",
            "score": 4,
            "replies": []
        },
        {
            "author": "Kleidt",
            "body": "I thought they photoshopped the Argentinian guy in",
            "score": 3,
            "replies": []
        },
        {
            "author": "Deletious",
            "body": "Didnt that guy fuck his sister?",
            "score": 3,
            "replies": [
                {
                    "author": "Jaded-Woodpecker-299",
                    "body": "that was Altman the open AI guy",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "thehourglasses",
            "body": "This was the conference where Bannon threw a seig heil. Classy company.",
            "score": 3,
            "replies": []
        },
        {
            "author": "VINCE_C_",
            "body": "This is ultimately what our planet is being killed for.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BaseNice3520",
            "body": "BTW is Elon's own portrait in that poster, shopped? his jawline has like 30LVs higher of mewing power",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jaded-Woodpecker-299",
            "body": "that neglected manchild really needs to get some mental health support",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "I’m sick of seeing Elon posts in this sub, I’m aware that it’s relevant but why does this photo have to contaminate this sub",
            "score": 3,
            "replies": []
        },
        {
            "author": "bestill234",
            "body": "Weirdos. Soulless weirdos.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chikado_",
            "body": "ain't it just so neat that our fucking elected (by so many goddamn idiots) president is not in this picture?",
            "score": 2,
            "replies": []
        },
        {
            "author": "uglylittledogboy",
            "body": "He needs to go",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok_Perspective_8361",
            "body": "Imagine what you would do if you had his wealth, but instead he does stupid shit like this, in addition to destroying our country from the inside.",
            "score": 2,
            "replies": []
        },
        {
            "author": "seggsdge",
            "body": "Soy",
            "score": 2,
            "replies": []
        },
        {
            "author": "CollapsingTheWave",
            "body": "Is this a weird reference to the  illigal logging issues?",
            "score": 1,
            "replies": [
                {
                    "author": "BaseNice3520",
                    "body": "Milei has some issues with chainsaws\n\n[https://ichef.bbci.co.uk/news/1024/branded\\_mundo/ba1a/live/c933b940-a5c3-11ee-bc44-c7570d3b941d.jpg](https://ichef.bbci.co.uk/news/1024/branded_mundo/ba1a/live/c933b940-a5c3-11ee-bc44-c7570d3b941d.jpg)",
                    "score": 4,
                    "replies": [
                        {
                            "author": "CollapsingTheWave",
                            "body": "Interesting.. 🤔",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "flynnwebdev",
            "body": "We live in an utterly bizarre timeline now",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top-Estimate2575",
            "body": "Look on the bright side, when Musk gets overthrown we can use a chainsaw on him! Lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "ordinaryhorse",
            "body": "What a dipshit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ent_Soviet",
            "body": "I’d pay money to watch him try to figure out how to start it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mundane_Designer_199",
            "body": "God idiocracy was prophetic",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lumpy-Nihilist-9933",
            "body": "neither know how to use a chainsaw",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exotic_Magazine2908",
            "body": "This degeneracy and depravity of the elites and billionaires is actually a sign of their weakness. They are desperate the things are not going so good for the empire and distract their people with circus.",
            "score": 1,
            "replies": []
        },
        {
            "author": "niagaemoc",
            "body": "He's insane.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Astraxx2020",
            "body": "PRESIDENT CAMAAAACHOOO!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "packocrayons",
            "body": "I can tell the color of that plastic from a mile away. That's a holzfforma. A chinese company that directly rips off Husqvarna and Stihl ~~(who to my knowledge are American but I haven't checked)~~. Apparently they're both european",
            "score": -1,
            "replies": [
                {
                    "author": "Gathorall",
                    "body": "Swedish and German, no wonder Americans think they're so great when they think good product=American.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "packocrayons",
                            "body": "Lmao I'm Canadian. It was just a guess",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}