{
    "title": "No kidding! They've already been priced out of everything else!",
    "author": "haloarh",
    "subreddit": "LateStageCapitalism",
    "rank": 171,
    "score": 874,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 39,
    "url": "https://i.redd.it/hq9fiwnscjke1.jpeg",
    "id": "1iuxy9f",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "rougekhmero",
            "body": "~~NIGHT~~LIFE",
            "score": 211,
            "replies": [
                {
                    "author": "NuffinButA-J-Thang",
                    "body": "Came here to find my intent has already been shared. Great minds or something",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wytch78",
            "body": "You can’t go out. Going out is like $100. Mayyyybe if you’re lucky some crustpunks are putting together a free house concert to save arts and culture. ",
            "score": 147,
            "replies": [
                {
                    "author": "Vilnius_Nastavnik",
                    "body": "In NYC a night out for $100 would be a raging bargain ",
                    "score": 59,
                    "replies": [
                        {
                            "author": "None",
                            "body": "$100 for a night out is absurdly expensive (for me, in this economy, being underpaid)  and it is definitely possible to go out for way cheaper than that in NYC, just don’t go to some dumb club or a craft cocktail bar. There are punk dive bars and little dive bars with crazy happy hours.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "briancbrn",
                                    "body": "I wish we had good dive bars down here in SC 😞",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Well I’m Covid conscious / quad-demic conscious (I wear an N95 everywhere and never take it off except for alone in apartment), I don’t drink (except for like a few times a year or on special occasions) and am on a beyond tight budget so I’m not frequenting any dives anyway. I usually just get harassed by men in dive bars even pre-covid, pre-N95 and I’m a queer woman so you’re not really missing out on much at least from my perspective. Everyone is sick here right now anyway (except for me because I wear a respirator) so you don’t want to be out and about exposing yourself to disease just for the hell of it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "daeglo",
                    "body": "Bring back house parties!",
                    "score": 24,
                    "replies": [
                        {
                            "author": "graygarden77",
                            "body": "I love a party in the house",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "RockafellerMeds",
                            "body": "Need houses and at 400k it doesn't work like it used to. ",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Death_by_Hookah",
                    "body": "Even buying drinks for a party at home is expensive where I am. I mean, everything is, but it’s especially painful when we wanna have a drink and watch a shit movie.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "daeglo",
                            "body": "Get your guests to each bring a case of beer. That's what we used to do.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "glumbum2",
                                    "body": "Also just arrived high lol",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fremenator",
                    "body": "I live in a high cost of living city.   Every night including weeknights there are shows for either zero cover or $10.   Beers/drinks are between $7-15 each.   I have a super low tolerance so that adds up to max $40 and that's if I don't pregame.   \n\nI definitely get it like it's easy to spend $100 with food, Ubers, and getting knock out wasted, and I've done that A LOT the last year (but I'm old now with a salary), but you could definitely go out on the cheap if you know where to look.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alladin_Payne",
            "body": "I'm surprised the headline isn't  \"Are Millenials killing nightlife?\"",
            "score": 151,
            "replies": [
                {
                    "author": "rappa-dappa",
                    "body": "Millennials aren’t young people.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "PuzzlePassion",
                            "body": "I’m not a millennial, but I feel like everyone talks about millennials exactly like that.",
                            "score": 35,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Alexandertheape",
            "body": "![gif](giphy|35MG6KoNC3zyAkGes0)",
            "score": 33,
            "replies": [
                {
                    "author": "RockieTrops",
                    "body": "Turns out gen Z aren't boring - we're just gaming.",
                    "score": 26,
                    "replies": []
                }
            ]
        },
        {
            "author": "Explorer_Entity",
            "body": "I'm 37 and I never got to have this \"nightlife\". Can't even afford food...",
            "score": 18,
            "replies": []
        },
        {
            "author": "haloarh",
            "body": "[SOURCE](https://www.dazeddigital.com/life-culture/article/66137/1/young-people-are-being-priced-out-of-nightlife-study-says)",
            "score": 5,
            "replies": []
        },
        {
            "author": "daeglo",
            "body": "Back in my day we just threw a house party if we wanted to have fun. Bars are overrated.",
            "score": 33,
            "replies": [
                {
                    "author": "blueep3",
                    "body": "I did that for a year or so as im the only person i know lucky enough to own a house but people just disrespect the space so it makes it no fun",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Zealousideal-Load-64",
                    "body": "We don't have houses!",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "FreeMarketApeEscape",
                    "body": "Fuck yeah house parties were like every night while i roomed with highschool buddies during college. I worked mornings at a memory care and never got any sleep haha",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "NocheEtNuit",
            "body": "Went to a show. It was $23 for a fucking watered down whiskey sour. I'm never leaving the house again 😭",
            "score": 5,
            "replies": []
        },
        {
            "author": "pauloeusebio",
            "body": "I took for granted all those times at downtown Austin in the early 2000s. You never know what you have until it's gone.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ondesinnet",
            "body": "My son seems to go to a rave in Oregon every other night. Clubbing might be out but they still party in Oregon at least.",
            "score": 8,
            "replies": [
                {
                    "author": "daeglo",
                    "body": "We get wild in Oregon 😎",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChrisRich81",
            "body": "And here I thought my students just preferred PlayStation online, Netflix, and TikTok. I stand corrected.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DB-601A",
            "body": "nightlife is where you make it. but then these journo types wouldn't know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lolTryingToAdult",
            "body": "I just spent about $200 bar hopping for a friends birthday. Lol that’s my spending for the next 3 months. It’s gonna take me a while to recuperate financially. \n\nHere’s my breakdown of the night:\n\nBirthday gift: $50 Amazon gift card because it’s cheaper than a regular gift and you don’t have to worry about getting something they don’t like. \n\nBar 1: 3 glasses of wine, appetizer. Total of $55\n\nBar 2: entry fee for the group(live music was playing), 2 margaritas. Total: $63\n\nGas: $32\n\nHad to call it a night because I was drunk, couldn’t afford it anymore and my designated driver said it was time to go home. Plus I was hungry and bar food is expensive. Honestly, it’s cheaper partying at home. I couldn’t see myself doing this every night….id go bankrupt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrashCulture",
            "body": "I've seen the opposite.(I'm an older guy returning to university.) I'm the one being called boring for refusing to go to night clubs because it's too expensive. They act like paying 25€ in entrance fee, another 10€ in wardrobe fees and then 12$ for a beer or 25$ for a cocktail is the way things should be.\n\nI have no idea how they manage to afford it, but I guess that's where they feel their money is best spent. I'd much rather buy a big case of 1€ beers and invite some friends over for boardgames than pay the exorbitant fees nightclubs takes these days.\n\nWhen I went to the same clubs 15 years ago you could get a pint for 2-3€, only the fanciest of places had an entrance fee.",
            "score": 1,
            "replies": [
                {
                    "author": "Frogmaninthegutter",
                    "body": "Most of them are in debt. I'm 39 and I was dating a woman that was 33 and she had friends that were in their late 20s. A lot of them like to go out all the time and have some serious credit card debt going on because of it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CrashCulture",
                            "body": "I guess that makes sense, though everyone is in debt in this economy.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "onelawforthem82",
            "body": "To be fair they are poor, but they're also boring.",
            "score": -29,
            "replies": [
                {
                    "author": "AmumuHug",
                    "body": "Wow a new account that has half-assed inputs that get removed AND trying to fuck on reddit? Can't tell if it's a bot or just lonely.",
                    "score": 17,
                    "replies": []
                }
            ]
        }
    ]
}