{
    "title": "Just a reminder.",
    "author": "CMao1986",
    "subreddit": "LateStageCapitalism",
    "rank": 164,
    "score": 9958,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 37,
    "url": "https://i.redd.it/06nsii11bjke1.png",
    "id": "1iuxp1x",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoiledWholeChicken",
            "body": "You're not a capitalist, you're the capital.",
            "score": 296,
            "replies": [
                {
                    "author": "vynepa",
                    "body": "Beautifully put. It is strange to me how \"capitalists\" can hold their beliefs and simultaneously say things like \"If the product is free, you are the product.\" All they have to do is take that one extra step.",
                    "score": 64,
                    "replies": []
                },
                {
                    "author": "Stellanora64",
                    "body": "I'm going to use this for later. I tend to over explain things, but that just works.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "words_wirds_wurds",
                    "body": "They literally call you 'human resources' to your face",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "lasercat_pow",
            "body": "Most people, probably over 90 percent of US people, have no idea what capitalist, socialist, or communist even mean.",
            "score": 262,
            "replies": [
                {
                    "author": "atomicfuthum",
                    "body": "I'd say that over 80% of people worldwide only know that \"socialism = bad\" due to propaganda.",
                    "score": 116,
                    "replies": [
                        {
                            "author": "Agent398",
                            "body": "Socalism is when the government does handouts and free stuff. Communism is the same but more scary and more evil",
                            "score": 69,
                            "replies": [
                                {
                                    "author": "atomicfuthum",
                                    "body": "My country - Brazil - has free healthcare... is that communism or socialism?",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "letsnotandsaywemight",
                                            "body": "Yes",
                                            "score": 36,
                                            "replies": []
                                        },
                                        {
                                            "author": "SoakingWetBeaver",
                                            "body": "No, free healthcare is only Communism if it happens within the borders of USA. Elsewhere free healthcare is compatible with Capitalism.",
                                            "score": 22,
                                            "replies": [
                                                {
                                                    "author": "disingenuousinsect",
                                                    "body": "Until those countries stop allowing a prescribed proportion of their economy to be exploited by the masters. Then they are evil commies.  \nI have noticed the state propagandists rarely (if ever?) cite other countries superior health coverage as an evil. They don't want people to consider that. But when the idea is accidentally leaked, their counter is always the same--lack of choice within the public system for billionaires to cut to the front of the line for a new liver, Mr So-and-so having to wait an entire 10 hours for a replacement plastic bicep insert, etc.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SkamsTheoryOfLove",
                                            "body": "Socialism. Solidarity.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Stellanora64",
                                    "body": "Literally my parents lmao. I'm teaching them slowly, but it sure hasn't been easy. Slowly but surely they'll get there, hopefully.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "leftofmarx",
                    "body": "Capitalism is when I freedom and eagles soar, socialism is when we are enslaved to healthcare, communism is when Stalin kills 20 billion by eating all of the grain with his large spoon",
                    "score": 32,
                    "replies": [
                        {
                            "author": "lasercat_pow",
                            "body": "Lol",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Independent-Stick244",
                            "body": "No need for the /s.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BaseNice3520",
                            "body": "https://preview.redd.it/psmku82723me1.png?width=896&format=png&auto=webp&s=5ce8286208e508b9413f56a3a8226c265c041a35",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CheeseReaper77",
            "body": "Americans are probably the only people stupid enough to think that one day they’ll be a millionaire so thats why they need to advocate for the tax cuts and all the stuff they can take advantage of when they become rich",
            "score": 55,
            "replies": [
                {
                    "author": "words_wirds_wurds",
                    "body": "'Millionaire' doesn't mean much anymore. If you own a home and have a modest retirement account, you are a millionaire by 60 no sweat. Still crushed by today's cost of living.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Kalsed",
                    "body": "No, no they are not. I've never stepped on the US. I heard this mentality all of my life. Propaganda is a hell of a drug, thinking that people are stupid for it makes sure that a) they will not hear you b) makes you more susceptible to it. Class consciousness is hard.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "PiskoWK",
            "body": "Gritty is with the people.",
            "score": 43,
            "replies": [
                {
                    "author": "UncleSlacky",
                    "body": "Why is he still on Xitter though?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "PiskoWK",
                            "body": "Even gritty has corporate overlords in the NHL.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Yalla_3ad",
            "body": "but I was told if I work hard enough and never skip a day at work, I might have a shot at being rich one day.",
            "score": 30,
            "replies": [
                {
                    "author": "Fuzzloo",
                    "body": "You may, if you do it every day for the next 10000 years",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "ItsAMeEric",
            "body": "Liberals:\n\nFederal employees are being fired, how will they survive?\n\nKids are losing subsidized school lunches and poor people are losing SNAP food stamps, how will they survive?\n\nSick people are losing medicaid benefits, how will they survive?\n\nIllegal immigrants that are being exploited for cheap labor are being deported, how will we afford to eat?\n\nHow can Trump be so cruel to make these people have to suffer at the hands of the free market?\n\nBut also... Capitalism is the greatest economic system in the world!!!!",
            "score": 18,
            "replies": [
                {
                    "author": "rodneyck",
                    "body": "Many of the dems are asking these questions now, because the other side is destroying the safety net systems, but during the election, not a word. It was all identity politics and we are for 'good things.' WTF that meant. They couldn't even bring themselves to talk about the real issues making people struggle. Another sign of capitalism in decline, and the parties are nothing more than instruments for the oligarchs to destroy the world.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Commercial-Kiwi9690",
            "body": "Its not just billionaires, but multimillionaires that live off compounded interest forever, ie the top 20%. They significantly effect or democracy, and they are parasitical as they do not contribute to society but only take.",
            "score": 15,
            "replies": []
        },
        {
            "author": "_CHIFFRE",
            "body": "The workers value for the Capitalists is in getting squeezed for their productivity: [Labour productivity](https://en.wikipedia.org/wiki/List_of_countries_by_labour_productivity)",
            "score": 6,
            "replies": []
        },
        {
            "author": "wellreadwhore",
            "body": "Any time my Republican friend tries to claim that they are capitalist I just ask them what capital they own",
            "score": 4,
            "replies": [
                {
                    "author": "RiverLum",
                    "body": "What are you called if you are someone who believes in the ideology of capitalism but don’t own capital (inb4 dumb class traitor)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "wellreadwhore",
                            "body": "We're all just consumers imo",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BoomerCapital",
            "body": "\"I'm a capitalist!\"\n\nOh? What capital do you have? What datacenter do you own? Apartment building? Mine? No? You have an underfunded IRA and $500 in a savings account?",
            "score": 2,
            "replies": []
        },
        {
            "author": "SloanKettering350",
            "body": "Elon Musk is handsome 😚",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -9,
            "replies": [
                {
                    "author": "negative_imaginary",
                    "body": "Unlike communist, which from the beginning was used to form a collective political identity, capitalist initially referred to a specific class of people, those who owned capital and used it to generate wealth through private enterprise. The term became more widespread in the 19th century, especially in the works of Karl Marx, who used it to describe the bourgeoisie, or the ruling class that controlled the means of production. In this context, being a capitalist wasn’t simply about believing in capitalism as an economic system, it was about actually possessing capital and benefiting from it. This differs from communist, which refers to an ideological and political identity that anyone can adopt, regardless of their material wealth.\n\nEven in America during the Cold War, political rhetoric was dominated by anti-communism rather than pro-capitalism. The emphasis was on resisting the perceived threat of communism rather than actively promoting capitalism as a personal identity. The Red Scare, McCarthyism, and general political discourse framed capitalism as the natural order, while communism was cast as an ideological opponent. As a result, many Americans came to define themselves not as *capitalists* but simply as *not communists.* Even today, conservative and liberal political movements in the U.S. tend to frame economic debates around defending against socialism or government overreach rather than championing capitalism as an explicit identity.",
                    "score": 10,
                    "replies": []
                }
            ]
        }
    ]
}