{
    "title": "List of MAGA Actions and Statements that Mirror Fascist Regimes",
    "author": "russa111",
    "subreddit": "LateStageCapitalism",
    "rank": 151,
    "score": 94,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 24,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iwlrma/list_of_maga_actions_and_statements_that_mirror/",
    "id": "1iwlrma",
    "selftext": "TLDR; looking to write a personal research paper on the blatant fascism that we see in the Trump administration and MAGA movement, looking for fascist acts of Trump and papers regarding the rise of fascist regimes.\n\nI have been talking to family and friends about the what we are seeing in the U.S. and how it is exactly the path that led to brutal fascist regimes. Some see the writing but others refuse to see it and say that Biden did the same. I decided that I am going to write a short research paper on the topic so condense the information and have sources all in one place.\n\nI know it’s a stretch, but I was wondering if anyone has kept track of actions and statements from Trump and his administration so that I can make this as comprehensive as possible. The news cycle just goes so fast, it’s so hard to keep track of everything. Also any academic/journal articles discussing the nature of fascism and the rhetoric that led to the rise of fascist regimes would be amazing. I already have some that I will work from, but could always use more.\n\nAlso if anyone is interested in the final paper, let me know and I can share. I don’t get paid for this or anything, so it’s not professional, but I do have a background in political science, economics, and IR, so it might still be useful for some.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious-Let-5781",
            "body": "Don’t have a list, but the parallels are easily spotted. As recommended by others you need a larger scope as Biden is complicit. American empire is decaying into fascism and that’s a bipartisan process, the dems were just less openly violent against their own population (unless you’re speaking up for the Palestinian cause)\n\nYou might want to try the opposite approach. Through researching zionism I ended up reading about how the Nazi regime came to power and it’s hard not to see parallels (especially if you include economics). Link the 2008 credit crunch to the 1929 crash and continue from there. BadEmpenada has a video (which has sources you might like) analyzing the Nazi conquest for lebensraum in eastern Europe as German colonization greatly inspired by the genocide of the native Americans, and there’s a lot of colonial posturing by Trump. \n\nA nice little detail you might like is that the nazi’s only build working camps (which are still concentration camps) on proper German soil and all extermination camps were on newly conquered polish ground so the german population would be less aware/exposed. Kinda like how ICE has started sending migrants to Guantomano (sp?) bay without a clear plan on how to proceed. \n\nThis last part isn’t mirrored in our timeline yet, but Nazi concentration camps didn’t start out as extermination camps, but were initially to, well, concentrate people to process out of the country and when you’ve got them there in a camp they might as well wirk. The Haavara Agreement (another great sourced vid on YT as part 16 on a Palestine series but can’t remember the channel name) was there before WW2 to guide the Jewish exodus (steering it towards Palestine, but that’s another whole bucket of worms). The hate for the untermensch outgrew the pace of the emigration and plans for a final solution were drawn up.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Whoretron8000",
            "body": "Stretch that list past a few presidents and you might have some help, focusing on one president and ignoring all else is just another trite paper detailing that water is wet.",
            "score": 13,
            "replies": [
                {
                    "author": "russa111",
                    "body": "I agree that the U.S. has had an illusion of freedom and has been quite authoritarian for quite some time. It is ignorant to pretend that Trump appeared in a vacuum, that’s not what I’m saying. I think that it’s also necessary to acknowledge that authoritarianism exists on a scale and there are different forms of it. It’s hard to deny that MAGA is building to fascism in a way that, to my knowledge, we have not before seen on American soil in modern history. Replacing all dissenters with loyalists, even down to the JAG corps, is pretty alarming. Idk, what are your thoughts?\n\nI know the US is a capitalist hell-scape that has inflicted countless atrocities, but right now we are at the edge of things getting a whole lot worse. I want to write this paper not to examine the course of US politics that have led us here over the last, but to show how we are not on the verge of fascism, but that fascism is here. And now we have to decide how we will respond to it, starting at the grassroots level.\n\nThe reason is because I come from a very conservative state, the people in my life will not be willing to read a 50 page communist critique of what has led us to this point, but they would be willing to read 5-10 pages of our current situation and what is terrifying about it.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "rrunawad",
                            "body": "You make it sounds like fascism under Trump is this unique evil when it's not. He's just bringing fascism back home when it was typically projected outwards against ''lesser'' countries and people who weren't allied with US hegemony. The US has always been a fascist settler empire spreading death and decay all around the world.\n\nAlso every state is by nature authoritarian. Conflating authoritarianism with fascism is how you end up with politically illiterate liberals who think that opposing authoritarianism is the most important virtue in existence while they keep drone bombing people in the Middle-East. If you want to measure fascism as a spectrum, then honestly, Trump is still lacking in that regard compared to his predecessor who committed a genocide.\n\nJust keep a list of the ways Trump is violating domestic and international law and pushing for reactionary, bigoted policies and legislation if you must, but I wouldn't measure it, honestly.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "russa111",
                                    "body": "I’m gonna be honest, I don’t get why yall gotta be condescending like this. Give a little benefit of the doubt instead of picking apart allies. \n\nI am aware of US atrocities, as I said in my comment that you are replying to. I am very aware that Trump is bringing home what we’ve done to other countries, hence why I said “ on American soil.” But this should still be alarming for even those that recognize the evils of the U.S. It’s possible to recognize that we’ve terrorized countries around the world, but that things could get far worse. \n\nPolitical dissent will be suppressed more aggressively, negative impacts from losing trade and allies will squeeze Americans tighter while also playing into the victim-complex that Americans have. They will blame outwardly more and more, causing increased aggression. Maybe it won’t play out like this, I hope it doesn’t, but we can’t pretend like things can’t descend further into madness.\n\nAs for authoritarianism and fascism. I suppose it depends on how you are defining, but typically authoritarian rule is typically considered part of a fascist regime. Again, I know the U.S. does fucking terrible things, I’m not arguing Biden or past presidents aren’t war criminals. But it is also worth keeping in mind that Trump has been in office for a month, so we have not seen how this will play out. I hope I’m wrong, but it’s not looking like Trump will end his time in office behind Biden.\n\nWith all of this stuff, I’m open to being wrong, but I just ask that you’re not condescending and realize that we’re on the same side. And I shouldn’t have to cover every possible point for that to be acceptable. Like I said, I’m writing this paper for people that aren’t as well-versed as you or I. People that feel things are crumbling and are scared and tired and don’t know why. People that think “only communists are fascists, like the nazis!” So I think starting by trying to convince them that the U.S. has always been fascist on a global scale is a stretch.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "-zybor-",
                                            "body": "Liberalism is moderate wing of fascism.\n\nWhat going on in your country is just consequences of prolonged fascism since its founding. Washington was the richest person at the time of US founding.\n\nhttps://preview.redd.it/73iop4l6g0le1.jpeg?width=720&format=pjpg&auto=webp&s=bcb5a8f7733fdcc27d07d43788350f7554d8f1f4",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "MotherEarth1919",
                                            "body": "I think you have a great idea, don’t let nay sayers deter you. Yes, we have always been hypocritical and the military/industrial complex is not a conspiracy. Most of the people I know are burying their head in the sand and just want to live a life without hardship. Thank you for trying to educate and spread awareness. \nNaomi Klein wrote the Shock Doctrine which gives numerous examples of this happening globally. It may give you more ideas on what they plan to do to seize control.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tomvonbeck",
                            "body": "Nah no thoughts back from them methinks, they just wanted to shit on you and look cool on the internet",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Adventurous_Meal1979",
            "body": "I'd be interested to read it. I have tried to find basic information about the rise of the fascist states in the 1920s and 30s and specifically how life was for people; you often hear about the more sensational or egregious aspects of fascism but not how it affected everyday life. if more people who think this isn't going to affect them knew how it was back then, it might change some minds.",
            "score": 5,
            "replies": [
                {
                    "author": "russa111",
                    "body": "Yes exactly, i come from a conservative state and much of my family and childhood friends are conservative. I already see some people in my life starting to be like “oh, maybe this could be bad.” So I’m hoping I can put together a good,concise paper for these people around me.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "FlummoxedFlummery",
                    "body": "Oh we finna find out how it was...",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "A-CAB",
            "body": "Why are you limiting to Trump and MAGA? Amerika is the regime that inspired the Nazis. The last president committed the first televised and most brutal genocide in a generation. \n\nYou should link the fascist actions of the amerikan regime, not any one of its despots, so that you do not misdirect efforts to counter it.",
            "score": 4,
            "replies": [
                {
                    "author": "russa111",
                    "body": "Because it’s about audience. I’m not sure about your background but I grew up VERY conservative and VERY religious. It wasn’t until my junior year of high school that I started to deconstruct this worldview because of a friend that would have conversations with me and was really willing to answer my questions and he had patience with me. \n\nIt took me around 5 years from that point to really deconstruct (in some areas faster than others hahah.) And if he had jumped straight to “you know the U.S. has always been fascist around the world,” I don’t know if I ever would’ve freed myself (I like to think I would have, but idk). \n\nChanging hearts happens a step at a time and it requires addressing your audience properly. This paper is not for communists like us, it is for conservatives who are starting to see the cracks because MAGA is going mask off with fascism. The problem is that fascism has been so poorly taught in the U.S., that many don’t recognize it for what it is, and even with Trump being as blatant as he is, many still don’t know what to call it.\n\nWhat are your thoughts?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "A-CAB",
                            "body": "I think your scope is too limited. People deconstruct based on analysis. If your analysis is limited in its scope such that it’s only useful in analyzing one aesthetic manifestation of fascism but not others it has no utility. Principle is indivisible. \n\nYou don’t trick people into being socialists. That has never worked.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "russa111",
                                    "body": "I agree that the scope is limited, but that is how research questions and papers work. I don’t know your background, but it’s so so common for research papers to be narrow, even my topic is considered broad for a short essay. I’m looking at the ways that Trump and MAGA rhetoric and actions echo the rhetoric and actions of fascist regimes. It’s impossible to include the full story and workings of US domestic and global politics in a paper, it would require a series of essays, or books even. Which who knows, I’m getting really into writing so maybe I’ll do that someday.\n\nAnd I totally agree, and I can see why you said the trick thing, but that’s not my intention. I’m not tricking anyone. But every time you get someone to actually confront their skewed worldview it’s a victory and it will be easier and easier in the future. Generally speaking, that is.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "A-CAB",
                                            "body": "My PhD is in economics. I’m familiar with research papers. \n\nI still think it’s a mistake to only tie in Trump to fascism. Brevity is a gift, and I’m not suggesting that you summarize the amerikan regime in two paragraphs (though it only really needs two words - white hegemony). What I am suggesting is that you should treat the Trump regime as the status quo and not the exception. Because they are not particularly different from anything else the amerikan project has seen.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "russa111",
                                                    "body": "First I want to clarify, I intended no disrespect when I said “I don’t know your background.” I was saying that to acknowledge that you may already know research papers very well haha. Out of personal interest though, do you mind if I ask what realm within economics?\n\nI guess I’m struggling to see how I could simply say that Trump is part of the status quo when he seemingly is not. Just the same way that not all forms of capitalism or socialism are the same, not all forms of fascism is the same. I don’t know if we’ve seen something like project 2025 before. Something so accessible to the public eye that is being executed so quickly. Strict loyalists being placed everywhere up and down the ladder, cutting all social safety nets (even if they weren’t strong before), breaking with allies. While I recognize that Trump didn’t appear out of no where and I can identify factors that led to his rise to power, I feel that he can’t be identified as a status quo leader when he is completely reshaping our government. And I think if I were to write an essay about him being the same as all presidents before, it would lose people from the start because he clearly is not.\n\nBut maybe I have an error in my thinking. Im not trying to say that you’re wrong, I’m genuinely interested in your thoughts and feedback. Thanks for your time and input by the way.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "A-CAB",
                                                            "body": "To answer your first question, industrial organization. \n\nI’m going to challenge you first by responding to your notion that Trump is remaking “our” government. Who do you mean to include with the use of “our?” Certainly it is not you and me. I am no oligarch and so I have never held political power in any meaningful way. Also, I assume that you are a student. Do you mean to say that you have any ownership of the amerikan regime? You almost certainly do not. \n\nThe amerikan regime belongs to the same owners and is not being remade. It is not our government. It is the government of the capitalist class. It is a dictatorship of the bourgeoise. Always has been and it always will be until its dying day. \n\nStrict loyalists to the capitalist dictatorship have always been in power. There are no social safety nets to weaken. Perhaps you are witnessing a newfound and paradoxical honesty in the approach to the regimes specific organization, but you are not witnessing change. \n\nP2025 is not materially different from the platform of the Biden regime, or that of any other amerikan presidents stated policy objectives. While I will give you that the regime has a newfound aesthetic bravado, I would advise against focusing on its appearance. As socialists we must be serious in our analysis of the material conditions in the regime. What material change is there, and to the degree that there is material change, how is the trajectory any different? \n\nTrump is the status quo, he’s just packaged less carefully.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoHalf2998",
            "body": "\nFascists (specifically Nazis)\n- thought having children was the most important thing and supported powerful men having mistresses/divorces to support it\n- believed in rigid gender roles and punished gay/trans Germans for not following them\n- Called accurate reporting of their actions “the lying press”\n- Believed only blue-collar Germans could be correctly patriotic\n- Unions/Trade organizations were attacked and Democratic Socialists were lumped together with Socialists\n- Accused the educated and educators of being brainwashed and doing the same to youth\n- Purges and privatization of government services\n- Crony capitalism deals with party leadership were accepted and often praised\n- The “trains ran on time” because accurate reporting on issues was impossible and the faithful wouldn’t believe it\n- worked with Conservatives for power but weren’t conservatives themselves: interested in radically remaking the government and were fine rewriting the rules to prefer themselves\n\nI’ve wrote this list a lot recently…",
            "score": 0,
            "replies": []
        },
        {
            "author": "Single_Parsley_9782",
            "body": "I’m very interested in the final paper. I bought notebooks specifically for keeping track of his actions for this purpose but ultimately didn’t for my mental health. My suggestion is to through the various leftist news ticktock accounts like Aaron Parnas and MeidasTouch (and listen to MT podcasts.) Also sift through the account TotalHypocrisy. She hasn’t been doing it quite as much recently but she has a ton of fantastic content dissecting trumps EO’s, what they mean, and often how they align with Hitler. Also read the book “How Fascism Works” by Jason Stanley if you haven’t already. It was written during trumps first term but has reminded me of a lot of forgotten red flags from the past. I really look forward to reading your paper and thank you for doing important work.",
            "score": -2,
            "replies": [
                {
                    "author": "Single_Parsley_9782",
                    "body": "Also here’s an Instagram post by Reich Wing Watch that draws many (basic) parallels. Follow that page for another good jumping off point to find things to deep dive into. Sorry I can’t help more. If I think of anything else I’ll keep adding them\n\nhttps://www.instagram.com/share/BA5454qiGP",
                    "score": -1,
                    "replies": [
                        {
                            "author": "russa111",
                            "body": "Thank you so so much for this!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Equivalent-Jury-3056",
            "body": "I’m interested. 🙋🏽‍♂️",
            "score": -3,
            "replies": []
        }
    ]
}