{
    "title": "U.S. Productivity Soars, Wages Stagnate",
    "author": "Yuval_Levi",
    "subreddit": "LateStageCapitalism",
    "rank": 134,
    "score": 960,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 20,
    "url": "https://i.redd.it/y3bffso0n1le1.png",
    "id": "1iwwxgt",
    "selftext": "",
    "comments": [
        {
            "author": "Straight-Razor666",
            "body": "The gap between the green line and the gray line is the wealth workers created that the capitalist parasites stole from them.  If you want to understand Marx's points of Surplus Value, these graphs do so clearly.  This is capitalism working as intended.  It benefits the rich and immiserates everyone else.  \n\nhttps://preview.redd.it/a1lkjidah4le1.png?width=957&format=png&auto=webp&s=a5074c49503507c68c034b80d98f9988b0eaccae",
            "score": 1,
            "replies": []
        },
        {
            "author": "TronNeutrino",
            "body": "work is real, money is fake\n\n  \nand they still steal labor",
            "score": 108,
            "replies": []
        },
        {
            "author": "No_Window8199",
            "body": "sounds like slavery",
            "score": 64,
            "replies": [
                {
                    "author": "Yuval_Levi",
                    "body": "late stage subsistence capitalism = neo-feudalism",
                    "score": 31,
                    "replies": []
                }
            ]
        },
        {
            "author": "_CHIFFRE",
            "body": "Capitalist will say: the people accept it, yes they might moan about it in their circles or on the internet but ultimately they accept. Sometimes a few harmless protests, no biggie. Not our responsibility to give a good deal or even a fair one, pay the workers as little as you can get away with.\n\nthis crap happens in Europe aswell and a lot needs to be done to tackle this, It's good to see Boycotts being more and more used and people ''voting with their wallets'', especially in eastern europe the last few weeks there has been some action but that can only be a start.",
            "score": 22,
            "replies": [
                {
                    "author": "KobaWhyBukharin",
                    "body": "Move fast and break things is an excellent strategy for chaos and confusion, as they are showing. but they are not considering the implications of labor because US oligarchs have done such a good job neutering it. They are not afraid, they are going ham currently.\n\n\n\nTrump is really going to accelerate class consciousness I think. Where it goes i have no idea. \n\n\nI used to think a general strike was impossible in America, but now I see the possibility. Trump is creating conditions that are necessitating that reaction. There's nothing abstract about the conditions Trump is creating it is very clear when they hit ",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cthulusuppe",
            "body": "Let's see: Unions were strongest in the 50s and 60s. The 70s is when businesses began offshoring production and middle-class women began to enter the workforce. The 80s destroyed unions. The 90s and 00s is where the digital revolution contributed to productivity via improved software/automation. \n\nWhat happened in the 2010s to cause productivity gains to plateau? Offshoring niches fully saturated? If AI fails to optimize manufacturing further, compensation may re-couple with productivity gains and we'll have only lost 4 decades worth of income growth to the vampires at the top.  Will capitalism fail to suppress wages further, then, as capitalists are forced to admit that labor holds all the cards in production businesses, afterall?",
            "score": 11,
            "replies": []
        },
        {
            "author": "kevan0317",
            "body": "Don’t call it slavery. The billionaires will get mad.",
            "score": 10,
            "replies": []
        },
        {
            "author": "wastingtoomuchthyme",
            "body": "Reducing humanity to statistics doesn't show the human suffering...\n\nProductivity soaring is at the expense of the people struggling to survive and their quality of life ..\n\nTired, ignorance and fearful people don't make good revolutionaries and won't demand a better life.. until the tipping point and it all collapses.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Osiris_Raphious",
            "body": "Reminder gdp is a lie and a useless figure in post industrial world. \n\nProductivity is just like corporate value evaluation, made up. If money makes money, if debt makes money, if they can print money and charge fees and make profits off doing no work, 'productivity' is inherently misrepresented. \n\nEqually if wages are stagnant and productivity is up, means that once again, we have progress not adding to our quality of life. But it has enriches the alreay wealthy class by trillions.",
            "score": 3,
            "replies": []
        },
        {
            "author": "web-cyborg",
            "body": "That productivity and GDP growth hoarded at the top % was stolen from wages. Because of that, it was also stolen from local and federal taxes that would have been collected from those workers' higher earnings, and there would have been higher spending/consumption which could be good for , especially local, business (and local sales tax etc.  if any, which would help municipalities with struggling budgets).\n\n If the wealth explosion at the top since the late 80s had instead gone more into wages across the board, social security would have been funded more all of those years.  Instead, the wealth being siphoned from greater productivity to the top was outside of the 150k earning social security taxation cap.",
            "score": 3,
            "replies": []
        },
        {
            "author": "CapitalismOMG",
            "body": "This is an indicator of the growing wealth gap between hourly workers and salaried workers. \n\nProductivity measurement in itself is flawed as measuring productivity of the “total economy” on the whole becomes a measurement of how much income an average worker makes. Therefore, this chart is comparing the average worker’s salary (inclusive of salaried workers) to the average hourly worker’s salary. \n\nHere’s some more info:\nhttps://economicsfromthetopdown.com/2020/01/17/debunking-the-productivity-pay-gap/",
            "score": 4,
            "replies": [
                {
                    "author": "jackist21",
                    "body": "It’s even more problematic than that article suggests.  “Productivity” is measured in dollars so a decrease in the value of the dollar versus goods results in an increase in productivity.  If in year 1, I make 10 hammers sold at $10 each and in year 5, I make 5 hammers sold at $30 each, that registers as an increase in productivity even though I am producing fewer hammers.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 2,
            "replies": []
        },
        {
            "author": "analyticaljoe",
            "body": "This is why tariffs are not going to do anything for labor. It's just going to be taken as profit for the companies.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheThirdDumpling",
            "body": "Well, for sure the wealth are being stolen by the top 1%. But....\n\nWhat is the productivity? GDP per capita per hour? Because GDP is also a fake number.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Boners_from_heaven",
            "body": "Productivity is just the measure of how much surplus value capitalists can extract from your flesh.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tankhwarrior",
            "body": "Everyone worker voting to the right needs this imprinted on their retina",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Cheetah_7249",
            "body": "Productivity soared but let’s see energy usage/energy infrastructure growth. 🤔",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far-9947",
            "body": "Japan all over again!",
            "score": 1,
            "replies": []
        }
    ]
}