{
    "title": "The Death of a Nation",
    "author": "Brilliant_Shine2247",
    "subreddit": "LateStageCapitalism",
    "rank": 128,
    "score": 1806,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 67,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1ix6htt/the_death_of_a_nation/",
    "id": "1ix6htt",
    "selftext": " Just when I thought it couldn't get any worse, out esteemed (/s) president has ordered that all records of police misconduct be deleted. This opens the door for a lawless force of thugs with guns and a budget. \n\n\n\nI've been the victim of police misconduct and it hits on a whole new level. Especially when you know you did nothing wrong. \n\n\n\nBrown shirts will be wearing blue. \n\n\n\nI have no doubt that we will soon see the homeless communities disappear. Project 2025 makes it clear that we are undesirables. I bet even the so-called \"liberals\" will stand silently by. \n\n\n\nYes, I said we. I'm homeless. I worked my ass off starting at age 15, only to lose everything after an attempted murder left me with brain damage and unable to work. No longer a productive member of society, I have lived under bridges, in abandoned houses and in tents. \n\n\nBeing homeless means living in constant fear anyway, but this is the 1st time my fear has become palatable. Even though the cops around here don't really mess with me (much) because they know I don't do drugs or drink, I realize that the tripwire is always tight. \n\n\nI played by the rules all my life. Worked, saved , took care of my family. All to be lost to a deputy with a double digit IQ and a steroid problem. I've lost 2 tents and everything I had over the last 2 months, but this is where I get scared. \n\n\n\nHow many of you will stand with us when the time comes? \n\n\n\n(Just to be clear, because the word \"homeless\" is usually enough to have a post removed and the occasional permaban. I am not soft begging or asking for any kind of help. For the moment I am good. I have about everything I need. Thanks.)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "dancin-weasel",
            "body": "This is how revolutions begin. People with nothing to lose.",
            "score": 162,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "I think a lot of people in politics have lost sight of that.",
                    "score": 89,
                    "replies": [
                        {
                            "author": "Flapjackchef",
                            "body": "I think US politicians are caught up in the mentality of “everybody’s stupid but me…” only to insanely childish degrees where they think the majority of the voting population can barely manage to breathe. It seems literally parading Trump around as a king doesn’t fly across the political spectrum and only the dumbest of MAGA probably supports it.  \n\nJust seems like they’re desperate. A lot of people say that having Trump and Elon cause chaos with a bunch of morons in top positions is a cunning move, but it looks like a group of people summoning a tornado and trying to build a house in it. Everything they are doing is increasing the chance of class consciousness spreading.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Micklevandickle",
            "body": "Well written. Thanks for sharing. ",
            "score": 384,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "Thanks, I do fancy myself as a bit of a writer. Hahaha. I have a Ko-fi page where a lot of my essays on being homeless in America can be found. \n\nIn keeping with my disdain of capitalism, everything is free to read and I offer my book for free to anyone that wants it. A link can be found in my profile. I encourage anyone who has an interest in how being the collateral damage of capitalism manage to live to check it out. My goal is to remind people that we are human beings.",
                    "score": 284,
                    "replies": [
                        {
                            "author": "Micklevandickle",
                            "body": "People go crazy when they can no longer communicate their experience to others. Don’t stop writing! ",
                            "score": 100,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "You hit the nail right on the head, comrade. The homeless community is unfortunately filled with people who have fallen into the abyss or choose to remain silent so as to not \"make waves\". This does not make them any less human.",
                                    "score": 82,
                                    "replies": [
                                        {
                                            "author": "Micklevandickle",
                                            "body": "Of course. But does make them mad lol. Long live the resistance! ",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "Brilliant_Shine2247",
                                                    "body": "Sometimes a madman can be your best tool.",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "Micklevandickle",
                                                            "body": "People with nothing to lose are very valuable for change for sure. But we can’t go mad in this fight. ",
                                                            "score": 18,
                                                            "replies": [
                                                                {
                                                                    "author": "Brilliant_Shine2247",
                                                                    "body": "True.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "smpd01",
                                                                    "body": "A lot of \"us\" are mad already. I don't think that anyone was implying that it's hip to be mad... It's not about value in a fight, dog? We're human?? Mad people remind us where our hearts really are. And No One is saying let's go drive people mad. Yes, I would advise mental health hygiene and community for those with the privilege. But like... Come on.",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Micklevandickle",
                                                                            "body": "Sorry. You took a word, mad, that has a definition and a word that I was using in good faith and you just took a big shit on it to feel clever and cause your ego reacted. And that really pissed me off. Being mad means something. And our resistance needs to not be mad so we can fight back. Got it? Cheers. ",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "stevegoodsex",
                            "body": "I got no idea wtf ko-fi is, but you are very talented and I share a similar background. I'd love to show some support if you wanna shoot me a dm with a link.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "You can find a link in my profile. Street Scribe. \n\nI appreciate the good words, comrade!",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "molotavcocktail",
                            "body": "Username checks out.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "Hahaha. Thank you. It was auto generated but I liked it.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LiveHardandProsper",
            "body": "Cops really are nothing but legalized criminals, aren’t they?",
            "score": 112,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "They killed over 1,300 people last year. The majority unarmed. Qualified immunity is a hell of a drug.",
                    "score": 91,
                    "replies": []
                },
                {
                    "author": "VAhotfingers",
                    "body": "Always have been. They’re the enforcement arm of the bourgeoise.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "REO-teabaggin",
                            "body": "Since their inception the police have had two objectives: to protect the property of the rich (including capturing escaped slaves), and harassing the poor to spread fear. \n\nIf a poor person gets robbed or murdered, they might look into it, but realistically they only solve around 3% of cases. \n\nIf a rich person gets murdered, let's say on the streets of New York, the mayor pulls together a team of hundreds, calls for a nation wide manhunt, and labels the crime as terrorism.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Griffdog17",
            "body": "We will stand with you comrade. If they want the homeless, they gotta get through us.",
            "score": 35,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "The fascists may be in for a surprise, comrade!!",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "knightstalker1288",
            "body": "The country already failed you.  What makes you think status quo will make your situation any better?  You’ve already lost everything, what else do you have to lose?\n\nDef don’t support Trump or Republicans, but this shitty facade of a functioning administrative state would need to be destroyed in a leftist revolution anyways.  Trump is doing the dirty work and paving the way for a leftist rebuilding of the country when the pendulum inevitably swings the other way.",
            "score": 74,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "Because, according to the Playbook 2025, my community is now in real danger of becoming criminals for existing. \n\nI agree 100% with you. Both political parties have attacked the homeless relentlessly. Laws are being passed on a daily basis to even criminalize the people who just try to help. All white flag shelters have come to an end in my immediate area, for example. \n\nBut what this administration has done with strengthening a police force that is already on the verge of going rogue will be the end of us. The relationship between Leo and the homeless is already fraught with danger. The next step, according to Playbook 2025 is to make it almost impossible to hold the police accountable for misconduct. I think that explains why police unions overwhelmingly backed Trump. \n\nOf course, at the end of the day, this is just my opinion.",
                    "score": 67,
                    "replies": []
                },
                {
                    "author": "nitromN1",
                    "body": "I cant wait for society to burn so MY ideology can come out of the ashes!!!",
                    "score": 11,
                    "replies": [
                        {
                            "author": "zellmerz",
                            "body": "“I have enough comfort that I don’t want a significant change to the status quo even though millions, if not billions of people suffer every day to give me this marginally acceptable quality of life.” \n\nCurrent society is going to lead to the end of humanity. Shit needs to change",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "lolnaender",
                            "body": "You do realize that growth often necessitates destroying the old thing right? Do you not think it would be worth it to replace the current, rather shitty system? The ones who made it this way will not give up their power peacefully.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NormieSpecialist",
            "body": ">I bet even the so-called \"liberals\" will stand silently by.\n\nOf course not! They’re going to keep peacefully protesting to rase awareness until it’s declared illegally to due so. Then they’ll raise awareness online till that too becomes illegal and then they're going to wait 4 years to vote in the *good guys* till we become a straight up fascists state and then they’ll… probably join the conservatives to save their own asses. Because they’re liberals.",
            "score": 25,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "One of the best things I've seen all day! Thanks.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "NormieSpecialist",
                            "body": "I’m glad. I hope things get better for you man.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "I'm exactly where I need to be. If things get better, then ok. If not, then I will keep writing about it. All in God's time. \n\nJust kidding. I don't believe in God and I sure ain't giving him the credit for my hard work. Hahaha",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "NormieSpecialist",
                                            "body": "Can relate.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "But I appreciate the words, comrade.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "cptcommanche",
            "body": "Sorry to hear man. Can you get to Canada?",
            "score": 19,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "No. I'm stuck here in a rural town in NC because my son is here. Due to police misconduct in protecting the people who tried to murder me (long, convoluted story) he has been alienated from me. The one thing he does know about me is that I did not run out on him, and that is one hill I'm more than willing to die on. My boy will not grow up thinking his dad just gave up and ran out.",
                    "score": 50,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impractical_Meat",
            "body": "I am extremely worried about homeless/unhoused people. I was listening to NPR this past weekend and they mentioned that my city's government was looking into ways to remove even more homeless encampments and possibly even \"reimburse\" homeowners whose property values \"have dropped\" because of homeless people. No empathy whatsoever, just hate because everyone wants to act like they're not one unfortunate event away from losing their homes.",
            "score": 13,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "Make no mistake. There is no war on homelessness, just a war on the homeless.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "PerroLabrador",
            "body": "Everybody in the US is living now what is known as a dictatorship, soon enough people will  begin to be politically persecuted.",
            "score": 18,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "Yep, and the 1st ones to go will be the helpless and those with no voice.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "maghau",
                    "body": ">known as a dictatorship\n\nA dictatorship of the bourgeoisie, as it has always been. The primary victims have been minorities and poor people, which is why shitlibs have supported it. Now that they might be affected themselves, they have, in usual fashion, started to care... somewhat.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "lastquincy88",
            "body": "“But, you grow up and you calm down\nAnd you’re (workin’ for the clampdown)\nYou start wearin’ blue and brown\nAnd (workin’ for the clampdown)\nSo you got someone to boss around\nIt makes ya’ feel big now\nYou drift until you brutalize\nMake your first kill now”\n\nClampdown-The Clash \n\nI miss Joe Strummer",
            "score": 6,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "The Clash was real shit, bro. Thank you very much for that. If I'm not mistaken, they had the 1st video on MTV.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrowtentBPotent",
            "body": "I think you mean the fear is palpable, not palatable lol",
            "score": 9,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "That is correct! Thank you for pointing that out.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "GrowtentBPotent",
                            "body": "No prob my friend, sorry for your struggles. Scary times",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GCYLO",
            "body": "Stay safe, brother. I've been increasingly jumpy about the knock ever since Trump came back.",
            "score": 5,
            "replies": []
        },
        {
            "author": "JustJaxJackson",
            "body": "Thank you for sharing your experience. \"We the People\" seem to be collectively waking from the apathy we've had for decades...the taking for granted of our freedom. This crisis is precisely what our founding fathers wanted us to prepare for, and they told us how to do it. We are waking up, all over the country, and I have to believe deeply and fiercely that this dismantling of everything fought for over 250 years will NOT stand. We are with you, and We are bigger in number than they are, and while they are filled with derision and dislike for us? WE are filled with righteous anger and indignation -- if we stand together, they cannot succeed. \n\nWE are with you. <3 Keep writing. Keep speaking out. One voice is quiet, but millions together will create a roar they cannot drown out.",
            "score": 3,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "Thank you for those words. Unfortunately, many in my community will go down without a fight. We have been conditioned to fear the police and to not cause a fuss.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShesAMajorTom",
            "body": "I will stand with you",
            "score": 3,
            "replies": []
        },
        {
            "author": "CannabisTours",
            "body": "You’ll have my sword",
            "score": 2,
            "replies": []
        },
        {
            "author": "JimDa5is",
            "body": "Of course the liberals will stand by. That's what they do... clutch their pearls while watching all this nightmarish shit on their 75\" TV in their cul-de-saced McMansion. But it's ok because they recycle, drink fair trade coffee, and donate $10 to the food bank so they're doing their part. \n\nI'm sorry about your situation and the fact that we live in the richest country in the world but have people sleeping outside. You are not alone. You are not unseen (however much people would like that).  I've been where you've been and most people don't realize who easy it is without the proper support network to get there. And once you're there how very, very close it is to impossible to get back out again without the said network\n\nI hope that soon our country will see the error of its way. I fear it will not.",
            "score": 2,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "My man, I have nothing to add. Good words.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JimDa5is",
                            "body": "This video (an updated version of Phil Och's \"Love Me I'm a Liberal\" is one of my new favorites. Pretty much nails how I feel about them.\n\n[https://www.youtube.com/watch?v=SgOHJaCPkLg](https://www.youtube.com/watch?v=SgOHJaCPkLg)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jfern009",
            "body": "Why can’t you get housing? Are you working? Do you suffer from an illness?",
            "score": 1,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "Brain injury from an attempted murder. I can't keep all the hoops straight that they want me to jump through for any kind of benefits. My writing is my only real hope. \n\n7 years ago I had to teach myself how to read and write all over again, so I've come quite a long way",
                    "score": 11,
                    "replies": [
                        {
                            "author": "PandazCakez",
                            "body": "I’m sorry to hear that man. I hope things get better for you.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "No worries about me. I'm right where I'm supposed to be. I'm meant to be here and to write the stories for those have/had no voice. \n\n7 years ago I couldn't read or write do to my brain injury. Now I chronicle my journey and those I've met along the way.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jfern009",
                            "body": "I hope you get the help you need. Sounds like you would qualify for benefits. Has anyone helped you with filling out the paperwork for disability, healthcare, and section 8?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "I gave up on any kind of help a while back. I do get food stamps, at least for now. As long as I have my notebooks and a tent to keep the rain off my head then I'm a happy camper. (See what I did there? I still got it!)",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "jfern009",
                                            "body": "Hopefully you can connect with the resources to get you the help you deserve and are entitled to and keep you safe and not sleeping on the street. I’m sorry you’re going through this. What state do you live in?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Brilliant_Shine2247",
                                                    "body": "NC. If nothing else, I'll be eligible to tap my retirement in a couple of years. Meanwhile, I'm right where I need to be. \n\nI appreciate the concern. Rare things these days. 💕",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}