{
    "title": "Trying to wrap my head around UDAid",
    "author": "md5md5md5",
    "subreddit": "LateStageCapitalism",
    "rank": 133,
    "score": 56,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 44,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1ixjxjb/trying_to_wrap_my_head_around_udaid/",
    "id": "1ixjxjb",
    "selftext": "So it's a good thing Trump got rid of it in the sense that it was really a shadow organization for US imperialism? Although that aid came with strings attached and other bad things sometimes normal people benefitted from it? But overall it's a blow to us imperialism though which is a good thing right? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "bloodmonarch",
            "body": "Yes and no. USAID despite its use as an imperialist tool, still does some good.\n\nIf you see it as a self inflicted blow against US soft power, then yes.\n\nBut its undeniable countless aid and humanitarian orgs have dependancy on USAID, so there will be a lot of pain inflicted on the most powerless people all around the world.",
            "score": 200,
            "replies": [
                {
                    "author": "helraizr13",
                    "body": "Some of the richest people in the world are decimating some of the poorest people in the world.",
                    "score": 54,
                    "replies": []
                },
                {
                    "author": "Full-Run4124",
                    "body": "Also many US small farmers.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "nobule",
                            "body": "Small farmers aren't getting USAID crop contacts. These are big farms who have bought out all the other farmers in the area and switched from providing food to their local and regional community in favor of monocropped subsidized crops. Seriously, do not feel bad for them.",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "Magikarpical",
                                    "body": "they don't get contracts directly, but small farmers sell grain to grain elevators and they sell to USAID. it will hurt small farmers eventually, probably quite quickly.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Mysterious-Let-5781",
                            "body": "I think you’re confused with the Equity in DEI (meaning small farmers are still getting screwed, but from a different angle)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "evgis",
                    "body": "Exactly, world is grey, not black and white.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "For_bitten_fruit",
                    "body": "I got downvoted on this sub a week or so ago for saying this exact same thing. It really isn't simple, but it's regrettable that some of the most vulnerable people in the world will now suffer.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Satans_Dookie",
            "body": "It may have been stood up with every good intention but it didn’t take long for the CIA to infiltrate and use it to fund cutouts to wreak havoc across the globe under pseudonyms and hidden agendas.  There’s so much rot in the US government.",
            "score": 66,
            "replies": [
                {
                    "author": "Certain_Noise5601",
                    "body": "THAT is the waste, fraud, abuse, not our facking VA workers, forest rangers, cancer researchers, and the countless humanitarian organizations! The CIA sucks.",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "aglobalvillageidiot",
                    "body": "USAID funded a fake social network in Cuba. Like really think about the brazen audacity that takes. They built an entire social network in a foreign country to stir up revolution because of the big scary communisms.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Revolutionary-Pin-96",
            "body": "There are inevitably good consequences of dismantling the administrative state when that state perpetuates horrific crimes against humanity every day. Doesnt mean you have to agree with Trump, but yes, dismantling USAID is something I think every anti-imperialist would agree with.",
            "score": 24,
            "replies": [
                {
                    "author": "No_Cheetah_7249",
                    "body": "Thank you. \n\nMy god the pervasive neoliberal imperialist thought in here is frustrating. Everyone is talking about the good us aid did. Which is true to an extent. But let’s go one step deeper with our analysis. Why do so many of these countries suffer? Is there maybe an imperialist country that has funded endless war, poisoned medicines, supported radical ideologies, used crippling sanctions, thrown countries into civil war, etc? \n\nAll the good that US Aid did was a bandage on a festering wound that the US itself has caused. ",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Southern_Agent6096",
                    "body": "Problem with this is that it just stopped humanitarian assistance. It didn't defund the CIA or other tools for empire. It is only being \"dismantled\" so it can be looted, privatized and removed from any pretenses of oversight or accountability.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "hellaurie",
                    "body": "Yeah fuck them hungry people amiright? I'm an anti imperialist!!!",
                    "score": -10,
                    "replies": []
                }
            ]
        },
        {
            "author": "QofteFrikadel_ka",
            "body": "USAID has its faults but it was some of the only assistance vulnerable people received from food, to education, medical care, WASH, disease prevention and control etc. These people are now going to suffer a lot and die because aid has been removed. Like someone said before it’s nuanced. What’s coming in its place will be devastating for the worlds poorest people and just make the rich richer",
            "score": 8,
            "replies": []
        },
        {
            "author": "croddyRED",
            "body": "I’ve been struggling with this but I don’t stop at ending funding to just one organization.  I wonder if we’ve been on a slow and natural decline as a nation for many of the same reasons other empires have collapsed in the past.\n\nPeople can’t admit we have been making mistakes when it comes to the way we govern and distribute goods and wealth?  They can’t fathom that this is not a result of any one party or president. Our success had been exploited a long time ago and our systems are corrupt and perverted. It’s not that Democracy and Capitalism on their own don’t work. But they are optimal under specific conditions and restraints. Even if we were to study these systems in practice in the past the conditions and restraints are very different. We would have to update our systems and regulations often to keep up with changing landscape. \nRegardless, this system is widely out of harmony with the current conditions and restraints.\n\nThat being said, the US did set a pretty darn good foundation for governance. Funny many of our struggles were discussed even then. We engaged in discourse about what issues could arise within our system and what we should avoid. Fear the mob and fear the dictator. Do not allow debt to be offered upon the people…our systems are corrupted.\n\nCurrent systems need an overhaul and laws may need to be passed or amended in a pretty aggressive manner. Furthermore, financial systems and the economy will need substantial changes to be made to reduce fraud in a massive way. There’s so many facets of this system that can be examined - I don’t disagree with conservatives on that.  However, it shouldn’t be that we make all these changes and perhaps propose a new system without a good understanding of what will replace/enhance current systems in a positively meaningful way. Stuck between pain now or more pain later…\n\nThis goes without talking about the geopolitical affect this will have. Our (prestigious) position in the imperialistic world arena will be vulnerable, if not down-right exposed, which very well may be the plan! \n\nExpose the system for not working properly, find groups to blame, offer a “better” solution, weed out those who do not or cannot operate under tyrannical control within the new system, and you’ve got yourself…well there’s a reason Nazism and fascism is being touted all over. It’s not baseless…although in many ways, ridiculous.",
            "score": 7,
            "replies": []
        },
        {
            "author": "lddebatorman",
            "body": "Maybe?  But the problem is they're not doing it to undermine US Imperialism.  Imperialism has not been diminished in any way, it's just shifting forms.  You should see this, along with all the other cuts as they were intended to be by their architects, as a form of class warfare.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pete_Bondurant",
            "body": "You can want a tree to get chopped down, but you also need to worry about which way it will fall. I'm not educated enough to know exactly how to dismantle the state in the right way, but I'm sure that Musk will not do it in that manner.",
            "score": 2,
            "replies": []
        },
        {
            "author": "-Planet-",
            "body": "Are there any plans to replace these programs with something better and more regulated? Surely, it wasn't all bad?",
            "score": 7,
            "replies": [
                {
                    "author": "UnluckyWriting",
                    "body": "Not a chance. The plan is to shift some of the money to the US International Development Finance Corp (DFC), which uses your tax dollars to leverage private investment overseas. Its aim is not development of poor countries, but to extract money and resources from those countries back to private equity firms and hedge funds. \n\nFrom https://www.phenomenalworld.org/analysis/how-to-doge-usaid/ the author writes:\n\nThe new Trump Administration is turbo-charging the lesser known but increasingly dominant agenda within USAID: “mobilizing private capital.” This approach, which I have termed the Wall Street Consensus, is a decade-old international development paradigm that has been promoted by the World Bank, the United Nations and rich countries’ development agencies, including the USAID under the Biden Administration.\n\nThe Consensus reimagines the role of the state as a facilitator of private investment, through various subsidies to investors that are often described as “derisking.” Development is no longer a public good to be directly financed by states, but a market opportunity to be unlocked through the alchemy of public-private partnerships (PPP) into “investible,” privately-owned projects.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "-Planet-",
                            "body": "Hmm, this doesn't sound like making America great again. I appreciate the information, thank you.\n\nThe whole Greenland (although I think global warming is a factor too)/Gaza rebuilding thing is making sense all of the sudden.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rip2Trayvon",
                    "body": "Are there any plans under the Trump administration, using the excuse that they are eliminating corruption in USAID, to reimplement programs that actually helped those in other countries, or those who need help in this country? Zero chance.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "-Planet-",
                            "body": "I figured as much. I just find it strange no one is asking this -- at least in press conferences and whatnot I've watched.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Rip2Trayvon",
                                    "body": "I assume it's because most of the issues asked about in press conferences are asked about in a broader, more obvious press-focused light. Any issues regarding actual layers of politics aren't interesting or important considering the scale at which things are happening, it's almost semantics to ask about given the lying and corruption. It's an open secret that they don't give a fuck about anything other than what's in everyone else's faces right now, besides those under the spell of course. The entire rest of the world sees what is happening with Russia, Elon and Trump.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "-Planet-",
                                            "body": "It's so obvious it's really hard not to see anymore. People get whisked away in the wiles of some other outrageous thing going on...it's a constant and exhausting barrage.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sockalexis",
                    "body": "They have “concepts of a plan”. Does it look like there are any “plans” happening right now? Other than maybe a rapid -fire version of Project 2025? It’s just a purge of anyone who either already stood against the Orange Menace, or anyone who hasn’t pledged loyalty to the self-anointed king. That’s the plan.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "-Planet-",
                            "body": "Ah yes, the infamous \"concepts of a plans.\"  \nA small ember of hope existed in this human shape.\n\nI feel I have seen no media outlet / journo question this one thing. They're axing, but no plan to replace these systems. I've seen no one talking about this, drawing attention to it; or even asking the president what his plans are to replace/refine these systems. It's strange.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Puzzleheaded-Coast93",
                    "body": "There is not a plan to replace the humanitarian aid obviously, but you can be sure the covert operations to influence other countries will continue with a neocon like Marco Rubio in charge of the State Department. In general though, like other empires as they declined, America is turning to more aggressive means to maintain its hegemony as China chips away at it.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "idleat1100",
                    "body": "No. As flawed as it was, it was a very powerful tool for good. We are not in a timeline where things are broken or scrapped and built anew with better intentions, but rather things are scrapped and privatized for profit and cruelty. We have a long way to go before the bottom.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "-Planet-",
                            "body": "*Yeaaaaah,* I figured as much. I keep seeing all these things getting the axe and I've yet to hear anything about replacements. I thought (hoped) maybe I was missing some news...hah.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "idleat1100",
                                    "body": "Well at least we’ll be at 0 (or negative). It’s a good place to build from! Every act of construction begins with demolition. But it will be a scramble and they have all the cards and money and plan.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Forgotlogin_0624",
                    "body": "Dude, What the fuck are you talking about?  If you’re lucky this is getting replaced with jack squat.  If you’re unlucky it’s getting relaxed with cluster bombs",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hellaurie",
                    "body": "What are the unregulated aspects of USAID in your mind? Do you know anything about it or have any reason to claim it's not \"more regulated\"?",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "qwer_or_wasd",
            "body": "I don't have time for sources ATM, but just know that trump etc are not dismantling the imperialist arm of USAID, but consolidating it under the executive. This is their Unitarian theory of power playing out. There are no upsides",
            "score": 1,
            "replies": [
                {
                    "author": "Splainjane",
                    "body": "If you don’t have time to provide a source, don’t post",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mysterious-Let-5781",
            "body": "The most simple answer is that it’s not black and white. USAid is a tool of soft imperial power and rightfully criticized for being so, but it’s also doing that by actions that are good (like donating condoms to Gaza, Mozambique to help combat the AIDS crisis). They’re also not blanket cancelling everything USAid is engaged in which is what we should be most weary off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AHoopyFrood42",
            "body": "In a vacuum it's a good thing but obviously context changes things.\n\nThe problem is all the imperialist functions of USAID are just going to be moved directly under the CIA. It's the  empire managers making these decisions after all, so when the dust settles the net change will be the removal of any of the beneficial aspects while the imperialism will just become a lot more direct.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DBFool2019",
            "body": "Only if they don't move the funds to another version of it. Look at how he defunded the WHO during his 1st term. Hi sycophants cheered about it, then he took that money and gave it to a Gates Foundation offshoot that did the same exact thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BuckyLaroux",
            "body": "This is not a good thing, specifically for those whose lives depend on it.\n\nTrump did it in order to appeal to his base who would love to see people suffer as they don't have the capacity to give a shit for anything but America first.\n\nPeople will suffer because of this choice. Maga fools live to see this and will gladly pay more for groceries etc. \n\nThis is not a blow to us imperialism in any way.",
            "score": 1,
            "replies": [
                {
                    "author": "Puzzleheaded-Coast93",
                    "body": "It is a blow to U.S. imperialism, but only because the Trump administration is incredibly incompetent. Of course they’ll continue the foreign influence operations USAID engaged in under the CIA and State Department, but this is a huge blow to the U.S.’s soft power capabilities in the global south, which was already turning towards China. You can expect to see more developing countries turning away from the American sphere of influence and towards China in the next few years. The Trump administration thinks it can just rely on the threat of military force and economic leverage to dominate other countries, but the U.S. is no longer in the dominant position it was on either front twenty years ago, and there’s no domestic appetite for war.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Neko_Maia",
            "body": "It’s throwing the baby out with the bath water. Just audit it and trim it",
            "score": -1,
            "replies": []
        }
    ]
}