{
    "title": "Liberals live in a different reality.",
    "author": "lightiggy",
    "subreddit": "LateStageCapitalism",
    "rank": 110,
    "score": 2908,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 103,
    "url": "https://i.redd.it/ix4f4ehpwcle1.jpeg",
    "id": "1iy6z11",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Luke92612_",
            "body": "Fascist Spain existed all the way into the 70's",
            "score": 123,
            "replies": [
                {
                    "author": "No-Candidate6257",
                    "body": "No, Nazi Germany was the only bad guy in Western history.\n\nNo other Western country was bad. Imperialism and Fascism lived and died with Nazi Germany.\n\nEveryone else is 100% based and lit wholesome big chungus liberal democracy who loves democracy, freedom, and human rights!",
                    "score": 66,
                    "replies": []
                },
                {
                    "author": "wyaxis",
                    "body": "America has been fascist for as long as it’s existed",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Luke92612_",
                            "body": "Capitalist, imperialist, and oppressive? Yes.\n\nFascist? No, because fascism was only formulated as an ideology and as a term in the 20th century.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "wyaxis",
                                    "body": "What do you call what we did in Vietnam and Iraq then?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Luke92612_",
                                            "body": "Fascist, because that happened in the 20th and 21st centuries after fascism had been formulated.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "wyaxis",
                                                    "body": "Ah yes I was confused my bad",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "astakask",
            "body": "We live in the stupidest timeline of the multiverse",
            "score": 585,
            "replies": [
                {
                    "author": "lightiggy",
                    "body": "People reading about the Business Plot: \"Holy shit, the United States was one step away from becoming a fascist dictatorship in the 1930s.\"\n\n(Wall Street’s “master plan” was to march to the White House with the pro-Roosevelt American Legion and expect everyone, from the lowest civilian, to every state militia, to every branch of the federal military, to stand there and do nothing).\n\nMeanwhile, in the good timelines where American fascists backed by Wall Street launched a [well-planned nationwide Spain-style coup](https://en.wikipedia.org/wiki/George_E._Deatherage) against Roosevelt (they still lost):\n\nhttps://preview.redd.it/c7pfkia55ele1.png?width=500&format=png&auto=webp&s=078e4712ce38b4c2bb9a606c31215976aa1b7bb2\n\nBarring a Soviet victory in the Cold War, homegrown fascists fucking up bigtime and causing irreparable damage to their cause, preferably in the 1930s or 1940s, would've been our best hope of the West not becoming the way it is now.",
                    "score": 189,
                    "replies": [
                        {
                            "author": "Shanguerrilla",
                            "body": "To be fair, the commenter below is right too that Japan and Pearl Harbor (and the economics that would make us the world power until now) were what got us in the war rather than 'fighting nazis'.\n\nI say that because frankly during the 30s and before, Nazism was seriously getting a popular foothold in this country.  Around the time of the Business Plot, the super rich elite like Disney and Ford and others were all on board with Hitler and Nazi's until they had to let us go to war against them.",
                            "score": 91,
                            "replies": [
                                {
                                    "author": "lightiggy",
                                    "body": "The attack on Pearl Harbor was in response to a total oil embargo against Japan.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "Shanguerrilla",
                                            "body": "Yup.  Not just the embargo, but our supplying their enemies.  Hence why I included (and the economics that would make us the world power until now).\n\nYou're right.",
                                            "score": 20,
                                            "replies": []
                                        },
                                        {
                                            "author": "Gidje123",
                                            "body": "Geez the more you know...",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "halpfulhinderance",
                            "body": "I think the comic is referring specifically to Vance travelling to Germany to express support for the far right. And Elon doing the same thing via video call\n\nThat’s why it said “European Fascism”. Tho tbh, they were doing a good enough job digging that up on their own",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "cindymartin67",
                                    "body": "And the fact that so many of their policies align with a similar Mussolini style fascism. Its right there in front of our faces",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BassoeG",
                            "body": "Alternatively, what if Smedley Butler hadn't been so tragically trusting of the system that he believed Franklin Roosevelt would at least *try* to see justice done based on the evidence he brought him and instead accepted the offer to be the coup's figurehead leader?\n\nhttps://i.redd.it/rdcxwn5swjle1.gif",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SupremeElect",
                    "body": "the bullet wasn't supposed to miss...",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "TieTheStick",
                    "body": "No, we have just lived looking enough to have forgotten the evil that Fascism and oligarchy brings to civilization. \n\nIf we cannot remember history in our laws and norms, we are doomed to repeat it.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "cindymartin67",
                    "body": "How do I get out. How did I get here?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Code_Race",
                            "body": "Hit alt-f4 to exit timeline, thank you",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Randalmize",
                    "body": "Counterfactual we live in the funniest timeline that results in the invention of time travel. 😆",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpockStoleMyPants",
            "body": "This comic would be more accurate if the Dulles brothers were sneaking Nazi Scientists into the US behind Uncle Sam's back in the top panel. The perception of the US being anti-fascist is a popular one, but not true - sadly. The US really didn't enter WW2 until the Axis posed a serious economic threat to US hegemony - then they covered their economic concerns with 'humanitarian' concerns when the US knew very well of Germany's treatment of Jews and other minorities long before they joined the war (they were turning away ships filled with Jewish Emigrants - [see the Voyage of the St. Louis in 1939](https://en.wikipedia.org/wiki/MS_St._Louis)).",
            "score": 195,
            "replies": [
                {
                    "author": "KrtekJim",
                    "body": "> they were turning away ships filled with Jewish Emigrants\n\nRefugees. They were turning away refugees, which is worse.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "buttersyndicate",
                    "body": "What about that time when Germany had to be denazified and instead the US pulled that Nuremberg ruse [so they could to spend the next years recycling nazis for West Germany's state and NATO](https://www.youtube.com/playlist?list=PLFdL4svwk75fBzj8BnF9q9-mFAnpKBqTu)?",
                    "score": 65,
                    "replies": [
                        {
                            "author": "kilofSzatana",
                            "body": "Don't forget the SS death squads deployed in Latin America.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "depersonalised",
                                    "body": "Reagan‘s death squads?",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Belligerent-J",
                                    "body": "Please elaborate",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "PresentProposal7953",
                                            "body": "Look up condor ",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 18,
                    "replies": [
                        {
                            "author": "eko425",
                            "body": "You’re conveniently forgetting the economic stranglehold and oil embargo the US imposed on Japan before they attacked Pearl Harbor. Dialectics, folks",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Knytemare44",
            "body": "The USA is fucked. Like, properly",
            "score": 37,
            "replies": []
        },
        {
            "author": "apiaryaviary",
            "body": "The premise that fascism was ‘buried forever’ in 1945 and is now being actively resurrected—is historically simplistic at best and dangerously misleading at worst. Fascism was never truly defeated—it was repackaged, rehabilitated, and in many cases, absorbed into the very institutions that claimed to have destroyed it. The U.S. government, for instance, wasted no time integrating Nazi scientists into its Cold War military-industrial complex (see Operation Paperclip) and embraced anti-communist authoritarians across the world whenever it served capital’s interests.\n\nWhat we’re seeing now isn’t the ‘revival’ of fascism—it’s the logical continuation of a system that never really abandoned it. Neoliberal capitalism has always had a deeply anti-democratic undercurrent, and when economic crises hit, it inevitably turns to reactionary strongmen, corporate authoritarianism, and nationalist scapegoating to maintain control. The ‘tech libertarians’ in this cartoon aren’t some bizarre aberration—they are exactly what you would expect when capital is given unchecked power. Whether it’s billionaires openly praising dictators, reactionary influencers peddling hierarchy as ‘natural,’ or corporations bankrolling far-right movements, the conditions for fascism have been incubating in the global economy for decades.\n\nThe mistake is in thinking that fascism is something that was ‘defeated’ in the first place. It was never truly about jackboots and swastikas—it was, and is, about ensuring that economic and political power remains in the hands of a select few, using whatever means necessary. And if digging up the old symbols of the past helps distract people from the fact that the real battle isn’t between ‘right’ and ‘left’ but between ordinary people and the ruling class, then of course they’ll do it. That’s how power works.",
            "score": 27,
            "replies": []
        },
        {
            "author": "Ok_Arachnid1089",
            "body": "Surely liberals know about Spain. Surely..",
            "score": 48,
            "replies": [
                {
                    "author": "buttersyndicate",
                    "body": "The Franco guy went sooo quickly from \"dictator\" to \"Caudillo\", \"strongman\", \"Head of State\", \"Anti-Communist Ally\"...",
                    "score": 35,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChadicusVile",
            "body": "Tell me you don't know about US industrialists and Nazi collaboration before the war and Operation paperclip after the war in less than ten words...",
            "score": 46,
            "replies": [
                {
                    "author": "ZipMonk",
                    "body": "NASA.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "ChadicusVile",
                            "body": "Yes",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lightiggy",
            "body": "[French fascists](https://en.wikipedia.org/wiki/Maurice_Challe), most of whom defected halfway through the war since Pétain kept dropping mixed signals, Hitler didn’t give them enough concessions, and Germany eventually occupied Vichy France, and later dragged the Algerian War into the early 1960s when it should’ve ended in the late 1950s and [nearly started a civil war](https://en.wikipedia.org/wiki/Algiers_putsch_of_1961), with the [most fanatical ones](https://en.wikipedia.org/wiki/Raoul_Salan) still rebelling without military support and [trying to assassinate Charles de Gaulle](https://en.wikipedia.org/wiki/Petit-Clamart_attack) after the liberals dragged him out of retirement to bail them out:\n\nhttps://preview.redd.it/ib3hs10ywcle1.jpeg?width=1022&format=pjpg&auto=webp&s=27c8ed29fa9116f36075c752aa3d1ee25080126f",
            "score": 52,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "lightiggy",
                            "body": "Vichy France fought the Allies on numerous occasions, but never declared war on them. Since Germany was a traditional enemy of France, it needed to be explicit. Vichy France did negotiate with Germany, but it was ironically the upcoming invasion of the Soviet Union that helped cause talks to fall apart. Numerous Vichy French generals correctly foresaw that Operation Barbarossa would fail and thought it was better to wait before deciding whether to form a proper alliance.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "We-R-Doomed",
            "body": "As if any of these three guys would ever pick up a shovel",
            "score": 32,
            "replies": []
        },
        {
            "author": "Explorer_Entity",
            "body": "Should be a Red Army soldier holding the shovel\\*. Or having a gun slung on him. Who even is generic military dude? He's... white. and wearing generic military garb. Perhaps his weapon is identifiable... M1 Garand?\n\n\\*Top panel should be the tombstone alongside this:\n\nhttps://preview.redd.it/ssurdyn00ele1.jpeg?width=800&format=pjpg&auto=webp&s=999460dadaf0f59f25a4daf2f7f903a40b2927ef",
            "score": 12,
            "replies": []
        },
        {
            "author": "wunderud",
            "body": "Laughs in Francoism",
            "score": 11,
            "replies": []
        },
        {
            "author": "Lesbineer",
            "body": "What the USA funded like actual nazis to rebuild West Germany, supported the mafia in Italy to stop the popular communist party. Like most of NATO and the EU were former nazis as well",
            "score": 10,
            "replies": []
        },
        {
            "author": "Raccoon_DanDan",
            "body": "It was never buried, it only put on a mask",
            "score": 15,
            "replies": []
        },
        {
            "author": "Powerful_Reward_8567",
            "body": "Both parties support fascism in their own hypocritical way.",
            "score": 66,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -22,
                    "replies": [
                        {
                            "author": "Captain__Trips",
                            "body": "We tried that in 2016. And 2020. And 2024. The Democrats are neither good nor perfect precisely because big business controls both sides.",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": -12,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "Captain__Trips",
                                                            "body": "Yeah you'd think the Democrats would be doing something adult right now, since there are \"literal Nazis\" occupying the government. Can you point out the appropriate adult responses to \"literal Nazis\" in the government that Democrats are doing? Does DNC chair Hakim Jeffries saying \" what leverage do we have?\" count as an adult response to the fascists?",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": -6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Captain__Trips",
                                                                            "body": "Did I ever say they are equally bad though? Right wing politics is deplorable, but the Democrats have been an abject failure as opposition to the right wing programming that's now wrecking the country. Theyve been failing since Newt Gingerich. The liberals have no answer to nationalist right wing populism",
                                                                            "score": 13,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": -12,
                                                    "replies": [
                                                        {
                                                            "author": "Captain__Trips",
                                                            "body": "These propaganda accounts are so weird. Fetterman aside? I guess the goal is to just say nonsense and hope enough people get confused and discouraged...",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": -7,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": -9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Captain__Trips",
                                                                            "body": "Oh I've thought a lot about John Fetterman and his political career arc. I've also thought a lot about the protest movements that get crushed by liberal capitalism. Both are great topics to be educated on and learn who is on who's side",
                                                                            "score": 9,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Captain__Trips",
                                                                                            "body": "You are really misinformed if you think the MAGA movement was birthed from the Occupy movement. In fact, if that were even the case, that would make the Democrats even more inept and stupid for seeing that and not capitalizing on it themselves. Anyway, MAGA as it's known was birthed from the Obama election, but I would argue it's origins go back to Reagan.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "NewTangClanOfficial",
                                                            "body": "> Fetterman aside, the entire party is pretty worthless.\n\nThis part of your comment makes it look like you support Fetterman. Is that the case?",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "Holiday_Jury9228",
                                                                    "body": "You don't have to agree 100% with someone to support them. But I don't see very many charismatic leaders on the left right now. AOC has great energy. Insisting on everything being either black or white supposes that nothing is grey. MC Escher was not a philosopher. -edit",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "NewTangClanOfficial",
                                                                            "body": "Alright, bye.",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Original_Telephone_2",
                                            "body": "That's a false choice and a cop out",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TolPM71",
                            "body": "You guys always go on about \"not letting the perfect be the enemy of the good\" whenever you're doing something shitty whether it's covering for Wall St, abandoning the working class, enabling police militarisation, tossing miniorities under the bus when they become inconvenient, running shitty, tepid, policy and issue free electoral campaigns or backing and enabling an ongoing genocide.\n\nCan you come up with a better excuse? That one's worn out!",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "CynicalProle",
                            "body": "That saying doesn't apply when \"the good\" are people who contribute to an active genocide..",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "Fun-Pain-Gnem",
                            "body": "> Don't let \"absolutely, irrefutably dogshit\" be the enemy of perfect.\n\nFtfy",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "StillAtRest",
                            "body": "Both sides of the same coin bud & it's a shiity coin. There is no \"good\" side",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "maghau",
                            "body": "Democrats: *committing genocide*\n\nLiberals: the Dems are good, actually \n\n(probably because their victims are mostly brown and poor people and liberals are racists and class traitors)",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "Dream-In-Hydrogen",
                            "body": "Check it out, Lois.  A lost liberal is about to get banned. 🍿",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "NewTangClanOfficial",
                                    "body": "Washed away, like piss in the rain.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "weforgottenuno",
                            "body": "Spotted the liberal",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "A-CAB",
                            "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HowieO-Lovin",
            "body": "Fascism never ceased....it just changed hands...",
            "score": 6,
            "replies": []
        },
        {
            "author": "faustoc5",
            "body": "First, the USA never buried fascism, not even nazis, that credit goes to the Soviet Red Army\n\nSecond, USA and its allies supported fascism before and after the WW2, for them communism was more dangeours than nazism.\n\nThrid, Project paperclip and Gladio Operation\n\nFourth, both USA parties support fascism wheneven it suits them.",
            "score": 17,
            "replies": []
        },
        {
            "author": "naivenb1305",
            "body": "Ah. The age old far right died myth. To be clear it’s always been there and especially here.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Anti_colonialist",
            "body": "Liberals have this backassward idea that someone like Trump formed in a vacuum.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Corrupt_Official",
            "body": "lmao",
            "score": 10,
            "replies": []
        },
        {
            "author": "SpecialistAddendum6",
            "body": "For a second I thought you were disputing the second part, but MAGA really doesn't have to do much digging at all.",
            "score": 8,
            "replies": []
        },
        {
            "author": "LuisMataPop",
            "body": "It should've a Russian soldier instead of uncle Sam",
            "score": 5,
            "replies": []
        },
        {
            "author": "Pumpkinfactory",
            "body": "Would be Accurate if Uncle Sam has a Nazi officer standing right behind him with the labels \"NATO Command\" and \"GLADIO\" barely covering the Swastikas, and the thought bubble said \"Remember, now thats your new name\".",
            "score": 2,
            "replies": []
        },
        {
            "author": "coldypewpewpew",
            "body": "elon would never pick up a pickaxe",
            "score": 2,
            "replies": []
        },
        {
            "author": "SpaceMalakhi",
            "body": "Even the first vignette is so wrong on so many levels",
            "score": 2,
            "replies": []
        },
        {
            "author": "PostingLoudly",
            "body": "For the first panel I feel like we're conveniently ignoring Iberia.",
            "score": 4,
            "replies": [
                {
                    "author": "NewTangClanOfficial",
                    "body": "It ignores the entire history of US foreign policy post WWII. The whole thing is a liberal fantasy that has nothing to do with the real world.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "That-Hamster1863",
                            "body": "yeah, \"thanks to america decades worth of growing evil embedded sentiment disappeared instantly!\" is something only they believe",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shits_do_that",
            "body": "So Trump and Musk built afd?",
            "score": 1,
            "replies": []
        },
        {
            "author": "cindymartin67",
            "body": "It’s giving “Mussolini”",
            "score": 1,
            "replies": []
        },
        {
            "author": "turkeyflavouredtofu",
            "body": "Have they already forgotten about General Franco? 🙄",
            "score": 1,
            "replies": []
        }
    ]
}