{
    "title": "How Burkina Faso wants to achieve food sovereignty.",
    "author": "Ok-Musician3580",
    "subreddit": "LateStageCapitalism",
    "rank": 113,
    "score": 350,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 8,
    "url": "https://v.redd.it/y2q3bna2jfle1",
    "id": "1iyhi36",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SatsuiLove",
            "body": "There is beauty in the world, and Burkina Faso should be a reflection of the love that guides humanity. Every human deserves nourishment and the chance to build a better future.",
            "score": 48,
            "replies": []
        },
        {
            "author": "future_old",
            "body": "As in the Heart, So in the Earth by Pierre Rabhi is a good read about food sovereignty projects in west Africa, although it’s not up to date with current events. This video is very inspiring though! As an American watching our government in … transition … local food self sufficiency is a topic on a lot of people’s minds. ",
            "score": 16,
            "replies": []
        },
        {
            "author": "PermiePagan",
            "body": "Let's just hope they won't give them the Libya treatment. That's what the US does to countries that try to become independant.",
            "score": 15,
            "replies": [
                {
                    "author": "future_old",
                    "body": "BF got the Libya treatment once or twice already. ",
                    "score": 14,
                    "replies": [
                        {
                            "author": "PermiePagan",
                            "body": "True, as soon as I saw that it was \"Al-Q\" forces that had attacked them, I though \"those same guys that the US just backed to take Syria?\" So it was all the CIA and French keeping the area constantly destabilized, to justify their military presence. Got it.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ThePolishAstronaut",
            "body": "“He who feeds you, controls you”\n- Thomas Sankara",
            "score": 3,
            "replies": []
        }
    ]
}