{
    "title": "Jeff Bezos Reveals Sick MAGA Takeover of Washington Post",
    "author": "ilir_kycb",
    "subreddit": "LateStageCapitalism",
    "rank": 97,
    "score": 1960,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 38,
    "url": "https://newrepublic.com/post/192012/jeff-bezos-change-washington-post-opinion",
    "id": "1iz0sqw",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ilir_kycb",
            "body": "[Draft Resolution On Freedom Of The Press](https://www.marxists.org/archive/lenin/works/1917/nov/04.htm)\n\n> For the bourgeoisie, freedom of the press meant freedom for the rich to publish and for the capitalists to control the newspapers, a practice which in all countries, including even the freest, produced a corrupt press.",
            "score": 469,
            "replies": [
                {
                    "author": "AnotherYadaYada",
                    "body": "Simple sing it. Control the press control the information.\n\nI mean, how much money does he want to protect or power to grab.\n\nFFS. Hopefully out of all of this nonsense something good will come, like the phoenix rising from the ashes.\n\nOnly soooo much shit people can take.\n\nNewspapers are dead, but there is SOME good journalism/journalists still around. More control is needed over this shite, but not by the rich with agendas.",
                    "score": 113,
                    "replies": []
                },
                {
                    "author": "FlummoxedFlummery",
                    "body": "Always has been",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Recovery8",
            "body": "Jeff Bezos already looks like Temu Lex Luthor so may as well go all in. ",
            "score": 219,
            "replies": []
        },
        {
            "author": "None",
            "body": "He was already a bad person. He just made it official.",
            "score": 138,
            "replies": []
        },
        {
            "author": "SapphosLemonBarEnvoy",
            "body": "_\"Democracy dies in ~~darkness~~ broad daylight.\"_",
            "score": 237,
            "replies": [
                {
                    "author": "ilir_kycb",
                    "body": "Which democracy? US America has been a plutocracy since its founding.\n\n[Your Democracy is a Sham and Here's Why: - YouTube](https://www.youtube.com/watch?v=oYodY6o172A)",
                    "score": 123,
                    "replies": []
                }
            ]
        },
        {
            "author": "stingerfingerr",
            "body": "So wp was good until last year?",
            "score": 49,
            "replies": [
                {
                    "author": "TuckHolladay",
                    "body": "Seriously.  I would ask people to go back and read last years op eds.  Without doing any research I would guess that there are a whole bunch that suggest killing Palestinian kids is just the price we pay for freedom and the economy is awesome it’s your fault you are poor.",
                    "score": 73,
                    "replies": []
                },
                {
                    "author": "VuDuBaBy",
                    "body": "Bezos bought the WP in 2013.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "dnvrnugg",
            "body": "Vote with your money people. Boycott Amazon too.",
            "score": 31,
            "replies": []
        },
        {
            "author": "mrcmatt",
            "body": "I just canceled my subscription to the Washington Post, and you know what, it felt good",
            "score": 91,
            "replies": [
                {
                    "author": "The-Kurt-Russell",
                    "body": "Same I cancelled it",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "Samael5101",
                    "body": "Same here.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Muleskinned",
                    "body": "I feel bad for the workers printing the paper and distributing it.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Stickboyhowell",
            "body": "Let him have it. Nobody trusts it nowadays anyways. Is sunk as low as Fox News being demoted from news to 'entertainment media'. Nobody with half a brain cell even pays attention to it anymore.",
            "score": 50,
            "replies": [
                {
                    "author": "maghau",
                    "body": "You shouldn't trust neolib media in general.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "jrtf83",
            "body": "“We are going to be writing every day in support and defense of two pillars: personal liberties and free markets.“\n\nSo personal liberties of people to live as they gender they choose, I assume?",
            "score": 21,
            "replies": [
                {
                    "author": "killer_weed",
                    "body": "No, the personal liberty to discriminate.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tremor_Sense",
            "body": "Take it a step further, and cancel your prime.",
            "score": 19,
            "replies": [
                {
                    "author": "astrologicalburnout",
                    "body": "On it.",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "THespos",
            "body": "Okay.  Let’s hear about “free markets.”  Specifically, let’s hear about how Amazon’s anticompetitive behavior promotes the opposite of free markets.",
            "score": 16,
            "replies": [
                {
                    "author": "BruiserTom",
                    "body": "Bezos:  Free market for me, but not for thee.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZachMorrisT1000",
            "body": "The rich are so scared the poor are gonna realize they are being drowned by capitalism.",
            "score": 9,
            "replies": [
                {
                    "author": "IamMrBucknasty",
                    "body": "Hence building panic rooms, disaster shelters and other pet projects to protect their thin skinned hides from the masses.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "RobDaBigSpoon",
            "body": "Once again time has come for me to tell whomever will hear me, with full disgust in my heart, Jeff Bezos started as a Wall Street guy before starting Amazon. \n\nHe was ALWAYS shit.",
            "score": 5,
            "replies": []
        },
        {
            "author": "maneki_neko89",
            "body": "I went and cancelled my account and deleted the app this afternoon. Even though I've been a subscriber for almost a decade, I highly doubt that the Washington Post is going to return back to the pre-Beansoup days and I'm not waiting around and giving them money while the Blue Origin Bond Villain owns the presses.  \n  \nAside from some very good topical journalism, I don't want to be bombarded with MAGA slop and I already feel better in doing so.",
            "score": 17,
            "replies": [
                {
                    "author": "maghau",
                    "body": "What has changed? We all know WP's been doing the bourgeoisie's bidding since it was founded.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "maneki_neko89",
                            "body": "I should’ve pulled the plug when [Ann Telnaes](https://substack.com/@anntelnaes?r=a57v&utm_medium=ios&utm_source=profile) left because she depicted Bezos as one of the billionaires worshipping a Trump statue and wasn’t allowed to publish it at the Post",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TopperHrly",
            "body": "As if the capitalist press was free before then",
            "score": 6,
            "replies": []
        },
        {
            "author": "jasonbhaller",
            "body": "I remember when he bought the post he said he would just be a silent owner and let the paper run as it always did. Good times.",
            "score": 3,
            "replies": []
        },
        {
            "author": "dratseb",
            "body": "Well shit, I guess the media is the enemy of the people now. Broken clocks, etc etc",
            "score": 1,
            "replies": []
        },
        {
            "author": "redwoodtree",
            "body": "Come on man let’s , like, give nazis a chance and stuff. You write positive stuff. Gotta go to my yacht now, write good. Later!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Teach-o-tron",
            "body": "Who the fuck is still paying for this rag?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Penelope742",
            "body": "https://preview.redd.it/3ym493o67wle1.jpeg?width=1200&format=pjpg&auto=webp&s=3792f37d5f9b9e943840df00b80f5f01ca91670f",
            "score": 1,
            "replies": []
        },
        {
            "author": "parkerm1408",
            "body": "Did he think we didn't already know who he supported?",
            "score": 1,
            "replies": []
        }
    ]
}