{
    "title": "Why don't Democrats ever reverse bad Republican policies when they are in charge?",
    "author": "Beginning_Ground9472",
    "subreddit": "LateStageCapitalism",
    "rank": 83,
    "score": 2538,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 290,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1izli9g/why_dont_democrats_ever_reverse_bad_republican/",
    "id": "1izli9g",
    "selftext": "Liberals whine and complain about what Republicans due but once they win, suddenly those policies never existed. \n\nExample was during the border crisis during Trump's first term where Democrat officials like AOC were going to the border and crying and those cages to get some photo ops. Even though those were put there by Obama, used by Trump and Biden approved plans to build [a new facility in Guantanamo](https://www.npr.org/2025/01/16/nx-s1-5252468/guantanamo-biden-legacybuild)  which now once completed, will conveniently be used by Trump to house undocumented immigrants.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting-Sign2678",
            "body": "Dems are the good cops, Repubs are the bad cops.\n\nAll cops are still cops.",
            "score": 2566,
            "replies": [
                {
                    "author": "Responsible_Fix_6958",
                    "body": "Good analogy. ACAB.",
                    "score": 698,
                    "replies": [
                        {
                            "author": "Hrtpplhrtppl",
                            "body": "The Whole \"Good/Bad Cop\" Question Can Be Disposed Of Much More Decisively. We Need Not Enumerate What\nPorpotion Of Cops Appears To Be Good Or Listen To Someone's Anecdote About His Uncle Charlie, An Allegedly Good Cop.\nWe Need Only Consider The Following:\n\n(1) Every Cop Has Agreed As Part Of His Job To Enforce Laws, All Of Them\n(2) Many Of The Laws Are Manifestly Unjust, And Some Are Even Cruel & Wicked.\n(3) Therefore, Every Cop Has Agreed To Act As An Enforcer Of Laws That Are Manifestly Unjust, Or Even Cruel & Wicked\n\nThus There Are No Good Cops",
                            "score": 119,
                            "replies": [
                                {
                                    "author": "bkuri",
                                    "body": "Is this supposed to be a title or something?",
                                    "score": 80,
                                    "replies": [
                                        {
                                            "author": "Therval",
                                            "body": "I think it’s a Fallout Boy song title",
                                            "score": 60,
                                            "replies": []
                                        },
                                        {
                                            "author": "Wasphammer",
                                            "body": "This sounds like a sick Communist Isekai Light Novel title.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "re_gren",
                                                    "body": "I'd read that.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "shane_4_us",
                                            "body": "She misunderstood Das Kapital, but she's got the spirit.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "supercheetah",
                                    "body": "All the good cops I know ended up quitting because they couldn't handle all the corruption.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "nice_whitelady",
                                            "body": "Same",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Appropriate_Ant_4629",
                                    "body": "How about ones that change their mind.  Like Chris Dorner?  Sure, they don't last long, but for a brief moment do they count?",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "D0UB1EA",
                                    "body": "holy shit it's kanaya",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "weirdi_beardi",
                                    "body": "There was one good cop.\n\nThen OCP turned him into a product.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "wordwords",
                                    "body": "Not me trying to spell out the capitalized letters",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Lengthiness_1175",
                    "body": "Both parties serve the same system, just with different branding to keep the illusion of choice alive.",
                    "score": 299,
                    "replies": [
                        {
                            "author": "Aint-no-preacher",
                            "body": "America has one political party. But in typical American extravagance, it has two.",
                            "score": 119,
                            "replies": [
                                {
                                    "author": "xKirstein",
                                    "body": "I actually don't think that's true anymore. I think America **HAD** one political party. Now it has two political parties; one party ([Democrats](https://www.salon.com/2025/01/30/are-we-on-the-side-of-our-donors-dnc-race-puts-spotlight-on-money-and-good-billionaires/)) represent the rich oligarchy and the other party (Republicans) represent Russia. Don't forget that Elon Musk ([a Nazi](https://www.youtube.com/watch?v=-VfYjPzj1Xw&t=17s)) was in [regular contact with Dictator Putin](https://apnews.com/article/musk-putin-x-trump-tesla-election-russia-9cecb7cb0f23ccce49336771280ae179). Both parties need to be disposed of, but it's obvious that Republicans have lost their minds.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "bullhead2007",
                                            "body": "Lol sorry dude the Republicans aren't representing Russia. Though I do think Trump has a crush on Putin because he likes strong men.\n\nBoth parties serve the same oligarchs. It's just the DNC represents oligarchs who want to keep the pretense of decorum and the facade that we're not a fascist imperial state alive, but the current republicans + Trump represent the oligarchs who want to throw away decorum and finish the transformation into a white christo-fascist ethno state. Has nothing to do with Russia.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "djokov",
                                                    "body": "This. The idea that Putin is puppeteering the GOP behind the scenes, is ultimately an American and European liberal conspiracy theory which has the purpose to write off the GOP and the pro-Russian European far right as something \"not\" American/European. It is essentially a way for liberals to deny the fact that their far right parties are a product of their *own* domestic conditions.\n\nThis does *not* however mean that these parties are not pro-Russian, or that they have no ties to Russia, but this is because their politics and ideology are aligned. The mistake is in believing that Putin and Russia are the source of the pro-Russian sentiments.\n\nFor Trump himself, I think you are spot on. Trump is not an \"ideological\" fascist, but goes along with whatever politics which serve his own purposes best, which happens to be the politics of the far right. Moreover, his narcissistic traits are conductive to fascist expressions of power. Essentially, Trump is someone who *only* respects power, which is why he is actually somewhat respectful towards Putin, Xi Jinping and Kim Jong-un, especially in the case of the latter, given that he leads a country that *should* on all accounts not be able to resist America’s power.\n\nTrump is also influenced by those around him, and the general pro-Russian tendency on the far right is better explained by ideology. Essentially, the far right believes that communist China is their greatest geopolitical threat, and that Putin and Russia are a potential anti-China ally. The funny thing is that 10 years ago this actually might have been possible, but that the Russo-Ukraine conflict has led to an irreversible Russian pivot towards China. The fact that the far right are wasting their time pursuing this is potentially a very good thing.",
                                                    "score": 9,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "howarthee",
                                                    "body": "> Both parties serve the same oligarchs\n\n*Proceeds to describe two different sets of oligarchs*",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "djokov",
                                                            "body": "Both serve the same oligarchs, but the two parties each represent different tendencies of the oligarchy. This means that oligarchic alignment can easily shift between the two parties, not just according to changes in their overall economic conditions, but also on a case by case basis. The tech industry shifting away from the Dems and towards the GOP in recent years is a good example of this.\n\nIf the parties served *different* oligarchs like you say, then the Dems would actually be in opposition to the Republicans, but this has simply never been the case. The lack of Dem resistance is especially prevalent right now that the GOP accelerationists are in charge. It is evident that the Dems are being told to fall in line, not necessarily because the oligarchy is in total agreement about the new direction, but that it is seen as preferable over *actual* opposition taking place, something which would be very damaging to the oligarchy as a whole.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "skjellyfetti",
                            "body": "Rethuglicans take giant steps; Dems take tiny, incremental steps. Regardless of the size of the steps, they're all marching in the same direction :: Towards oligarchy.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "Pristine_Proposal_84",
                                    "body": "Yes.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "DBFool2019",
                                    "body": "Dems haven't taken an incremental step left in decades.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Anti_colonialist",
                                    "body": "Those incremental steps liberals love to talk about are incremental fascism.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Content_Log1708",
                            "body": "\\^\\^ THIS \\^\\^",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "embles94",
                    "body": "https://i.redd.it/5jeqyh3e6qle1.gif",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Ok_Recipe12",
                            "body": "awwwhh, i haven't seen the professor since they shit on their fans.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aglobalvillageidiot",
                    "body": "I think of it as pro wrestling. They pretend to hate each other for TV but are really working together to fool the audience because they get paid by the same people",
                    "score": 69,
                    "replies": [
                        {
                            "author": "donniemoore",
                            "body": "\"the country is hopelessly polarized\"\n\nanother defense budget passes\n\nrinse and repeat",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "BasedSquareBase",
                                    "body": "beautifully written",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "myshinynewdppaccount",
                            "body": "It would be worth it if some of them would attack each other with chairs, or at least have the common courtesy to drop an elbow from the top rope once and a while. \n\n\"Lemme tell you something, Mr. Speaker....!\"",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "aglobalvillageidiot",
                                    "body": "Scott Steiner math is as good as any representative I've seen.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sakodak",
                    "body": "They've cleverly presented themselves such that the \"good cop\" and \"bad cop\" is relative and depends on which of the two approved positions you take. \n\n\nOnly once you step outside the bounds they've created through media can you see them all for what they are.",
                    "score": 59,
                    "replies": []
                },
                {
                    "author": "pccb123",
                    "body": "This is a too perfect analogy.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "SupremeElect",
                    "body": "Dems are the \"saviors.\" Repubs are the scapegoats.\n\nDems bark at Repubs but never bite them because at the end of the day, they're working together.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "Hrtpplhrtppl",
                    "body": "Tom and Jerry...\n\nThe highest form of protest is not having children for the government needs the governed... and even that choice is being eroded away. My in laws keep asking me when I'm going to \"Give them grandchildren.\" I keep reminding them I'm part Native American. We wouldn't breed in captivity, which is why they had to bring you all here. I mean, why would they even want to own slaves anymore when they can just rent you and your children for a fraction of the costs..?\n\nThe ruling class can afford a good enough education to know the true history of the United States and certainly to be able to understand the basic principle of cause and effect. They have us playing Russian roulette with our health every day in America for as much profit as they can squeeze out of us. A country with no public health care system obviously could not handle any public healthcare crisis like covid or the never-ending opioid addiction epidemic their private healthcare industry has created and continues to supply.\n\nWith no universal health care, the United States government forces people of lesser means to self medicate or suffer, then punishes them when they do. That is both cruel and wicked. I mean, the whole premise of Breaking Bad only worked for an American audience since Walt would not have needed the money in the first place in a more developed nation because being unable to afford to continue living does not happen there... \n\nThe powers that be are ensuring there are desperate people doing desperate things. Then, we see that the wealthy and their goons, the police, are beyond the reach of our justice system, so their laws are just in place to handicap the rest of us. The social contract has been broken. Que the vigilantes... no justice, no peace. \n\n\"Those who make peaceful change impossible make violent change inevitable. \" JFK\n\nNow I'm not saying don't vote. Please always choose the lesser evil. However, we have always been and always will be the scapegoats left to point our fingers at one another in order to keep us distracted from any meaningful change. I mean, what led to this, people couldn't vote...? How is what got us here going to get us out? When you find yourself in a hole, the first thing to do is stop digging. After all, repeating the same thing over and over expecting a different result is the very definition of insanity. Before we can have an intelligent discussion on how things ought to be, we first would need to agree on how they truly are...\n\nI mean, out of all the hundreds of millions of Americans, who really thinks these were the best two candidates...? Is it a wise tribe that does not send its best warriors to fight? You see, our masters will never give us the tools to dismantle their houses... The Republic of America has a so-called \"representative democracy.\" How can that be true when the \"representatives\" are all wealthy while the majority of the \"represented\" are poor?\n\nAmerican two party politics is like the cartoon Tom and Jerry. Tom doesn't really want to catch Jerry because then he'd be out of a job, and Jerry doesn't want Tom replaced with a cat that will actually eat him. So they act like they hate one another and put on a show for the masses while continuing business as usual in the back room. \n\nFor example, insider trading laws do not apply to any members of Congress, either side. What's it called when those who make the rules don't have to live by them? Furthermore, when the punishment for a crime is only a fine, it does not apply to the wealthy. \n\nSure, they can say they let us \"vote\", and therefore this is what we wanted, but with all the lobbying and money in American politics, America is as much a democracy as would be two wolves and a lamb voting on what's for dinner. \n\nIn America, the wealthy have won every \"election,\" and the only thing to trickle down in the economy has been their generational wealth. This is why, in a true democracy as the ancient Greeks understood it, people got their representatives the same way we would get a jury. America is not a democracy. \n\n\"Only those who do not seek power are qualified to hold it.\" Plato\n\nAnd please remember what we actually celebrate on the 4th. A cabal of stolen land entitled elite, slave owning aristocrats, found a way to get out of paying their taxes. Only thirty percent of the colonists supported the \"revolution\" with the rest saying, \"Why trade one tyrant a thousand miles away for a thousand tyrants one mile away...?\" System isn't broken it's functioning exactly as intended. Why own slaves when you can rent them for a fraction of the cost (read the 13th amendment)...? But the real question they must be asking themselves is how can their grand experiment survive contact with the real time information/communication age, which is where we are now... would you agree?\n\n\"The poor man really has a stake in the country. The rich man hasn't; he can go away to New Guinea in a yacht. The poor have sometimes objected to being governed badly, the rich have always objected to being governed at all. Aristocrats were always anarchists...\" G.K. Chesterton",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Substantial-Spare501",
                    "body": "I big cop club",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "JstnJ",
                    "body": "yeah its a good analogy, because both parties primary goal is using policy to police the system with the intention of maintaining the current power structures",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Obvious_Coach1608",
                    "body": "Dems are the political wing of the intelligence community.\n\nPubs are the political wing of the military industrial complex.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "NormieSpecialist",
                    "body": "Nicely said.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CriticalEuphemism",
                    "body": "Conservatives are just liberals who want to control everything. Seriously… look up the definitions. Liberals aren’t leftists. They’re barely center.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "icannothelpit",
            "body": "Because democrats are paid for by the same people as Republicans. They both serve the ruling class and profit off of making our lives worse. Look up the ratchet effect for more fun ideas.",
            "score": 824,
            "replies": [
                {
                    "author": "ilir_kycb",
                    "body": "> Look up the ratchet effect for more fun ideas. \n\n[How The United States Ended Up With Two Right-Wing Parties - YouTube](https://www.youtube.com/watch?v=6LPuKVG1teQ)",
                    "score": 167,
                    "replies": []
                },
                {
                    "author": "kokopelli73",
                    "body": "And the Overton Window.",
                    "score": 48,
                    "replies": []
                },
                {
                    "author": "unshifted",
                    "body": "Yup. The Dems serve as a placebo button and a sort of cooldown. The Republicans do all of the shit that the wealthy want, and then when the population gets restless about that, they get to vote for Dems. Now they feel like they've done something to swing the pendulum the other way and they get a 2-8 year pause on the wealthy implementing the more heinous shit.\n\nThey also exist to strangle leftist movements before they get too big.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "rebeccasf",
                    "body": "Yes! The most glaring example of this is the first drumpf tax bill that created a 10 trillion dollar deficit.  Demorats couldn't stop complaining about it right up until they took back power in 2021, then crickets.  This is entirely Shill Clintons fault. You can trace every single demorat fiscal policy back to his administration. Shill Clinton saw repubelicans getting a bunch of money from Wall Street and went to them and said, \"give me the money and I'll do whatever you want!\" This wasn't a big deal for him since he (and Reagan) was an acolyte of Milton Friedman and if you look back you'll see Clinton's economic policies were identical to Reagan's.  Shill Clinton completely destroyed the demorat party and they refuse to change and exclusively work for the billionaire class.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "howdybeachboy",
                            "body": "It’s so well known that democrats won’t undo trump international trade policies that it’s a reason that allies are super wary about the US.",
                            "score": 18,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "destructormuffin",
            "body": "Because they're complicit",
            "score": 254,
            "replies": [
                {
                    "author": "ColeBSoul",
                    "body": "Bingo. I saw another post recently whinging about “wHy wOnT DeMs oPpOsE tRuMps pLaNs” and the perfect response was: “because they don’t oppose them.”",
                    "score": 93,
                    "replies": []
                }
            ]
        },
        {
            "author": "SevenHolyTombs",
            "body": "Democrats had the majority several times but refused to codify Roe V Wade. They also had the majority for Biden's first two years and refused to overturn Trump tax cuts from 2017. Biden actually collected more in tariff revenues than Trump did his first term. And Obama and Biden were involved in just as many wars as any Republican ever was. \n\nhttps://preview.redd.it/8xkhdki7yple1.jpeg?width=893&format=pjpg&auto=webp&s=6c19abd93ebd1ae830d9d8a341caa90fc68a90c7",
            "score": 226,
            "replies": [
                {
                    "author": "tabas123",
                    "body": "It’s actually “we can’t do anything even though you gave us all three branches because of (Lieberman, Sinema, Manchin, the unelected parliamentarian that you can easily replace or ignore, etc.).\n\nThere will ALWAYS be just enough “centrist” (really CORRUPT) dems to prevent the real change that would in any way hurt the donor class. And they don’t codify things like Roe or Obergefell bc then they can’t run on it. They would have to run on actual progress.",
                    "score": 50,
                    "replies": [
                        {
                            "author": "SevenHolyTombs",
                            "body": "It's possible when you govern well and put the needs of the people above the wants of the wealthy.  Under FDR the Democrats always controlled more than 60% of the Senate and more than 70% of the House.  Democrats could have easily defeated the Orange Rapist Felon if they weren't so corrupt and didn't go overboard on so many unpopular policies. \n\nhttps://preview.redd.it/5gnuiyhjxrle1.png?width=792&format=png&auto=webp&s=8b42a542e0dd5d9e011b28ad195041e99830bb64",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "tabas123",
                                    "body": "Unfortunately I truly believe that if this kind of landslide happened again there would still be just enough of the corrupt cronies willing to take the heat from the rest of them. We give them 70% of the senate and 20 “centrist” senators from “moderate” states will have issues with populist economic policies like FDR.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "SevenHolyTombs",
                                            "body": "If you look at MAGA Republicans, they openly attack Centrists and the Old Republican Guard. They publicly advocate replacing them during elections. The current Corporate Democrats treat Populists like they're Naive Radicals. The current Democratic Party is a Center-Right Party.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "tabas123",
                                                    "body": "100%. They’re essentially 80’s Republicans. We have Bill Clinton to thank for that, he was the start of the Dems fully embracing corporations and the donor class after Reagan showed how lucrative corruption could be. We have no real left representation other than like 6 people in all of government.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AMC4x4",
                    "body": "How was all that going to get past the Senate filibuster?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "kestrel808",
                            "body": "There's nothing in the constitution that says the Filibuster needs to exist.  It's an arbitrary senate rule that can be revoked at any time, like when you want to nominate a supreme court justice.",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "KennyGolladaysMom",
                                    "body": "at the very least they need to make it like the old days where you had to stand up there and say shit for hours. make these fuckers work for their obstructionism.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "asnider1313",
                            "body": "Funny how the republicans have all these weapons to stop the democrats but the Dems don’t.",
                            "score": 91,
                            "replies": [
                                {
                                    "author": "Substantial_Owl6440",
                                    "body": "Yeah, I'd have liked to have seen a few Democrats get arrested trying to enter Federal buildings so they could get their message out, but beyond that, I'm curious what your answer would have been to the filibuster? Eliminate it? I'm not convinced the Senate GOP won't do it soon to pass their reprehensible tax cuts for the wealthy and gutting of Medicaid & SNAP, but would you have had the Dems do it?",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "author": "asnider1313",
                                            "body": "To be honest, I don’t think there’s any way to save our current political structure. If the Dems wanted to they could have gotten rid of it under Obama, they could’ve codified roe, and they could’ve passed a true Medicare for all but they didn’t and not bc of the bipartisan bull shit they spewed, they had a super majority during Obamas first term, but because they’re complicit. They don’t actually give a fuck, they both serve the same donors.",
                                            "score": 35,
                                            "replies": [
                                                {
                                                    "author": "ChangingChance",
                                                    "body": "They tried to they came I believe 1 vote short on the public option.\n\nOne of those manchin sinema types",
                                                    "score": -9,
                                                    "replies": [
                                                        {
                                                            "author": "Substantial_Owl6440",
                                                            "body": "Not sure why you're getting downvoted for just telling the truth. Joe Liebermann was the holdout. He represented CT where all the insurance companies are. He basically denied affordable healthcare for millions.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "ChangingChance",
                                                                    "body": "Yeah the sub has its quirks.  Glad I didn't misremember. \n\nPeople should really know the name of the 41 people against having affordable insurance. Just cause it was the idea of a black man.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lethkhar",
                            "body": "By removing the Senate filibuster with a simple majority vote. Or doing it when they had a supermajority.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "strutt3r",
                            "body": "Or the parlimentarian? Or any other scapegoat?",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "heavyheaded3",
                            "body": "right, better to not try at all. better to not use the bully pullpit. better to not fight. better to acquiesce to the right and punch left.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "rednehb",
                            "body": "the filibuster is a made up rule that can be overturned by a simple majority vote lol.\n\nDems- \"But if we do it so will the Republicans!!\"\n\nspoiler alert- the republicans are going to do whatever they want because they're lying hypocrites that don't even pretend to be decent fascists anymore like the dems do",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "b_evil13",
                            "body": "Exactly. They didn't have the numbers to pass any of the stuff they wanted too and there was this thing called Executive Power overreach that everyone cried about before Trump 2.0. \n\nThey shit bricks over biden's student loan forgiveness. Imagine if Biden or Obama had tried event a 1/4th of what Daddy Trump has done. Even when they had closer margins on the court they didn't try it. But now that daddy has the supreme court he can do what he wants and they just proved that with Roberts ending the pause on fucking over paying for bills that had already been incurred for USAID contractors....many of whom are American businesses that are owed money. They are allowing them to not pay past due bills. Not future finding mind you but money that is owed to small businesses that contracted with US AID like the one dumb trumper who provided supplies who is owed thousands and will have to close his 40 year old business if the bill isn't paid by the US govt for services already rendered. I mean that is just fucking crazy to me, but standard Donny T business tactics.",
                            "score": -11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fuckyoudigg",
                    "body": "What does codifying roe v wade do though? The Republicans can just vote to remove it later, or use the courts to get rid of it.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "rednehb",
                            "body": "You're suggesting that passing laws the open fascists don't like is useless, just fyi.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "big__cheddar",
            "body": "Don't forget when Obama made the Bush era tax cuts permanent. They don't always do nothing; sometimes they actively make it worse.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Putrid_Race6357",
            "body": "Political ratchet theory",
            "score": 59,
            "replies": []
        },
        {
            "author": "vankirk",
            "body": "Neo feudalism. The owners own you and everything else is for rent. Party doesn't matter. Same owners.",
            "score": 245,
            "replies": [
                {
                    "author": "No-Candidate6257",
                    "body": ">Neo feudalism. \n\nDon't be a lib. Stop inventing new words for capitalism.\n\nCapitalism is the problem.\n\nSocialism is the answer.\n\nDon't complicate it.",
                    "score": 87,
                    "replies": [
                        {
                            "author": "JstnJ",
                            "body": "i think a new word is good to describe something, and that is: Technofeudalism\n\nIt's new, capitalism describes some of the phenomena but Marx or Engels couldn't properly predict the specific forces in modern technology.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "No-Candidate6257",
                                    "body": "It's just capitalism.\n\nAnd the liberal troll Varoufakis just invented a new bullshit term to confuse people and not have a serious conversation about Marxism-Leninism.",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "StillSad2276",
                                            "body": "counter point: what if the rich people turn themselves into robo/nanite \"gods\" and rule over humanity with a iron fist.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Remarkable-Gate922",
                                                    "body": "That would be cool because they would no longer support capitalism.\n\nThe reason the support capitalism today is because it is of benefit to them and they are psychopaths who lack basic empathy and education.\n\nThere's no point in hoarding money if you are an immortal robot god.\n\nAnd fusing with the machine will give them all of human historical knowledge and the immense calculation capabilities of an AI.\n\nCapitalism would die instantly.\n\nThey might decide that the existence of humans is no longer required and kill us all, but I doubt it.\n\nThey might decide that fusing with the machine is best for everyone and assimilate all other humans like the Borg. That's more likely but I wouldn't mind.\n\n\nIn reality, they will likely do exactly what every other god does: Absolutely nothing because they have everything and need nothing.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "StillSad2276",
                                                            "body": "tell me why you believe that then reality of them being brutal mechanical monster gods? how do you know that they would wouldn't recreate their fairytales into a \"real\" thing in the worst way possible.\n\nwhat's stopping them form thinking like that? honestly I hope someone rats out that technology to ML government like China and others before they turn on the switch.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "StillSad2276",
                                                            "body": "that implies they wouldn't get the information from Wikipedia and other cia-backed sources. honestly it feels like most sci-fi writers expect for merging with a machine to truly iron out the flaws but honestly I don't think that would happened. \n\n  \nYou would think they realize the errors of their ways  or some shit but nah, they would make the gods that man came up look sweet in comparison. ( Imagine the pure nightmare fuel of remaking shit like biblical floods and plagues)",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Remarkable-Gate922",
                                                                    "body": "With enhanced understanding and an elimination of physical needs and fears, why would they continue acting like some scared animal preparing for scarcity?\n\nCapitalism is caused by cowardice and ignorance.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "StillSad2276",
                                                                            "body": "Fair point\n\n  \naddendum: the only thing you didn't consider is Americans, I wonder if that would even work on them or the brainrot would overpower said history because most of them would prefer to look away.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "JstnJ",
                                            "body": "Ok, I see your point...I don’t think neofeudalism is a particularly useful distinction, but I do think techno-feudalism captures something worth paying attention to. Especially with AI and the commodification of human creativity without compensation, it highlights dynamics that are useful to pay attention to specifically within the exploitations of capitalism though. I gotchu tho",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "djokov",
                                                    "body": "I agree with you on the part that it highlights something important within capitalism, but the above commenter’s criticism is still fairly valid given that Varoufakis himself considers technofeudalism something which is distinct from capitalism. It is a separation which can obfuscate that many of the elements that his book highlights is not novel to capitalism, but are being accelerated massively by new technology.\n\nI can see its value as a rhetoric tool but I feel that the book loses some clarity because of it.",
                                                    "score": 12,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "djokov",
                                    "body": "\"Technofeudalism\" is entirely compatible with the analytical framework of Marx and Engels. \n\nI must preface this by saying that I think *Technofeudalism* is a great book, and that it contains a lot of incredibly valuable analysis. There are however a number of analytical \"traps\" which exist when approaching the post-2008 Financial Crisis digital sphere and economy from a Marxist perspective, which means that it is a subject which Marxist academics really struggle to get \"right\", Varoufakis included.\n\nVaroufakis' central thesis is that technofeudalism has replaced capitalism, in part due to how tech platforms extract profits through \"cloud rent\" instead of producing and selling material goods like corporations have under \"traditional\" capitalism. Like Varoufakis points out, \"cloud capital\" is not different from capital in its ability to shape behaviour, something which capital has always had. Nor is \"cloud capital\" immaterial or non-physical, as it exists in our digital infrastructure (server farms, etc.). Cloud capital, in Varoufakis' eyes, is essentially the \"algorithmic power\" to command our behaviour, with the critical distinction that cloud capital can reproduce itself *without* waged labour. We are essentially reduced to \"cloud serfs\" that does this reproduction for free.\n\nThis is a somewhat simplified and *very* brief explanation of where Varoufakis goes wrong, but he essentially makes a mistake of focusing solely on Marx's analysis of capitalism being a system which extracts the surplus value of waged labour, which leads him to overly fixate on a distinction between waged and unwaged labour. In somewhat of a typical western Marxist academic fashion, he has adopted a eurocentric analytical lense in where unwaged exploitation somehow becomes \"uncapitalist\". Varoufakis also tends to be naive/idealistic when it comes to the question of political power within capitalism—his avoidance of discussing the role of the state within a socialist revolution being an example of this—which leads to him drawing a false equivalence between historical land enclosures and the \"new\" digital enclosures which withholds our identities, when our identities and citizenships have always been subject of the capitalist class *within* in capitalist societies.\n\nThe result is that Varoufakis draws some false conclusions when attempting to ascribe aspects of the post-2008 economy, aspects which in reality have *always* been present within capitalism. Unwaged forms of human labour has always existed and sustained capitalism. The \"feudal\" cloud rent of Big Tech is simply another expression of the exploitation within monopolised capitalist markets. Cloud capital functions and exists just like any other capital. Big Tech algorithms may appear autonomous, but they are created and sustained by human labour, as well as rely on a digital infrastructure that consists of other forms of capital. Additionally, the ability of cloud capital to command our behaviours, is nothing *fundamentally* different from how traditional marketing works, as well as how traditional media has always curated and filtered what we are exposed to in terms of products, news and ideology. This has also always been a process informed by our consumption patterns. What we are experiencing now is certainly a hyperintensification, however, especially considering that it is much more individualised.\n\nMoreover, Big Tech does not actually profit all that much from rent extraction like Varoufakis' thesis implies, but have value because they allow other corporations to sell their goods and services, in addition to accumulating capital by being overvalued in the eyes of investors who have increasingly been operating on \"vibes\" since the financial markets began recycling debts in the 1970s. Nick Srnicek touches upon this in his book *Platform Capitalism* (not a perfect analysis either but also a good one), but Big Tech are essentially capable of overinflating their own value, due to how they are not \"tied\" to a very specific industry, and do not need to grow through vertical and/or horisontal aquisitions within their own field. This makes it possible for Big Tech to more effectively leverage \"vibes\"-based investments by chasing business acquistions which serve some sort of \"niche\" or \"fad\". This means that the value of Big Tech is in some sense \"immaterial\", but none of these aspects are novel within capitalism. It is pretty much the 21st century version of chasing new forms of snake oil.\n\nIn defence of Varoufakis, I do think that his \"technofeudalism\" describes an accelerationist trend within capitalism after 2008. It is a trend that has always existed, and is not unlike how technology has allowed capitalism to find new ways of extracting surplus profit in the past. I also think that \"technofeudalism\" is a great rhetoric tool, moreso for selling books than making accurate analysis, but I also appreciate its appeal. I've written academic papers on the topic and I am really impressed with the way Varoufakis writes and conveys his ideas. Ultimately I think that Varoufakis analytical missteps are the main issue, not the term \"technofeudalism\" itself. We're talking about really minor and technical mistakes here, but ones that affect his overal thesis, and his book ultimately serves to obfuscate much of capitalism's history of the same and/or similar forms of exploitation. Presenting technofeudalism as something \"new\" lets capitalism off the hook, so to speak, even though I do not believe that this ever was Varoufakis' intention.\n\nIn the end just to summarise: Technofeudalism does not describe anything new in these respects, but I see how Varoufakis' eurocentrism informs such a conclusion. It is also an easy mistake to make, seeing as Marx *did* focus a lot of his work on waged labour due to having somewhat of a eurocentric approach of his own. Though this is not an excuse, seeing as Marx’s analysis of slavery, primitive accumulation, and social reproduction shows that he recognised capitalism’s reliance on multiple forms of labor exploitation, both waged and unwaged. Technofeudalism is ultimately perfectly compatible with the framework of Marx and Engels, and their dialectical method allows us to extend the Marxist framework to modern contexts like \"digital serfdom\".\n\nIf there is one key takeaway from this it is that capitalism is not *solely* defined by wage labor but also by a totalising drive to commodify all aspects life—a process which combines wage exploitation with unwaged coercion.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mylord420",
                            "body": "Do you even yanis varoufakis bro/broette?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "No-Candidate6257",
                                    "body": "First of all: That would be tEcHnOfEuDaLiSm, not neo feudalism.\n\nSecondly: Yes, Varoufakis is a lib who goes on about \"muh authoritarianism\" and - like all libs - invents new words for capitalism to not have a serious conversation about Marxism-Leninism. Ever heard him say \"the USSR and Communist China are amazing and we should implement China's political systems in Europe adapted to our unique circumstances and material conditions\"? No? Okay, there you go.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Adriano-Capitano",
            "body": "They will blame Ronald Reagan for the homeless/emotionally disturbed issues we face in major cities - but not do a damn thing.",
            "score": 64,
            "replies": [
                {
                    "author": "mavjustdoingaflyby",
                    "body": "I disagree. They will spend millions on studies and implement programs where the vast majority of money gets spent on management and administrative instead of actually getting people off the streets. BTW, fuck Ronald Reagan and the ACLU. They are both equally to blame for the deinstitutionalizing that put massive amounts of mentally disturbed homeless people on the streets.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "nate-urbate",
                            "body": "Genuinely asking, could you explain the ACLU's role here in further detail?",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "cogitationerror",
                            "body": "Sorry, are you upset at the ACLU for going after the Willowbrook State School? That place was basically a *torture camp* for disabled people of all ages. We have footage of it, and it’s horrifying to watch, especially knowing that I could have ended up there had I been born earlier. Clearly we need safe places for mentally disabled people but the emphasis needs to be on safe. Legal channels were the only recourse the victims of WSS had, and I will not fault the ACLU for representing them when it was the only way they could receive any kind of recompense. Keep your blame on the system, not the people trying to keep mentally ill children from being strapped down naked and physically abused before dissociating so hard that they are permanently psychologically damaged.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Adriano-Capitano",
                            "body": "Unfortunately - yes! The homeless industry and non-profits aren't of much help. \n\n\"Why should the government do anything when we can volunteer, donate, and pray? This man only pushed three women onto the subway track last year and has been arrested only 40 times - how dare you try to take away his freedom?\"",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CaptinACAB",
            "body": "The ratchet effect is part of being controlled opposition that is beholden to the owner class.",
            "score": 28,
            "replies": []
        },
        {
            "author": "Consistent_Cat3451",
            "body": "Libs only exist to stall progress of any sort of real leftist policies that benefit the working class.\n\nIn any developed nation, Dem would mostly fall on a center right category",
            "score": 25,
            "replies": []
        },
        {
            "author": "kgberton",
            "body": "Because they don't actually disagree with those policies",
            "score": 33,
            "replies": []
        },
        {
            "author": "4spooky6you",
            "body": "They're both beholden to the same Capital owners. If you want change you'll need a working class revolution.\n\nFor a revolution to work, you must first build a revolutionary movement; following these general steps:\n\n1) Raise class consciousness and awareness (through discussion and education)\n\n2) Organize locally with other socialists/communists, helping to build foundations for mutual aid/dual power structures \n\n3) Unionize your workplace\n\n4) General strike\n\n\nAs for #1, my recommended intro reading list:\n\nThe principles of communism - Engels (https://www.marxists.org/archive/marx/works/1847/11/prin-com.htm)\n\nSocialism utopian and scientific - Engels (https://www.marxists.org/archive/marx/works/1880/soc-utop/)\n\nThe state and revolution - Lenin (https://www.marxists.org/archive/lenin/works/1917/staterev/)\n\nThere's also a ton of good YouTube content if that's more your thing ( but you really should read the foundations of theory as well), highly recommend these channels as a good starting point:\n\nhttps://www.youtube.com/@SecondThought/videos\n\nhttps://www.youtube.com/@YaBoiHakim/videos",
            "score": 39,
            "replies": [
                {
                    "author": "howdybeachboy",
                    "body": "What do you think of this guy? I’ve seen him recommended to me: https://youtu.be/DDlQjkZZvTg",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DreBeast",
            "body": "Oh, this is my favorite part. When people start to connect the dots",
            "score": 25,
            "replies": [
                {
                    "author": "greenyadadamean",
                    "body": "💡",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "schlongtheta",
            "body": "Ratchet Effect -- Republicans push everything to the right, and Democrats prevent movement back to the left. \n\nDemocrats are \"controlled opposition\".  They are as owned and controlled by the billion dollar companies as Republicans. \n\nYou beat Fascism with Socialism and Communism. You don't beat Fascism with Capitalism because capitalists will always side with fascists (fascism does not threaten their capital). \n\nOnce you see that, you'll never un-see it.",
            "score": 9,
            "replies": []
        },
        {
            "author": "CrashCulture",
            "body": "It's called the ratchet effect.\n\nBoth parties are largely owned by the same kind of people, and therefore have mostly the same agenda. They can't be open about this of course, and must always appear to be fighting each other. So they play good cop bad cop.\n\nOne will do all the bad changes and earn credit among those voters who wants them, the other will cry foul and score points for verbally opposing it. They don't actually want to reverse those changes, but it is important for them to put on a show of doing so.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Forgotthebloodypassw",
            "body": "From [Bill Hicks](https://www.youtube.com/watch?v=ZLIPUDlRBFA) 25 years ago: \n\n“I think the puppet on the right shares my beliefs.” “I think the puppet on the left is more to my liking.” “Hey, wait a minute, there’s one guy holding out both puppets!” “Shut up! Go back to bed, America. Your government is in control. Here's Love Connection. Watch this and get fat and stupid. By the way, keep drinking beer, you fucking morons.\"",
            "score": 9,
            "replies": []
        },
        {
            "author": "Xpmonkey",
            "body": "Cause they are in the same party as the democrats.   Just another corporate political organization.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Inside-General-797",
            "body": "Bc for a lot of shit they are uniparty. Our politicians are all bought and sold by the same corporations. Its all just optics how they present it.\n\nThe don't be a pussy party vs the don't be an asshole party. Though they are both the party of sucking off big business.",
            "score": 6,
            "replies": []
        },
        {
            "author": "bowerboy_1",
            "body": "Neo liberals are essentially Republicans, there are very few progressive Democrats.\n\nCase in point, Democrats campaigned against progressive candidates harder than they ever did against any Republican in 2016 when Bernie ran in the primary. Pelosi backed a Republican leaning house Democrat in Texas who was corrupt over a progressive candidate. \n\nYou don't get a Trump presidency without neo liberalism. They talk and promise the world then when they win, throw breadcrumbs to constituents. They don't hesitate to push for salt tax removal, raises, or acting like they have no power when they control the house, senate, and presidency, because the parliamentarian who has no authority says they don't recommend legislation.\n\nPeople got fed up with ineffective losers and made poor choices because they were shamed by blue MAGA (neo liberals)",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 79,
            "replies": [
                {
                    "author": "spicy-chilly",
                    "body": "*Harm maximization. It does absolutely nothing to stop both parties from moving right, which is the default since the Democratic Party is a bourgeois imperialist party, so \"lesser evil\" voting axiomatically applied to opponents in each isolated election is an incorrect algorithm for harm reduction and all you end up doing is browbeating people into supporting *greater and greater* evil every election. We saw this in real time when Democrats went from saying people needed to vote blue for kids in cages to saying \"leave the kids in cages and massacre tens of thousands of kids\" in just 4 years. It's been happening for a long time and especially after the DLC/Third Way takeover of the party.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "spicy-chilly",
                                    "body": "No, you organize your workplace and your community, join PSL, help out with the 2028 general strike, and slap any liberals in the face who say they're going to support a genocidaire.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -13,
                                            "replies": [
                                                {
                                                    "author": "spicy-chilly",
                                                    "body": "Yes it did. What didn't work out was liberals nominating a genocidaire. That was the cause of the loss and will be next time too if they do it again. The harm maximization has crossed the absolute limits of the masses.",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": -11,
                                                            "replies": [
                                                                {
                                                                    "author": "spicy-chilly",
                                                                    "body": "Are you trying to browbeat people into always supporting fascist mass slaughter right now? Cross reference my first comment.",
                                                                    "score": 17,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "spicy-chilly",
                                                                                    "body": "You are doing exactly what I said you are. You are trying to \"but Trump\" your way into people always supporting fascist mass slaughter going forward as both parties move right—maximizing harm. You are the one not being realistic either. Liberals not nominating genocidaire monsters is something realistic, convincing the masses to cross the fascism rubicon just so that genocidaire Democrats can be politically viable is not realistic. \n\nAnd no offense, but framing other people as causing harm for a \"purity test\" when you're the one supporting arming fascist mass slaughter is scummy, and I have spoken to plenty of Palestinians and they were not saying to vote blue for the people decimating Gaza. 🤷‍♂️",
                                                                                    "score": 16,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Every-Ad3280",
                                                                                            "body": "I think you overestimate how much the average person cares and you sold out Palestinians to prove a point in the process.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "poteland",
                                                                                                    "body": "Ah yes, famed palestinian advocate Kamala Harris would defintely have saved them.",
                                                                                                    "score": 13,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "spicy-chilly",
                                                                                                    "body": "I know I don't because I looked into the polling and a huge supermajority of everyone who aren't republicans opposed sending arms and supplies to Israel and polling in several swing states showed that ~34% were more likely to vote for Harris had she supported an arms embargo with only 7% less likely. It's literally the reason why she lost and the cause was liberals nominating Biden, the party doubling down on nominating a replacement genocidaire, and Harris refusing to comply with popular policy that would make her far more likely to win—nobody else caused the loss.\n\nAnd your accusations are completely inverted, you are fine with fascist mass slaughter, downplaying how much people care to avoid acknowledging the culpability of liberals for the loss, and trying to browbeat people into supporting fascist mass slaughter going forward because you have decided it is acceptable to throw all non Americans under the bus and \"fascism for thee but not for me\" is acceptable to you indefinitely going forward. In reality this entire conversation is proving my point that \"blue no matter who\" is harm maximization and your knee jerk reaction is all because you haven't yet understood the horrors of you successfully browbeating the masses to the other side of the rubicon.",
                                                                                                    "score": 8,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gingerbeardman79",
                    "body": "Where's this \"harm reduction\" you speak of? I haven't seen fuck all in decades.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "schlongtheta",
                            "body": "The \"harm reduction\" was you *not* getting medicare for all, while also giving away billions of dollars to do a proxy war with a nuclear power (the Ukraine/Russia war) and giving away billions of dollars to do *an entire genocide* (the extermination of Palestinians in Gaza). \n\nObviously (I hope it's obvious), I am disgusted by the Democratic Party for being the party of War even more loudly than the Republican party has traditionally been the party of War.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "lasercat_pow",
                                    "body": "more than one genocide -- biden also (by proxy) funded the RSF who are committing genocide in Sudan, and of course biden is also complicit in the congolese genocide by not doing anything about it.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "schlongtheta",
                                            "body": "Biden also voted YES on the Iraq War (just like Hillary did). A lot of us oldheads can never forget that. \"Weapons of mass destruction\" they told the world. A horrible career of violence, around the world, and locally in his own country. (He led the way with the 1990s crime bill that led to mass incarceration and unlimited police brutality without accountability).",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "gingerbeardman79",
                                    "body": "I was picking up what you were putting down from the start. Well said.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Lethkhar",
                                    "body": "The Democrats with single-party rule in my state passed a bill last year outing trans students to their parents.",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "Lethkhar",
                                                    "body": "It is literally a [Parents Bill of Rights](https://ospi.k12.wa.us/data-reporting/protecting-student-privacy/implementation-i-2081-parents-bill-rights) law based on the same law in Louisiana.\n\nFrom the OSPI website:\n\n>The initiative states that parents and legal guardians have the right to inspect their child’s public school records, a right that is already outlined in existing law. However, **the initiative defines what constitutes as a “record,” to include items such as medical or health records; records of any mental health counseling; and any other student-specific files, documents, or other materials maintained by the school.**\n\nYou might be forgiven for thinking this section was not actually implemented, since a lower court issued a temporary stay specifically around this section. But as the OSPI website points out, the lawsuit was later dismissed by a Democratic judge. Current WA law creates a chilling effect where trans students cannot seek public school mental health resources without their parents having access to those records.\n\nTo steel man your position: your strongest defense of the Democrats here would be to point out that some of them are now trying to amend it. But defending the Parents Bill of Rights as pro-LGBTQIA+ is just spitting on those of us who are actually affected by this shit.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "A-CAB",
                                                                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "A-CAB",
                                                    "body": "Lesser-evil rhetoric in relation to elections or current policies is prohibited. Dismissing voting third party because they are “useless” or because you are “throwing your vote away” also violates this rule. It also encompasses saying Trump is “worse” for Gaza, as that place is already completely destroyed. Trump is merely carrying out what the american ruling class started under Biden. Resorts being built and mass relocation were already happening under Biden and Kamala would’ve continued it.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "gingerbeardman79",
                                    "body": "I mean you're talking to a trans person with a trans kid. Kamala's answer to the question of protecting trans kids was basically [and I'm paraphrasing, here] \"fuck every kid that lives in the wrong state idgaf\".\n\nWasn't all that *materially* different from the Dems' answer to protecting women's rights...",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "tabas123",
                                            "body": "Also she never once spoke about protecting trans kids on the campaign trail despite Republicans constantly saying she did. Flat out not true.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "gingerbeardman79",
                                                    "body": "You're right, that *would* be disingenuous. \n\nI'm not suggesting they are the same. \n\nI'm merely stating that while, yes, the Republicans actively attack us and they are worse for us and many other vulnerable groups in the present, the Democrats have also largely not lifted a finger at the federal level to protect *anybody's* rights. \n\nThey've had many opportunities to do so. [multiple supermajorities, startling new powers given to the oval office *during Biden's term*, etc]\n\nSo why haven't they? I offer two reasons:\n\n 1 Because then they'd have no ammunition for the Republican gun they hold to vulnerable voters and progressives alike every two years. \n\n 2 Because they are beholden to all the same big donors/lobbyists that help get the assholes across the aisle elected. And because they serve the same people with the same monied interests, they have the same ultimate goals as the aforementioned assholes. \n\nThey simply play a different role in creating the illusion of choice in order to continue the advancement of both parties' *real* agenda: further enriching the already ultra-wealthy [their owners].\n\nWhile ofc simultaneously co-opting any leftist movements that develop in order to subvert and destroy them from the inside before they can gain real momentum. [this is specifically the goal of the \"progressive\" wing of the party]\n\n[see \"The Ratchet Effect\" on the broader interwebs for more info]",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "None",
                                                                                            "body": "[removed]",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "A-CAB",
                                                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "A-CAB",
                                                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "schlongtheta",
                                                    "body": "Does everyone see that Democrats (including this commenter bellatricked) do not care about trans kids? \n\n\"Yes these are all bad things, but...\" (A good saying to keep in mind is, \"Everything after the word \"but\" is a lie.\")",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "A-CAB",
                                                                    "body": "Lesser-evil rhetoric in relation to elections or current policies is prohibited. Dismissing voting third party because they are “useless” or because you are “throwing your vote away” also violates this rule. It also encompasses saying Trump is “worse” for Gaza, as that place is already completely destroyed. Trump is merely carrying out what the american ruling class started under Biden. Resorts being built and mass relocation were already happening under Biden and Kamala would’ve continued it.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "A-CAB",
                                    "body": "Lesser-evil rhetoric in relation to elections or current policies is prohibited. Dismissing voting third party because they are “useless” or because you are “throwing your vote away” also violates this rule. It also encompasses saying Trump is “worse” for Gaza, as that place is already completely destroyed. Trump is merely carrying out what the american ruling class started under Biden. Resorts being built and mass relocation were already happening under Biden and Kamala would’ve continued it.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "No-Candidate6257",
                                    "body": "Impressive, you got caught by a single wedge issue.\n\nI guess committing genocide against Palestinians is worth it for having marginally better rights for some fringes of some small majority of people in your country.\n\n[Stop voting for the lesser evil. It's not cool.](https://www.reddit.com/r/LateStageCapitalism/comments/1izli9g/why_dont_democrats_ever_reverse_bad_republican/mf3tpqd/)",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "No-Candidate6257",
                                                    "body": "Yes. A wedge issue. Only about 0.95% of the US adult population identifies as transgender. Most of the adult population (97.35%) self-identifies as cisgender. And voting for a party because it (very marginally and half-heartedly) improves the lives of less than 1% of the population - specifically as a stereotypical rainbow liberal political move, not because they actually care about you - is probably the most perfect example of a wedge issue that exists in current mainstream politics, massively utilized to split the voting base into two camps by both sides of the fascist uniparty.\n\nBut yes, yes, I get it. Your personal wellbeing is more important than the suffering of billions worldwide.\n\nI guess committing genocide against Palestinians is worth it for having marginally better rights for some fringes of some small majority of people in your country. After all, you are part of that minority and, therefore, that's the only thing you care about.\n\n\"I don't care if he's drone striking weddings. I still vote for Obama because he's black.\"-vibes.\n\n[Stop voting for the lesser evil. It's not cool.](https://www.reddit.com/r/LateStageCapitalism/comments/1izli9g/why_dont_democrats_ever_reverse_bad_republican/mf3tpqd/)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "gingerbeardman79",
                                    "body": "Wouldn't be all that different from life disabled and trans so far...",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "askouijiaccount",
                    "body": "Harm reduction? If you say so, buddy. ",
                    "score": 9,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "askouijiaccount",
                                    "body": "Voting blue doesn't reduce harm. Gtfo with that lib shit. ",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "A-CAB",
                                    "body": "Lesser-evil rhetoric in relation to elections or current policies is prohibited. Dismissing voting third party because they are “useless” or because you are “throwing your vote away” also violates this rule. It also encompasses saying Trump is “worse” for Gaza, as that place is already completely destroyed. Trump is merely carrying out what the american ruling class started under Biden. Resorts being built and mass relocation were already happening under Biden and Kamala would’ve continued it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "A-CAB",
                    "body": "Lesser-evil rhetoric in relation to elections or current policies is prohibited. Dismissing voting third party because they are “useless” or because you are “throwing your vote away” also violates this rule. It also encompasses saying Trump is “worse” for Gaza, as that place is already completely destroyed. Trump is merely carrying out what the american ruling class started under Biden. Resorts being built and mass relocation were already happening under Biden and Kamala would’ve continued it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "squeezymarmite",
            "body": "This is exactly why it is not hyperbolic to say that we are witnessing the collapse of the US right now. Once Trump-Musk have broken institutions, who will fix them? Even if there is another election, historically speaking, once things are broken they stay that way.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Niaboc",
            "body": "Because Democrats are the shield of the rich, Republicans are the sword",
            "score": 11,
            "replies": [
                {
                    "author": "tabas123",
                    "body": "Can’t believe I’ve never heard this analogy before. What a banger.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "kenkanoni",
                    "body": "Damn, what a nice quote!\n\n![gif](giphy|YS8c0Z7in21AM4A2AR)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sizzmo",
            "body": "Good answers here.\n\nBut in reality it's the fundamental ideology of Neoliberalism. \n\nNeoliberalism by nature concedes to conservatives on how the country should be run. Yes, corruption of course plays a part but corruption is also a part of the neoliberal ideology. \n\nNeoliberals also do not believe in systemic change for any real issue the country faces. They only believe that individuals should have the *opportunity* to change things for themselves.\n\nConservatives believe in systemic change. And when you have two ideologies where one believes in systemic change, and the other does not, you have a political ratchet effect where the overton window shifts to the ideology that believes in systemic change.\n\n\nThere are so many examples of this in effect\n\n- Abortion rights not being codified into law\n\n- Tax cuts never being reversed \n\n- Minimum wages staying stagnant \n\n- Workers being stripped of union rights\n\n- Stripping government programs\n\n\nIn each instance, conservatives enact systemic change, and Neoliberals agree on the conservative framing and only allow for individuals to solve their own problems, with the government only there to maybe support the individual in solving those problems, means tested of course.",
            "score": 5,
            "replies": []
        },
        {
            "author": "LostSectorLoony",
            "body": "Controlled opposition",
            "score": 7,
            "replies": []
        },
        {
            "author": "No_Manufacturer_1911",
            "body": "Because they are capitalists.\n\nThey’re also at war with you.",
            "score": 5,
            "replies": []
        },
        {
            "author": "atomicfuthum",
            "body": "From an foreigner's perspective (mine from Brazil)... these two parties are like, two sides of the same coin, having the same decisions and impact.\n\nI've seen many presidents and governments since like, the 90s (I'm 39) and like, it all blends.",
            "score": 8,
            "replies": []
        },
        {
            "author": "NoooDecision",
            "body": "Because they don't want to do the things they pretend to want to do. They haven't wanted to for many decades.",
            "score": 17,
            "replies": []
        },
        {
            "author": "SplendidMrDuck",
            "body": "Dems are bought and paid for by big money interests, folks like Mike Bloomberg have a stranglehold on the party to ensure that progressivism is snuffed out and neoliberal corporatists and their pet projects are the only thing that matters to the DNC.",
            "score": 18,
            "replies": []
        },
        {
            "author": "escopaul",
            "body": "It's called the Ratchet Effect.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Abyssal_Aplomb",
            "body": ">The United States is also a one-party state but, with typical American extravagance, they have two of them. - Julius Nyerere",
            "score": 4,
            "replies": []
        },
        {
            "author": "MizzyMorpork",
            "body": "It’s controlled opposition.  It’s why the people don’t get what they want in gov",
            "score": 4,
            "replies": []
        },
        {
            "author": "jeffdschust",
            "body": "Because the Democrats are two things:\n1) Useless cowards\n2) A center-right Conservative Party that cares only a tiny smidgen for regular people.  It’s better than ZERO caring, but it ain’t far off.",
            "score": 5,
            "replies": []
        },
        {
            "author": "spectaclecommodity",
            "body": "Class power. They are both bourgeois parties that represent different factions of capital.",
            "score": 5,
            "replies": []
        },
        {
            "author": "JFCGoOutside",
            "body": "Their job is to stop any moving left and they do that job well. This system only flows in one direction like a river.",
            "score": 5,
            "replies": []
        },
        {
            "author": "UpsideClown",
            "body": "Red team is the ratchet and Blue team is the pawl, and they work together to keep thing moving in one direction.",
            "score": 5,
            "replies": []
        },
        {
            "author": "machine_logic",
            "body": "Their bosses don't want them to.",
            "score": 5,
            "replies": []
        },
        {
            "author": "SnapesGrayUnderpants",
            "body": "Because the lesser of two evils is still fucking evil.",
            "score": 5,
            "replies": []
        },
        {
            "author": "puffz0r",
            "body": "Because the Democrats are Republicans minus the outright racism.",
            "score": 6,
            "replies": []
        },
        {
            "author": "left1ag",
            "body": "Democrats hold the line. Republicans move it to the right.",
            "score": 19,
            "replies": [
                {
                    "author": "askouijiaccount",
                    "body": "Democrats don't hold shit ",
                    "score": 14,
                    "replies": [
                        {
                            "author": "left1ag",
                            "body": "I don’t mean “hold” as in “protect”. I mean “hold” is in “obstruct and stagnate”",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "askouijiaccount",
                                    "body": "Yeah I'm not stupid. My point stands. ",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ferenczi_Dragoon",
            "body": "Dems and republicans are like a ratcheting wrench for the corporate class. Republicans pull to the right (deregulate, pro business, cut spending, cut taxes), dems lock the progress. ",
            "score": 8,
            "replies": []
        },
        {
            "author": "wozudichter",
            "body": "Minnesota chiming in!  Feel like politics here have been a strong separator between dem and repub values.  Strong social safety net, great Medicaid program, free school lunches, strong investment in education etc… sad to hear it’s not like every state, but I’m glad for the environment we have here and attribute it to our local government!",
            "score": 4,
            "replies": []
        },
        {
            "author": "DiscerningBarbarian",
            "body": "It's called controlled opposition. It makes it seem like there are two sides when there really is only one, which is money.",
            "score": 3,
            "replies": []
        },
        {
            "author": "bezos-is-a-POS",
            "body": "Scratch a liberal and a fascist bleeds",
            "score": 5,
            "replies": []
        },
        {
            "author": "sagan999",
            "body": "Because if they fix the problem, they can't campaign on fixing the problem next time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Hands",
            "body": "Because they don't actually want to.  It's by design.  All dems actually give a shit about is money and plausible deniability not actually making things better or addressing any of our many many problems.  Hope that helps",
            "score": 4,
            "replies": []
        },
        {
            "author": "Osiris_Raphious",
            "body": "One big pro corporate uniparty.",
            "score": 5,
            "replies": []
        },
        {
            "author": "homonculus_prime",
            "body": "Look up \"sham opposition party.\" That's it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "remotereyy",
            "body": "they are part of the same team",
            "score": 4,
            "replies": []
        },
        {
            "author": "tsulegit",
            "body": "Can’t send fundraising emails if there aren’t crowbars left in the spokes!",
            "score": 3,
            "replies": []
        },
        {
            "author": "AndyNemmity",
            "body": "Because their donors want them too. That's the reason. It's been like this since the 80s.\n\nThe democrats are a right wing party.",
            "score": 5,
            "replies": []
        },
        {
            "author": "yetanotherweebgirl",
            "body": "Because just like in other countries with bipartisan electoral systems, both sides benefit personally from legislation or decisions that move power and wealth from the 99% to the 1%.\n\nRegardless which party you vote for in a bipartisan democracy (including multi-party ones that favour first past the post, effectively ensuring only the 2 biggest ever have a majority), you’re giving power to the privileged to keep making decisions that only benefit the privileged.\n\nImagine it like this: it’s the same asshole but they sometimes put on a fake moustache and wear a different color shirt",
            "score": 5,
            "replies": []
        },
        {
            "author": "LuvLaughLive",
            "body": "Great question!  I've wondered the same for years. Esp when we have had a democratic majority in all 3 houses at times.",
            "score": 5,
            "replies": []
        },
        {
            "author": "rkmyers83",
            "body": "The lobbyists that fund republicans also fund the democrats.  The democrats give us crumbs.  That’s the only difference.  Corporate owned dems rig the primaries and are useless.",
            "score": 4,
            "replies": []
        },
        {
            "author": "westsidefashionist",
            "body": "Most Democrats are Republicans bro. It’s not two parties. It’s just one party. The wealthy control them both. That’s why they don’t reverse policies and Democratics engage in wars just like George Bush did. They are almost the same.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Velociraptortillas",
            "body": "Because YOU are not their constituent.\n\nThey're hoping you don't notice",
            "score": 3,
            "replies": []
        },
        {
            "author": "chuuckaduuck",
            "body": "Republicans do bad shit in a bad light,\n\nDemocrats do bad shit in a good light.",
            "score": 5,
            "replies": []
        },
        {
            "author": "blorpdedorpworp",
            "body": "It is much more difficult to build than to destroy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "lngfellow45",
            "body": "BECAUSE THEIR OWNERS SUPPORT THEM!",
            "score": 3,
            "replies": []
        },
        {
            "author": "spacegamer2000",
            "body": "Remember when Obama ran on repealing the bush tax cuts? They were set to expire if democrats did nothing, but they were going to repeal them first. Then for some reason they never explained, the Obama democrats made the bush tax cuts permanent.",
            "score": 3,
            "replies": []
        },
        {
            "author": "amadeus451",
            "body": "Because they see us as their assets, not their constituents.  We're so close to finally getting common people to see the depth and breadth of the class war!",
            "score": 11,
            "replies": []
        },
        {
            "author": "Grandmas_Cozy",
            "body": "Both parties exist to protect capitalism . They just have different messaging",
            "score": 4,
            "replies": [
                {
                    "author": "Other-Net-3262",
                    "body": "It's the rich against the poor. Why can't people understand this. Divide and conquer is how they maintain power.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Other-Net-3262",
                            "body": "The stock market feeds the beast ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "apiaryaviary",
            "body": "https://preview.redd.it/w5femej1fqle1.jpeg?width=1290&format=pjpg&auto=webp&s=ea747f55b516cb0b2f72a6c0c8da40a69a6d9397\n\nBecause of this attitude",
            "score": 3,
            "replies": []
        },
        {
            "author": "kestrel808",
            "body": "Because they share the same donor base as the Republicans and the donor class by and large likes those policies.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Key-Ad-3981",
            "body": "Because those ‘bad’ Republican policies aren’t really all that bad for the Democratic elites.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Thogicma",
            "body": "Because it's one big uniparty.  Republicans are there to put the policies in place, Democrats to feign helplessness and do nothing when people decide they'd like a different flavor of conservative this go-round.\n\nBut don't worry, in 4 years they'll be telling you democracy is on the ballot and a million idiots will tell you that you're a literal Nazi if you won't vote for them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "domewebs",
            "body": "The Ratchet Effect explains everything\n\n https://stopmebeforeivoteagain.org/stopme/chapter02.html",
            "score": 3,
            "replies": []
        },
        {
            "author": "FlyingFalcor",
            "body": "Cuz they only a few % points off from being the same scum the Republicans are. People complain about non voters but we almost out number both sides combined at this point. Why can't people see the writing on the wall. We are done with this bs \"choice\" between two money grubbing heads of the same evil beast. The only option is completely open access for new parties to form and a true popular vote to be put in place. The oligarchs have it easy with the current two party system pay both sides and always win. If there were a dozen even dozens of different parties running candidates someone is bound to have that undeniable spark and get the votes from the general public to win (even though there is a good chance they'd get shot at some point). I don't have any answers I just know this system is a sham and there are countless brilliant amazing humans in our country whose kids and grandkids deserve better than what they're gonna get.",
            "score": 3,
            "replies": []
        },
        {
            "author": "i_am_replaceable",
            "body": "Just saying all the answers here is what other side cites as well at times when they are coherent.  I know other side is misinformed but they are also right that during Dems in charge, not much changes.  We are getting played. There was a ranked choice ballot question in Nevada, guess what? Both Dems and Republicans opposed it.  That tells you everything there is to know.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Mobile_Ask2480",
            "body": "because they like it",
            "score": 3,
            "replies": []
        },
        {
            "author": "rainofshambala",
            "body": "Because they are not there to reverse bad policies, they are there to keep the people calm and make them think they have an option all they have to do is reform the Democratic party.",
            "score": 3,
            "replies": []
        },
        {
            "author": "wade_garrettt",
            "body": "Because they don’t want to",
            "score": 3,
            "replies": []
        },
        {
            "author": "WeenFan4Life",
            "body": "Corporate donors",
            "score": 3,
            "replies": []
        },
        {
            "author": "cneakysunt",
            "body": "Overton window.\n\nThey're all culpable.",
            "score": 3,
            "replies": []
        },
        {
            "author": "FeralGuyute",
            "body": "Same with Cuba,  Obama tried to normalize relations, Trump renegged, biden doubled down on Trump policies.  Same with China, same with Iran, the list goes on.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Chaetomius",
            "body": "First, they allow themselves to be forced to have a 60% majority requirement so they can't do it.\n\nThen, when they have that: b-b-b-b-but the parliamentarian!\n\nand so on and so forth. always an excuse.\n\nthey don't want to win, actually.",
            "score": 3,
            "replies": []
        },
        {
            "author": "commie_1983",
            "body": "dullards and sharpheads.",
            "score": 3,
            "replies": []
        },
        {
            "author": "juanchopancho",
            "body": "They are Republican lite.  Lesser evil. Still evil. Controlled opposition. They serve the same masters aka billionaires. Politically incompetent. Braindead messaging. Even if they lose they still get paid and dgaf.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Raenoke",
            "body": "They're on the same team",
            "score": 3,
            "replies": []
        },
        {
            "author": "pgm_01",
            "body": "People need to understand that Washington is not broken, rather it runs the way the politicians want it to. Part of that is making it a sport, Red vs Blue. When Red flagrantly fouls Blue, Blue boos while Red cheers. When Blue commits the same foul, Blue cheers while Red boos. By keeping people engaged with a specific team, the real game of robbing the poor to feed the rich continues unabated. Social issues are used to distract from economics, so Democrats will do a bare minium to \"fix\" a problem because it keeps the problem around to be used in the next election cycle. \n\nObamacare is the ultimate example. It did improve things, but didn't fix the system and left plenty of loopholes that have now been exploited to their maximum, making healthcare too expensive once again. People have been trying to improve healthcare in this country since before FDR, and yet every fix to the system is a patch that gets exploited until people can't take it anymore and a new patch is created. The demand for profits in the system is always in the foreground in any discussion, instead of the needs of the people. This same dynamic plays out on every topic. We can't do that much about global warming because it hurts fossil fuels. Both parties will put profits over people; Democrats are willing to throw a few bones to the people, while Republicans are not.",
            "score": 3,
            "replies": []
        },
        {
            "author": "morpheuseus",
            "body": "I honestly feel that democrats are useless on purpose. And that everyone with money is in on the scheme to ruin the world for capital.",
            "score": 3,
            "replies": []
        },
        {
            "author": "moosehunter87",
            "body": "Just because the democrats are to the left of the republicans it doesn't make them a left wing party. America has a far right and a right wing. That's it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BladeofDudesX",
            "body": "Because then what would they run on?",
            "score": 3,
            "replies": []
        },
        {
            "author": "MisterAnderson-",
            "body": "Google “the ratchet effect”. \n\nThanks for coming to my TED talk.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Accurate-Exercise845",
            "body": "Ratchet effect",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "Two sides of the same coin.",
            "score": 5,
            "replies": []
        },
        {
            "author": "epsteinpetmidgit",
            "body": "Because both parties are owned by the billionaires.   Dems  vs Republican is just a show to distract the masses",
            "score": 3,
            "replies": []
        },
        {
            "author": "WatchThatLastSteph",
            "body": "Because they're two teams playing for the same side: the rich side.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Nearby-Jelly-634",
            "body": "Because they all jack off to the status quo. It’s the core of neo-liberalism.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Valendr0s",
            "body": "They sometimes do. But obviously not enough.\n\nThe last time the Democrats had enough of a majority to actually reverse something, it was Obama's first term. And everything they tried to do was basically blocked by one \"democratic\" senator. And they lost that supermajority very quickly to a special election.\n\n---------\n\nBut the real reason is because they're Democrats, not progressives. And since the Republicans are all basically in lock-step, a Democrat is more just 'anybody who isn't a Republican' - so it's a big tent. And it's hard to get enough votes - they have issues with coalition building.\n\nThe Democrats don't have as good of a propaganda media arm that gets all their followers to believe in immigrants eating dogs & cats. And if they did, they still wouldn't be able to convince their voters to agree on anything.\n\nSo Republicans get insane shit passed in lockstep.\n\nAnd even if Democrats controlled every seat, they would still disagree too much to pass anything progressive.\n\n---------\n\n*EDIT* - the #1 thing the Dems can and should do... Filibuster everything possible. Force the Republicans to abolish it. Otherwise, the Dems will act as though their hands are tied, just so maintain a filibuster that they never use and the Republicans will use at every opportunity anyway. It's both sides playing with two different sets of rules.\n\nObstruct and Filibuster. Be the assholes the right says you are. Their followers believe it anyway, you lose nothing by obstructing. But you might just gain some respect of the left. And you get to force them to do away with the one thing that makes it so you can't get anything done if we ever do get a majority again.",
            "score": 2,
            "replies": [
                {
                    "author": "DontrentWNC",
                    "body": "Best answer ITT",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "cheese_scone",
            "body": "Because it's not red vs blue it's the 1% vs you!",
            "score": 2,
            "replies": []
        },
        {
            "author": "dmots10",
            "body": "It's a big club, and you ain't in it",
            "score": 2,
            "replies": []
        },
        {
            "author": "ilir_kycb",
            "body": "> Why don't Democrats ever reverse bad Republican policies when they are in charge? \n\nThe more interesting question is why would they want to?",
            "score": 2,
            "replies": [
                {
                    "author": "Beginning_Ground9472",
                    "body": "True, there’s no monetary gain in progress, only status quo.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ilir_kycb",
                            "body": "I think you have a fundamental misunderstanding of the motivation and function of the Democratic Party (no offense intended).\n\nDemocrats and Republicans primarily serve the interests of capital and thus have virtually no difference in their political goals. There are only minimal real differences in that the Democrats tend to represent the interests of international capital while the Republicans tend to represent the interests of national capital. The differences on cultural issues between the parties are just theater for the voters (divide and conquer).\n\nFor a closer look at how liberal “democracies” work, this is a good video: [Your Democracy is a Sham and Here's Why: - YouTube](https://www.youtube.com/watch?v=oYodY6o172A)\n\n> Liberals whine and complain about what Republicans due but once they win, suddenly those policies never existed.\n\nWhat the parties say publicly what they want is practically just propaganda nonsense. Their primary purpose is to create legitimacy for the system by creating the illusion of choice (political participation).",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aglobalvillageidiot",
            "body": "There will always be enough \"centrists\" to block any effort at change from the crew who are interested in it. \n\nPowerful people are disinclined to vote against systems that made them powerful.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdaptablyResponsible",
            "body": "Historical review of the two parties actions demonstrate they are on the same side and play off each other.",
            "score": 2,
            "replies": []
        },
        {
            "author": "nthitz",
            "body": "They do somewhat. https://www.politico.com/interactives/2021/interactive_biden-first-day-executive-orders/ has a list of Biden day one actions including some reversals of Trump policies",
            "score": 2,
            "replies": []
        },
        {
            "author": "haloarh",
            "body": "Didn't Obama make the Bush tax cuts permanent?",
            "score": 2,
            "replies": []
        },
        {
            "author": "peacefulsolider",
            "body": "same dish different flavour",
            "score": 2,
            "replies": []
        },
        {
            "author": "rustbelt",
            "body": "Dem leadership needs the status quo to maintain their class positions. What this means is they take money from the oligarchs, and become only responsible to their needs as that is who they choose to serve. \n\nCitizens United could’ve been undone with Obamas supermajority or another times. Here we are.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kudos2Yousguys",
            "body": "Once a policy is in place, it's now \"the way it is\", it's the new status quo. Liberals can only protect the status quo, they can never upset it. They may oppose changing the status quo, but once it's changed, it's by definition, the status quo, so they must preserve it.  \n\nIt's, for me, the main infuriating thing about liberals",
            "score": 2,
            "replies": []
        },
        {
            "author": "blackrose14",
            "body": "https://preview.redd.it/alt3r0qbzqle1.jpeg?width=1170&format=pjpg&auto=webp&s=9a8ec30ef98cd1bbdc433282fc8fcf907ea0de36",
            "score": 2,
            "replies": []
        },
        {
            "author": "vurto",
            "body": "Both sides are bought out. Each side will say whatever needs to be heard to get the votes while each side works towards the same goals... power and money... there's no conflict there at all. The only conflict happens in our minds.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TieTheStick",
            "body": "I left the Democratic party last week. Everyone should do the same.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Anti_colonialist",
            "body": "That's how their ratchet effect works. Now that Republicans have shifted even further to the right the DNC will fill the void left by Republicans.",
            "score": 2,
            "replies": []
        },
        {
            "author": "zodiackodiak515",
            "body": "Because they want something to campaign against. Because “we fixed it! Let us keep fixing it!” Isn’t a good campaign slogan",
            "score": 2,
            "replies": []
        },
        {
            "author": "KudaCee",
            "body": "read Gramsci",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mr_Marc_longlastname",
            "body": "Millionaires gonna millionaire.",
            "score": 2,
            "replies": []
        },
        {
            "author": "New_Breadfruit5664",
            "body": "Cuz it's the American capitalist unity party why should it cannibalize its own policies?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pankeopi",
            "body": "Tbf, it feels impossible to criticize Obama on the left, even people that acknowledge the terrible things he's done have to include how charismatic he is, etc.\n\nThe main exception is when Bernie gathered enough protesters to stop him from making cuts to Medicaid. Even then, you didn't see Bernie outright criticize Obama himself.\n\nIt's one of the biggest problems with Democrats, not acknowledging Obama's role in the rise of Trump. It's still political suicide to do so.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "The democratic party is the HR of our government. They’re not there to help us but to keep the government safe.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TacoMullet",
            "body": "Because they are two birds that share one feather or something I hear.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Daringdumbass",
            "body": "Because they’re cowards who’ve betrayed this country for decades. Anybody in those positions of power are complicit as long as they’re complacent. They’re not against those policies, they just pretend to be so they can get more approval and votes from the public. Then literally never follow through with their promises. They’re liberals, I wouldn’t expect anything less.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Existing_Gift_7343",
            "body": "Our government, whether it's a democratic or republican, is not on our side. They are on the side of all the money they collect from all their crooked dealings that 100% affects all of us in the negative. We're on our own, and it's only going to get worse. Homelessness is going to skyrocket, as we're all seeing prices are going to shoot higher than most people can afford. More and more people will lose their jobs, retirement, etc. it's going to get so much worse. But I blame the fucking idiots who voted for that piece of shit. But they're going to get their karma and I'm so down to watch their demise, their, desperation. It's nice to see karma in action!! Democrats are just sitting there with their thumbs up their asses waiting for RUMP, to kill them. Like I said, we're on our own.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Late_Again68",
            "body": "Because they're fine being the pawl to the Republican ratchet. It suits their aims perfectly.",
            "score": 4,
            "replies": []
        },
        {
            "author": "traanquil",
            "body": "Dems are controlled opposition. Elites own both parties and win no matter what. The purpose of the Democratic Party is prevent the country from moving left",
            "score": 3,
            "replies": []
        },
        {
            "author": "DrCarter90",
            "body": "Because they can’t rally us without a boogyman.",
            "score": 1,
            "replies": []
        },
        {
            "author": "randomindyguy",
            "body": "“The United States is also a one-party state but, with typical American extravagance, they have two of them.”\n\nThe Democratic Party is where any left-leaning ideas go to die in America. An occasional actual progressive makes their way to Washington. The Democratic machine is sure to always tamp down on Leftist ideas when they actually have an opportunity to enact them.\n\nLike why don’t states like CA, NY, or MN have universal healthcare? They’re supposed bastions of leftism. Yet they somehow manage to work in the edges of progressive ideas, never making bold policy decisions.\n\nSo they’ll spew some leftist rhetoric here and there to suck people in locally. Once they get up to the state and federal level, progressivism is only allowed to the extent it doesn’t upset capitalist donors.\n\nDon’t get sucked in to the Democrat capitalist machine. Organize locally.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SuckMyDickNBalls69",
            "body": "Controlled opposition.",
            "score": 2,
            "replies": []
        },
        {
            "author": "taooffreedom",
            "body": "Controlled opposition does that.",
            "score": 4,
            "replies": []
        },
        {
            "author": "weirdmountain",
            "body": "Left wing, right wing… same vulture.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DBFool2019",
            "body": "Because they share those policies.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AntiauthoritarianSin",
            "body": "Ratchet effect. They all want to move to right because that's where the money is.",
            "score": 2,
            "replies": []
        },
        {
            "author": "askouijiaccount",
            "body": "Are you seriously asking this question or just trying to make a point? ",
            "score": 2,
            "replies": []
        },
        {
            "author": "The_Sex_Pistils",
            "body": "Ratcheting is real",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ammonia13",
            "body": "Two sides of the same coin. \n\nWe have no choice under this system it will keep ratcheting right- if it’s possible to go more right in the next couple years.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "It’s easier for dems to piss off regular people than billionaires",
            "score": 2,
            "replies": []
        },
        {
            "author": "EndOfTimes_Official",
            "body": "Both parties benefit from exploiting the population,  Democrats by forcing extended timelines to solutions in order to milk profits from the investments and Republicans by directly exploiting human workers for capital. Democrats and Republicans are both capitalist parties which only succeed by creating static differences in living conditions to stratification the exploitation and encourage self-derision through the abundance of suffering and gross negligence and unfairness.",
            "score": 2,
            "replies": []
        },
        {
            "author": "faustoc5",
            "body": "It's called theater politics, they are just pretending to be against. \n\nThat way the law that they are in favor is passed but people believe they are not as evil as republicans.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beckland",
            "body": "The Senate filibuster: Bills need 60 votes to avoid a filibuster. Even when Dems have a majority, 51 votes is not enough to overcome the filibuster.",
            "score": 2,
            "replies": []
        },
        {
            "author": "chr20b",
            "body": "\"The Kingdom of Conscience will be exactly as it is now. Moralists don't really *have* beliefs. Sometimes they stumble on one, like on a child's toy left on the carpet. The toy must be put away immediately. And the child reprimanded. Centrism isn't change -- not even incremental change. It is *control*. Over yourself and the world. Exercise it. Look up at the sky, at the dark shapes of Coalition airships hanging there. Ask yourself: is there something sinister in moralism? And then answer: no. God is in his heaven. Everything is normal on Earth.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Freshprinceofpepe",
            "body": "Cause they both serve the same corporate intrests",
            "score": 1,
            "replies": []
        },
        {
            "author": "wastingtoomuchthyme",
            "body": "Democrats are just the pawl for the GOP to push against to ratchet everyone to the right..\n\nGOP serves the oligarchs. DNC serves corporations",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ravallah",
            "body": "If the US is a neighborhood of houses and one of them is on fire:\nThe Democrats are watching it burn, swiping something from the yard if they think no one is looking,\nThe Republicans are throwing fuel on the flames, actively trying to burn down the whole neighborhood, and looting everything they can and will tell you they are doing it to help and that the fire department is bad and can’t be trusted.\nI want the fire department, who will actually do something to help. If my only options are the Democrats and the Republicans, the house is still burning down. The lesser of the two evils aren’t helping, but since they aren’t actively taking overtly malicious actions, I’d rather deal with the Dems while trying to advocate for the fire department.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Preaddly",
            "body": "Appealing to the left in any way loses the party voters, as independents tend to prefer republican policies to progressive ones.\n\nAppealing to independents has a chance of winning them the votes of republican defectors. After all, progressives will still vote democrat anyway, since they have no choice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NazareneKodeshim",
            "body": "Because bad Republican policies are Democrat policies.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Pyrofish-J7",
            "body": "This is a very simplistic view of this scenario, and it's always far more complicated than people want to look into. \n\nFor instance, the Obama administration did have camps at the border, but it was unaccompanied minors. Kids that showed up alone. Where are they supposed to go? Foster families? How do you find their parents? Their parents obviously thought that if they sent them alone that the US wouldn't be able to deny them entry. With no housing for adults, they were given court dates and allowed to enter the US until their asylum case could be heard. \n\nThem Trump's first administration changed the interpretation of the law. They stopped letting people/families in to await trial, and any that crossed the border, a misdemeanor, were considered to have broken the law and they would be separated from their children and both imprisoned. If you're going to lock people up, you can't lock them up with kids and adults in the same place right? They termed this an end to Catch-and-release. So the previous camps that were used for unaccompanied minors, were now also being used for family separation, which is horrendous. They claimed it was it a deterrent. \n\nBiden switched it back to catch-and-release with asylum seekers awaiting their hearing, and only unaccompanied minors being housed in those buildings at the border. \n\nIt's a complicated problem when people are so desperate they send their kids, alone, to cross the border. Are their parents in some kind of trouble, or have a record? Maybe they have cousins here, who knows?  The solution was not to make it worse, like the R's did. It would seem that the cruelty was the point for them. The D's have tried repeatedly to get more asylum judges down there so this wouldn't be as much of a problem. Get their cases resolved quicker. The budgets always get shut down. I would say that part of it IS both sides dragging their feet because they like having the problem to run on. \n\nImmigration used to be reversed, btw. R's loved immigration in the 90's because they knew our farms, meat packing, and a decent portion of the construction industry relied on undocumented labor that worked for cheap and outside of the US labor laws. The D's said this was slave labor, and these people should be recognized as worked with labor protections afforded to Americans. The R's knew this would hurt alot of businesses, so they just left it alone. Somewhere along the line, the R's changed to hate-that-guy-over-there. If you recall during Trump 1, \"no one wants to work\". They ran off alot of the labor. Then immigrants came back, and started to fill those positions once Biden came in. By next year, you'll hear \"no one wants to work again\" because of lazy this and that... we need immigration, and there should be protections for those people, too.\n\nNow tariffs from the first Trump term... the Biden administration largely left those in tact, which was absurd. I can see that it would be difficult to pull them back when American business had reorganized around their existence, but that didn't help inflation. A gradual draw down of tariffs could have helped the general public.",
            "score": -5,
            "replies": []
        },
        {
            "author": "scaredandtired11",
            "body": "How exactly did that story you linked indicate in any way that Biden approved Guantanamo expansion? Did anyone read the article? It only talks about how he reduced the number of detainees. And this would be the first I've heard of Biden expanding. I agree with your sentiment but?? Was that a wrong link?",
            "score": -1,
            "replies": [
                {
                    "author": "Beginning_Ground9472",
                    "body": "You would be correct, these contracts are being used to build more facilities and prisons. I couldn’t find the NY article and only the guardian one but isn’t going into details of how Trump is using the funding https://www.theguardian.com/us-news/2024/dec/06/biden-immigration-detention-centers-inhumane-conditions",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lythieus",
            "body": "Because the old fucks in charge of the party are actually center right, and only care about staying in power.\n\nThe young bloods need to come in and revitalize the party. The steady average age of Congress going up every cycle needs to stop.",
            "score": -1,
            "replies": [
                {
                    "author": "Viztiz006",
                    "body": "How old was Obama when he was elected?\n\nStop believing in things like this. Race, Gender, Age, etc. doesn't matter as much as Class. Both parties serve the interests of the capitalist class rather than the working class.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Constantlearner01",
            "body": "Uh, when were we in charge? The last brief time we were we passed the ACA.",
            "score": -6,
            "replies": []
        }
    ]
}