{
    "title": "Billionaire Sergey Brin says people should work harder to replace themselves",
    "author": "JimDa5is",
    "subreddit": "LateStageCapitalism",
    "rank": 70,
    "score": 789,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 37,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1j0iyaj/billionaire_sergey_brin_says_people_should_work/",
    "id": "1j0iyaj",
    "selftext": "If this is not the literal fucking definition f Late Stage Capitalism I don't know what is.\n\ntl;dr Billionaire capitalist says the engineers (who are almost certainly salaried) should work 60 hours a week to create the AI that will ultimately replace them. I know it's hard to get spun up about people who show almost no class solidarity with us but they are still workers (mostly, stock options and shit muddy the waters) being exploited by the ruling class even if they don't recognize it. Brin became a stupidly rich in exactly the same way Henry Ford did in his day. The labor is different but it's labor all the same\n\n[https://gizmodo.com/googles-sergey-brin-says-engineers-should-work-60-hour-weeks-in-office-to-build-ai-that-could-replace-them-2000570025](https://gizmodo.com/googles-sergey-brin-says-engineers-should-work-60-hour-weeks-in-office-to-build-ai-that-could-replace-them-2000570025)\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "bird_celery",
            "body": "That guy can go fuck himself.",
            "score": 250,
            "replies": [
                {
                    "author": "Dude_9",
                    "body": "https://i.redd.it/v69vs3fjdyle1.gif",
                    "score": 66,
                    "replies": []
                }
            ]
        },
        {
            "author": "LessThanSimple",
            "body": "60 hours a week?!  I was burning out at 50 hours, and even now, at 40 hours, I still struggle.\n\nThis dude needs to send all of us an email stating 5 things he did last week and justify his job.  I doubt very fucking much he works 60 hours a weeks himself.",
            "score": 192,
            "replies": [
                {
                    "author": "anspee",
                    "body": "Rich people tally all the menial shit all us regular plebs do like eating lunch with their friends and running errands or commuting... all of that conveniently gets filed under magical \"business expenses\" and the mythological concept of \"work\" to them.",
                    "score": 93,
                    "replies": []
                },
                {
                    "author": "soitgoes7891",
                    "body": "I got hired at a sandwich factory and they were just opening a bakery section. I originally thought I was going to work the traditional 40 hours everyone else making sandwiches did, but they stuck me in the brand new bakery where no one knew how to work the machines and demand was high. They wanted us there 6 days a week for 12 hours and it was minimum wage before the overtime hit. Never again will I do that. I somehow lasted 20 months before getting fired for no call no show. Horrible way to waste life.",
                    "score": 44,
                    "replies": []
                }
            ]
        },
        {
            "author": "Movie-goer",
            "body": "These guys like Brin and Musk with their 60-80 hour a week BS are just trolling. They get off on the outrage they know they're causing. \n\nThese guys don't work 40 hours a month.",
            "score": 116,
            "replies": [
                {
                    "author": "TheGreatMightyLeffe",
                    "body": "Nono, they \"work\" 80 hour weeks, it's just that they consider going on a yacht vacation with some other rich dude \"networking\" so they've been \"working\" constantly for two weeks sipping drinks in the sun.\n\nIt's not THEIR fault you weren't smart enough to simply be born with more liquid assets and now have to do actual work, that's no excuse to work any less than them!",
                    "score": 54,
                    "replies": [
                        {
                            "author": "IAmAHumanIPromise",
                            "body": "You should’ve thought about that before you were born a peasant",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "Forgotlogin_0624",
                            "body": "You’re joking but it’s important that we acknowledge that they truly believe that, and that they believe we are cattle.  We are not people as they see it.  \n\nBrin sees nothing wrong with anything he’s doing, he’d just as happily weld shackles to these engineers and whip them until they comply.  \n\nIt’s important we honestly face our position with these types ",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "TheGreatMightyLeffe",
                                    "body": "Equally, it's important to remember that our argument against billionaires isn't a moral one, even though most, if not all, of them are dicks.\n\nAs communists, our argument must by necessity be a materialist one based in our differing class interests, and thus underline the fact that things wouldn't be any different if we just replaced our current oligarchs with really nice people.\n\nNot to say we shouldn't also call them out for being aasholes, but, sometimes I feel like many comrades get too caught up in hating billionaires because they're assholes and not because they're materially part of the exploiting class and making our lives worse by simply existing.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "JimDa5is",
                                            "body": "I feel you but are you sure the two aren't inextricably connected? I mean it doesn't matter in the end but it seems to me that they're assholes because those are the kind of people driven to hoard extreme wealth.  \n\nFor me, it's just that dicks like Brin are the easy targets and billionaire is shorthand for 'the power elite that have raped and pillaged my people for lo these many years', ya know?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "TheGreatMightyLeffe",
                                                    "body": "Thing is, there are people who inherit wealth, and might geniuenly be decent people. If you make it a moral question, they become an instant counter to it.\n\nThe material argument, however, isn't as easily dismissed since you can't just point to a philantropist and prove that billionaires aren't all \"evil\" to argue against that the resources tied up in a single individual living an oppulent lifestyle could do more good distributed among the most needing in society, regardless of that person's moral fibre.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "commie_1983",
            "body": "Do these people forget that they bleed?",
            "score": 49,
            "replies": [
                {
                    "author": "BassoeG",
                    "body": ">Do these people forget that they bleed?\n\nNo, that's why luxuriously appointed New Zealand bunkers and SPUR the shooty robodog are products.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "commie_1983",
                            "body": "More of us than them, and lots of homeless desperate people. Anyone want 1k to beat the crap out of my landlord? Not a serious question, just to make a point.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Forgotlogin_0624",
                                    "body": "Make it 900 and we’ve got a deal.\n\nOkay okay, 550 and a burlap sack full of door knobs to do the deed\n\nFine, I’ll give you 50 bucks and provide my own door knobs",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CornusControversa",
            "body": "Word of advice Sergey, be very careful when walking around cities, because if can be very unpredictable",
            "score": 41,
            "replies": []
        },
        {
            "author": "HomemPassaro",
            "body": "Under a socialist system, that would be the goal. Less socially necessary work, more free time for everyone to enjoy the benefits of it.\nUnder capitalism, this means higher unemployment, which leads to lower wages and a decrease in quality of life to everyone but the capitalists.",
            "score": 35,
            "replies": [
                {
                    "author": "JimDa5is",
                    "body": "Oh, trust me, I've made this exact argument WRT minimum wage. If it's not worth a living wage perhaps people shouldn't be doing that work, ie. if flipping burgers isn't worth $15/hr maybe people shouldn't be flipping burgers. We don't manually dig ditches anymore because there are machines that do it way more effectively. The disconnect with capitalism is that now all the ditch diggers starve and die (capitalism) instead of lounging at home gardening or moving along to another endeavor (socialist paradise).\n\nI'm fully down with humanity allowing machinery and software to take over the hard labor of life. If your god wants you to eat bread made with the sweat of your brow, he can fuck right off.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sc4rl3tPumpern1ck3l",
            "body": "![gif](giphy|rg4iofhciswNy)\n\nit's well past time",
            "score": 19,
            "replies": []
        },
        {
            "author": "elrabb22",
            "body": "The fact that these are real people saying things like this over and over again blows my mind",
            "score": 17,
            "replies": [
                {
                    "author": "Movie-goer",
                    "body": "They're not real people. They're personas.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "blankdolli",
            "body": "Luigi taught us that guns can be used on people other than innocents.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Chunderbutt",
            "body": "Never enough to just enjoy your endless money.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Tiny-Positive9529",
            "body": "Let me translate so that’s it clear:\n“Hello slaves, you are not working enough for me to get more richer faster. So work more hours for the same pay & take my net worth to the moon! Also, we fire you just to show that we can.”",
            "score": 8,
            "replies": []
        },
        {
            "author": "Leprecon",
            "body": "Great, so once I replace myself with AI I can kick back and relax and just reap the benefits and lead a chill life?\n\nNo? You get to keep all the benefits while I have to scrounge for scraps? Ok then...\n\n\nI wouldn't mind the **\"we must increase productivity endlessly\"** messaging so much if the next sentence would be \"for the good of the people so we can spend less time at work and more time enjoying life\". But for some reason the sentence after that is always \"for the good of the economy and corporate shareholders!\"",
            "score": 7,
            "replies": []
        },
        {
            "author": "flynnwebdev",
            "body": "Hardly surprising. One must be bereft of empathy and ethics to become a billionaire. There's no honest way to do it, that's for sure.",
            "score": 7,
            "replies": []
        },
        {
            "author": "DukeBaset",
            "body": "The CEO is literally the easiest job to automate.",
            "score": 4,
            "replies": [
                {
                    "author": "JimDa5is",
                    "body": "It really is. I feel like any given LLM could replace them at this point",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "I mean all you can do is laugh at this guy. Imagine being that stupid.",
            "score": 3,
            "replies": []
        },
        {
            "author": "NationalGeometric",
            "body": "If AI is going to replace me, it’s going to pay my bills too. Replacing a person to have them have to find another job doesn’t help motivate anyone.",
            "score": 3,
            "replies": []
        },
        {
            "author": "a_greek_hamster",
            "body": "These assholes really wanna get Luigi’d",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tall_Investigator611",
            "body": "This guy can F*\"k Off...",
            "score": 2,
            "replies": []
        },
        {
            "author": "TuckHolladay",
            "body": "It’s going to be so funny when all these high earners suddenly understand what’s going on",
            "score": 2,
            "replies": []
        },
        {
            "author": "Philthy_85",
            "body": "Oh look, it's another one of Epstein's buddy's",
            "score": 1,
            "replies": []
        }
    ]
}