{
    "title": "Poverty is the 4th greatest cause of U.S. deaths (2023 article)",
    "author": "Straight-Razor666",
    "subreddit": "LateStageCapitalism",
    "rank": 36,
    "score": 577,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1j2i8e3/poverty_is_the_4th_greatest_cause_of_us_deaths/",
    "id": "1j2i8e3",
    "selftext": "Excerpt:  [The analysis](https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/10.1001/jamainternmed.2023.0276?guestAccessKey=5e3c70e5-f175-43ef-8e31-b04942227ccd&utm_source=For_The_Media&utm_medium=referral&utm_campaign=ftm_links&utm_content=tfl&utm_term=041723) found that **only heart disease, cancer, and smoking** were associated with a greater number of deaths than poverty. Obesity, diabetes, drug overdoses, suicides, firearms, and homicides, among other common causes of death, were less lethal than poverty. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Straight-Razor666",
            "body": "A fundamental contradiction of capitalism is that it creates widespread poverty at a greater rate than it amasses wealth into the hands of the few.  In order for the rich to get richer, the masses must get poorer.  This is a CONSEQUENCE of capitalism; it is a NECESSARY requirement to how it operates.  It cannot function otherwise.  \n\nCapitalism is the greatest crime against humanity to have been committed.  Those who have have been waging it must be brought to justice.\n\n*\\*non-violently, no violence is advocated with this post, violence is not supported or advocated.*",
            "score": 108,
            "replies": [
                {
                    "author": "None",
                    "body": "It’s terrifying as a Childfree woman to watch the march towards Christian nationalism and forced births.\n\nHuman traffickers were running an egg farm in the country of Georgia, they lured women there by advertising for a job and then they imprisoned them, forced hormones into them, and harvesting their eggs.\n\nJust like in the handmaid’s tale, pollution and disease caused some major problems for society and capitalism demanded more children be born so society decided to get those children however possible.\n\nAnd even though that was fiction it looks like we’re getting there pretty quickly in reality now too.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Lonely_Cosmonaut",
                    "body": "Violence is only acceptable in Minecraft.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jonnyjive5",
            "body": "~~poverty~~ capitalism",
            "score": 42,
            "replies": []
        },
        {
            "author": "Yatagurusu",
            "body": "And poverty is heavily linked with the first three of those too",
            "score": 38,
            "replies": [
                {
                    "author": "None",
                    "body": "4.\nMy mom died from suicide when she was 69. We don’t have public transportation in this state. Some of the cities have a bus that will travel around the city, and there is a bus that will go between the cities a couple times a day, but if I suddenly lost my car I would have to Uber to the grocery store to the doctors office and I would quickly run out of money or die.\n\nMy mom‘s dashboard malfunctioned so it wasn’t going to pass inspection because the check engine light couldn’t come on.  She could still see the speed because the little screen that controls the stereo shows the speed, but all the other lights were unavailable In the area where the speedometer is.  There was no way she would ever be able to get that fixed. She was living on SSI and after paying her rent and her car payment she had $20 a month left over.\n\nDuring Trump’s last term people like my mom were only getting $16 a month in food stamps.\n\nSo for food, toilet paper, gas for the car, cleaning products, any dental care she would need, soap, anything, she had a total of $36 every month.\n\nHow would you budget to do $1000 repair on a car when you have $36 every month after paying rent and car?\n\nSo she chose to end it quickly rather than slowly starve to death in her apartment.\n\nAnd I really miss my mom. ",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Yatagurusu",
                            "body": "I think you replied to the wrong person? im sorry for your loss and this is a very poignant reminder of how poverty deaths arent just malnutrition and medical care ♥️ it affects every part of our lives.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gvillegator",
            "body": "Wonder if these will be counted in the “Black Book of Capitalism?”",
            "score": 19,
            "replies": []
        },
        {
            "author": "hairyreptile",
            "body": "It’s a sacrifice the capitalists are willing to make",
            "score": 13,
            "replies": []
        },
        {
            "author": "None",
            "body": "I consider drug overdoses (in most cases) to be deaths of despair, caused by poverty.\n\nI mean I’m just a middle-aged white lady so my opinions don’t change the data of course, I’m just saying that when I think of deaths caused by poverty that includes deaths of despair, my mom’s suicide was directly due to poverty. Her death won’t be counted as a death because of poverty, but it totally was.",
            "score": 10,
            "replies": []
        },
        {
            "author": "CaptinACAB",
            "body": "Great talking point against liberals who think we should take guns from poor people on the cusp of rising violent fascism. \n\nAgain, the answer to all these problems is improving the material conditions of people.",
            "score": 6,
            "replies": []
        },
        {
            "author": "duhellmang",
            "body": "That's the goal make people desperate so they have to take low income jobs",
            "score": 3,
            "replies": []
        }
    ]
}