{
    "title": "My child deserves better",
    "author": "Nice_Skin1696",
    "subreddit": "TrueOffMyChest",
    "rank": 14,
    "score": 67,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 34,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1je7ugn/my_child_deserves_better/",
    "id": "1je7ugn",
    "selftext": "I never thought I’d be here—fighting this hard just to protect my own child.\n\nFor years, I’ve watched my daughter come back from my ex’s house filthy, neglected, and confused. I’ve documented everything—photos of her in the same clothes for days, unbathed, medical reports proving her health issues were ignored. But no matter how much proof I have, the system still won’t hold my ex accountable.\n\nI’ve followed every court order, taken every co-parenting class, even sat through mediation where my ex lied through their teeth. I’ve done everything “right.” But it doesn’t matter, because the family court system isn’t about what’s best for the child—it’s about maintaining a false sense of “fairness.”\n\nMy ex has:\nCancelled my daughter’s doctor’s appointments without telling me\nIgnored court orders & manipulated schedules\nCoached my child to say things like “I don’t want to go to Daddy’s”\nSent manipulative messages, twisting reality to make me the “problem”\nWeaponized CPS and the courts against me with false reports\n\nAnd yet, I’m the one constantly walking on eggshells, afraid that if I push too hard, the courts will somehow turn it against me.\n\nI don’t care about “winning.” I just want my daughter to be safe, clean, and loved. But the system keeps enabling neglect because it refuses to enforce real consequences.\n\nI’m sharing this because I know I’m not alone. So many parents are fighting this same battle, screaming into a void while judges keep handing our kids back to people who don’t deserve custody.\n\nHas anyone actually made it out of this? How do you get the courts to actually care?",
    "comments": [
        {
            "author": "Gonebabythoughts",
            "body": "Get their school involved.",
            "score": 41,
            "replies": [
                {
                    "author": "Nice_Skin1696",
                    "body": "our daughter is only 3.5 right now. so shes not enrolled in anything yet. and every option ive tried to enroll her in, the mother declines it. because we have 50/50 say, yet she unilaterally enrolls our daughter in programs against my consent",
                    "score": 31,
                    "replies": []
                }
            ]
        },
        {
            "author": "FairyFartDaydreams",
            "body": "Ask the court to only allow messaging through an approved app. that way she cannot lie about what she is responding saying. then ask in the app about daycare to help her socialize. she is preschool age so you might be able to get her in the free VPK programs for next year",
            "score": 31,
            "replies": [
                {
                    "author": "Nice_Skin1696",
                    "body": "we already do that as well. she harasses me through the app, lies, and manipulates the narrative anyways. i’ve already got a police investigation into her behaviors and have bright this to the judges attention, but nothing was done",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dizzy_Fishing8740",
            "body": "The next time she shows up and your daughter is visibly neglected or hurt, immediately call the police without her knowledge. The courts might not listen to you, but if two cops come by and document \"Disturbance regarding custody, arrived at scene with both parents at Dads property, child was visibly neglected, child was being dropped off by mother after her time with her\"\n\nThere's now 2 witnesses to your kid being DROPPED OFF after SHE had time with her.\n\nDon't let that bitch ruin your daughters mind. Fight for her or she'll grow up realizing no one will or ever tried. You're doing your best whatever happens. I just want this type of shit to fucking stop.",
            "score": 22,
            "replies": [
                {
                    "author": "Nice_Skin1696",
                    "body": "i really appreciate your support. and i agree third party testimony is crucial. however, i dont want this to become a problem of the police getting tired of coming out every single week for the same issue. i do however, have witnesses at home, and at work that see the conditions shes returned in weekly. do you think police involvement would be an appropriate route to take?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "notsohappydaze",
                            "body": "If your child is being neglected or mistreated, then 100% police involvement is both justified and appropriate. \n\nChild neglect is actually illegal.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Nice_Skin1696",
                                    "body": "they are already aware though, and havent acted on it. i had the local police department open an investigation into her, and i used everything i was showing our judge, to build the case. so maybe im just being impatient? he did say it would take a few weeks before i even heard anything back, as to whether charges will be filed",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RandomGuy_81",
            "body": " what state or country youre in?",
            "score": 9,
            "replies": [
                {
                    "author": "Nice_Skin1696",
                    "body": "pennsylvania in the US",
                    "score": 6,
                    "replies": [
                        {
                            "author": "RandomGuy_81",
                            "body": "Def get the  school system and counseler involved\n\nThats when you can report child neglect and harder to push under rug",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Nice_Skin1696",
                                    "body": "shes only 3.5 so school isnt on the table yet. but the mother is enrolling her in programs like child advocacy to further push her narrative. ive already stated she has no valid reason for these enrollments, especially with 4 unfounded CYS reports under my belt",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "RandomGuy_81",
                                            "body": "Wait….whats wrong with child advocacy programs",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Nice_Skin1696",
                                                    "body": "there’s nothing wrong with them if used correctly. the issue is my ex is enrolling our daughter under false pretenses/false allegations claiming that i’m abusive and neglectful, when the reality is the opposite. i have documented proof that our daughter is neglected in her care, yet shes using these programs to push a false narrative against me and manipulate the system",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "RandomGuy_81",
                                                            "body": "The game is perception and shes beating you\n\nThe big question is what is your kid saying or will say when they can talk",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "Nice_Skin1696",
                                                                    "body": "you’re right—perception plays a huge role in these situations, and she’s been working hard to control the narrative. that’s exactly why i’ve been documenting everything. i can’t control what she tells people, but i can prove what’s actually happening with medical records, messages, photos, and court filings.\n\nas for what my kid says, that’s my biggest concern. she’s already being coached to say certain things, and at this age, she just repeats what she hears. that’s why i focus on patterns and facts instead of just words. a single statement can be influenced, but a long-term pattern of neglect and manipulation is harder to deny. my daughter has already been interviewed twice by CYS who said he statements have been consistently contradicting my ex’s claims. and today my daughter has a forensics interview. so either shes going to remain consistent, or shes going to repeat coached phrases, which ive already alerted them to the possibility of such. \n\nthe challenge is getting the system to see past perception and actually act on facts.",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "RandomGuy_81",
                                            "body": "Theres no preschool or daycare?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Nice_Skin1696",
                                                    "body": "childcare is handled at home for now, and preschool starts this fall. that will be my first step in getting third parties involved who can observe and document any concerns firsthand.\n\nthe challenge is figuring out how to present nearly two years of documented neglect, manipulation, and false allegations in a way that highlights the pattern without making it seem like a personal attack. my goal isn’t to fight my ex, it’s to make sure the full picture is seen and acted on.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 3,
            "replies": [
                {
                    "author": "Nice_Skin1696",
                    "body": "i completely agree that advocacy programs are valuable when they’re used properly. i have no issue with their role in helping kids. my concern is that my ex has already made first contact and framed a false narrative before i even have the chance to present the facts.\n\nthe problem isn’t advocacy itself, but the fact that she’s using these programs to reinforce false claims of neglect and abuse against me, when in reality, the documented neglect is happening in her care. these programs rely on the information they’re given, and when someone like my ex manipulates that from the start, it makes it much harder for the truth to be recognized.\n\ni do want to talk to the advocacy leads and provide real documentation to counter the false claims, but i also know how difficult it can be once someone plants a misleading narrative first. that’s my challenge.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Nice_Skin1696",
                                    "body": "that’s how it’s supposed to work, and i’d like to believe that’s how it will play out. but in my experience, when someone controls the initial narrative, it can shape how professionals interpret everything that follows.\n\nif my ex has already framed me as neglectful or abusive, there’s a risk that anything my child says will be viewed through that lens, even if she isn’t outright saying anything bad about me. confirmation bias is real, and once a professional thinks there’s an issue, they start looking for things that fit that assumption.\n\nthat’s why i’m focused on making sure my documentation is solid before i approach them so they’re getting the full, factual picture instead of just my ex’s version of events",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "notsohappydaze",
                                            "body": "If the child is with the neglectful parent, then the advocacy leads will *see* that she's dirty, unkempt, hungry, etc.\n\n There is literally no narrative on earth where the parent can say \"well yes, child *is* on my time now, and will be all week/month/whenever and hasn't seen the other parent for 4 days, but overlook how child is and just pretend that child has come back from other parent's house like this\". \n\nCan you see how ridiculous that would be? Also, these people aren't stupid - they know all the manipulation techniques that are used. The only narrative will be the objective one that they see in their interactions with the child and both parents and how the child is with the parents.\n\nETA: Grammar",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Nice_Skin1696",
                                                    "body": "i really appreciate your input on this. thats kinda where i’m on the fence with it. its too ridiculous to actually be overlooked, along with the plethora of allegations my ex has made, and none have been founded. the issue is that my ex knows how to appear competent, and clean the child up when she knows someones looking. but i have photos/videos of the conditions she is in both at her moms house and when she returns. weekly. and they are pretty awful conditions. and ive shown CYS that evidence all 4 times they’ve been called to my house, and yet nothing is being done",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Current-Anybody9331",
            "body": "I'm so sorry.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mcmurrml",
            "body": "What about hiring a lawyer for you and a GAL for your child?",
            "score": 2,
            "replies": [
                {
                    "author": "Nice_Skin1696",
                    "body": "money is tight since i’m dumping every extra penny i have into my lawyer who doesnt do much for me. shes been great at representing me, but not very helpful otherwise. ive heard some horror stories about having a GAL so im not sure if that will be the best approach. but, thats just my guess, and i really dont have the money to try",
                    "score": 3,
                    "replies": [
                        {
                            "author": "mcmurrml",
                            "body": "You need to find it. Use a CC get a loan and if this lawyer is not doing what he or she can then get rid of them and get someone else. With what you have something should have happened. A GAL is supposed to act in the best interest for the child. Ask for recommendations. You are fighting for your child and you need help. You need a good lawyer and a good GAL. With all the proof you have things should be going better.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Midnightbutterfly81",
            "body": "Okay if you have a lawyer talk with them ask what are the next steps. Ask if you should file a complaint with child protective services. Also I would keep a detailed log of dates times and pictures as well what she left wearing each time what she comes back with how many diapers you sent how many she comes back with etc. the more specific details and dates times will be harder to dispute in court \n\nI hope that things get better for you",
            "score": 2,
            "replies": [
                {
                    "author": "Nice_Skin1696",
                    "body": "that’s solid advice, and exactly what i’ve been doing this entire time. CYS is already aware of her pattern of false allegations, but they don’t take action.\n\nfor example, my ex fabricated a drug test and falsely claimed i exposed our daughter to cke just two weeks after she herself was court-ordered to take a hair test for cke. when CYS investigated, they determined it was a custody issue, not a CYS issue, because the medical test for my daughter came back negative.\n\nmy ex’s results were also negative, but i have documented proof that she associates with people who use. yet despite all of this, she continues to manipulate the system with false reports, and no action is taken against her",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Midnightbutterfly81",
                            "body": "I am so sorry the system is not working for your child this is ridiculous and i hope that somebody will actually listen to you sometime soon.\n\nThis is a really bad thing but if she associates with shady people, you wanna make sure that your daughter is able to articulate to you if anything nefarious happens. So I would really encourage to teach her proper anatomical terms for her body parts and for boy parts. I hate to even say that, but this will help to ensure nothing gets miscommunicated if anything nefarious does happen. I truly hope that someone actually listens to you before something really bad happens to your daughter. I will say it is so nice to see that she has you.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Nice_Skin1696",
                                    "body": "i really appreciate that. she’s still young, but i want to make sure she always feels safe and knows how to express herself. i’m doing everything i can to protect this kid, because no one else is",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TelevisionBeautiful6",
            "body": "Request a GAL. If they send someone who is not a good fit, you can request a new one. And call CPS when she's at her mom's. Or document before and after pics from the weekend and call CPS as soon as she comes home.",
            "score": 2,
            "replies": [
                {
                    "author": "Nice_Skin1696",
                    "body": "i’m already documenting those things, i’ve been doing that since day 1 lol. CPS has been involved 5 times (currently is now for false allegations of abuse in my house). and ive showed them the neglect, and horrid conditions our daughter has been in. nothing has been done. she even fabricated a drug test for c*ke. and said it was a fact that i exposed our 3 year old daughter to drugs. not CYS, nor the judge, did a single thing about it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brojangles1234",
            "body": "Then don’t let your child go to this persons place. If you’re saying there’s no enforcement for them then there will be none for you either more than likely. And does the other parent actually seem like someone who will pursue such a thing legally? To me it doesn’t seem like it. I say face down the legal system and just don’t let your child to be in their custody for any period of time.",
            "score": 2,
            "replies": [
                {
                    "author": "Nice_Skin1696",
                    "body": "i get what you’re saying, but unfortunately, it’s not that simple. there’s a court-ordered parenting plan in place that requires me to follow the custody schedule. if i refuse to hand her over, i’d be the one violating the order, which could seriously hurt my case.\n\nthe real issue is that the system refuses to enforce consequences when my ex violates the agreement, even when there’s clear evidence of neglect. that’s why i’m focusing on documentation and legal strategies to make sure the truth gets recognized.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}