{
    "title": "My Sister Slept with My Boyfriend, and Now She’s Trying to Take Over My Job",
    "author": "TruthorTale",
    "subreddit": "TrueOffMyChest",
    "rank": 5,
    "score": 313,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 115,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1je8xvs/my_sister_slept_with_my_boyfriend_and_now_shes/",
    "id": "1je8xvs",
    "selftext": "Years ago, my sister Reta slept with my boyfriend. \n\nUnfortunately for me, i didn’t find out until after I was pregnant. i decided to keep my baby, but I never confronted her about what exactly happened we both just came to the understanding i knew, me and my boyfriend fought about it relentlessly without an audience to watch us. The night I gave birth, she went home with him. I knew it, but I didn’t ask for details I didn’t wanna know what they did. Instead, i went no contact with my sister for good reason. for three years and i focused on raising my 3 beautiful daughters.\n\nFast forward, my boyfriend and I got married, it wasn’t perfect, yes i’ll soon learn to regret it. And yes, Reta was invited. I thought we were past everything, i never held a grudge against her, truly i just let myself walk away. Years later, me and husband divorced, and for reasons I can’t even explain now but nothing to do with Reta. I helped Reta get a job at my workplace. I thought I was being the bigger person and helpful bc i knew she would’ve never gotten a job after she was laid off, (someone bought out their company and she was cut.)\n\nReta climbed her way up to a supervisor role while I remained her boss. And that’s when she showed her true colors, hee true intentions of how truly entitled and miserable she is. flirting with MY boss who has a wife at home. Going out of her way to do things for other employees she doesn’t do for me. Her tone when she speaks is so frustrating bc and sounds ugly. I cant help but thinks she places herself above you at all times.\n\nShe started pushing me out slowly at first but then it got worse, making demands to HR, knowing we were already struggling to keep people. She backed them into a corner, making it clear that they’d lose another supervisor if she wasn’t transferred or if i wasn’t . So HR called me with a “solution.” They could transfer me—to a store an hour away. With no car. No gas card. Nothing. \nI have two cars, one of which won’t make it 20 minutes away and i drive it everyday to work which is 12 minutes from my house. My second car my daughter used to get to school and work, i don’t want to rob youngest daughter of that driving experience as her first time driving. we are trying to set up buying a car for her but money is too tight. She sometimes wakes up at 4am to take me to work when the first car isn’t working. i don’t have the ability to buy her a car for herself. \n\nHR knows my potential and knows if i’m sent to another store i will be able to turn the place around the way i did the place i’m at now. Which Reta would love to take credit for. A lot is going to be asked of me and it’s responsibility i did not sign up for.\n\nI wanted to be promoted on my own terms when i had the fundamentals to provide for it. She is controlling when and how i leave my own store that i worked 8 years to build. \n\nNow, Reta is running around badmouthing me to employees, making herself out to be the victim. And let’s be real—this woman has always been selfish. She lives alone, keeps a fat, uninsured boxer in her tiny apartment, and the poor thing barely sees the light of day except to use the bathroom. An employee, i also consider my friend told me Reta told her about sleeping with my boyfriend at the time (i told friend years prior so she already knew)Reta was almost bragging about it. \nMy friend asked “did you ever even apologize?” and Reta said “it’s been too long, i think it’s too late now” but not remorseful. \n\nI don’t know why I ever let her back into my life. I should have left her in the past where she belonged. How could your own sister do anything like this.\n\n\nContext: Me and Reta are 2/6 kids (4 boys,2 girls) she is my only sister.\nI have 3 kids all of which have different fathers. she has none.\n\nI am currently married to a man of 5 years now was dating him for 3. \n\nall of this occurred in 2005-2007\n\ni got my sister the job 6 years ago- i have worked there for about 8 years or so years now. She was jobless for about a year and half before i offered it to her.\n\n",
    "comments": [
        {
            "author": "Leather-Tip-1995",
            "body": "Why the fuck would you do ANYTHING for that backstabbing piece of shit? Stop being the bigger person. Just because she is your sister doesn't mean anything. Disown her, never talk to her again, if she's on fire do not even piss on her. She's dead to you.",
            "score": 1278,
            "replies": [
                {
                    "author": "trvllvr",
                    "body": "Apparently, her self esteem is in the toilet and she let both of them walk all over her. I mean ffs, she married the POS who not only slept with her sister, but did it ON THE NIGHT SHE GAVE BIRTH TO **HIS** CHILD! \n\nNow, she’s worried about being the bigger person. Bet she’s been fed the bs to “suck it for the sake of family.” \n\nOP, if you have any self worth, you need to stop being a doormat and tell HR that you can’t do it as transportation and distance are an issue. If they value you, as you say, they’ll move her. Otherwise, you again need to suck it up and deal with the shitty circumstances that you now put yourself in by letting her back in your life. Go no contact again and let her deal with her own shitty life.",
                    "score": 335,
                    "replies": [
                        {
                            "author": "stinstin555",
                            "body": "T. H. A. T. ⛔️. P. A. R. T. \n\nFirst step is for OP to get into therapy to work on her mental health and self esteem issues.\n\nPeople treat us the way we allow them to. <<< READ THAT AGAIN!!! ⚠️\n\nAnd second she needs to write a comprehensive and detailed letter to HR outlining the ways that he sister is undermining her authority, bad mouthing her to employees, overt hostility, outlining her insubordination with examples and state that her sister has created a hostile work environment. She needs to take the letter to HR and request a formal meeting. Period.",
                            "score": 55,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HilMickaelson",
                    "body": "OP keeps her sister around because she’s a people-pleaser and didn’t learn her lesson the first time.\n\nMaybe she’ll finally cut ties after finding out sis has been sleeping with her boyfriend and her boss.\n\nOP's sister has no morals and is probably sleeping her way up the corporate ladder while trashing OP behind her back.\n\nOP, it’s time to turn the tables. Offices thrive on gossip, so let the rumor mill do the work. Cry, play the victim, and make sure everyone knows your sister is unstable, trying to steal your life, and you regret ever bringing her into the company. Oh, and don’t forget to drop the bomb that she was screwing your boyfriend while you were pregnant. That’ll get people talking.\n\nThen, take it up a notch—send an anonymous tip to your boss’s wife about the little office affair. Whether she ignores it or burns it all down is up to her, but if it’s true, at least she’ll have the chance to kick him to the curb.",
                    "score": 37,
                    "replies": []
                }
            ]
        },
        {
            "author": "theworldisonfire8377",
            "body": "There's no way this is real. \n\n\"The night I gave birth, she went home with him.\" \n\nNo one in their right mind would be able to get past this. So either this is fake, or you're the biggest doormat in the world and you need to seek professional help.",
            "score": 349,
            "replies": [
                {
                    "author": "Either_Pair7832",
                    "body": "User name is TruthorTale. Guessing this one’s a tale.",
                    "score": 90,
                    "replies": [
                        {
                            "author": "Mr_Hugh_Honey",
                            "body": "Really depressed individual posting some depression porn",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Easy-Concentrate2636",
                    "body": "Yeah, I think this is fake as well.  Either that or op is a flattened doormat.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "ExcellentCold7354",
                            "body": "Some people like being a martyr. 🤷‍♀️",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TwoBionicknees",
                    "body": "and none of it makes sense, this backstabbing crazy person is around her work badmouthing her and went to HR to say me or her, they'd say get the fuck out you weirdo, today, like right now.\n\nAlso if the company wanted you and thought you could turna round another store they'd buy you a fucking car to do it. It's complete nonsense.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "sasheenka",
            "body": "You are now reaping the fruits of your own stupidity, sorry.",
            "score": 98,
            "replies": []
        },
        {
            "author": "YakElectronic6713",
            "body": "Lol. So dumb. It's all your own doing. \n\nIf this is real, of course. Must be a shit post/rage bait, because who can be this dumb?",
            "score": 51,
            "replies": []
        },
        {
            "author": "Outside_Ad_3679",
            "body": "Why do you keep letting her back in and giving her chances to cause issues",
            "score": 33,
            "replies": []
        },
        {
            "author": "sfrancisch5842",
            "body": "Fake ass post.  And a stupid one at that.",
            "score": 17,
            "replies": [
                {
                    "author": "SummerWedding23",
                    "body": "Agreed. So many weird inconsistencies and unnecessary information- such a red flag or the fakes.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Playful_Annual_5507",
            "body": "I don’t even know what to say.. how intense. Holy cow. \n\nDon’t know what you’re exactly searching for when it comes to advice.. So I’ll say something extremely unproductive— you should’ve let that awful specimen of a woman stay jobless all those years ago!",
            "score": 15,
            "replies": [
                {
                    "author": "P33peeP00pooD00doo",
                    "body": "Yeah, it's kind of hard to give good advice when someone is in the FO stage of the FAFO process!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "KBPredditQueen",
            "body": "You're an idiot and you've sacrificed your own happiness and that of your family and children for a number of years to support a backstabber, you feel good about that decision? Stop accommodating her.",
            "score": 13,
            "replies": []
        },
        {
            "author": "RDUppercut",
            "body": "This story is one of the most convoluted messes I've read on this sub in a good long while, and that's saying something for this sub.",
            "score": 14,
            "replies": []
        },
        {
            "author": "onetrickpony4u",
            "body": "Another fake in this sub",
            "score": 11,
            "replies": [
                {
                    "author": "KBPredditQueen",
                    "body": "It has to be, this is the most pathetic s*** i've ever seen",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "captain_stabbinCR",
                    "body": "Complete bullshit and poorly written.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "mykneescrack",
            "body": "This was annoying to read. You decided to have a baby after your boyfriend fucked your sister. You also, decided to marry him with that knowledge.\n\nCool, she’s going for your job. What’s one more thing? \n\nIf you didn’t care about them having sex, not sure why you’re surprised or care about this, tbh.\n\nI don’t envy you.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Bart_Dethtung",
            "body": "All of this seems too bizarre to be true. You still married the man who slept with your sister and went home with him the night you gave birth? You \"forgave\" your slut sister and got her a job where you work? HR calling you with a \"Solution\" to the personnel issue by moving you to another store? You can do better than this tripe.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Naive-Indication8474",
            "body": "She showed you her true colors already and you ignored that and turned the other cheek. Why are you surprised she smacked you again?",
            "score": 7,
            "replies": []
        },
        {
            "author": "Deep_Sir_3517",
            "body": "Girl I couldn’t get past the second paragraph because I was going to have a stroke. Get away from her wtf.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Roke25hmd",
            "body": "You got what you deserve, this is what happens when a person is a doormat",
            "score": 4,
            "replies": []
        },
        {
            "author": "swake3",
            "body": "Seems like ChatGPT needs to work on self esteem. AI Therapy?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Absinthe_gaze",
            "body": "Also Tale made by AI. Please stop.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ibba60222",
            "body": "You’re a doormat, period, point blank. Stop doing favors for that trash. Damn being the bigger person. Go scorched earth with that POS and be done with it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Agreeable-Gap-4160",
            "body": "What a train wreck. 3 kids to 3 different men...somehow you ain't all peaches in this arc of a story.",
            "score": 4,
            "replies": []
        },
        {
            "author": "nancypants30",
            "body": "I mean at this point anything that happens to you because of your sister is on you.🤷🏽‍♀️🤷🏽‍♀️",
            "score": 3,
            "replies": []
        },
        {
            "author": "houtxasstrooss",
            "body": "Why isn’t Hr moving her. You have seniority. Make sure they know this solution is not viable for you. She can go away and oh well if they lose another supervisor",
            "score": 2,
            "replies": []
        },
        {
            "author": "houtxasstrooss",
            "body": "Also, report her to Hr for the boss situation or let that wife know of her intentions. Hit below the belt if you have to",
            "score": 2,
            "replies": []
        },
        {
            "author": "PerspectiveOne7129",
            "body": "two post, both written by AI, and not a single comment on OP's account which was made a few days ago. sus AF.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mbpearls",
            "body": "The fact you marroed a weak, pathetic cheater who fucked your sister is wild. \n\nCome on, girl. Wake the fuck up. Your sister sucks, your loser husband sucks, and you're intentionally living a life of misery for no reason. Stop settling for dog shit.",
            "score": 2,
            "replies": []
        },
        {
            "author": "nos4a2020",
            "body": "You made very bad choices. Your sister sucks but you made choices that brought you here. Hope it gets better for you. Really I do. Grow a pair and get it together.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ColonelBagshot85",
            "body": "I refuse to believe anyone is this much of a doormat. This has to be ragebait....\n\nYour boyfriend/husband cheated on you with your sister, and you still married him? Your sister screwed your partner, and you're still in contact with her...? In fact, the sister (who had no qualms about betraying you in the worst way possible) also managed to get you to find her a job at the place you're working?\n\nShe's already proved to you that she's willing to stab you in the back. Why would you even entertain having her be employed at the same place?\n\nI don't think any advice will be taken on board. You've allowed someone who has harmed you multiple times to exert herself in your life time and time again.\n\nYou might as well roll over and give her everything you own and love now. I mean, it's inevitable you will eventually, considering this is either a fake story to cause ragebait....or you have no self-esteem or a backbone and love being a victim.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lahierofantissa",
            "body": "I never will get how you can forgive someone or whatever and still allow them access, in this case close access, your job! to you. Borders up for the toxic while still being polite & very superficial.",
            "score": 1,
            "replies": []
        },
        {
            "author": "princessjamiekay",
            "body": "When people show you who they are, you should believe it. They are both terrible. I’m glad you are distancing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Typical_Agency8984",
            "body": "Stop being nice. She will continue to walk all over you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Savings-Ad-3607",
            "body": "First why would you ever stay with a guy who slept with your sister? Also why did you ever forgive her? Like if I was you I would be badmouthing her all over the office “did you my sister slept with my husband while I was giving birth, yeah she is a snake” word gets around fast.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Original_Cranberry68",
            "body": "Kick her out of your life. If this was another person taking your job then what action would you take? Just go after her with full force…\nTBH this seems like a track from any soap opera",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mufasasass",
            "body": "This is the kind of stuff that makes people murder their siblings. She's a nightmare.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TryingToBeLevel",
            "body": "Wow. Human doormat w multiple baby daddy’s. ESH.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rude_Vermicelli2268",
            "body": "Go give HR your own ultimatum, you were there first and are more senior. Unless they value her more than they do you. \n\nStop trying to befriend your enemy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EngineFace",
            "body": "You really know how to pick em huh?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChallengeHoudini",
            "body": "I stopped reading after you married your cheating disgusting, has no self-respect or dignity, boyfriend. He couldn’t have betrayed you any deeper wtf",
            "score": 1,
            "replies": []
        },
        {
            "author": "1cilldude",
            "body": "No offense but you need to start making better decisions about who is in your life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shelly_895",
            "body": "Man, you really like touching that hot stove to see if it still burns you, don't you?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lucky_Log2212",
            "body": "No good deed goes unpunished. I would not move. Let her. She has the flexibility. Tell them you can't move, you have the most seniority, and you aren't moving. Stand up for yourself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old-Ebb-8227",
            "body": "So then what are you doing to do about this? She showed you who she was and you ignored it, you allowed her to make this mess and it is now your responsibility to find a solution or don't and lose your autonomy. I hope you are raising stronger daughters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Informal_Policy_9115",
            "body": "I’m speechless really. She been had showed her true colors when she slept with your boyfriend while you were pregnant smh. Who needs enemies when you have family like that. Cut her off permanently and never let her back into your life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Firstbase1515",
            "body": "Honestly, if she’s bad mouthing your report her to HR, you should have done it in the beginning when she was acting inappropriately with a married man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ellenripleyisanicon",
            "body": "Respectfully, you did this to yourself Why on earth did you reward her with a job for sleeping with your Boyfriend??\n\nTruly foolish behaviour. Please learn your lesson and cut ties with this person. You need more self respect than this OP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Fee_161",
            "body": "I really want to feel sorry for you, but you've done a lot of dumb things regarding your sister and ex. \n\nAct like a doormat, get treated like a doormat.\n\nOf course she doesn't regret her actions because you shielded her from the consequences.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Warhammer02",
            "body": "Your life is sad but those were your choices. You are living the life you choose for yourself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comprehensive-Sun954",
            "body": "Truth or Tale….  Hmmm. 🤔 I pick… Tale!",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrictKnee5136",
            "body": "God what a bitch, she’ll reap what she sows don’t worry",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrictKnee5136",
            "body": "God what a bitch, she’ll reap what she sows don’t worry but yea move on away",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puppet007",
            "body": "Tell HR that if they move you away, you’re not coming back. \n\nYour sister is making a toxic work environment for not only you but for everyone else there. HR should transfer her instead of you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "notsoreligiousnow",
            "body": "OP. You’re a stupid doormat. I have no other words for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "More_Tacos_n_Vodka",
            "body": "What will it take for you to finally go no contact with the monster that is Reta? You need to cut the cancer out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lane_of_london",
            "body": "Sorry to be a downer, but you bought this on yourself. You know what she's about, and you get her a job and is the guy you married the one she slept with",
            "score": 1,
            "replies": []
        },
        {
            "author": "Disastrous-Panda5530",
            "body": "You have let both your sister and husband walk all over you. You’ve been there longer than your sister. I’d absolutely put up a fuss with HR and wouldn’t accept a transfer. Why should you have to transfer when you have seniority over your sister. And you are a fool to do so much as lift a finger to help your sister after her betrayal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Disastrous-Panda5530",
            "body": "You have let both your sister and husband walk all over you. You’ve been there longer than your sister. I’d absolutely put up a fuss with HR and wouldn’t accept a transfer. Why should you have to transfer when you have seniority over your sister. And you are a fool to do so much as lift a finger to help your sister after her betrayal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "succubussuckyoudry",
            "body": "I mean, you are in the fafo stage now.  I hope people have better advice for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImmisicbleLiquid",
            "body": "This is on you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Temporary-Exchange28",
            "body": "You need help, girl.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TwinGemini_1908",
            "body": "Not the brightest crayon in the box",
            "score": 1,
            "replies": []
        },
        {
            "author": "Savings_Marsupial204",
            "body": "I remember when I was mentally challenged",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReadyAd5385",
            "body": "I vehemently refuse to believe any of this just for my own sanity. Wtf...",
            "score": 1,
            "replies": []
        },
        {
            "author": "iAnkou",
            "body": "guys, this account is 2 days old and it's literally called \"Truth or Tale\". It's obviously fake cmon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious_Complex74",
            "body": "Damn it’s sad when a person is such a blank canvas they gotta copy someone else’s painting to feel pretty",
            "score": 1,
            "replies": []
        },
        {
            "author": "tobeornottobe42",
            "body": "I think you should seriously see a psychologist..you shouldn't be so invested in keeping your relationship with a person like that even if she is your sister",
            "score": 1,
            "replies": []
        },
        {
            "author": "stuckinnowhereville",
            "body": "Stop being a doormat. Cut them out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Appropriate_Dig911",
            "body": "Ouch",
            "score": 1,
            "replies": []
        },
        {
            "author": "PicklesMcpickle",
            "body": "You said she told other employees about sleeping with your boyfriend. \n\n\nI recommend you go to HR with that.  That she has created a hostile work environment for you. \n\n\nYou're giving the option of being moved against your consent or at the store that you're currently working at. \n\n\nTell them if you're moved to a different store then they'll likely lose you as an employee eventually.\n\n\nBut check your HR handbook if you have one. \n\n\nA lot of jobs have some sort of moral causes fit in.  And she's telling other co-workers that she's slept with your boyfriend years ago? \n\n\nWhy? Why are you having to in a hostile workplace and she gets rewarded?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Charming_Garbage_161",
            "body": "I know people say to be the bigger person but honestly being the smaller person usually works out way better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gdrom123",
            "body": "I couldn’t get past the first paragraph because I can’t believe OP is this dumb. Well good luck with whatever foolishness you continue to tolerate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beginning-Stop7646",
            "body": "This has to be rage bait bc no one can be this stupid",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lashia_x3",
            "body": "That girl is only going to do what you allow so start standing up for yourself and stop being a doormat. If you don’t want to leave the. Tell them that and have them transfer her. Not only she is becoming a liability to the job. If you’re her boss start acting like it instead of allowing her to be yours.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrMCG1",
            "body": "You bring the misery to your own life.  Cut her out of it again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stuffeh",
            "body": "Guaranteed she threatened the employees you manage with the \"I'm her sister\" entitlement. Ask around to see what's she's been demanding using your name.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jjjt22",
            "body": "I just really hope this is fake.",
            "score": 1,
            "replies": []
        },
        {
            "author": "markintardis",
            "body": "Hope this is fake. Don’t really have a lot of sympathy for op. Three kids by three different guys!! She needs to get help but I don’t see that happening.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ginsodabitters",
            "body": "If this is real it’s entirely your fault. It’s not real though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sugarcatgrl",
            "body": "Sorry, but what a dumb person. Who thinks like that?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Final_Technology104",
            "body": "Stop being the “Nice Girl” (doormat)!!!\n\nMy aunt did this to my mom when we were kids and my mom went No Contact for the rest of her life and I’m glad she did!\n\nWhat your sister and husband is beyond forgivable and if you do not do anything, she’s going to get worse. \n\nThey both crossed the Rubicon Years Ago. \n\nYour sister will never change, she’s morally corrupt and it’s in her very nature.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QNaima",
            "body": "I'm showing my age but... are we on \"Candid Camera\" or that show \"What Would You Do\"?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThatMovieShow",
            "body": "Your boyfriend - the person in a committed relationship who was supposed to behave himself - fucked your sister and you stayed with him? \n\nWhat your sister did is definitely shitty but she wasn't in a relationship. Your boyfriend was. He should have been kicked out immediately because this absolutely will happen again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Good_Ad6336",
            "body": "Respectfully, have some self respect and stop letting her run your life. \n\nThis girl seriously thinks that she can have an inappropriate work relationship with her boss and still make demands of HR? She’s lucky you don’t gather witness statements saying there is inappropriate behavior, and she has been harassing you, and deliver said statements to HR demanding they either reign her in or you will be seeking legal advice for their failure to prevent harassment and punishing you instead of her.\n\nThat part, though emotionally draining, is the easy part. The hard part is growing a spine and learning to stand up for yourself. You say you are over her previous behavior and that’s fine. But you have got to stop letting her continue to mess with you in the future.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VioletSea13",
            "body": "OP…stop giving your sister the knives she uses to stab you in the back. Cut her out of your life like the cancer she is. Tell your boss to send your sister to the other store.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IDK-My-BFFJill",
            "body": "At what point in writing this did you realize you should pick yourself up off the floor? You may believe you were being the bigger person, but you let her sleep with the father of your children, then gave her a job. You gave her reward after reward for her actions, and in turn, it encouraged said actions.",
            "score": 1,
            "replies": [
                {
                    "author": "BeeJackson",
                    "body": "It’s fake, or her sister is a better woman that she is that she can steal husbands and jobs.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IDK-My-BFFJill",
                            "body": "I hope this is fake more than anything",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheSuperTiger",
            "body": "I spent a whole bunch of money in therapy to learn “She might be your sister, but she will never be your friend”. I have let that sibling back into my life, and she has made me regret it every time. Never again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Birdsonme",
            "body": "Two ridiculous posts and zero comments with a username like that? I’m calling bs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Majestic-One-1981",
            "body": "Find proof of her intentions with your boss, and send to his wife anonymously. His wife will take care of her",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fukyurfeels",
            "body": "You should do two things for yourself, the first is make a resume with what you have done at your current position and how you turned the store around. Then send it out in mass. The second is go to HR and tell them you are unable to transfer due to the distance. However you also want to remind them what you have done for them, and that you would be interested in the new position. Once you inform of your interests, then tell you these are the things you will need to be successful and turn another store around. In your list of demands start with a high salary and willingness to negotiate. That you will need a company vehicle until you can purchase a new one of your own. Or that you're willing to take on a new role of turning around poor performing stores. This new role would include a company vehicle, gas card, and other benefits. If they are afraid to lose a supervisor, then they will really be afraid to lose you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Smoke__Frog",
            "body": "Jesus what a total mess. For those who want a summary.\n\nOP found out her sister was sleeping with her bf. She then chose to have a child with said bf and married. Shockingly, they divorced.\n\nOP then for some reason got sister a job at her company and was shocked when sister tried to ruin things for her at work lol.\n\nAnd oh yea. OP has three kids……..with three different men. And none of the fathers is she currently with. You can’t make this stuff up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OpportunityCalm6825",
            "body": "When you're trying to win the doormat contest but your opponent is OOP. 😂\n\nBeing stupid and gullible, life has taught you nothing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "domclaudio",
            "body": "Sounds like your sister wants to be you. Might even change her name after she makes you commit suicide.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Requirement-2420",
            "body": "Tell HR she is creating a hostile work environment and she needs to be transferred out not you. \n\nAlso cut her off and stop helping her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoonDancer118",
            "body": "Could you ask HR to accommodate your commuting situation with your car that they could  help you out with a new/used car either as a package of your new job as you have the reputation of turning the business around where you are now or pay back so much each month. You need to get as far away from your sister as possible. Good luck",
            "score": 1,
            "replies": []
        },
        {
            "author": "AffectionateWheel386",
            "body": "I’m not sure why you let her back into your life, but I would cut her out now. I would go to another store and let that one fall down because if you indeed did all of that work, she will not be able to sustain it.\n\nAnd frankly, I think you need some therapy. I would keep your sister out of your life permanently. She clearly has no good intentions toward you at all.  I would document everything she does around you too so anything that could be considered inappropriate as a manager you can take two higher ups.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweet-Sleep3004",
            "body": "HR can move your sister to the other store. Start documentation of her actions and take a case to HR for isolation you against your team which is a form of bullying you. She is not your sister. She sees you as a rival so start being a hard rival. Push back and don't move because of her. Tell HR you are happy where you are and if Rita wants a promotion, move her to that store to show off her so called skills. \n\n\nGo low contact with her and never invite her back in. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "wunderone19",
            "body": "Send a an email to the bosses wife (anonymously) and let her know just how much your sis loves her hubby.",
            "score": 1,
            "replies": []
        }
    ]
}