{
    "title": "my friend is dating a boy she watched grow up.",
    "author": "MysticForestCat",
    "subreddit": "TrueOffMyChest",
    "rank": 8,
    "score": 74,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 50,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1jecxuk/my_friend_is_dating_a_boy_she_watched_grow_up/",
    "id": "1jecxuk",
    "selftext": "my friend 27(F) started dating a guy 19(M) who is our friends 33(M) sons best friend. (there son is 17 and had him highschool at 16) On top of this she is still legally married to her ex husband 29(M) who she was with with 7 years, married in late 2022 separated in early 2024. \n\nIt’s really bothered me as he just turned 19 recently and back in October 2024 he had mentioned she has been texting him to me and my bf (both of us are 27) while at a cookout at the 33M friends house. The at the time 18 year old was showing us her telling him how great he is and many compliments while also trauma dumping about her ex husband. On the way home me and my bf discussed how weird that is. \n\nwhat’s even weirder is she kinda in a way watched this boy grow up. He’s been best friends with our friends son since there were children. She had been friends with 33M friend since 2017-18 ish as his younger brother 29M is friends with her ex husband. So she’s known her bf since he was around 11 years old if my math is right …. this just makes me very uncomfortable. \n\ni don’t see what they could possibly have in common. She posted there relationship status at the beginning of March. She is in the medical field with a degree and takes him to his job at Mcdonald’s. Because he doesn’t have a car or license yet. To further show the maturity and different spots they are in life… \n\nThen he told us this past weekend how she “made him delete social media” and he’s moving in with her (she has her own apartment) \n\nIt’s obviously a toxic relationship. She is being a groomer. Idk what to do other than complain on here to get it off my best and distance from her as a friend. Because all our other friends have tip-toed around the obvious discomfort we all over of the situation. \n\ni would like to add too that she looks older than her age. she looks mid 30’s and he looks like a teen out with his mom it’s just a lot for me to process because i see my friend of years so differently now ",
    "comments": [
        {
            "author": "Chemical_Ad3941",
            "body": "Some creeps exposing themselves in the comments.\n\nRegardless of gender of any of the parties involved, a full grown late 20s has no business being in a romantic relationship with a teenager. I'm the same age and all I can see them now is a bunch of children. Not infantalizing them, I meant that they're teenagers, period. They have a lot of growing up and their brains aren't fully developed. This is creepy behavior, and especially disgusting considering she watched him grow up.",
            "score": 107,
            "replies": [
                {
                    "author": "Cyd_Snarf",
                    "body": "SHE DIDNT FUCKING WATCH HIM. Holy shit is no one actually reading anything. I guess I’m the creep. Ya’ll belong on Facebook.\n\nBut, as not to be a complete hypocrite, I did read your post in its entirety and I agree that this young person probably still has plenty of maturing to do before being in a serious relationship like this.",
                    "score": -21,
                    "replies": []
                }
            ]
        },
        {
            "author": "SarcasmIsntDead",
            "body": "Sounds like your friend is dating a boy she groomed fixed your title…",
            "score": 42,
            "replies": [
                {
                    "author": "Cyd_Snarf",
                    "body": "Please. At what point during this child’s lifetime does the grooming occur. Point at it specifically.",
                    "score": -59,
                    "replies": [
                        {
                            "author": "SarcasmIsntDead",
                            "body": "“The way she’s watched him” known the boy since he was 11 you think she hasn’t in any way groomed him? This didn’t just happen out of no where… \n\nDefinitely found her account.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Cyd_Snarf",
                                    "body": "So, by your own admission, there is no mention of grooming. You just went ahead and assumed it was.\n\nEdit: go ahead decipher the “closeness” in their relationship here…\n\n“my friend is dating a boy she watched grow up.”\n\n“what’s even weirder is she kinda in a way watched this boy grow up. He’s been best friends with our friends son since there were children. She had been friends with 33M friend since 2017-18 ish as his younger brother 29M is friends with her ex husband.”\n\nLike, map that shit out on a pad of paper. They don’t know each other. OP is pearl clutching",
                                    "score": -37,
                                    "replies": [
                                        {
                                            "author": "SarcasmIsntDead",
                                            "body": "You really sound like the person that votes to lower the age of consent…",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "Cyd_Snarf",
                                                    "body": "So you’re not gonna do it are ya? You’re not going to actually read this post and think about what is happening. You’re not going to do anything that has you think past the end of your nose. As if anything I said had anything to do with age of consent. Get back in your herd.",
                                                    "score": -11,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "annoyed__renter",
                            "body": "You think she began texting him trekking him how great he was the day he turned 18? Unlikely. Clearly they are very familiar with each other.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ananonh",
            "body": "Disgusting. ",
            "score": 62,
            "replies": []
        },
        {
            "author": "YakElectronic6713",
            "body": "Your friend is an emotionally immature predator.",
            "score": 6,
            "replies": []
        },
        {
            "author": "historicityWAT",
            "body": "Yeah this is a gross grooming situation",
            "score": 29,
            "replies": []
        },
        {
            "author": "Good_Narwhal_420",
            "body": "friend is a fuckin weirdo",
            "score": 9,
            "replies": []
        },
        {
            "author": "JoNyx5",
            "body": "How close are you to him? Can you be a safe space? Did you tell him that making him delete social media is controlling and their relationship can easily turn abusive (if it isn't already)? How do his parents feel about it, do they know? If not, can you tell them? Do they have influence over him?\n\nYour friend is indeed a groomer. If he's at the point where he's moving in with her, he has likely been thoroughly groomed already and is blind to the toxicity. You need to make sure he doesn't get alienated from you.  \nDefinitely talk to your friends about it, if possible let them talk to her about how fucked what she's doing is (best if he's also there and listens) but not mention it yourself. Instead, say nothing and don't distance yourself from her, but try and gain the boys trust. Don't speak against her outright (because then she will try and alienate you from him and he might distance himself) but try and plant small seeds of doubt in him. That's the easiest when asking him questions that are worded in a way to make the toxicity obvious, but let him come to that conclusion himself. That has the highest likelihood of getting him out as soon as possible.\n\nDO NOT sit by and do nothing. That boy needs you.\n\nEdit: Just realized it's not your sons best friend but your friends sons best friend. In that case, ask your friend (the parent of the son) to be the safe space etc, and take the role of calling out your groomer friend in front of the boy and then distancing yourself.",
            "score": 18,
            "replies": [
                {
                    "author": "MysticForestCat",
                    "body": "i was about to say i wasn’t close with him because i see him as a child. I am going to talk to my bf and come to a game plan to confront our friend who’s son is this boys friend. i also want to add i told him back in october when he was showing us the messages between them that i thought it was weird she was messaging him and he was very teenager about it very defensive and immature the way a 19 year old is :/",
                    "score": 14,
                    "replies": [
                        {
                            "author": "JoNyx5",
                            "body": "Yeah I meant close more in a \"are you a trusted adult for him\" kind of way.\n\nSounds like a good start! I hope it works out.  \nEven if he was defensive, it might have stuck in his head and could contribute to him having doubts about the relationship.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "agent-assbutt",
            "body": "I cut off my best friend of 15 years for similar behavior. I'd recommend you do the same.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Silent_Syd241",
            "body": "Your friend is a creep.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Just-Distribution394",
            "body": "call her out for it",
            "score": 4,
            "replies": []
        },
        {
            "author": "Johnny_Poppyseed",
            "body": "Have you or any of your friends called her out for this behavior yet? I just can't imagine not saying something if I was you in this scenario? Like the very first time I heard about it, I'd be like \"wtf are you serious? That's weird dude\". Are you really all just tiptoeing around it not saying anything? ",
            "score": 7,
            "replies": [
                {
                    "author": "MysticForestCat",
                    "body": "there all ignoring it to there faces… but have said they don’t agree with it but again not to her or his faces. me and my bf feel like the odd ones out and not sure if it’s our place as we’ve only been friends with them since early 2023",
                    "score": 6,
                    "replies": [
                        {
                            "author": "nunya123",
                            "body": "Idk if there really is anything you can do other than having an open and honest conversation with your friend. I hate to say this since it’s gross and weird, but they are both adults. I would definitely distance myself in this situation…and vomit at home.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Similar_Corner8081",
            "body": "Ewww no that's not ok either. She's known him since he was 11 and watched him grow up and wants to date him. I'm going to comment on the age gap you might want to make someone aware of what's going on because it sounds like she's trying to isolate him. She's also not even single. She is still married. You need to keep an eye on him because there's a power imbalance here.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Brat7235",
            "body": "Well this is a messed up situation, but I’m glad you know that it’s wrong and aren’t supporting/enabling/ignoring it.  A lot of people nowadays defend their friends even when they’re in the wrong.  Personally I would tell my friend how I feel about the situation because that’s the type of person I am.  I struggle to hold opinions in.  If you’re doing something around me that I don’t support, I will let you know.  People can do whatever they want… but not around me.\nMaybe talk to the younger guy, or his parents?",
            "score": 2,
            "replies": []
        },
        {
            "author": "5l339y71m3",
            "body": "So gross but thank you for sharing because even more upsetting is how many people downright don’t believe women are capable of this level of predatory behavior and they absolutely are. \n\nI’m sorry your friend has aged into a groomer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Just-Distribution394",
            "body": "i need a damn cigarette for this",
            "score": 4,
            "replies": [
                {
                    "author": "MysticForestCat",
                    "body": "me too!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Both-Ad-9225",
            "body": "Your friend is a pedo",
            "score": 5,
            "replies": []
        },
        {
            "author": "AcheyShakySpoon",
            "body": "Have you talked to the kid’s dad about it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ColonelBagshot85",
            "body": "It's disgusting! She's a n*nce who has groomed him, and is now isolating him from others.\n\nWhere on earth is his mother in all of this? If someone did that to my niblings or children....well, I'm not sure I can type here what I'd do, but I'm sure you get a fair idea.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bison5595",
            "body": "Time for women to stand on business. You would lose your mind if this was the reverse. Time to prove if you really have a problem with age gap relationships",
            "score": 0,
            "replies": [
                {
                    "author": "MysticForestCat",
                    "body": "thank you !!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "dogstarfugitive",
                    "body": "Yep.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "famcz",
                    "body": "For real.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "torquebow",
            "body": "I don’t exactly have a say or any solutions for this, but this does happen quite often. Probably happens more than you think.\n\nThe whole of my body reacts in a very negative way about stuff like this, even if there isn’t any direct action I can do.\n\nBeing protective and attentive is good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cowardlylines",
            "body": "He's an adult. Tell me why it's more acceptable for tbe government to send people his age off to get blown to pieces with explosives for the sake of rich people's yacht money, but that same age group can't decide who they sleep with.",
            "score": -1,
            "replies": [
                {
                    "author": "RegentusLupus",
                    "body": "Do you have any apples you want to compare to oranges, while you're at it?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "cowardlylines",
                            "body": "Actually no. Im not comparing apples to oranges. This stupid idea where an adult can do whatever they want unless it's sex with another consenting adult is boring as hell. \n\nIf they can smoke, drive, and vote they are legally adults and can make their own decisions.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "th_row_a_way_s",
            "body": "They are both of age, my recommendation is you distance yourself from her. That means no communication",
            "score": -33,
            "replies": [
                {
                    "author": "plutonasa",
                    "body": "lol nah, if a guy did this, you would be crying foul play.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "th_row_a_way_s",
                            "body": "Disagree with you.",
                            "score": -27,
                            "replies": [
                                {
                                    "author": "Cyd_Snarf",
                                    "body": "Welcome to Reddit where no one is capable of thinking for themselves. Everyone here thinks slapping a downvote on something they even tangentially find related to grooming/pedophilia is them somehow “fighting the menace”. Rather than looking at individual situations for what they are and giving honest feedback. It’s the slide toward Facebook that the growing boomer crowd is helping to make happen.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cyd_Snarf",
            "body": "You’re trying to make this your business but it just isn’t. They’re both adults and tbh the age gap is kind f whatever here\n\nEdit: go ahead downvote without reading things, you know you want to",
            "score": -44,
            "replies": [
                {
                    "author": "plutonasa",
                    "body": "so is it ok for a 33 year old dude to go out with a 19 year old gir/ he's been looking over while growing up?",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Cyd_Snarf",
                            "body": "What does that have to do with anything? And your question is a bit of a stretch compared to OP’s post. It’s not like this was his babysitter. Just because a person grows up near you doesn’t make them somehow your kid or something wtf. You can assume details if you want but all I’m reading is someone older was around while someone younger was going from childhood to adulthood and then they started a relationship *gasp* oh the scandal",
                            "score": -18,
                            "replies": [
                                {
                                    "author": "-ALL-CAPS-",
                                    "body": "\\*switches genders\\*\n\nhow does that make the question a stretch??",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Cyd_Snarf",
                                            "body": "If OP’s post said “I know someone who was responsible for some aspect of raising or looking after a child and then when that child grew up they started dating.” I would be in COMPLETE AGREEMENT. but no one wants to hear that shit\nEdit: and I’m not the one that switched the genders for this little what if",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "Cyd_Snarf",
                                                    "body": "Edit: OHHHHH I’m so dumb. This is about it being a lady. Like, everyone is piling on to show they can be predators/groomers just like guys. Which is completely valid and true… except OP doesn’t describe grooming in this post.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kingofmymachine",
            "body": "He doesnt know any better and will have to learn the lesson himself. Sorry OP",
            "score": -4,
            "replies": []
        },
        {
            "author": "PerspectiveOne7129",
            "body": "Sweet Home Alabama!",
            "score": -4,
            "replies": []
        }
    ]
}