{
    "title": "I was in a longterm abusive relationship with a famous person",
    "author": "AugustusFan",
    "subreddit": "TrueOffMyChest",
    "rank": 18,
    "score": 17,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 43,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1jec77y/i_was_in_a_longterm_abusive_relationship_with_a/",
    "id": "1jec77y",
    "selftext": "I don’t even know what I’m allowed to disclose, so I'm gonna try to be careful to not reveal anything. I will be using he/him pronouns (not to indicate their gender i just want to make my post simpler to comprehend).  Please bear with me this is going to be very long, but I cannot go another second without talking about this to someone.\n\n\n\nSome background on how it started, I met him when I worked part time for a catering company when I was in college for a private event that he was hosting a few years ago. He recognized some of the catering staff including me when we catered for another party that he had around 2 months after my first time working for him, so he asked some of the staff members to stay overtime (which we’re absolutely not allowed to do but I was only scheduled for one more event before I stopped working for that company so it wasn't a big deal) so only a few of us agreed to and we stayed over for no more than 2 hours max. I talked to him individually towards the end of the night and we exchanged numbers. \n\n\n\nHe invited me over after he flew back from LA around 2 weeks after we last talked, and I was asked to sign an NDA so I pretty much understood what was going to happen that night even though he’s not publicly out of the closet. The contract was very strict but there was absolutely no way I wasn’t going to sign it, since I did know him prior to working his event. He’s a pretty well known star in Hollywood, and he’s part of a mega huge movie franchise that I loved when i was younger and  was part of one of my favorite shows ever, and it helps that he’s pretty attractive so it was hard to say no to this opportunity. We spent nights together occasionally, like once a week sometimes twice even though he allegedly was seeing someone at the time (he's still seeing that person I believe). \n\n\n\nI think it was around the 5 month mark when I started noticing some red flags. He would pressure me into skipping other commitments and coming over even though I had a lot of school work at the time. He would also pressure me into drinking even though I legally couldn't drink yet and he’s significantly older than me (and he very much looks it, so his obsession with trying to be young and acting like a fboy in his early 20s is pretty embarrassing). Naturally, as I spent more time with him we kinda developed a more intimate relationship, so he kinda started to split his time between his partner and I (apparently the partner didn’t know about me since he was filming pretty often at the time and they weren’t spending much time together). \n\n\n\nAfter a few months, he started being angry with me all the time and he sometimes got physical with me. He even forced me once to try drugs so he can try to get intimate with me cause we weren’t having sex for like a month (I now developed a phobia of medication or any type of hallucinogens). \n\n\n\nWhen I threatened to leave him, he would start accusing me of cheating on him and started screaming at me until I broke down. He also accused me of selling stories about how he's in a fake PR relationship with his partner and that he cheats on them with escorts. This was a constant problem that happened well over 10 times. I started getting very stressed and people around me in school and at work were noticing how irritable and panicked I constantly was. He also was very controlling and required that I have my location on at all times, which nobody ever asked me to do prior to meeting him so I felt like I was constantly being watched. \n\n\n\nI have to admit that I did talk about him to my closest friends only, which he later found out about and held over my head for months. The way he went about it was pretty insane though, he started threatening to sue and make my family go broke even though I assured him that these are longtime friends of over 10 years and would never tell anyone (partly because i’m not out myself, only my friends know).   \n\n\nThe moment I did decide I was absolutely done with him was when I found out that he’s been filming us being intimate (something that I never consented to and would never be ok with). Obviously he did not care and tried to force me to stay, until he  started hitting me and punched my stomach real hard that the wind knocked out of me, then proceeded to force himself on me against my will. \n\n\n\nThe next morning, he kicked me out and blocked me everywhere, but not before saying that he wanted nothing to do with this relationship and that we should both move on with our lives. I had to stay with my best friend for an entire week where I was just crying without a single break, and my family were worried sick because I normally don't go more than two days without seeing them. Now i’m dealing with severe anxiety and panic disorder that’s just taken over my life. We ended our relationship right after I graduated from college, so I didn’t have an opportunity to look for a job due to my mental state and I cannot support myself so i’m staying with my family but they don’t know anything other than I’m dealing with a lot mentally.\n\n\n\nI hate that he’s perceived as kind when he’s the exact opposite. I also hate how he’s been literally everywhere recently at every major film event recently acting all innocent and fake. I had to delete my twitter account because I kept seeing tweets about him at recent big award shows and I can't even stomach looking at his face. Thankfully I don’t hear about him in my day-to-day life, but I saw posters the other day of a movie he’s in which made me want to throw up (another thing he completely ruined for me, I can’t stand watching movies anymore cause it was literally his entire personality the entire time we were together. I promise your deep knowledge of film history and shitty acting will not land you that Oscar you so desperately want, the academy will never take you seriously). \n\n\n\nI can't talk to anyone about this except for pretty close friends that are aware of my sexuality. I’m not out to my family, so they just see what a wreck ive been the past couple of months and there's no way to explain my situation without them finding out about my sexual history. I can't even  see a lawyer without my parents since I cannot afford it and there’s no way I could ever involve them in this (they already think that I’m potentially on drugs due to my state recently since I barely eat and always sit alone at home). \n\n\n\nI don't know much about the law tbh, but what i do know is that I don't have the means to pursue this legally, and I absolutely cannot risk my religious family ever finding out and disowning me. I honestly feel like I would rather jump from a cliff than deal with my current mental state. Part of me just wants to say fuck this shit and to go public with everything that happened and fuck up my life cause it already kinda is, but I know that I will not have a home to come to when my family finds out about this. I’m 100% sure I don’t exist to that man so it just pisses me off that he gets to have this great life while I’m the one that has to deal with the repercussions. It’s absolutely unfair.\n\nThe most difficult thing to admit to myself was that I allowed someone to abuse me to that extent and still chose to stay with them (I feel so stupid in hindsight). I was hoping to find support or community here and see what i can do to cope with what happened to me, so if you have any advice in that regard please i beg you to share. ",
    "comments": [
        {
            "author": "Swiftienation",
            "body": "I also want to warn you that some of the details you mentioned are kind of a dead giveaway on who the person is. I won’t specify which details so nobody starts speculating, but you might wanna edit ur post to remove those small things before names start being thrown around. I really hope it’s not the person in my mind tho",
            "score": 16,
            "replies": [
                {
                    "author": "Redfoot87",
                    "body": "I can't figure out who is it.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "4-rensicfiles7623",
                            "body": "Me either",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ResearcherExotic7331",
                    "body": "No one comes to my mind honestly",
                    "score": 12,
                    "replies": [
                        {
                            "author": "audreyhorn666",
                            "body": "Me either, but if it’s some Marvel type franchise it would go right over my head because I don’t watch any of those kinds of movies",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OrnerySnoflake",
                    "body": "There’s a couple people I’m guessing it could be and I’d be deeply disappointed if it’s either of them.\n\nWhoever it was who did this to OP is a vile piece of shit. This “man” hides behind NDAs to shield themselves from the repercussions of their abhorrent behavior. It’s disgusting and only a coward would behave this way.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "4-rensicfiles7623",
                            "body": "Yeah I realised who I think it may be and it’s deeply disappointing. He was an alum from my college and would show up on campus a lot back in the 2010s — nice guy but always a bit weird how much he wanted to hang out with coeds. ",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "4-rensicfiles7623",
                                    "body": "All that to say OP. It doesn’t matter who this person is — you do not deserve what happened to you. I am so sorry for how you must be hurting. I have been there and cannot imagine the added complexity of the person being famous. I hope you are able to get the support you need— I know it feels impossible but life does get better on the other side. ",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Redfoot87",
                            "body": "OP is still young, that's why he's easily manipulated. He should tell his close friends about it, talk to people who support him and sue the pants of this guy.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "A_Sarcastic_Werecat",
                    "body": "I want to echo the previous poster. Please edit your post and remove some details - to protect yourself. I'm really very sorry about what happened to you. It wasn't and isn't right.\n\nYou did not deserve any of what happened, and I hope you get all the support you need.\n\nHowever, just from the details, I have a very strong suspicion about the person, and I'm not a big movie nerd. So if I can guess it, others will also be able to. So please make sure that you are safe and take out some details.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "RiverHarris",
                            "body": "I’m a huge movie nerd and I can’t figure it out.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Barthez_Battalion",
            "body": "Can someone DM who they think this is. I have some guesses but I am not sure.",
            "score": 13,
            "replies": [
                {
                    "author": "Dat-Tiffnay",
                    "body": "Me too",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "lostbedbug",
                    "body": "Same here!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Ordinary-Owl4803",
                    "body": "Me too",
                    "score": 3,
                    "replies": [
                        {
                            "author": "pain_has_a_face",
                            "body": "Can someone tell me who? I need to know.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Time-Palpitation-945",
                            "body": "Me three… I have no idea",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "DonutDerby",
                            "body": "me too. so I can avoid his movies",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "clairedrew",
                    "body": "Same here please",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rache77",
                    "body": "Same here",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sikamikanica",
                    "body": "Same, please.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Vegan_Digital_Artist",
                            "body": "same here, please.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HighfivePunch",
                    "body": "Same.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "collectif-clothing",
                    "body": "Me too! I have zero guesses though. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "overnighttoast",
                    "body": "Me too :(",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "nas0427",
                    "body": "Me too!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Unfair-Dimension-876",
                    "body": "Yeah same! I have too little knowledge of Hollywood to be able to know who this is.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Corfiz74",
            "body": "Damn, I really really want you to sue his ass for every penny he is worth! I'm so sorry you went through that. If you can't afford therapy, can you at least find a support group? Hopefully, they will have an experienced counselor leading the group, who would be able to help you.",
            "score": 5,
            "replies": [
                {
                    "author": "GrandeLatteGirlie",
                    "body": "he admitted to breaking his NDA and is worried about being outed, so maybe its not a good idea to encourage him to go to court. I hate to be so morbid but idk how he can get out of this situation.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Maester_Bates",
            "body": "You should edit this to take out some of the details. I don't watch a lot of American movies or TV and it was still very obvious who it is.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Swiftienation",
            "body": "First of all I wanted to say I’m really sorry you went through all of that. I know people that dealt with similar type of abuse and weren’t themselves for a while, but with the right support system you can potentially start over regardless of what happened. Do you know any lawyers that you could ask about NDAs?",
            "score": 3,
            "replies": []
        },
        {
            "author": "kathy2120",
            "body": "I am a DV survivor and lemme tell you, the hardest point of my life was when I left that abusive relationship and had to start all over by myself. I understand what you are currently going through and at some points you might not want to continue, but if I listened to that voice in my head I wouldn't have went on to find the partner of my life and have 3 beautiful children with him. What I'm trying to say is that your life doesn't end here and what you went through does not define you. I pray for you and please know that my DMs are open if you want to talk <3",
            "score": 8,
            "replies": []
        },
        {
            "author": "GrandeLatteGirlie",
            "body": "I'm not shocked that someone with a lot of fame and money chooses to operate that way. I think I know who ur talking about but it's probably not a good idea to mention his name here. I'm sure that eventually he will be exposed for the predatory POS that he is, cause if he did this to you I imagine that there are others as well. Maybe if this gets enough attention other possible victims might come forward. I'm sorry that you had to go through that and I'm sending love your way. I hope you come back from this better and healthier.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BeeJackson",
            "body": "Sweetie, unless you are going to name names then this is fake.",
            "score": 1,
            "replies": [
                {
                    "author": "RiverHarris",
                    "body": "Do you not understand how NDA’s work?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "BeeJackson",
                            "body": "NDAs can be voided because of PROVEN abuse because the victim has to be able to report physical abuse to police. NDAs don’t give you immunity for all behavior.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "RiverHarris",
                                    "body": "Ok well I don’t think he’s quite there yet. He just needed someone to talk to.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "BeeJackson",
                                            "body": "He wrote a darn book. It’s either fake or he’s not right.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "kathy2120",
                                    "body": "did you not see the part where he said his religious family would disown him if they found out he's gay?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BeeJackson",
                                            "body": "He’s not asking to do anything. He’s just venting. Typically people feel uncomfortable when they are treated badly but have no recourse to gain justice. Unless OP risks something he might as well pretend the whole relationship didn’t exist and focus on building a happy life.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "kathy2120",
                                                    "body": "I agree with the last part of your post if we were to offer any advice. I think that instead of jumping to conclusions maybe providing resources for victims of abuse would be the better choice.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "BeeJackson",
                                                            "body": "Frankly, if a person can write a book about their toxic relationship then they are savvy enough to look up DV assistance and therapy.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}