{
    "title": "small penis shaming destroyed my life",
    "author": "unlucky_pe",
    "subreddit": "TrueOffMyChest",
    "rank": 13,
    "score": 25,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 24,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1jef82h/small_penis_shaming_destroyed_my_life/",
    "id": "1jef82h",
    "selftext": "i'm not looking for advice-- i just want to vent. i'm trying to schedule with a therapist and psychiatrist to get the help i desperately need. i'm just really frustrated.\n\na few years ago, i was happy. very happy. there wasn't another life i wanted to live. i had just graduated university, landed a wonderful job, and was looking forward to start dating. i started to spend more time on the internet, and i couldn't help but notice how many small penis jokes, stories, and insults were on the internet (\"small dick energy,\" \"pencil dick,\" \"fast car small dick,\" \"big truck small dick,\" etc). i immediately became self-conscious, measured myself for the first time, and realized i was the small penis loser everyone was laughing at.\n\ni wasn't able to ignore it. i started to notice women around me using \"little dick energy\" as an insult. i remembered a man at university who was outed by a woman for having a small penis and promptly mocked by everyone. i noticed just how many women openly shared negative experiences with small penises online. i noticed my body was used exclusively for cuckoldry, humiliation, and other very degrading fetishes with pornography. everywhere i looked, i found nothing but negativity. it was very clear my body was an embarrassment.\n\ni was ashamed of my body and immediately spiraled into deep insecurity. i came across a few penis enlargement communities on reddit. i was desperate and wanted a new body, so i immediately started. and broke it. it just doesn't work anymore. i can't get an erection. i can't feel pleasure. i usually can't climax. it's covered in giant veins, discolorations, etc. it really looks so, so ugly. i can't look at my body without feeling deformed and unlovable.\n\nover these few years, i've seen a little over 10 specialists and 10 physical therapists. i had a surgery. i had 5 mris, 4 cts, 2 ultrasounds, nerve conduction studies. i've tried multiple prescription drugs. i tried shockwave therapy, dry needling, and some other treatment plans. i exercise every single day, drink only water, sleep a lot, and maintain a very healthy diet. i've tried and tried and tried. i've spent thousands and thousands of dollars for nothing.\n\nit destroyed my life. i stopped seeing my friends. i leave the house once a month for a physical therapy appointment. i am incredibly lonely and depressed. i've been trying and trying to commit suicide, but i really can't. part of me always believes something is around the corner. just 1 more appointment. just 1 more specialist.",
    "comments": [
        {
            "author": "occultom",
            "body": "You need to stop watching porn dude, the shit you see online is not realistic at all.. 5 inches is the average. Not every guy you see is packin an anaconda. Don’t be ashamed.. You’ll find someone who likes you exactly for who and what you are. Believe it or not, a lot of women would prefer an average size, compared to a footlong from Subway.",
            "score": 60,
            "replies": [
                {
                    "author": "unlucky_pe",
                    "body": "this isn't about porn. i didn't watch porn much at all until after my injury. it was only after the nonstop small penis stories, insults, and jokes did i feel insecure.\n\nalso, i'm aware of the average size. i am very, very thin. i am small.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "occultom",
                            "body": "May I ask how old you are?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "unlucky_pe",
                                    "body": "24 :(",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Ephemerxl",
                                            "body": "you need to see a psychologist while making a follow-up with a psychiatrist. stop making useless appointments, it's not your physical body that needs attention, it's your mind.\n\nyou were unconsciously insecure with something that you found out at a later age. you need therapy, not surgeries or whatever cosmetic you want to push upon your body.\n\nbut more than that, you need to be honest about this to yourself. and most importantly, be kind to yourself.\n\ni know what you mean by every single word, and please trust me on mine.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ThrowawayGhostGuy1",
                    "body": "Holy shit did you not read a word he wrote?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Dark--princess420",
                    "body": "I second this",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "abaddon667",
            "body": "Can I say this. I have a small penis; it’s not a big deal. I have a wife and 3 children. It’s not over for you. If a girl’s a size queen; that’s her business. Best not get upset over something you can’t control. \n\nLook on the bright side. You live in the modern age and likely have it better than 99% of people who have ever lived. I get it, it’s the only form of body shaming still acceptable. But fuck them; you don’t have to let it bother you so much. Live your life, and don’t worry about it.",
            "score": 9,
            "replies": []
        },
        {
            "author": "BusinessAd1178",
            "body": "I’m curious if you ever had a woman that complained, or if you just decided it mattered because porn told you so.",
            "score": 14,
            "replies": [
                {
                    "author": "unlucky_pe",
                    "body": "not about porn. i didn't consume it much until after my injury.\n\ni was always a \"hopeless romantic\" type and rejected the few opportunities i had with women as i wasn't interested in hookups. still a virgin today.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "embilamb",
            "body": "Man I don't get the hate for small schlongs. Like, so what? Oral must be easier on the giver and great for the receiver you'd think, and so many people enjoy oral. Most people find big Ds too painful. I'd rather a small D I can service with my body well over a monster dong that won't fit any day.",
            "score": 4,
            "replies": []
        },
        {
            "author": "New-Number-7810",
            "body": "I’m sorry that you’re going through these mental problems, and I’m sorry that society has made you feel lesser. \n\nOP, you are a human being. You have inherent worth and dignity. You are valuable. You matter. The world would be worse off without you. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "88NORMAL_J",
            "body": "Social media is the devil. I understand how hearing all that stuff can be traumatizing. It's kind of a consequence of how the evil of women is different from the evil of men. I hope you realize that even though sex is the origin of life, it is not everything. i wish you the best. Do some shrooms",
            "score": 2,
            "replies": []
        },
        {
            "author": "MostBoringStan",
            "body": "What kind of physical therapy are you doing on a broken penis?",
            "score": 2,
            "replies": []
        },
        {
            "author": "spacecash1",
            "body": "My advice is to stop looking for the jokes, stop visiting the communities, and see a therapist.. You are having obsessive thoughts about this. Remember 99.9 % of the time your equipment is invisible to everyone, nobody sees it, you ashamed about something nobody around you is thinking about. I repeat, nobody is thinking about your junk except you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CashewCaju",
            "body": "So fyi the term \"small dick energy\" is not exactly about the literal size, it is more about how insecure men act (I particularly don't use that term, but that's normally how I see it being used). Most women can deal with different sizes and there are \"toys\" to improve the sex life of a couple that could help if the size is a problem. What women don't want is men that do not try to make things work, that don't want to improve nor care for them, women don't like insecure men with bad attitudes, that's where most of the bad comments come from.\nWhat you wrote looks like a sort of greek tragedy with a self fulfilling prophecy, where you trying to escape a hypothetical situation (where a woman would reject you because of your size) ended up causing a real physical injury.\nAnd I know you don't want advice, but I think that for you to live a better life you would have to put all that physical aspect aside a little, do not focus so much energy on it, and try to improve your mental health and your attitude towards life. There's a whole you to be, a whole life to live.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PrestigiousFlower815",
            "body": "Ok so first off, your life matters. Period. \n\nI understand you’re frustrated with the cards you have been dealt. I understand that you are going through a lot but I want you to know, as a woman, you are so much more than sex. You are more than what you have to offer in the bedroom and you matter. I can’t speak for other women but I can tell you, there ARE people out there who don’t care about size. There are women who would love you without. Think about people who are paraplegic. Plenty of people without their abilities can still find and maintain a happy relationship. Please do not boil yourself down to being worth one single thing that is physical. \n\nWhat do you offer with your soul and heart and mind? How else can you contribute to the world in a way that brings you happiness? What hobbies do you have? \n\nYou. Are. Worth. More. Than. Your. Body. \n\nYou will get through this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CategoryKiwi",
            "body": "I’ve always found the reference to penis sizes as good/bad distasteful.  It’s literally just body shaming.  \n\nWe figured out in the late 00’s how much body shaming actually fucks people up, and people have rightfully started calling each other out on it.  We made some progress.\n\nExcept for some reason body shaming around the penis was never included in that progress.  \n\n(And as a bonus, men can’t fight against it because they just get assumed to be small penis owners and dismissed, but it’s too private and it’s sexual harassment to whip it out and prove otherwise)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Screamingsleet",
            "body": "Bruh, I'm like 5.75 inches on the best of days and not girthy at all. I was also self conscious at your age, and didn't lose my v card til I was 29 because I was so insecure. Had multiple chances in college, literally walked out of the room on 2 separate occasions with a girl naked in bed. I couldnt think of the seeing my penis.\n\nGuess what, like they say. There's someone for everyone. First I fell for a girl at work and we were truly great. Would've married that girl but she had some shit going on we won't get into. Fast forward a year after we stopped, I met a girl online on a dating app. Unless they were/are both gaslighting me, both said I was plenty and since I last way too fucking long, would get them off every single time. But 6 years later, dating app girl and I are still together, house, baby, a family. It gets better my guy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "confused-_-brain",
            "body": "It ain’t about the size of the boat it’s about the motion in the ocean",
            "score": 1,
            "replies": []
        },
        {
            "author": "wangchungyoon",
            "body": "Elon is this you??",
            "score": -14,
            "replies": [
                {
                    "author": "keepgettingbetter365",
                    "body": "To think this is the opportune moment for this joke is so insensitive. Why do it here when the OP will see it?",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "AbheyBloodmane",
                    "body": "Guy opens up about his life and you thought it was a good idea to perpetuate it? What's wrong with you?",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}